{"jobTitle": "QC Manager", "company": {"name": "Kitsch", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Quality Assurance", "industry": "Internet Publishing", "description": "<strong>About Us<br/><br/></strong><strong>KITSCH</strong>is proud to be recognized as a self-financed, female-owned global accessory brand built on positivity and pure hard work. Established in 2010, with a business plan no longer than a paragraph, Kitsch has grown from door to door sales to selling products in over 27 countries across 20,000 retail locations worldwide.<br/><br/>KITSCH is committed to creating high quality products that are effortless, elevated and easy to use. From fashionable shower caps to our viral towel scrunchies, we aim to evolve your everyday essentials.<br/><br/>We believe that everyone should feel confident when purchasing our products no matter your hair type, style, or budget.<br/><br/><strong>The Role<br/><br/></strong><strong>Overview:<br/><br/></strong>The Quality Control (QC) and Regulations Manager is responsible for ensuring that all products meet established quality standards through rigorous testing, benchmarking, and process management. This role requires close collaboration with various departments and suppliers to maintain and improve product quality. The QC Manager also oversees the management of certificates and audits, ensuring compliance with industry standards and regulatory requirements.<br/><br/><ul><li>APP &amp; TOP Approvals for Product &amp; Packaging</li><ul><li>Ensure all APP and TOPs follow Kitsch standard or within discrepancy tolerance</li><li>Work closely with the Production, PD PH and PD US teams to finalize product benchmarks</li><li>Update Asana task on APP and TOP approval for tracking</li><li>Receive, approve and sign off TOPs</li><li>Establish standards and benchmarks for bulk production</li></ul><li>Quality Control</li><ul><li>Establish an efficient system and hire the right team member for quality control for NPD and for existing products</li><li>Address and fix all SKUs with quality issues reported from the team;</li><li>Ensure all Kitsch product standards are met at all times</li><li>Directly communicate with suppliers and Kitsch teammates to remedy and come up with solutions effectively</li><li>Physical checking &amp; evaluating of samples (drop, open-close, scratch, laundry tests, etc) to ensure Kitsch quality is maintained at all times</li><li>Recommendations to be relayed to the US Team for approval after tests and investigations are done</li><li>Ensure the best action plans/solutions are executed from the factory's end</li></ul><li>Regulatory Compliance</li><ul><li>Work closely with PD and Design to ensure all products &amp; packaging comply with relevant regulatory standards and requirements</li><li>Stay updated on changes in regulations and industry standards to ensure ongoing compliance</li><li>Prepare and manage documentation for regulatory submissions and audits</li><li>Work with regulatory bodies to address and resolve any compliance issues</li></ul><li>Certificates Management &amp; Application</li><ul><li>In charge of record-keeping and file management of factory audit reports and required certifications. Organizes data</li><li>Ensure all SKUs have complete &amp; valid audit, test and certification from legit third party companies like Intertek, Bureau Veritas, SGS, etc</li></ul><li>Supplier onboarding &amp; payment terms negotiation</li><li>Team Leadership</li><ul><li>Lead, mentor, and manage the QC team</li><li>Foster a collaborative and high-performance culture within the QC department<br/></li></ul></ul><strong>What We Bring To The Table<br/><br/></strong><ul><li>Competitive Pay/Benefits</li><li>A dynamic team</li><li>An open mind for new ideas</li><li>Growth…growth and some more growth!<br/><br/></li></ul><strong>Our Hiring Practices:</strong><em><strong>KITSCH LLC</strong>is an equal opportunity employer. We are committed to work in an environment that supports, inspires, and respects all individuals and recruits on merit-based processes regardless of race, color, religion, sex, sexual orientation, gender identity, marital status, age, disability, national or ethnic origin, military service status, citizenship or other protected characteristics.<br/><br/></em>Powered by JazzHR<br/><br/>gvksdnpDOF", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3997221136"}