{"jobTitle": "National Sales Operations Manager", "company": {"name": "ARIS Executive Search", "location": "Orange County, CA"}, "location": "Orange County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Sales and Analyst", "industry": "Medical Equipment Manufacturing", "description": "<strong>About the Company:</strong> <p>Our Client is a medical device company focused on serving the upper extremity segment of the orthopedic market.</p><p><br/></p><p><strong>About the Role:</strong> </p><p>The National Sales Operations Manager is a member of the National Accounts team and is responsible for supporting and expanding company relationships with IDN’s, hospital systems, individual hospitals, and high-profile accounts.</p><p><br/></p><p><strong>Responsibilities:</strong> </p><ul><li>Professionally and responsibly represent the Company when interacting with supply chain administration of IDNs, hospital systems, and high-profile accounts during in-person and virtual meetings.</li><li>Coordinate with the commercial sales team to plan, execute, and achieve the stated goal(s) for assigned IDN’s, Hospital Systems, and stand-alone facilities.</li><li>Ensure compliance of existing contracts and pricing agreements.</li><li>Facilitate resolution of customer pricing issues.</li><li>Assist in finalizing new/renewing business agreements by coordinating requirements, cross-referencing pricing, responding to formal RFPs, developing and negotiating contracts.</li><li>Aid in the integration of new/extended contract requirements with Finance and Operations.</li><li>Update, engage, and inform sales team regarding GPO/IDN/Facility contract changes.</li><li>Drive the contract lifecycle from drafting through contract execution, extensions, and renewals.</li><li>Work alongside the Executive team to ensure compliance with Company policy, all statutory/legal requirements including AdvaMed and Eucomed.</li><li>Gather data on competitors and analyze market share/trends.</li></ul><p><br/></p><p><strong>Required Skills:</strong> </p><p>The ideal candidate will be a team player who collaborates with members of the commercial sales team, legal team, customer service, supply chain, marketing, and operational teams to establish customer proposals, responses, and always ensure compliance with company policies.</p><p><br/></p><p><strong>Preferred Skills:</strong> </p><p>The National Sales Operations Manager must be a charismatic and passionate individual with the ability to clearly support the company’s mission, values, and brand plus its innovative and novel products.</p><p></p>", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3997331372"}