{"jobTitle": "Director of Operations: Production, Manufacturing, Sales", "company": {"name": "agnesbaddoo.com", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "60,000.00/yr - 80,000.00/yr", "currency": "USD"}, "industry": "Fashion", "description": "<strong>DIRECTOR OF OPERATIONS: Luxury Leather Goods</strong><br/>LTHR WRKS | AGNES BADDOO is a small and growing Leather Goods manufacturing facility located in the heart of Los Angeles. In addition to our in-house brand, we work with primarily small-medium sized, independent, handcraft-oriented brands that sell internationally. <br/>We are looking for someone experienced in the fashion industry (manufacturing, branding, sales) and ideally, knowledgeable in luxury leather goods to oversee our operations.<br/><strong>Responsibilities:</strong><br/>The <strong>Director of Operations</strong> oversees studio associate, leather crafters, and directs the day-to-day administrative, operational manufacturing and sales functions of our production studio.<br/><strong>Requirements/Qualifications:</strong><br/><ul><li>5+ years Fashion Industry experience - showroom, sales, marketing, manufacturing, brand development strategies - any combination therein, not necessarily all listed.</li><li>Experience or familiar with luxury leather goods and/or</li><li>Experience with small, hand craft-oriented, non-corporate, independent brands, <em>preferred</em>. </li><li>Knowledge of Leather - i.e. varieties, qualities, sourcing, etc, ideal.</li><li>Knowledge of Manufacturing systems/computer programs that facilitate and streamline the \"production to retail” process, <em>wanted</em>.</li><li>Must be organized, excellent communication and time management skills, self motivated, good with numbers, team leader, team player, steady under pressure, solution oriented, resourceful, responsible, well mannered, work well with others. Sense of humor always welcome!</li><li>Excellent written and verbal communication skills</li><li>Experience with e-commerce, DTC, Wholesale, <em>general</em> social media (as a resource), welcome.</li><li>Knowledge of, interest in independent, coveted, world wide, <em>destination fashion brands and accessories</em>, is <em>a plus.</em></li><li>We look forward to hearing from you!</li></ul>", "responsibilities": "The <strong>Director of Operations</strong> oversees studio associate, leather crafters, and directs the day-to-day administrative, operational manufacturing and sales functions of our production studio.", "qualifications": {"required": "5+ years Fashion Industry experience - showroom, sales, marketing, manufacturing, brand development strategies - any combination therein, not necessarily all listed. Experience or familiar with luxury leather goods and/or Experience with small, hand craft-oriented, non-corporate, independent brands, preferred.  Knowledge of Leather - i.e. varieties, qualities, sourcing, etc, ideal. Knowledge of Manufacturing systems/computer programs that facilitate and streamline the \"production to retail” process, wanted. Must be organized, excellent communication and time management skills, self motivated, good with numbers, team leader, team player, steady under pressure, solution oriented, resourceful, responsible, well mannered, work well with others. Sense of humor always welcome! Excellent written and verbal communication skills Experience with e-commerce, DTC, Wholesale, general social media (as a resource), welcome. Knowledge of, interest in independent, coveted, world wide, destination fashion brands and accessories, is a plus. We look forward to hearing from you!", "preferred": "Experience with small, hand craft-oriented, non-corporate, independent brands, preferred.  Knowledge of Leather - i.e. varieties, qualities, sourcing, etc, ideal. Knowledge of Manufacturing systems/computer programs that facilitate and streamline the \"production to retail” process, wanted."}, "skills": ["Fashion", "Leather Goods", "Manufacturing", "Sales", "Marketing", "Brand Development", "E-commerce", "DTC", "Wholesale", "Social Media"], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997561430"}