{"jobTitle": "Procurement Order Management Specialist (Buyer/Supply chain) - Remote | WFH", "company": {"name": "Get It Recruit - Transportation", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-Time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "<strong>About The Role<br/><br/></strong>We are seeking a dedicated Procurement Specialist to join our dynamic team. In this role, you will collaborate with various internal stakeholders to manage end-to-end procurement activities for our operations, ensuring the timely delivery of products and services. Your expertise will be vital in driving value creation and maximizing business outcomes.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> **Stakeholder Collaboration:** Work closely with internal teams such as Engineering, Construction, Facilities, and Manufacturing to gather comprehensive procurement requirements and translate them into purchase orders.</li><li> **Supplier Management:** Lead the end-to-end RFx process, partnering with stakeholders to identify top suppliers, foster competition within the supply market, and maximize value creation.</li><li> **Purchase Order Management:** Create and manage purchase orders using our ERP system, communicating effectively with approvers to describe and justify purchases.</li><li> **Negotiation:** Negotiate pricing, lead times, terms, and conditions to achieve the best outcomes for the business.</li><li> **Invoice Management:** Oversee purchase order management and invoice issue disposition to ensure on-time delivery of products or services and prompt payment of invoices.</li><li> **Problem Solving:** Resolve supply chain-related issues that may arise throughout the procure-to-pay process.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> **Experience:** At least 2 years in a Procurement, Buyer, Order Management, or Supply Chain role within manufacturing, supply chain, or engineering.</li><li> **ERP Systems:** Proficiency with ERP systems such as Oracle, SAP, or similar.</li><li> **Purchase Order Management:** Experience handling a high volume of purchase orders daily, coordinating with Accounts Payable to ensure timely invoice payments.</li><li> **Stakeholder Engagement:** Proven ability to collaborate with internal stakeholders, gather procurement requirements, and translate them into purchase orders.</li><li> **Negotiation Skills:** Demonstrated success in negotiating pricing, lead times, contract terms, etc.</li><li> **Adaptability:** Experience working in a fast-paced environment.</li><li> **Technical Skills:** Basic knowledge of Excel and the ability to create simple spreadsheets.</li><li> **Customer Service:** Excellent customer service skills and a commitment to providing great support.</li><li> **Industry Knowledge:** Previous experience in aerospace or frontier technology industries is a plus.<br/><br/></li></ul><strong>How To Apply<br/><br/></strong>If you are a proactive, detail-oriented professional eager to make a significant impact in a dynamic industry, we would love to hear from you. Please submit your resume for consideration.<br/><br/>We appreciate your interest and look forward to the possibility of welcoming you to our team!<br/><br/>*Please note: The company name has been removed to maintain confidentiality.*<br/><br/>Apply Now<br/><br/>*We are an equal opportunity employer and welcome applicants from all backgrounds. *<br/><br/>Employment Type: Full-Time", "jobFunction": "Other", "industry": "Human Resources Services", "postedDate": "1 week ago", "skills": ["ERP", "Oracle", "SAP", "Excel", "Procurement", "Buyer", "Order Management", "Supply Chain", "Negotiation", "Customer Service"], "url": "https://www.linkedin.com/jobs/view/3997484453"}