{"jobTitle": "Social Media Coordinator", "company": {"name": "2.7 August Apparel, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "From $23.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Apparel & Fashion", "description": "2.7 August Apparel is an American fast-fashion clothing company that offers B2B services, from design to manufacturing and wholesale. We started our business in 2011 and opened the first wholesale store in the Los Angeles fashion district. We offer multi-brands like Endless Rose, English Factory, Grey Lab, and Free the Roses. We offer well-designed and valued fashion goods to our consumers, which helps our business succeed. We are looking for a talented Social Media Coordinator to join our team!", "responsibilities": "Create compelling visual assets that match the tone of our brands Filming, editing, and posting on social platforms Support the marketing team with the planning and development of social media campaigns Prepare reports for analyzing asset performance Test new tactics for reaching new and existing customers Help influencers develop content Stay up to date with the latest social media trends, new platforms, or new formats Ensure that all social media channels are regularly updated with relevant and fresh content Grow our influencer program Create and follow a social media calendar that aligns with the marketing team’s calendar Understanding and loving the brand identity Creating content and posting on our social Creating reels (trending) Active during photoshoots, preparing moods and contents Writing captions Creating highlights Liking, saving, reposting, commenting back, answering direct messages Can work under pressure and directly under head designer Looking for a creative, passionate, positive person , who is fashion savvy, is a people person, works well with other people and can bounce creativity back and forth with the team. Looking for someone knowledgeable and up for challenges", "qualifications": {"required": "Extensive experience with social platforms, including, but not limited to: Facebook, TikTok, and Instagram Knowledge of social media posting tools Genuine passion for the fashion industry Excellent communication and organizational skills Strong video and photography skills Able to understand and communicate brand identities Previous experience in managing social platforms for a company in the fashion industry Social media marketing experience Ability to multitask Strong understanding of retail culture and customer psychology English is required, Korean is plus.", "preferred": "Bachelor’s Degree required Minimum 2-3 years experience with social media marketing (Internships may be considered.)"}, "skills": ["Facebook", "TikTok", "Instagram", "Social Media", "Fashion", "Communication", "Organization", "Video", "Photography", "Brand Identity", "Retail", "Customer Psychology", "English", "Korean"], "postedDate": "1 week ago", "benefits": "401(k) Dental insurance Health insurance Paid time off Vision insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997590679"}