{"jobTitle": "Director of Operations", "company": {"name": "ConsultNet Technology Services and Solutions", "location": "Hawthorne, CA"}, "location": "Hawthorne, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Associate", "salary": {"amount": "125,000.00/yr - 175,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "<span><span>Director of Operations<br/> El Segundo Area, CA<br/> Direct Hire<br/> $125- $175k a year</span> </span>  <p> <span> <span> The Director of Operations is responsible for overseeing and integrating the Production, Stores, Shipping/Receiving, and Facilities functions to ensure the quality and timely delivery of products. This role includes managing production processes, inventory management, shipping and receiving operations, and facility maintenance. Direct reports will include the Production Manager, Production/Shipment Coordinator, Stores Manager, Shipping/Receiving Manager, and Facilities Manager.</span> </span> </p> <p> <span> <span> <strong> Key Responsibilities:</strong></span> </span> </p> <ul> <li> <p> <span> <span> <strong> Production Management:</strong></span> </span> </p> <ul> <li> <span> <span> Ensure the efficient and timely assembly and testing of units for both production and development programs.</span> </span> </li> <li> <span> <span> Collaborate with the Production Manager on technical coordination, resource management, assembly flow, and planning.</span> </span> </li> <li> <span> <span> Monitor the status of various product lines, balancing mature and developmental programs.</span> </span> </li> <li> <span> <span> Coordinate with the Production/Shipment Coordinator to ensure on-time shipments.</span> </span> </li> </ul> </li> <li> <p> <span> <span> <strong> Stores Management:</strong></span> </span> </p> <ul> <li> <span> <span> Partner with the Stores Manager to oversee kit levels, address material shortages, and manage inventory processing.</span> </span> </li> <li> <span> <span> Ensure inventory accuracy, adherence to FIFO material usage, and proper material handling.</span> </span> </li> </ul> </li> <li> <p> <span> <span> <strong> Shipping/Receiving Management:</strong></span> </span> </p> <ul> <li> <span> <span> Work with the Shipping/Receiving Manager to balance resources and support the timely processing of material receipts and shipments.</span> </span> </li> <li> <span> <span> Maintain accurate shipment documentation, proper packaging, and efficient shipment processing.</span> </span> </li> </ul> </li> <li> <p> <span> <span> <strong> Facilities Management:</strong></span> </span> </p> <ul> <li> <span> <span> Oversee facility maintenance, including equipment repairs, modifications, and general cleanliness.</span> </span> </li> </ul> </li> <li> <p> <span> <span> <strong> Cross-functional Coordination:</strong></span> </span> </p> <ul> <li> <span> <span> Drive tasks to completion with a problem-solving and execution-focused mindset.</span> </span> </li> <li> <span> <span> Promote ongoing process improvements and adherence to production environment programs (e.g., FOD, ESD).</span> </span> </li> </ul> </li> </ul> <p> <span> <span> <strong> Essential Duties:</strong></span> </span> </p> <ul> <li> <span> <span> Manage multiple departments in a dynamic and fluid production environment.</span> </span> </li> <li> <span> <span> Communicate production and shipment plans effectively and drive coordination between departments.</span> </span> </li> <li> <span> <span> Identify and address inefficiencies, developing tools and procedures to enhance task execution.</span> </span> </li> <li> <span> <span> Review and analyze daily and weekly reports to track progress, allocate resources, resolve shortages, and manage work queues.</span> </span> </li> <li> <span> <span> Collaborate with the IT department to develop metrics for evaluating production performance and identifying trends.</span> </span> </li> <li> <span> <span> Manage task assignments and output in Stores and Production for efficient and timely task completion.</span> </span> </li> <li> <span> <span> Ensure organized inventory storage and collaborate with Shipping/Receiving and Stores on inventory management.</span> </span> </li> <li> <span> <span> Continuously assess and improve production workflows to increase efficiency.</span> </span> </li> <li> <span> <span> Support the continuous improvement of assembly instructions, process routings, and inventory processes.</span> </span> </li> <li> <span> <span> Ensure compliance with quality systems and support training programs for new and existing employees.</span> </span> </li> <li> <span> <span> Implement changes related to ECNs impacting production and inventory.</span> </span> </li> <li> <span> <span> Communicate production status and constraints to management and recommend solutions.</span> </span> </li> <li> <span> <span> Review direct report employees' timecards for accuracy and escalate issues to management/HR as necessary.</span> </span> </li> <li> <span> <span> Participate in cross-departmental meetings to review status, resolve issues, and make decisions.</span> </span> </li> <li> <span> <span> Collaborate with Quality and Engineering departments as needed.</span> </span> </li> </ul> <p> <span> <span> <strong> Skills and Experience Required:</strong></span> </span> </p> <ul> <li> <span> <span> Energetic, creative, and analytical with a strong work ethic.</span> </span> </li> <li> <span> <span> Proven ability to multitask and handle challenges constructively.</span> </span> </li> <li> <span> <span> Strong organizational and communication skills (both verbal and written).</span> </span> </li> <li> <span> <span> Technical expertise in operations with 3-5 years of experience in Production/Manufacturing or a related field.</span> </span> </li> <li> <span> <span> Demonstrated ability to effectively organize and direct people and programs.</span> </span> </li> <li> <span> <span> Proficiency in ERP, Word, Excel, and Outlook.</span> </span> </li> <li> <span> <span> Effective communication with employees at all levels.</span> </span> </li> </ul> <p> <span> <span> <strong> Preferred Qualifications:</strong></span> </span> </p> <ul> <li> <span> <span> Six Sigma or TQM certification or experience.</span> </span> </li> </ul> <p> <br/> <span> <span> Welcome to ConsultNet and the family of companies, Tekne, SaltClick, TechBridge, and OmniMedia. As a premier national provider of technology talent and solutions, our expertise spans across project services, contract-to-hire, direct placement, and managed services both onshore and nearshore.<br/> <br/> Celebrating more than 25 years of partnership with a diverse client base, we've crafted rewarding opportunities for our consultants, fostering high-performing teams that deliver impactful results.</span> </span> </p> <p> <span> <span> Over the last few years thousands of consultants have found their calling with us in roles that have made a meaningful impact on their lives, enhanced their career, challenged them, and propelled them towards achieving their personal and professional goals. At the ConsultNet family of companies, we believe effective communication is crucial in aligning the right job with your unique skills and professional aspirations. To us, it's all about the personal approach we take and the values we uphold.</span> </span> </p> <p> <span> <span> Our comprehensive service offerings cover a wide range of technology positions across key markets nationwide. Client more at   www.consultnet.com  .</span> </span> </p> <p> <span> <span> We champion equality and inclusivity, proudly supporting an Equal Opportunity Employer policy. We welcome applicants regardless of Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other status protected by law.</span></span></p>", "responsibilities": "The Director of Operations is responsible for overseeing and integrating the Production, Stores, Shipping/Receiving, and Facilities functions to ensure the quality and timely delivery of products. This role includes managing production processes, inventory management, shipping and receiving operations, and facility maintenance. Direct reports will include the Production Manager, Production/Shipment Coordinator, Stores Manager, Shipping/Receiving Manager, and Facilities Manager.", "qualifications": {"required": "Energetic, creative, and analytical with a strong work ethic. Proven ability to multitask and handle challenges constructively. Strong organizational and communication skills (both verbal and written). Technical expertise in operations with 3-5 years of experience in Production/Manufacturing or a related field. Demonstrated ability to effectively organize and direct people and programs. Proficiency in ERP, Word, Excel, and Outlook. Effective communication with employees at all levels.", "preferred": "Six Sigma or TQM certification or experience."}, "skills": ["Production Management", "Stores Management", "Shipping/Receiving Management", "Facilities Management", "Cross-functional Coordination", "ERP", "Word", "Excel", "Outlook", "Six Sigma", "TQM"], "postedDate": "16 hours ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997052663"}