{"jobTitle": "Regional Talent Acquisition Manager - California 901", "company": {"name": "Telecare Corporation", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "116,481.18/yr - $143,918.56/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Mental Health Care", "description": "Telecare's mission is to deliver excellent and effective behavioral health services that engage individuals in recovering their health, hopes, and dreams. Telecare continues to advance cultural diversity, humility, equity, and inclusion at all levels of our organization by hiring mental health peers, BIPOC, LGBTQIA+, veterans, and all belief systems.<br/><br/><strong>Full Time; DAYS 8:00 am - 5:00 pm; Monday - Friday<br/><br/></strong>Expected starting wage range is $116,481.18 - $143,918.56. Telecare applies geographic differentials to its pay ranges. The pay range assigned to this role will be based on the geographic location from which the role is performed. Starting pay is commensurate with relevant experience above the minimum requirements.<br/><br/><strong>Position Summary<br/><br/></strong>The Regional Talent Acquisition Manager develops and implements regional talent attraction and recruitment strategies for all Telecare hiring needs across a region. The Regional Talent Acquisition Manager. Will have a dotted line reporting relationship into the Regional VP Operations and function as part of their leadership team to ensure hiring needs are supported and proactive recruitment and attraction strategies are deployed.<br/><br/><strong>Qualifications<br/><br/></strong><strong>Required: <br/><br/></strong><ul><li> Minimum of five (5) years of experience as a recruiter and at least two years’ experience managing people</li><li> B.S./B.A. Degree in Human Resources or a related field or combination of relevant education and experience</li><li> Knowledge and experience with MS Word, Excel, and HRIS or applicant tracking systems</li><li> Experience in developing recruitment strategies and providing data to quantify recruiting progress</li><li> Plan and conduct recruitment and selection processes (interviews, screening calls, etc.)</li><li> Experience in sourcing passive candidates and implementing additional strategies to provide slates of qualified candidates to support all hiring needs</li><li> Must be at least 18 years of age</li><li> All opportunities at Telecare are contingent upon successful completion and receipt of acceptable results of the applicable post-offer physical examination, 2-step PPD test for tuberculosis, acceptable criminal background clearances, excluded party sanctions, and degree or license verification. If the position requires driving, valid driver’s license, a motor vehicle clearance and proof of auto insurance is required at time of employment and must be maintained throughout employment. Additional regulatory, contractual or local requirements may apply<br/><br/></li></ul><strong>Essential Functions<br/><br/></strong><ul><li> Demonstrates the Telecare mission, purpose, values, and beliefs in everyday language and contact with the public and other staff members</li><li> Collaborates with management to ensure timely understanding of current and future workforce needs; implements improvements to sourcing, selection, and retention processes</li><li> Develops and implements recruitment plans</li><li> Facilitates recruitment meetings, as needed</li><li> Creates company-wide recruitment reports to measure recruitment outcomes, including vacancy rate, new hire source, and retention ratio reports</li><li> Presents recruitment updates weekly, to quantify service delivery, productivity and recruitment challenges for all hiring managers and their leaders the Region’s programs.</li><li> Evaluates report data to determine specific recruitment needs and develops action plan</li><li> Recruits for senior level positions, and other roles as needed</li><li> Represents Telecare in various capacities relating to recruitment</li><li> Keeps abreast of recruitment and retention trends in the health care market</li><li> Makes recruitment and retention recommendations to hiring managers</li><li> Ensures Leadership Hiring Advisory Teams are utilized at all programs and facilitates Leadership Hiring Advisory Team trainings</li><li> Develops recruitment tools for managers and staff with recruitment responsibilities</li><li> Effectively and comprehensively uses Telecare marketing materials and leverages the employment brand in all marketing and outreach to candidates</li><li> Collaborates with the Corporate Communications Department to enhance recruitment marketing through use of printed material, Telecare’s website, media, and other communication vehicles</li><li> Develops systems to evaluate candidate and hiring manager feedback for improvements of recruitment and retention practices<br/><br/></li></ul>Duties and responsibilities may be added, deleted and/or changed at the discretion of management.<br/><br/><strong>Skills<br/><br/></strong><ul><li> Demonstrated skills in creative sourcing and recruiting strategies for diverse candidates</li><li> Excellent interviewing and interpersonal skills are essential</li><li> Able to work with minimal direction and supervision and the ability to effectively organize work</li><li> Able to work in fast paced environment with constant changes regarding hiring needs<br/><br/></li></ul><strong>PHYSICAL DEMANDS<br/><br/></strong>The physical demands here are representative of those that must be met by an employee to successfully perform the essential functions of this job.<br/><br/>The employee is occasionally required to walk, stand, bend, squat, kneel, twist, reach, lift and carry items weighing 10 pounds or less and do simple grasping, drive as well as frequently sit.<br/><br/><strong>EOE AA M/F/V/Disability<br/><br/></strong>If job posting references any sign-on bonus internal applicants and applicants employed with Telecare in the previous 12 months would not be eligible.", "responsibilities": "The Regional Talent Acquisition Manager develops and implements regional talent attraction and recruitment strategies for all Telecare hiring needs across a region. The Regional Talent Acquisition Manager. Will have a dotted line reporting relationship into the Regional VP Operations and function as part of their leadership team to ensure hiring needs are supported and proactive recruitment and attraction strategies are deployed.", "qualifications": {"required": "Minimum of five (5) years of experience as a recruiter and at least two years’ experience managing people, B.S./B.A. Degree in Human Resources or a related field or combination of relevant education and experience, Knowledge and experience with MS Word, Excel, and HRIS or applicant tracking systems, Experience in developing recruitment strategies and providing data to quantify recruiting progress, Plan and conduct recruitment and selection processes (interviews, screening calls, etc.), Experience in sourcing passive candidates and implementing additional strategies to provide slates of qualified candidates to support all hiring needs, Must be at least 18 years of age, All opportunities at Telecare are contingent upon successful completion and receipt of acceptable results of the applicable post-offer physical examination, 2-step PPD test for tuberculosis, acceptable criminal background clearances, excluded party sanctions, and degree or license verification. If the position requires driving, valid driver’s license, a motor vehicle clearance and proof of auto insurance is required at time of employment and must be maintained throughout employment. Additional regulatory, contractual or local requirements may apply"}, "skills": ["HRIS", "Recruitment", "Sourcing", "Talent Acquisition", "Interviewing", "Interpersonal Skills", "Organization", "MS Word", "Excel"], "postedDate": "1 week ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3997855789"}