{"jobTitle": "Employee Relations Manager", "company": {"name": "Amazon", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "114,600.00/yr - 189,500.00/yr", "currency": "USD"}, "jobFunction": "Human Resources and Information Technology", "industry": "Software Development", "description": "The North American Employee Relations (ER) team supports Field Operations organizations across fulfillment and logistics business lanes. The central objective of our team is to ensure treatment of employees that is fair, respectful, and consistent with our framework of our core business values and objectives. To support that objective, this position’s responsibilities fall into proactive and reactive categories. We are seeking an ER Manager with a demonstrated ability to collaborate with and influence field operations managers, human resources, and contractors; to analyze multiple levels of employee and partner feedback to identify risks and gaps; to create, audit, and sustain positive workplace relations programs; and to design and conduct positive workplace relations training that drives best practices. The Manager also will work reactively on crisis-oriented situations that typically can only be successfully addressed under severe time constraints. The individual will work reactively on employee relations issues that may arise at a single station, within a specific geographic region, or network-wide. Balancing time between projects and crisis-response is a critical component for success in the position.<br/><br/>The Employee Relations Manager will possess employee and labor relations expertise, excellent judgment, and highly-developed analytical, interpersonal, and communication skills. The Manager will be comfortable both presenting to senior leaders and communicating with frontline employees. The successful Manager will be a strong project manager, capable of independently owning large-scale, network-wide projects. The Manager will quickly become an important “source of truth” regarding whether the organization is meeting its core values and principles.<br/><br/>This is a full-time position that reports into the WW Consumer organization for Amazon.com. The role will cover the West region. You can sit out of any Amazon facility closest to your home; Washington, Oregon, California, Nevada, or Arizona. Mandatory in office work 3 days per week on non-travel weeks. This position will support sites across one or more operational regions so comfort with travel is key. The successful candidate must be capable of significant domestic travel, sometimes with short notice, up to 50% of the time.<br/><br/>Key job responsibilities<br/><br/><ul><li> Detect and Mitigate Risks: Apply employee and labor relations expertise to successfully identify trends, gaps, and challenges; execute solution-focused strategies and programs to mitigate risks</li><li> Crisis Management: Work reactively on crisis-oriented partner issues under extreme time limitations while exercising excellent judgment</li><li> Project Management: Independently own large-scale, network-wide projects delivered on time that improve frontline partner experience</li><li> Analyze and Interpret Data: Exercise strong analytical skills using data and anecdotes to develop persuasive narratives and recommendations; demonstrated ability to define and measure success of programs</li><li> Communicate Effectively: Rapidly produce high-quality written communications that concisely analyze problems and recommends solutions; design and deliver highly-engaging training sessions</li><li> Collaborate: Build constructive relationships with critical stakeholders to share information and influence change</li><li> Problem Solve: Work independently with minimal supervision, in ambiguous situations, and persevere over internal and external barriers to drive resolutions</li><li> Work at Scale: Launch and manage sustainable mechanisms for entire networks<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> Bachelor’s degree required</li><li> 7+ years of relevant experience employee relations, labor relations, or labor/employment law with emphasis on labor and employee relations</li><li> Successful record of creating, improving and executing programs at scale</li><li> Excellent skills and attention to detail, able to juggle and prioritize multiple tasks simultaneously while delivering on commitments</li><li> Outstanding communication skills in written and verbal form; extensive public speaking, training, and/or communication skills</li><li> Ability to quickly connect with people across a wide variety of backgrounds</li><li> Skilled in MS Excel, Word, SharePoint &amp; PowerPoint; curious about new learning technologies<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Advanced degree, JD, or other specialized training in labor/employee relations</li><li> Leadership experience in distribution, logistics and/or transportation industries highly desired</li><li> Experience building and launching programs that measurably impact positive engagement</li><li> Experience analyzing and using metrics to identify vulnerabilities and drive improvements in the employee experience</li><li> Comfortable in a fast-paced environment and able to manage through ambiguity and change</li><li> Solid sense of accountability, high-quality judgment and sound decision-making</li><li> Fluency in multiple languages</li><li> Ability to handle confidential information and escalate issues when appropriate<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Pursuant to the Los Angeles Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $114,600/year in our lowest geographic market up to $189,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2728495", "responsibilities": "The North American Employee Relations (ER) team supports Field Operations organizations across fulfillment and logistics business lanes. The central objective of our team is to ensure treatment of employees that is fair, respectful, and consistent with our framework of our core business values and objectives. To support that objective, this position’s responsibilities fall into proactive and reactive categories. We are seeking an ER Manager with a demonstrated ability to collaborate with and influence field operations managers, human resources, and contractors; to analyze multiple levels of employee and partner feedback to identify risks and gaps; to create, audit, and sustain positive workplace relations programs; and to design and conduct positive workplace relations training that drives best practices. The Manager also will work reactively on crisis-oriented situations that typically can only be successfully addressed under severe time constraints. The individual will work reactively on employee relations issues that may arise at a single station, within a specific geographic region, or network-wide. Balancing time between projects and crisis-response is a critical component for success in the position.<br/><br/>The Employee Relations Manager will possess employee and labor relations expertise, excellent judgment, and highly-developed analytical, interpersonal, and communication skills. The Manager will be comfortable both presenting to senior leaders and communicating with frontline employees. The successful Manager will be a strong project manager, capable of independently owning large-scale, network-wide projects. The Manager will quickly become an important “source of truth” regarding whether the organization is meeting its core values and principles.<br/><br/>This is a full-time position that reports into the WW Consumer organization for Amazon.com. The role will cover the West region. You can sit out of any Amazon facility closest to your home; Washington, Oregon, California, Nevada, or Arizona. Mandatory in office work 3 days per week on non-travel weeks. This position will support sites across one or more operational regions so comfort with travel is key. The successful candidate must be capable of significant domestic travel, sometimes with short notice, up to 50% of the time.<br/><br/>Key job responsibilities<br/><br/><ul><li> Detect and Mitigate Risks: Apply employee and labor relations expertise to successfully identify trends, gaps, and challenges; execute solution-focused strategies and programs to mitigate risks</li><li> Crisis Management: Work reactively on crisis-oriented partner issues under extreme time limitations while exercising excellent judgment</li><li> Project Management: Independently own large-scale, network-wide projects delivered on time that improve frontline partner experience</li><li> Analyze and Interpret Data: Exercise strong analytical skills using data and anecdotes to develop persuasive narratives and recommendations; demonstrated ability to define and measure success of programs</li><li> Communicate Effectively: Rapidly produce high-quality written communications that concisely analyze problems and recommends solutions; design and deliver highly-engaging training sessions</li><li> Collaborate: Build constructive relationships with critical stakeholders to share information and influence change</li><li> Problem Solve: Work independently with minimal supervision, in ambiguous situations, and persevere over internal and external barriers to drive resolutions</li><li> Work at Scale: Launch and manage sustainable mechanisms for entire networks<br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s degree required, 7+ years of relevant experience employee relations, labor relations, or labor/employment law with emphasis on labor and employee relations, Successful record of creating, improving and executing programs at scale, Excellent skills and attention to detail, able to juggle and prioritize multiple tasks simultaneously while delivering on commitments, Outstanding communication skills in written and verbal form; extensive public speaking, training, and/or communication skills, Ability to quickly connect with people across a wide variety of backgrounds, Skilled in MS Excel, Word, SharePoint &amp; PowerPoint; curious about new learning technologies", "preferred": "Advanced degree, JD, or other specialized training in labor/employee relations, Leadership experience in distribution, logistics and/or transportation industries highly desired, Experience building and launching programs that measurably impact positive engagement, Experience analyzing and using metrics to identify vulnerabilities and drive improvements in the employee experience, Comfortable in a fast-paced environment and able to manage through ambiguity and change, Solid sense of accountability, high-quality judgment and sound decision-making, Fluency in multiple languages, Ability to handle confidential information and escalate issues when appropriate"}, "skills": ["Employee Relations", "Labor Relations", "Labor Law", "Project Management", "Data Analysis", "Communication", "Collaboration", "Problem Solving", "MS Excel", "Word", "SharePoint", "PowerPoint"], "postedDate": "1 week ago", "benefits": "Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $114,600/year in our lowest geographic market up to $189,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997802421"}