{"jobTitle": "Business Operations Analyst", "company": {"name": "Anduril Industries", "location": "Costa Mesa, CA", "industry": "Defense and Space Manufacturing"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "94,000—$141,000", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Defense and Space Manufacturing", "description": "Anduril Industries is a defense technology company with a mission to transform U.S. and allied military capabilities with advanced technology. By bringing the expertise, technology, and business model of the 21st century’s most innovative companies to the defense industry, Anduril is changing how military systems are designed, built and sold. Anduril’s family of systems is powered by Lattice OS, an AI-powered operating system that turns thousands of data streams into a realtime, 3D command and control center. As the world enters an era of strategic competition, Anduril is committed to bringing cutting-edge autonomy, AI, computer vision, sensor fusion, and networking technology to the military in months, not years.<br/><br/>As a Business Operations Analyst, you will own the data that informs the operational decision making at Anduril. In this role, you will partner with leadership and teams from across the business — from our Tower and Drone teams to our field operations team to our customer success team — to unpack ambiguous problems and build lasting, scalable solutions. Your work will vary from quick-turn analytical problem solving to process and data improvements and building core dashboards and tables — all in the pursuit of helping grow how Anduril operates and measures itself.<br/><br/>The Business Operations team at Anduril has two primary responsibilities:<br/><br/><ul><li> Standing up the operational processes and analytics to measure change. We work with teams to improve operational processes and building in the data-capture and analytics-reporting muscle to ensure changes for the long term.</li><li> Special projects. We are frequently pulled into high priority problems that must be solved, but do not fall neatly into the purview of an existing person’s job description. Our team is one of the first to get tapped when a messy problem needs solving.<br/><br/></li></ul>Much of the time, both of these go hand-in-hand.<br/><br/>As a Business Operations Analyst, you will be critical to supporting both of these responsibilities. While the BizOps team will be your team, you will often be embedded in the business, working cross-functionally with leaders and teams throughout the organization to solve messy problems, set up new processes, capture data, action upon it, and enable others to do the same.<br/><br/><strong>What You'll Do<br/><br/></strong><ul><li>Own operational projects end-to-end, from Definition, Solution, to Implementation. You will be handed ambiguous, messy problems with little prescription on how to solve them. If this does not excite you, this is not the role for you.</li><li>Work on operational problems involving the intersection of hardware and software systems. From inventory management systems, to asset-tracking in the field, to manufacturing systems capturing data on quality-issues on the production floor. Anduril is hardware business, and tracking hardware is messy. We need our systems, tools, and, processes to be up to the task.</li><li>Work deeply within data and systems, becoming intimately familiar with how our business systems (ERP, MRP, HRIS, etc.) function, and how to leverage data from them to create insights and analytics (leveraging tools like Excel, SQL, Tableau), equipping functional teams with these insights and tools to measure and improve their processes</li><li>Execute scrappy analyses on short-timelines to get answers quickly, while also owning more scalable solutions that will make Anduril successful in the long term</li><li>Project manage across many stakeholders. If you don’t like being the person leading meetings with large groups of people or managing large Slack channels to wrangle stakeholders towards a solution, this may not be the role for you</li><li>Work across functions and learn Anduril’s business top-to-bottom. You will interact with Supply Chain, Manufacturing, Finance, Engineering, HR, Recruiting, Growth, and more. The BizOps team is one of the most cross-functional teams at Anduril.<br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong><ul><li>You have 1+ years of experience in management consulting, investment banking, internal operations, or business analyst role</li><li>You lean into acknowledging your weaknesses and take the idea of feedback and growth seriously</li><li>You get energy from being a thought partner for others and it excites you to spend time translating operational problems into data problems, and to then going and executing on them</li><li>You are self-driven and relentlessly proactive. You don’t need someone to tell you to “move”. You just move. We’d rather have to tell you to slow down than to speed up.</li><li>You don’t wait on others to solve problems. You proactively step into the gap to offer solutions yourself.</li><li>You enjoy working at a place where no one minds if you leave early one day to go to an appointment or run an errand, but you also don’t mind responding to Slacks in the evening while you’re watching Netflix.</li><li>You have an appetite to build clear frameworks to structure problems.</li><li>You have strong analytical aptitude. You intuitively think about problems in terms of numbers and data-models, and you are able to quickly execute analyses in Excel or SQL.</li><li>You are comfortable communicating broadly and having a lot of eyes on your work. This role can at-times require comms to large groups and senior leadership. This should excite you!</li><li>U.S. Person status is required as this position needs to access export-controlled data.<br/><br/></li></ul>US Salary Range<br/><br/>$94,000—$141,000 USD<br/><br/><strong>Benefits<br/><br/></strong>The salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including: <br/><br/><ul><li>Platinum Healthcare Benefits: For U.S. roles, we offer top tier platinum coverage (medical, dental, vision) that are 100% covered by Anduril for you and 90% covered for your dependents.</li><ul><li>For UK roles, Private Medical Insurance (PMI): Anduril will cover the full cost of the insurance premium for an employee and dependents.</li><li>For AUS roles, Private health plan through Bupa: Coverage is fully subsidized by Anduril.</li></ul><li>Basic Life/AD&amp;D and long-term disability insurance 100% covered by Anduril, plus the option to purchase additional life insurance for you and your dependents.</li><li>Extremely generous company holiday calendar including a holiday hiatus in December, and highly competitive PTO plans.</li><li>16 weeks of paid Caregiver &amp; Wellness Leave to care for a family member, bond with your baby, or tend to your own medical condition.</li><li>Family Planning &amp; Parenting Support: Fertility (eg, IVF, preservation), adoption, and gestational carrier coverage with additional benefits and resources to provide support from planning to parenting.</li><li>Mental Health Resources: We provide free mental health resources 24/7 including therapy, life coaching, and more. Additional work-life services, such as free legal and financial support, available to you as well.</li><li>A professional development stipend is available to all Andurilians.</li><li>Daily Meals and Provisions: For many of our offices this means breakfast, lunch and fully stocked micro-kitchens.</li><li>Company-funded commuter benefits available based on your region.</li><li>Relocation assistance (depending on role eligibility).</li><li>401(k) retirement savings plan - both a traditional and Roth 401(k). (US roles only)<br/></li></ul>The recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.<br/><br/>Anduril is an equal-opportunity employer committed to creating a diverse and inclusive workplace. The Anduril team is made up of incredibly talented and unique individuals, who together are disrupting industry norms by creating new paths towards the future of defense technology. All qualified applicants will be treated with respect and receive equal consideration for employment without regard to race, color, creed, religion, sex, gender identity, sexual orientation, national origin, disability, uniform service, Veteran status, age, or any other protected characteristic per federal, state, or local law, including those with a criminal history, in a manner consistent with the requirements of applicable state and local laws, including the CA Fair Chance Initiative for Hiring Ordinance. We actively encourage members of recognized minorities, women, Veterans, and those with disabilities to apply, and we work to create a welcoming and supportive environment for all applicants throughout the interview process. If you are someone passionate about working on problems that have a real-world impact, we'd love to hear from you!<br/><br/>To view Anduril's candidate data privacy policy, please visit https://anduril.com/applicant-privacy-notice/.", "responsibilities": "As a Business Operations Analyst, you will own the data that informs the operational decision making at Anduril. In this role, you will partner with leadership and teams from across the business — from our Tower and Drone teams to our field operations team to our customer success team — to unpack ambiguous problems and build lasting, scalable solutions. Your work will vary from quick-turn analytical problem solving to process and data improvements and building core dashboards and tables — all in the pursuit of helping grow how Anduril operates and measures itself.", "qualifications": {"required": "You have 1+ years of experience in management consulting, investment banking, internal operations, or business analyst role\nYou lean into acknowledging your weaknesses and take the idea of feedback and growth seriously\nYou get energy from being a thought partner for others and it excites you to spend time translating operational problems into data problems, and to then going and executing on them\nYou are self-driven and relentlessly proactive. You don’t need someone to tell you to “move”. You just move. We’d rather have to tell you to slow down than to speed up.\nYou don’t wait on others to solve problems. You proactively step into the gap to offer solutions yourself.\nYou enjoy working at a place where no one minds if you leave early one day to go to an appointment or run an errand, but you also don’t mind responding to Slacks in the evening while you’re watching Netflix.\nYou have an appetite to build clear frameworks to structure problems.\nYou have strong analytical aptitude. You intuitively think about problems in terms of numbers and data-models, and you are able to quickly execute analyses in Excel or SQL.\nYou are comfortable communicating broadly and having a lot of eyes on your work. This role can at-times require comms to large groups and senior leadership. This should excite you!\nU.S. Person status is required as this position needs to access export-controlled data.", "preferred": ""}, "skills": ["Data Analysis", "Business Analysis", "Project Management", "Excel", "SQL", "Tableau"], "postedDate": "2 weeks ago", "benefits": "The salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including: <br/><br/><ul><li>Platinum Healthcare Benefits: For U.S. roles, we offer top tier platinum coverage (medical, dental, vision) that are 100% covered by Anduril for you and 90% covered for your dependents.</li><ul><li>For UK roles, Private Medical Insurance (PMI): Anduril will cover the full cost of the insurance premium for an employee and dependents.</li><li>For AUS roles, Private health plan through Bupa: Coverage is fully subsidized by Anduril.</li></ul><li>Basic Life/AD&amp;D and long-term disability insurance 100% covered by Anduril, plus the option to purchase additional life insurance for you and your dependents.</li><li>Extremely generous company holiday calendar including a holiday hiatus in December, and highly competitive PTO plans.</li><li>16 weeks of paid Caregiver &amp; Wellness Leave to care for a family member, bond with your baby, or tend to your own medical condition.</li><li>Family Planning &amp; Parenting Support: Fertility (eg, IVF, preservation), adoption, and gestational carrier coverage with additional benefits and resources to provide support from planning to parenting.</li><li>Mental Health Resources: We provide free mental health resources 24/7 including therapy, life coaching, and more. Additional work-life services, such as free legal and financial support, available to you as well.</li><li>A professional development stipend is available to all Andurilians.</li><li>Daily Meals and Provisions: For many of our offices this means breakfast, lunch and fully stocked micro-kitchens.</li><li>Company-funded commuter benefits available based on your region.</li><li>Relocation assistance (depending on role eligibility).</li><li>401(k) retirement savings plan - both a traditional and Roth 401(k). (US roles only)<br/></li></ul>The recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3997635637"}