{"jobTitle": "Psychiatric Mental Health Nurse Practitioner (PMHNP) - Remote | WFH", "company": {"name": "Get It Recruit - Healthcare", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Health Care Provider", "industry": "Human Resources Services", "description": "<strong>Job Summary<br/><br/></strong>Are you a dedicated and empathetic Psychiatric Mental Health Nurse Practitioner (PMHNP) looking to make a difference in mental health care? We're excited to invite you to join our supportive and dynamic team as a Remote PMHNP. In this role, you'll provide remote psychiatric evaluations, medication management, and therapy to help our patients thrive. If you have strong communication skills, enjoy working both independently and collaboratively, and are passionate about supporting patients' mental health journeys, we'd love to hear from you!<br/><br/><strong>Key Responsibilities<br/><br/></strong>Conduct thorough remote psychiatric evaluations for patients with various mental health concerns.<br/><br/>Prescribe and manage medications with precision and care.<br/><br/>Lead individual and group therapy sessions to support patients' mental health goals.<br/><br/>Collaborate effectively with a network of healthcare professionals, including physicians, therapists, and social workers.<br/><br/>Keep accurate and up-to-date medical records to ensure the best patient care.<br/><br/>Engage in ongoing professional development and education to stay current with best practices.<br/><br/><strong>Requirements<br/><br/></strong>Active and unrestricted PMHNP license.<br/><br/>Master's or Doctoral degree in nursing.<br/><br/>Ability to work independently as well as within a team environment.<br/><br/>Excellent communication and interpersonal skills.<br/><br/>Strong organizational and time management abilities.<br/><br/>Experience with telehealth or remote healthcare is a plus.<br/><br/><strong>Benefits<br/><br/></strong>Flexible scheduling: Set your own availability to suit your lifestyle.<br/><br/>Guaranteed payment for last-minute cancellations and no-shows, ensuring you are valued for your time.<br/><br/>Employment Type: Full-Time", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3997178726"}