{"jobTitle": "Operations Coordinator", "company": {"name": "Approved Freight", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Approved Freight Forwarders has immediate openings for a qualified Operations coordinator with 2 – 3 years’ experience in warehouse administrative processes. Rate of pay is $19.50 per/hr. Schedule Monday - Friday 8am-5pm with possible overtime.\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\n\n* Perform administrative tasks, data entry, scheduling appointments, coordinating pickups.\n* Help the organization run smoothly and ensuring that deadlines, plans for events or anything related gets accomplished on time with no issues.\n* Ensuring that all activities conform to local, federal, industry and company standards\n\nREQUIRED SKILLS / ABILITIES:\n\n* Warehouse, 3PL, Distribution, and Logistics experience required\n* Processing of hazardous freight declarations/documentation\n* Shipping and receiving of hazardous experience preferred\n* Billing and accruing\n* Import and export container processing\n* WMS experience required\n* Heavy email communication via Microsoft Outlook, Microsoft office proficiency required\n* Excellent strategic planning and problem-solving skills\n* Effective communication, including speaking, writing, and active listening\n\nREQUIRED EDUCATION AND EXPERIENCE:\n\n* High School Diploma or equivalent\n* Minimum of 2 years of warehouse admin experience in a 3PL distribution or logistics environment\n\nPHYSICAL REQUIREMENTS:\n\n* Able to lift up to 40 pounds.\n* Sit or stand for extended periods of time\n\nPay: $19.50 per hour\n\nBenefits:\n\n* Medical & Dental (100% company paid!)\n* Vision\n* FSA & Supplemental Benefits\n* Paid Time Off\n* 401K\n* 11 Paid Holidays\n* Yearly Performance Reviews\n* Monthly team celebrations\n\nhttps://www.thedewittcompanies.com/ccpa/\n\nEqual Opportunity Employer: Women/Veterans/Minorities/Disabled\n\nAbout Us:\n\nApproved Freight Forwarders got its start in 1991 serving the Guam market and has since expanded to Hawaii and California, serving as a key link to the Pacific and all around the world.\n\nEntrusted with the world’s freight, we provide ocean freight consolidations, air freight and over-the-road transport of goods and commodities. We are the only freight forwarder in Hawaii with terminals on all four major islands. And with more than 300,000 square feet of space, our warehouses can accommodate a diverse set of logistics needs.\n\nAs a Top 100 3PL provider, we accommodate all types of commodities and all sizes of freight for both business and individual clients. Our highly trained logistics experts use advanced technology to tailor shipping solutions that fit your specific requirements. Because we hand-load your freight when needed, our damage and claims rate is one of the lowest in the industry.\n\nApproved Freight Forwarders is part The DeWitt Companies, a fourth-generation family of five sister companies that provides relocation, logistics, warehousing and freight forwarding services to businesses, households and military customers all over the world. With wholly-owned assets in Alaska, Hawaii, Guam and the Mainland, our COD, DOD, GSA, and Corporate customers trust us for easy, affordable, and safe transportation of their goods. Beyond our overseas and domestic relocation services, we provide office and industrial moving (O&I), large installation projects (FF&E) and air and ocean freight services.\n\nAt Approved Freight Forwarders, we work hard to ensure that your shipment arrives on time and intact, and we keep you updated every step of the way.", "postedDate": "1 week ago", "skills": ["Warehouse", "3PL", "Distribution", "Logistics", "Hazardous Freight", "Shipping", "Receiving", "Billing", "Accruing", "Import", "Export", "Container Processing", "WMS", "Microsoft Outlook", "Microsoft Office", "Strategic Planning", "Problem Solving", "Communication"], "url": "https://www.linkedin.com/jobs/view/3997927764"}