{"jobTitle": "Operations Coordinator", "company": {"name": "Aston Carter", "industry": "Staffing and Recruiting", "location": "Agoura Hills, CA"}, "location": "Agoura Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "We are looking for an Operations Coordinator in Calabasas, CA ASAP!<br/><br/><strong>Job Description<br/><br/></strong>As an Operations Coordinator, you will leverage your operations experience in the cruise industry or in management and fleet movement to oversee quality control through the accurate reporting of data to suppliers, confirm services or passenger numbers, and manage information on manifests and emails. You will also control costs by managing confirmed services and carry out responsibilities in line with organizational policies and applicable laws.<br/><br/>Hard Skills<br/><br/><ul><li>Database Software</li><li>Internet Software</li><li>Inventory Software</li><li>Project Management Software</li><li>Spreadsheet Software</li><li>Word Processing Software</li><li>Electronic Mail Software</li><li>In-house Reservation Software</li><li>Advanced spreadsheet and computer skills<br/><br/></li></ul>Soft Skills<br/><br/><ul><li>Ability to read and interpret documents</li><li>Ability to write routine reports and correspondence</li><li>Ability to speak effectively before groups</li><li>Ability to calculate figures and amounts</li><li>Ability to apply common sense understanding to instructions</li><li>Ability to analyze risk, benefit, and impact of decisions</li><li>Ability to work with internal and external executives</li><li>Strong leadership and management capabilities</li><li>Team building</li><li>Development of objectives and goals</li><li>Goal accomplishment<br/><br/></li></ul>If you're interested, EMAIL your updated resume to sstaso @ astoncarter.com and APPLY NOW!<br/><br/><strong>About Aston Carter<br/><br/></strong>Aston Carter provides world-class corporate talent solutions to thousands of clients across the globe. Specialized in accounting, finance, human resources, talent acquisition, procurement, supply chain and select administrative professions, we extend the capabilities of industry-leading companies. We draw on our deep recruiting expertise and expansive network to meet the evolving needs of our clients and talent community with agility and excellence. With offices across the U.S., Canada, Asia Pacific and Europe, Aston Carter serves many of the Fortune 500. We are proud to be a ClearlyRated Best of Staffing® double diamond winner for both client and talent service.<br/><br/>Diversity, Equity &amp; Inclusion<br/><br/>At Aston Carter, Diversity And Inclusion Are a Bridge Towards The Equity And Success Of Our People. DE&amp;I Are Embedded Into Our Culture Through<br/><br/><ul><li>Hiring diverse talent</li><li>Maintaining an inclusive environment through persistent self-reflection</li><li>Building a culture of care, engagement, and recognition with clear outcomes</li><li>Ensuring growth opportunities for our people<br/><br/></li></ul>The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.<br/><br/>If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email astoncarteraccommodation@astoncarter.com for other accommodation options.", "postedDate": "1 week ago", "skills": ["Database Software", "Internet Software", "Inventory Software", "Project Management Software", "Spreadsheet Software", "Word Processing Software", "Electronic Mail Software", "In-house Reservation Software", "Advanced spreadsheet and computer skills"], "url": "https://www.linkedin.com/jobs/view/3997839747"}