{"jobTitle": "Store Manager", "company": {"name": "PUMA Group", "industry": "Retail", "size": "20,000+ employees", "location": "Camarillo, CA"}, "location": "Camarillo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "At PUMA, we are a global brand focused on innovation and speed in sportswear and culture. We aim to push boundaries and connect with our communities through design, footwear, and authentic partnerships. With over 20,000 employees in 120+ countries, PUMA Group owns PUMA, Cobra Golf, and stichd, and is headquartered in Herzogenaurach, Germany. This is a full-time on-site role as a Store Manager at PUMA Group in Camarillo, CA. The Store Manager will be responsible for overseeing day-to-day operations, ensuring customer satisfaction, managing store staff, implementing retail loss prevention strategies, and maintaining effective communication with team members and customers.", "responsibilities": "Overseeing day-to-day operations, ensuring customer satisfaction, managing store staff, implementing retail loss prevention strategies, and maintaining effective communication with team members and customers.", "qualifications": {"required": "Customer Satisfaction and Customer Service skills, Effective Communication skills, Store Management experience, Knowledge of Retail Loss Prevention techniques, Leadership and Team Management skills, Experience in the retail industry, Ability to analyze sales reports and trends, Excellent organizational and time management skills", "preferred": ""}, "skills": ["Customer Service", "Communication", "Store Management", "Retail Loss Prevention", "Leadership", "Team Management", "Sales Analysis", "Organizational Skills"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3997590090"}