{"jobTitle": "Senior Supply Chain Planner", "company": {"name": "MicroVention-Terumo", "location": "Aliso Viejo, CA"}, "location": "Aliso Viejo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "74,330-123,032", "currency": "USD"}, "jobFunction": "Supply Chain and Manufacturing", "industry": "Medical Equipment Manufacturing", "description": "Working for a company voted *Great Places to Work - 2022*, the **Senior Supply Chain Planner** owns and leads end-to-end demand, supply, and inventory planning for a subset of MicroVention products and/or regions with added emphasis on product launch planning and driving execution of new product introductions.\n\n**What You'll Be Doing**\n* Generate business requirements by working with cross-functional teams including Marketing, Regulatory, Operations, and Senior Management.\n* Create demand, inventory, and supply plans for new and existing products; function as the orchestrator, connector, educator, and negotiator across teams.\n* Ensure that everyone is working in concert while driving launches that optimize operational capabilities and ensuring successful commercialization with the best customer experience. An articulate, flexible, self-managed problem solver and an expert in Demand Planning, Supply Planning, and Order Management with proven track record in leading new product programs.\n* As a critical and highly visible role in driving results for the company, often need to marshal multiple functions to align on dealing with sometimes competing priorities.\n\n**<u>The Skills/Experience Needed for the Role</u>**\n1. Bachelor’s degree in Supply Chain, Engineering, or related field with minimum six (6) years of relevant experience, or equivalent combination of education and experience.\n2. Strong interpersonal and relationship-building skills and analytical approach towards problem solving in a matrix environment.\n3. Ability to analyze data, present findings, and make recommendations.\n4. Advanced computer skills including but not limited to Microsoft Windows, Word, Excel, PowerPoint, and strong ERP usage and understanding.\n\n**<u>How to Stand out from the Crowd</u>**\n1. Experience in a regulated industry, including medical device.\n2. Working knowledge of planning tools such as SAP IBP (Integrated Business Planning).\n3. Ability to think strategically and execute tactically, a persistent attention to detail, and a high level of comfort in working with numbers.\n\n**<u>Salary Range</u>**\n$74,330-$123,032 (Compensation could be higher based on education, experience and skill sets)\n\n**<u>MicroVention Perks</u>**\n* 15 Days of PTO, 12-13 Paid Holidays, and offices closed last week of December (paid).\n* Tuition Reimbursement up to $10,000/Year\n* On-Site/Hybrid/Remote Work Schedules\n* Focus on Diversity, Equity & Inclusion (DE&I)\n* Comprehensive Learning & Development Programs\n\n*We are an equal opportunity employer (EOE) and all qualified applicants will receive consideration for employment without regard to race, color, ethnicity, disability, religion, national origin, gender, gender identity, gender expression, marital status, sexual orientation, age, protected veteran status, or any other characteristic protected by law.*", "responsibilities": "Generate business requirements by working with cross-functional teams including Marketing, Regulatory, Operations, and Senior Management. Create demand, inventory, and supply plans for new and existing products; function as the orchestrator, connector, educator, and negotiator across teams. Ensure that everyone is working in concert while driving launches that optimize operational capabilities and ensuring successful commercialization with the best customer experience. An articulate, flexible, self-managed problem solver and an expert in Demand Planning, Supply Planning, and Order Management with proven track record in leading new product programs. As a critical and highly visible role in driving results for the company, often need to marshal multiple functions to align on dealing with sometimes competing priorities.", "qualifications": {"required": "Bachelor’s degree in Supply Chain, Engineering, or related field with minimum six (6) years of relevant experience, or equivalent combination of education and experience. Strong interpersonal and relationship-building skills and analytical approach towards problem solving in a matrix environment. Ability to analyze data, present findings, and make recommendations. Advanced computer skills including but not limited to Microsoft Windows, Word, Excel, PowerPoint, and strong ERP usage and understanding.", "preferred": "Experience in a regulated industry, including medical device. Working knowledge of planning tools such as SAP IBP (Integrated Business Planning). Ability to think strategically and execute tactically, a persistent attention to detail, and a high level of comfort in working with numbers."}, "skills": ["Supply Chain", "Demand Planning", "Supply Planning", "Order Management", "SAP IBP", "Microsoft Windows", "Word", "Excel", "PowerPoint", "ERP"], "postedDate": "1 week ago", "benefits": "15 Days of PTO, 12-13 Paid Holidays, and offices closed last week of December (paid). Tuition Reimbursement up to $10,000/Year On-Site/Hybrid/Remote Work Schedules Focus on Diversity, Equity & Inclusion (DE&I) Comprehensive Learning & Development Programs", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3997023332"}