{"jobTitle": "Field Operations Analyst - CA", "company": {"name": "Farmers Insurance", "industry": "Financial Services, Insurance, and Consumer Services", "size": "10000+ employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$73,360 - $100,870", "currency": "USD"}, "jobFunction": "Sales and Distribution", "industry": "Financial Services, Insurance, and Consumer Services", "description": "We are Farmers! We are… more than just your favorite commercials.  At Farmers, we strive to deliver peace of mind to our customers by providing protection and comprehensive advice and delivering in the moments of truth. That means having people who can help us meet changing customer and business needs. Farmers high-performance culture is focused on results and the people who achieve them. We hold ourselves and others accountable for sustainably growing the business and each other. We seek solutions, own our actions, and grow through discomfort. We see setbacks as opportunities while continuously asking ourselves how we impact our customers. Farmers is an award winning, equal opportunity employer, committed to the strength of a diverse workforce. We are dedicated to supporting the well-being of our people through our extensive suite of benefits, as well as the well-being of the communities we serve through employee volunteer programs and nonprofit partnerships. Helping others in their time of need isn’t just our business – it’s our culture!  To learn more about our high-performance culture and open opportunities, check out www.Farmers.com/careers/corporate and be sure to follow us on Instagram, LinkedIn, and TikTok.", "responsibilities": "This role provides operational and analytical support for territory leadership to optimize the implementation and performance of territory initiatives. Performs work with limited direction or guidance. Conducts market research, analyzes data, and provides actionable insights and recommendations related to field operations such as sales performance, agent productivity, customer experience, and market trends to territory and market leadership. Develops recommendations to improve sales productivity and to drive efficiencies. Coordinates product rollouts, sales initiatives, communication strategies, technology integration, process optimization, and profitability actions. Assists territory and market leadership with project management, presentation preparation, and communication initiatives. Supports leadership on ad-hoc projects including problem-resolution as assigned. Works across stakeholders to coordinate territory and market meetings including meeting agendas, communication, logistics, speakers, and content. Performs other duties as assigned.", "qualifications": {"required": "High School Diploma or equivalent required. 3-5 years of experience in insurance field operations, marketing or similar role required. Strong verbal and written communication skills. Proven analytical skills (interpreting data to tell a story). MS Suite (strong Excel skills, PowerPoint, etc.). Able to solve problems with minimal direction/taking ownership of finding solutions. Goal oriented team player with a positive attitude. Excellent time management skills. Organization & Planning skills. Strong relationship building.", "preferred": "Bachelors degree preferred. Experience with data analysis preferred."}, "skills": ["Strong verbal and written communication skills", "Proven analytical skills", "MS Suite (strong Excel skills, PowerPoint, etc.)", "Problem-solving skills", "Goal-oriented team player", "Excellent time management skills", "Organization & Planning skills", "Strong relationship building"], "postedDate": "2 weeks ago", "applicationDeadline": "At Farmers, the recruitment process is designed to ensure that we find the best talent to join our team. As part of this process, we typically close open positions within 8 to 21 days after posting.", "benefits": "Farmers offers a competitive salary commensurate with experience, qualifications and location. Bonus Opportunity (based on Company and Individual Performance) 401(k) Medical Dental Vision Health Savings and Flexible Spending Accounts Life Insurance Paid Time Off Paid Parental Leave Tuition Assistance For more information, review “What we offer” on https://www.farmers.com/careers/corporate/#offer", "remoteWork": "Remote", "url": "https://www.linkedin.com/jobs/view/3997692799"}