{"jobTitle": "Senior Relationship Manager", "company": {"name": "HSBC", "industry": "Banking, Financial Services, and Investment Banking", "size": "Not Applicable", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$253,700.00/yr - $380,500.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Banking, Financial Services, and Investment Banking", "description": "Our purpose – Opening up a world of opportunity – explains why we exist. Here at HSBC we use our unique expertise, capabilities, breadth and perspectives to open up new kinds of opportunity for our more than 40 million customers. We’re bringing together the people, ideas and capital that nurture progress and growth, helping to create a better world – for our customers, our people, our investors, our communities and the planet we all share.", "responsibilities": "As our Senior Relationship Manager you will:\n- Combine client relationship management with strong risk assessment and management capabilities ensuring the required credit quality & requisite returns on risk\n- Maintain HSBC internal control standards, including timely implementation of internal and external audit points together with any issues raised by external regulators\n- Be a core part of our team, originating target market clients focused on investment AUM, lending, and Advisory services from own network\n- Grow revenues across allocated portfolio, successfully manage and serve existing business relationships and originate new revenue streams\n- Grow HSBC’s share of client wallet involving product specialists to ensure product capabilities are in line with UHNW client requirements\n- Establish and maintain networks for co-operation with other HSBC businesses, to support the creation of solutions to customer needs that span geographical/product boundaries and regulatory environments", "qualifications": {"required": "Bachelor’s Degree required, Series 7 and 63 licenses, may allow for contingency to obtain Series 7 and 63", "preferred": "At least 5 years of relationship management experience in the banking sector, Proven track record in asset gathering, asset growth and revenue generation, Excellent commercial and negotiation skills, Strong customer service focus, Highly developed communication skills for use in direct client contact and problem solving, Excellent understanding of financial markets and products, Ability to provide strong financial and statistical analysis, Attention to detail and the ability to think creatively to solve problems."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not Applicable", "benefits": "HSBC offers a wide range of competitive and flexible benefits designed to help you improve your health and well-being, finances, and lifestyle.", "remoteWork": "Not Applicable", "url": "https://www.linkedin.com/jobs/view/3997643232"}