{"jobTitle": "Loyalty & CRM Manager", "company": {"name": "Pixi Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Customer Service, and Other", "industry": "Personal Care Product Manufacturing", "description": "<strong>About Pixi Beauty</strong><p>Pixi Beauty, a luminary in the beauty industry, combines innovation, quality, and charm to create unforgettable customer experiences. Our rapid growth and international reputation highlight our commitment to excellence. In our journey forward, we seek a visionary Loyalty &amp; CRM Manager to join our Los Angeles team and support our digital transformation under the guidance of the Chief Digital Officer.</p><p><br/></p><p><strong>Your Role</strong></p><p>As a direct report to the Chief Digital Officer, you will be instrumental in enhancing Pixi Beauty's customer engagement through data-driven CRM strategies and loyalty programs. You'll harness the power of digital tools, like Klaviyo, to craft personalized experiences, ensuring our brand remains at the forefront of digital innovation and customer satisfaction.</p><p><br/></p><p><strong>Key Responsibilities</strong></p><ul><li><strong>Email Program Management:</strong> Utilize Klaviyo to develop and execute sophisticated email marketing campaigns, optimizing for engagement and conversion.</li><li><strong>Data Analysis &amp; Strategic Decision Making:</strong> Analyze customer data to inform and guide strategic decisions, ensuring CRM initiatives are aligned with business objectives.</li><li><strong>Personalization Management &amp; Strategy Development:</strong> Craft a comprehensive strategy that leverages customer insights to deliver personalized experiences across all touchpoints, enhancing customer satisfaction and brand loyalty.</li><li><strong>Loyalty Program Management</strong>: Oversee our loyalty program from inception to execution, including design, member acquisition, engagement strategies, and reward fulfillment, to foster a strong, engaged community.</li><li><strong>Compliance &amp; Data Privacy:</strong> Ensure all CRM activities comply with relevant data protection regulations and best practices, safeguarding customer information and trust.</li><li><strong>CRM-Specific KPI Tracking:</strong> Monitor and optimize key performance indicators like Customer Lifetime Value (CLTV), Customer Acquisition Cost (CAC), and Customer Retention Rate, to gauge and improve the impact of CRM and loyalty efforts.</li></ul><p><br/></p><p><strong>What We're Looking For</strong></p><ul><li>A minimum of 3 years in CRM, loyalty program management, or digital marketing, with hands-on experience using Klaviyo or similar platforms.</li><li>Bachelor's degree in Marketing, Business, Digital Media, or a related field.</li><li>Demonstrated ability to analyze data and use insights to drive decisions and personalize customer engagement.</li><li>Expertise in digital marketing and social media platforms, coupled with a solid understanding of email marketing strategies.</li><li>Knowledge of data protection and privacy laws, ensuring compliance in all CRM strategies.</li><li>Proven track record of managing and enhancing loyalty programs, with a focus on increasing customer engagement and retention.</li><li>Strong organizational, analytical, and communication skills, with a detail-oriented approach to project management.</li><li>A passion for the beauty industry and a commitment to creating innovative customer experiences.</li></ul><p><br/></p><p>Join Pixi Beauty to impact our digital footprint and customer engagement strategy significantly. If you're driven by data, passionate about personalization, and ready to lead our CRM and loyalty initiatives, we'd love to meet you.</p><p></p>", "responsibilities": "As a direct report to the Chief Digital Officer, you will be instrumental in enhancing Pixi Beauty's customer engagement through data-driven CRM strategies and loyalty programs. You'll harness the power of digital tools, like Klaviyo, to craft personalized experiences, ensuring our brand remains at the forefront of digital innovation and customer satisfaction.", "qualifications": {"required": "A minimum of 3 years in CRM, loyalty program management, or digital marketing, with hands-on experience using Klaviyo or similar platforms.", "preferred": "Bachelor's degree in Marketing, Business, Digital Media, or a related field."}, "skills": ["CRM", "Loyalty Program Management", "Digital Marketing", "Klaviyo", "Data Analysis", "Strategic Decision Making", "Personalization", "Customer Engagement", "Email Marketing", "Data Protection", "Privacy Laws", "KPI Tracking", "Customer Lifetime Value", "Customer Acquisition Cost", "Customer Retention Rate", "Project Management", "Beauty Industry"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997598600"}