{"jobTitle": "Merchandising Assistant", "company": {"name": "ANINE BING", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Retail Apparel and Fashion", "description": "ANINE BING is looking for an Merchandising Assistant to join our team in Los Angeles.<br/><br/>The Merchandising Assistant collaborates with the Director of Merchandising to develop assortment strategies aligned with the brand’s financial and strategic goals, while acting as the expert on customer needs across all channels and ensuring cross-functional alignment with Revenue Channels, Production, Buying & Planning, and Marketing for optimal product assortments.<br/><br/>The ideal candidate is collaborative team player, hardworking, dedicated, open-minded, humble, and enthusiastic —ready and eager to learn every part of the buying and planning process. This person is excited to work cross functionally in a hands-on role and ready to work closely with a tight-knit team to drive results and take the ANINE BING brands to the next level.<br/><br/>This role is based at our Los Angeles HQ and reports to our Director of Merchandising.<br/><br/>Responsibilities<br/><br/> <ul><li>Support the development of seasonal line plans that push the brand forward in key strategic growth categories while protecting established categories</li><li>Partner with buying, planning, and revenue channels to curate an assortment across all categories and global channels, including Ecommerce, Retail, and Wholesale that that fuels our growing business</li><li>Create and execute category and SKU-based assortment and merchandising plans</li><li>Obtain an understanding of product needs and opportunities across all channels of business and communicate these insights to Design in a digestible way.</li><li>Be a product liaison working cross functionally with the Creative, Ecom, Retail and Wholesale teams ensuring product and collection vision materializes in market to end consumer.</li><li>Manage and communicate assortment details, pricing, and gross margin targets throughout the product development cycle.</li><li>Collaborate with cross-functional teams, including Planning, Product, and Customer Service, and support key milestones and presentations.</li><li>Engage with distributors and maintain effective communication via email and conference calls to discuss business opportunities and store assortments.<br/><br/></li></ul>Requirements<br/><br/> <ul><li>A minimum of 3 years in a merchandising role at a fashion company</li><li>Detail-oriented with excellent communication and organizational skills.</li><li>Advanced proficiency in Microsoft Excel (Vlookups, Pivots, Index Match) and Google Sheets is required for reporting and data formatting. Must be comfortable with handling large excel spreadsheets and datasets</li><li>Passion for fashion and market knowledge, with prior experience in the fashion industry or retail preferred.</li><li>Ability to effectively communicate, written and orally, with all levels of employees</li><li>Experience with NetSuite a plus <br/><br/></li></ul>Benefits & Perks<br/><br/> <ul><li>Work/Life Balance: Flexible work schedules, Unlimited/ flexible time off, paid holidays throughout the year, and extra days off in the summer</li><li>Wellness: ANINE BING covers 75% of costs for your medical, dental, and vision insurance and offers an array of other benefits for you and your dependents, including a generous parental leave program</li><li>And more: Generous employee discount and wardrobe<br/><br/></li></ul>Working at ANINE BING<br/><br/>ANINE BING seeks to empower its employees by providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Diversity and inclusion is critical to our success as a global brand, and we seek to recruit, develop, and retain the most talented people from a diverse candidate pool.<br/><br/>More About ANINE BING<br/><br/>ANINE BING is a Los Angeles-based fashion house started in 2012 that blends elements of Scandinavian simplicity with American energy to offer modern wardrobe essentials for women seeking a timeless yet rebellious approach to everyday style. Since its launch, ANINE BING has built a global brand represented across 90+ countries, including brick-and-mortar retail stores in cities worldwide.<br/><br/>Headquartered in Los Angeles, ANINE BING has over 200 employees and is backed by key investors, which include Index Ventures founder Danny Rimer (Facebook, Dropbox, Roblox, Net-A-Porter), Greycroft Partners founder Dana Settle (Bumble, Cuyana, Farfetch), and Felix Capital founder Frederic Court (Goop, Farfetch, Vitrue, Dailymotion).", "responsibilities": "The Merchandising Assistant collaborates with the Director of Merchandising to develop assortment strategies aligned with the brand’s financial and strategic goals, while acting as the expert on customer needs across all channels and ensuring cross-functional alignment with Revenue Channels, Production, Buying & Planning, and Marketing for optimal product assortments.", "qualifications": {"required": "A minimum of 3 years in a merchandising role at a fashion company, Detail-oriented with excellent communication and organizational skills., Advanced proficiency in Microsoft Excel (Vlookups, Pivots, Index Match) and Google Sheets is required for reporting and data formatting. Must be comfortable with handling large excel spreadsheets and datasets, Passion for fashion and market knowledge, with prior experience in the fashion industry or retail preferred., Ability to effectively communicate, written and orally, with all levels of employees, Experience with NetSuite a plus", "preferred": ""}, "skills": ["Microsoft Excel", "Google Sheets", "NetSuite"], "postedDate": "6 days ago", "benefits": "Work/Life Balance: Flexible work schedules, Unlimited/ flexible time off, paid holidays throughout the year, and extra days off in the summer, Wellness: ANINE BING covers 75% of costs for your medical, dental, and vision insurance and offers an array of other benefits for you and your dependents, including a generous parental leave program, And more: Generous employee discount and wardrobe", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997059792"}