{"jobTitle": "Project Manager", "company": {"name": "Implant Direct", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$99,400 - $149,100", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Medical Equipment Manufacturing", "description": "<strong>Job Description<br/><br/></strong>The<strong> Implant Direct </strong><strong>Project Manager</strong> plays a key role in leading the planning and implementation of significant, high-impact initiatives. They are tasked with supporting the Product Planning Group (PPG) process to prioritize and facilitate the timely launch of new product development projects. By developing comprehensive project plans, overseeing cross-functional project teams, identifying, and addressing project risks, and ensuring adherence to project timelines and budgetary constraints, the Project Manager ensures the successful achievement of all business objectives. The role is remote, however, the ideal candidate should live in <strong>Southern California.<br/><br/></strong><strong>Essential Responsibilities<br/><br/></strong><ul><li>Oversee a portfolio of concurrent projects, ensuring alignment with stakeholders.</li><li>Direct and coordinate all activities of the cross-functional product development team throughout each phase of the development process.</li><li>Foster a sense of urgency and ensure timely, cost-effective project completion.</li><li>Develop comprehensive project plans in collaboration with core team members and other departments, establishing clear objectives and deliverable alignment.</li><li>Drive resource allocation, maintain project schedules, manage change, address technical issues, and support team members in resolving challenges promptly.</li><li>Provide leadership to execute project plans in line with the New Product Development (NPD) Process, focusing on scope adherence, regulatory compliance, scheduling, and cost objectives.</li><li>Collaborate with Regulatory Affairs on 510(k) submissions, product licensing, and regulatory compliance goals.</li><li>Demonstrate knowledge of all product lines, including clinical features and customer requirements.</li><li>Update the Product Planning Group (PPG) regularly to ensure project status visibility, employing Daily Management (DM) practices to ensure compliance with project objectives.</li><li>Enhance the product development process.<br/><br/></li></ul><strong>Job Requirements<br/><br/></strong><strong>Minimum Requirements:<br/><br/></strong><ul><li>Bachelor’s degree in engineering or equivalent experience is highly desired.</li><li>3+ years project management experience in medical device or a similar regulated industry </li><li>Proficient in MS Office; MS Excel highly preferred<br/><br/></li></ul><strong>Preferred Requirements<br/><br/></strong><ul><li>Project Management certification</li><li>Experience with Medical Device Regulations</li><li>3 years relevant experience in Design Controls, 21 CFR 820, ISO 13485, or ISO 14971 </li><li>The ideal candidate should live in Southern California <br/><br/></li></ul>IND123<br/><br/><strong>Target Market Salary Range<br/><br/></strong>Actual compensation packages take into account a wide range of factors that are unique to each candidate, including but not limited to geographic location; skill sets; relevant education and certifications; depth of experience; performance; and other business and organizational needs. The disclosed reasonable estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled. At Envista, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. The total compensation package for this position may also include an annual performance bonus, medical/dental/vision benefits, 401K match, and/or other applicable compensation plans.<br/><br/>$99,400 - $149,100<br/><br/><strong>Operating Company<br/><br/></strong>Implant Direct<br/><br/>Envista and all Envista Companies are equal opportunity employers that evaluate qualified applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law. The “EEO is the Law” poster is available at: http://www.dol.gov/ofccp/regs/ compliance/posters/pdf/eeopost.pdf.<br/><br/>Envista and its family of companies (Envista) will not accept unsolicited resumes from any source other than directly from a candidate. Envista will consider unsolicited referrals and/or resumes submitted by vendors such as search firms, staffing agencies, professional recruiters, fee-based referral services and recruiting agencies (Agency) to have been referred by the Agency free of charge and Envista will not pay a fee for any placement resulting from the receipt such unsolicited resumes. An Agency must obtain advance written approval from Envista's internal Talent Acquisition or Human Resources team to submit resumes, and then only in conjunction with a valid fully-executed contract approved by the Global Talent Acquisition leader and in response to a specific job opening. Envista will not pay a fee to any Agency that does not have such agreement and written approval in place.", "responsibilities": "<ul><li>Oversee a portfolio of concurrent projects, ensuring alignment with stakeholders.</li><li>Direct and coordinate all activities of the cross-functional product development team throughout each phase of the development process.</li><li>Foster a sense of urgency and ensure timely, cost-effective project completion.</li><li>Develop comprehensive project plans in collaboration with core team members and other departments, establishing clear objectives and deliverable alignment.</li><li>Drive resource allocation, maintain project schedules, manage change, address technical issues, and support team members in resolving challenges promptly.</li><li>Provide leadership to execute project plans in line with the New Product Development (NPD) Process, focusing on scope adherence, regulatory compliance, scheduling, and cost objectives.</li><li>Collaborate with Regulatory Affairs on 510(k) submissions, product licensing, and regulatory compliance goals.</li><li>Demonstrate knowledge of all product lines, including clinical features and customer requirements.</li><li>Update the Product Planning Group (PPG) regularly to ensure project status visibility, employing Daily Management (DM) practices to ensure compliance with project objectives.</li><li>Enhance the product development process.<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Bachelor’s degree in engineering or equivalent experience is highly desired.</li><li>3+ years project management experience in medical device or a similar regulated industry </li><li>Proficient in MS Office; MS Excel highly preferred<br/><br/></li></ul>", "preferred": "<ul><li>Project Management certification</li><li>Experience with Medical Device Regulations</li><li>3 years relevant experience in Design Controls, 21 CFR 820, ISO 13485, or ISO 14971 </li><li>The ideal candidate should live in Southern California <br/><br/></li></ul>"}, "skills": ["Project Management", "Medical Device", "MS Office", "MS Excel", "Regulatory Affairs", "510(k) Submissions", "Product Licensing", "Design Controls", "21 CFR 820", "ISO 13485", "ISO 14971"], "postedDate": "2 weeks ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3997693609"}