{"jobTitle": "Executive Assistant to CEO and Advancement Director", "company": {"name": "Los Angeles Christian Health Centers", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Director", "jobFunction": "Administrative", "industry": "Hospitals and Health Care", "description": "<strong>Job Description<br/><br/></strong><strong>REQUIREMENT NEEDED FOR REVIEW AND CONSIDERATION</strong>:<br/><br/><ul><li> Resume</li><li> Cover Letter --- in 200 words or less please describe your primary interest and experience as it relates to this position/job description<br/><br/></li></ul><strong>SUMMARY:<br/><br/></strong>Los Angeles Christian Health Centers is a non-profit, faith-based, Federally Qualified Health Center. For over 20 years we have provided medical, dental, mental health, substance use, social work, optometry and pharmacy services throughout some of the most poverty-impacted communities in Los Angeles, including Skid Row, Boyle Heights, and Watts.<br/><br/>The Executive Assistant provides personal administrative support to the Chief Executive Officer and the Advancement Director. Promotes LACHC’s image by representing the Chief Executive Officer internally and externally, serving as a liaison between the Chief Executive Officer and employees, Board members, and other community members, supports all fund development activities with an emphasis on gift processing, database management, campaign administration and development back-office operations. Duties include general clerical/administrative work, assisting with Advancement, and other project based work. Support the clerical and administrative needs of the Board of Directors.<br/><br/><strong>ESSENTIAL DUTIES and RESPONSIBILITIES</strong> include:<br/><br/><strong>Support for the CEO<br/><br/></strong><ul><li>Represent the Chief Executive Officer in carrying out LACHC’s mission- to show God’s love by providing quality, comprehensive healthcare services to the homeless and underserved; exemplify LACHC’s values of Christlikeness, Excellence, Integrity and Accessibility. </li><li>Prepare correspondence, reports, and materials for publications and presentations. </li><li>Answer telephones and handle in appropriate manner; serving as the first line of communication with the outside world, represent the organization’s mission and values in all interactions. </li><li>Opens and sorts Chief Executive Officer’s mail. </li><li>Setup travel arrangements for Chief Executive Officer, Board Members, and other staff as needed. </li><li>Assist with Chief Executive Officer’s calendar; coordinate meeting times with requesters by finding available time slots and sending meeting invitations. </li><li>Prepare and maintain Chief Executive Officer’s expense report; complete purchase requests and reimbursement requests as necessary. </li><li>Meet and greet Chief Executive Officer’s clients and visitors; arrange visitor and vendor access to corporate office suite when needed; arrange food and other hospitality for CEO’s visitors and meetings. </li><li>Create, transcribe, and distribute meeting agendas and minutes for various leadership/management meetings as requested by Chief Executive Officer. </li><li>Perform general clerical duties to include but not limited to: photocopying, faxing, scanning, mailing, and filing (maintaining both hard copy and electronic filing systems). <br/><br/></li></ul><strong>Support for the Board of Directors:<br/><br/></strong><ul><li>Setup and coordinate meetings and retreats, maintaining schedule for administrative headquarters’ conference rooms. </li><li>Serve as liaison to Board of Directors; obtain Board signatures on resolutions, policies, and other forms as needed; maintain files/binders of signed documents such as Policy and Procedures Binder. </li><li>Anticipate needs of Board officers, committee chairs, and other members; maintain communication with Board members in between meetings, especially to obtain RSVPs and ensure quorum. </li><li>Maintain Board notebook (electronic or hardcopy depending on preference of the Board), keeping it updated and distributing updated version to Board members regularly. </li><li>Create, transcribe, and distribute meeting agendas and minutes for all Board meetings, as well as selected Board committee meetings. <br/><br/></li></ul><strong>Support for Advancement Director:<br/><br/></strong><ul><li>Under the direction of the Advancement Director, provide administrative support with Advancement related priorities including fundraising, special events, media/public relations, strategic communications and contributor relations. E.g. </li><li> Major contributor meeting scheduling, logistics, coordination and follow-up. </li><li> CRM (ETapestry) record keeping and updates of CEO networking contacts. </li><li> Process and acknowledge all contributions through CRM and reconcile income monthly with accounting and maintain organized record of all reconciliations. </li><li> Regularly create social media posts of contributor related topics and interest according to department editorial calendar and plans. </li><li> Create monthly fundraising reports and other database reports as needed. </li><li> Continually update and correct database records. </li><li> Coordinate production and mailings in support of direct mail program and events. </li><li> Handle all meeting logistics related to special tours and in-house meetings for department. </li><li> Keep accurate inventory of all department supplies and collateral material</li><li> Routinely provide Advancement Dashboard update data and other CRM analysis as needed. </li><li> Document and flyer design, updates and file management for core organizational collateral. </li><li>Act as member of Advancement teams on routine and special projects. </li><li>Under the direction of the Advancement Director and the CEO’s approval, maintain company logo, brand style sheet and electronic letterhead files for the effective access and use by all LACHC staff. <br/><br/></li></ul><strong>Other:<br/><br/></strong><ul><li>Coordinate project-based work and special assignments by doing research, establishing objectives, determining priorities, managing time, gaining cooperation of others, monitoring progress, problem-solving, and making adjustments in plans. </li><li>Other duties as assigned. <br/><br/></li></ul><strong>EDUCATION And/or EXPERIENCE<br/><br/></strong>Bachelor’s Degree and three or more years of experience as an executive assistant; experience with assisting in communications and or fundraising required.<br/><br/>Full-time position with Medical, Dental, Vision and 403B Retirement Plan with employer match. We are an equal opportunity employer and willing to consider candidates with criminal backgrounds.<br/><br/><strong>Company Description<br/><br/></strong>The Los Angeles Christian Health Centers (LACHC) opened in 1995 with a handful of staff but a big vision to render hope and healing through healthcare to the thousands of homeless and low-income residents living in Los Angeles. Today, 180 staff members serve the County's most vulnerable populations from our two full-time health centers in Skid Row and Boyle Heights. We also provide comprehensive medical care at our part-time satellite clinics hosted by our community partners throughout Downtown Los Angeles.<br/><br/>The Los Angeles Christian Health Centers (LACHC) opened in 1995 with a handful of staff but a big vision to render hope and healing through healthcare to the thousands of homeless and low-income residents living in Los Angeles. Today, 180 staff members serve the County's most vulnerable populations from our two full-time health centers in Skid Row and Boyle Heights. We also provide comprehensive medical care at our part-time satellite clinics hosted by our community partners throughout Downtown Los Angeles.", "postedDate": "1 week ago", "benefits": "Full-time position with Medical, Dental, Vision and 403B Retirement Plan with employer match. We are an equal opportunity employer and willing to consider candidates with criminal backgrounds.", "skills": [], "url": "https://www.linkedin.com/jobs/view/3997103518"}