{"jobTitle": "Marketing Manager, Amazon Fresh Grocery", "company": {"name": "Amazon", "location": "New York, United States"}, "location": "New York, United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Public Relations and Marketing", "industry": "Software Development", "description": "Interested in working on an innovative and high-impact business that is changing the way customers think about grocery? We’re seeking an exceptionally talented multi-channel marketer to launch and innovate our Omnichannel Marketing and Site Merchandising strategy for our some of our Center Store categories through multi-channel campaigns to drive customer adoption and engagement. The ideal candidate is data-driven self-starter who can utilize strong analytical skills to test, learn, and iterate on marketing tactics. The candidate should be able to apply excellent business judgment to deliver results in a rapidly evolving environment.<br/><br/>The Marketing Manager will work closely with internal and external partners to conceive and propose customer-facing strategies and concepts. Marketing Managers will also own guiding these projects to completion to hit customer, revenue, and profitability goals. This will include creating campaign experiment frameworks, analyzing results, and structuring scalable campaigns across Amazon-owned channels. You will own omnichannel campaigns end-to-end for the Snacks categories and vendor set, analyze performance, and iterate to enhance the customer experience. This role is inherently cross-functional, working closely with external partners, central marketing teams, selection, vendor manager, instock managers, product, and executive teams.<br/><br/>Key job responsibilities<br/><br/><ul><li> Develop, execute, and optimize an end-to-end marketing strategy for the Center Store product categories and vendor portfolios including omnichannel merchandising placements, promotional strategy, and product assortment.</li><li> Work closely with vendor management and instock management teams to meet business priorities.</li><li> Develop and integrate a go-to-market category strategy into the overall Amazon Fresh Strategy.</li><li> Drive experiments to continuously improve efficacy and efficiency of site merchandising tactics</li><li> Develop data-driven customer insights using raw data sources that are actionable and impactful</li><li> Support in-depth business reviews and present results and insights to key stakeholders and external partners</li><li> Earn trust at all levels through excellent communication and collaboration</li><li> Prioritize effectively in a quickly changing and ambiguous environment<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> 3+ years of professional non-internship marketing experience</li><li> Experience building, executing and scaling cross-functional programs or marketing campaigns from concept to completion</li><li> Experience in marketing or marketing research</li><li> Experience with Excel or Tableau (data manipulation, macros, charts and pivot tables)</li><li> Experience using Microsoft Excel to manipulate and analyze data</li><li> Experience using data and metrics to drive improvements<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Experience using customer research, hard data and metrics to back up assumptions, generate forecasts, and assess the efficacy of marketing programs</li><li> Experience utilizing systems and tools involving email, web, analytics, and CRM (Marketo, Tableau, Salesforce, etc.) for targeting, segmentation, reporting for demand generation<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $72,600/year in our lowest geographic market up to $155,200/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2716060", "responsibilities": "Develop, execute, and optimize an end-to-end marketing strategy for the Center Store product categories and vendor portfolios including omnichannel merchandising placements, promotional strategy, and product assortment. Work closely with vendor management and instock management teams to meet business priorities. Develop and integrate a go-to-market category strategy into the overall Amazon Fresh Strategy. Drive experiments to continuously improve efficacy and efficiency of site merchandising tactics Develop data-driven customer insights using raw data sources that are actionable and impactful Support in-depth business reviews and present results and insights to key stakeholders and external partners Earn trust at all levels through excellent communication and collaboration Prioritize effectively in a quickly changing and ambiguous environment", "qualifications": {"required": "3+ years of professional non-internship marketing experience Experience building, executing and scaling cross-functional programs or marketing campaigns from concept to completion Experience in marketing or marketing research Experience with Excel or Tableau (data manipulation, macros, charts and pivot tables) Experience using Microsoft Excel to manipulate and analyze data Experience using data and metrics to drive improvements", "preferred": "Experience using customer research, hard data and metrics to back up assumptions, generate forecasts, and assess the efficacy of marketing programs Experience utilizing systems and tools involving email, web, analytics, and CRM (Marketo, Tableau, Salesforce, etc.) for targeting, segmentation, reporting for demand generation"}, "skills": ["Marketing", "Data Analysis", "Customer Insights", "Cross-Functional Collaboration", "Omnichannel Marketing", "Site Merchandising", "Excel", "Tableau", "CRM", "Email Marketing", "Web Analytics"], "postedDate": "1 week ago", "salary": {"amount": "72,600.00/year - $155,200.00/year", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997091705"}