{"jobTitle": "Sales Representative (Entry Level), Work from Home", "company": {"name": "Vector Marketing", "location": "La Canada Flintridge, CA"}, "location": "La Canada Flintridge, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Human Resources Services", "description": "Vector Marketing is looking to fill part-time sales positions right away. Request an interview today and start work within the week.<br/><br/><strong>What are the position details?<br/><br/></strong>Our reps sell Cutco products through one-on-one appointments, explaining the products, and placing any orders. Previous work experience isn't required, we are just looking for people who enjoy working with others.<br/><br/>Reps are paid $27.50 base-appt that isn't based on sales or results, but they can earn more based on commission. If they have an off week, they still get paid for the work they did, but can earn more based on performance.<br/><br/>We help reps create a schedule that works best for them. Some work as much as possible, some part time, and others are just looking to make some extra income around their classes, other jobs, and family obligations.<br/><br/>The products are used in the kitchen and some outdoor tools as well. Previous knowledge about home goods, sales, or work experience is not needed. We are just looking for people who enjoy working with others.<br/><br/>We've been training people to do well for over 40 years. Even if someone doesn't stay with us long term - the sales, networking, and communication skills they build are needed for every field. Reps work from home or locally after training. Most meetings and training are held in the office.<br/><br/><strong>What are the basic requirements?<br/><br/></strong><ul><li> Enjoys working with others</li><li> All ages 18 + or 17 and graduating in 2024 are encouraged to apply</li><li> Some conditions apply</li><li> Able to interview within the week</li><li> Willing to learn and apply new skills<br/><br/></li></ul><strong>Who would do well here?<br/><br/></strong>People who have done well with us have had experience in all different lines of work - retail, fast food, cashier, grocery store clerk, administrative assistant, receptionist, server, landscape, warehouse worker, and in just about any field you can imagine. We also welcome applicants who haven't had any work experience. If they have a positive attitude and enjoy working with people, they can do well here.<br/><br/>If you think you would be a great fit for our sales team, fill out contact information and a receptionist will send you a text about setting up a virtual interview with a manager. We encourage applicants of all ages and experience, as we do not discriminate on the basis of an applicant's age.", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3997413944"}