{"jobTitle": "Medical Director", "company": {"name": "Nexus HR", "location": "Inglewood, CA"}, "location": "Inglewood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "290,000.00/yr - 350,000.00/yr", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Human Resources Services", "description": "<strong>- Inglewood, CA<br/><br/></strong><strong>Compensation: $290,000.00 to $350,000.00 per year DOE <br/><br/></strong><strong><em>Overview: Nexus HR is looking for a <br/><br/></em></strong><strong><em>Medical Director<strong><em>/Chief Medical Officer in Inglewood, CA. The ideal candidate will have to provide professional medical services to complement the delivery of primary health care services.<br/><br/></em></strong></em></strong><strong>About The Job<br/><br/></strong><em>Provides clinical leadership and supervision of medical providers, medical staff, and medical support staff. Works closely with the Health Center Managers to ensure quality-of-care accomplishes the organizational mission. Also, has a primary obligation to the Corporation as a whole and reports to the Chief Executive Officer.<br/><br/></em><strong>Duties and Responsibilities:<br/><br/></strong><strong><em>Supervisory: <br/><br/></em></strong><ul><li>Oversees the management and supervision of the medical and clinical support providers and delegates’ authority and responsibility when and where needed</li><li>Oversee and chair the Quality Improvement Committee and ensure quality of care is provided and risk is minimized</li><li>Collaborate with the providers to ensure standard of care is provided to patients<br/><br/></li></ul><strong><em>Clinical: <br/><br/></em></strong><ul><li>Provides medical evaluation, treatment and consultation services to patients of the clinic</li><li>Available to staff at all times; responds to emergencies and answers medical questions</li><li>Obtains and documents, or causes to be obtained and documented, appropriate chief complaint, past medical, family, and social history, review of systems, examination, medications and allergies, assessment and plan for each patient</li><li>Provides medical orders for prescription refills, administration of medication, ancillary testing, and/or referrals</li><li>Reviews ancillary test results and coordinates notification to the patient </li><li>Provides patient education as needed</li><li>Supervises patient care by non-clinic agencies such as home health care, nursing home, or hospice</li><li>Answers questions and relays information regarding patient care personally or through clinical staff</li><li>Completes appropriate paperwork to comply with insurance and reimbursement guidelines</li><li>Completes all documentation and paperwork in a timely manner<br/><br/></li></ul><strong><em>Medical Administrative:<br/><br/></em></strong><ul><li>Approves and maintains treatment protocols utilized by midlevel providers</li><li>Develops and documents protocols related to his or her job functions</li><li>Chairs provider meetings</li><li>Provides assistance to the Medical Clinic Manager for the orientation and training of providers</li><li>Monitors clinical areas for staffing needs and submits recommendations</li><li>Assists with development of patient care policies, protocols and procedures</li><li>Provides quality assurance, patient care assessment, risk management, and program evaluation services as a Chair of the QA Committee. In performing such duties the Medical Director/Chief Medical Officer reviews an adequate sample of the clinic's medical record with particular emphasis on the appropriateness, efficiency, and quality of care provided. When the review of said medical records show the corrective steps are necessary, the Medical Director/Chief Medical Officer should take appropriate corrective steps, in collaboration with the appropriate administrative supervisory or clinical personnel. Maintains appropriate records of all reviews and actions;</li><li>Provides utilization and peer review services regarding the medical necessity and appropriateness of outpatient and inpatient services provided to patients of the clinic. In performing such duties;<br/><br/></li></ul>Medical Director/Chief Medical Officer shall review an adequate sample of clinics medical records to ensure the provider examination, diagnosis, anticipates goals, medical orders, treatments and therapies, and documentation thereof, are timely, appropriate and of acceptable professional quality;<br/><br/><ul><li>Reviews and responds, in collaboration with Chief Executive Officer and Nursing Director, to any complaint or grievance specifically related to patient care or medical education</li><li>Chairs the Credentialing Committee to ensure all licensed providers are adequately credentialed to offer services that are required of their licensure</li><li>Assists with development of programs to increase or improve clinical services</li><li>Participates in public relations and community outreach activities as a clinic shall from time to time reasonably request</li><li>Provides assistance with OSHA, emergency preparedness, infection control and regulatory compliance<br/><br/></li></ul><strong><em>Administrative<br/><br/></em></strong><ul><li>Works closely with the Chief Executive Officer and Nursing Director to provide leadership and medical direction to the clinic’s staff</li><li>Reports on the performance of medical services to the Chief Executive Officer on a quarterly basis, in a manner and form adopted as adequate and appropriate by the Management Team</li><li>Assists and participates in the clinic’s Quality Assurance Program, OSHA guidelines and other regulatory entities</li><li>Participates in budget development</li><li>Assists the Chief Executive Officer and Nursing Director with the professional development of the clinic’s medical providers</li><li>Assist with screening of applicants for clinical positions; performs initial interviews, recommends candidates for and assists with final interviews and selection </li><li>Attends all staff, clinical, board or other special meetings as requested</li><li>Performs other appropriate duties as requested</li><li>Represents Anphon Medical Center at functions as requested</li><li>Maintains patient confidentiality at all times<br/><br/></li></ul><strong>Qualifications</strong>:<br/><br/><ul><li>Current state of California MD or DO licensure required</li><li>Current DEA certificate required</li><li>Board certification in Family Medicine is highly preferred</li><li>CPR certification required (must be obtained within 30 days of employment)</li><li>Experience in public health is preferred</li><li>Knowledge of HIPAA compliance</li><li>Previous medical office experience</li><li>Previous supervisory experience</li><li>Understanding of ethics of confidentiality </li><li>Previous computer experience or training</li><li>Successful candidate must submit to TB testing and any vaccinations recommended by OSHA Guidelines</li></ul>", "responsibilities": "Provides clinical leadership and supervision of medical providers, medical staff, and medical support staff. Works closely with the Health Center Managers to ensure quality-of-care accomplishes the organizational mission. Also, has a primary obligation to the Corporation as a whole and reports to the Chief Executive Officer.", "qualifications": {"required": "Current state of California MD or DO licensure required, Current DEA certificate required, CPR certification required (must be obtained within 30 days of employment), Previous medical office experience, Previous supervisory experience, Understanding of ethics of confidentiality, Previous computer experience or training, Successful candidate must submit to TB testing and any vaccinations recommended by OSHA Guidelines", "preferred": "Board certification in Family Medicine is highly preferred, Experience in public health is preferred, Knowledge of HIPAA compliance"}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3997690136"}