{"jobTitle": "Store Director", "company": {"name": "Rebag", "industry": "Retail Apparel and Fashion", "location": "Arcadia, CA"}, "location": "Arcadia, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales, Management, and Administrative", "industry": "Retail Apparel and Fashion", "description": "<strong>Company</strong><p><br/></p><p>Rebag, the ultimate destination for buying and selling the most coveted designer handbags and accessories, is an e-commerce company reimagining the role of luxury in the secondary market. Rebag has opened a world of endless access to luxury, with a unique business model that puts the seller first, offers upfront payment, and makes the resale experience smooth and clutter-free.</p><p><br/></p><p>Since its inception, Rebag has catered to a rapidly growing segment of consumers who are exploring ownership of luxury goods in a sustainable and affordable way. The company operates online and in stores, with locations in Los Angeles, New York, Miami, and Connecticut. Founded in 2014 by a team out of Harvard Business School, Rebag is backed by prestigious venture capital investors including General Catalyst, Novator, Crosslink and FJLabs, and has raised over $100m in funding to date. In 2020, Rebag was named one of Fast Company’s Most Innovative Companies. Rebag has been featured in the New York Times, Business of Fashion, VOGUE, TechCrunch and more.</p><p><br/></p><p><strong>Role Description:</strong></p><p>The Store Director position requires someone who is personable, energetic, highly organized, and hard-working. Individuals should have a passion for fashion and sustainability and should enjoy working with a team. The Store Director will be responsible for driving sales, mentoring Store Experience Leads, Omni Client Experience Managers, Bar Leads, and Customer Experience Specialists, and promoting excellence in customer service. The goal of this individual is to take responsibility for all aspects of the store's operations while playing an active role on the sales floor.</p><p><br/></p><p><strong>The Role's Core Values</strong></p><p><br/></p><ul><li>Develop and lead a team to achieve company standards across all categories; Lead by example on the selling floor, proactively coaching and inspiring the team.</li><li>Lead by example in the demonstration of integrity, honesty and knowledge to promote the company culture, values, and mission.</li><li>Set clear goals &amp; expectations along with the leadership team and hold consistent coaching sessions with associates to review performance and provide timely feedback; Oversee annual review process for direct reports.</li><li>Lead and showcase mastery of skills when it comes to the client experience</li><li>Engage with clients utilizing a Professional, Passionate, Performance Driven, and Personable mindset</li><li>Organize and execute the operational standards of the boutique</li><li>Work collaboratively with peers to drive our Rebag spirit</li><li>Assist management in developing the sales team to deliver best-in-class knowledge and experience to every customer that walks into the boutique</li></ul><p><br/></p><p><strong>What We Expect You to Bring To The Table</strong></p><p><br/></p><ul><li>Be reliable in difficult situations and has the willingness to be called upon to complete projects.</li><li>Be energized by problem solving and act and decide without having the total picture.</li><li>Expert in conflict resolution that can keep productive relationships</li><li>Have a keen eye for talent and be able to identify what Good performance is and High Performance is.</li><li>Be present and involved in brain-storming and be a hero for an idea</li><li>Keep training at the forefront of your everyday</li><li>Create sustainable talent strategies to fuel continued team growth.</li><li>Ability to be savvy with technology.</li><li>Full availability to provide support for our Retail store.</li><li>Never give up.</li><li>Comfortable standing on your feet for long periods of time</li><li>Ability to work weekends and evenings</li><li>Ability to lift a maximum of 40 lbs based on needs of the role.</li><li>Legal right to work in the United States</li></ul><p><br/></p><p><strong>How We Measure Results</strong></p><p><br/></p><ul><li>Oversee and make contributions to streamline and improve the effectiveness of daily store operations.</li><li>Maintain thorough understanding of all policies, procedures and processes; Ensure team adherence and constantly reinforce the philosophy behind these principles.</li><li>Drive all aspects of business including Operational FoH and BoH planning, Rebag Bar Experience, community networking and client development.</li><li>Partner with Store Managers and internal team to develop business goals for store and omni-channel and translate into action plan; Routinely monitor achievement of goals.</li></ul><p><br/></p><p><strong>What To Expect From Rebag</strong></p><p><br/></p><ul><li>A team that believes in the mission and works hard to make the impossible possible</li><li>Individuals who generate ideas to evolve the business.</li><li>An environment that strives in working efficiently and respects your off-time to recharge for the next day.</li></ul>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3997978936"}