{"jobTitle": "Account Executive", "company": {"name": "VersaDesk", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "<strong>Company Overview<br/><br/></strong>Welcome to the cutting-edge world of VersaDesk, where innovation meets comfort, and workspaces transform into dynamic hubs of productivity. With over two decades of pioneering excellence in the computer furniture and ergonomics realm, VersaDesk stands as the undisputed leader in revolutionizing the way we work.<br/><br/>Our journey began with the introduction of the desktop converter, a revolutionary product that has since become an industry standard. Owning both the design and utility patent for this groundbreaking innovation, we have been at the forefront of ergonomic solutions, providing users with the flexibility to seamlessly transition between sitting and standing. But innovation never sleeps at VersaDesk. We are thrilled to announce our latest leap into the future - a fusion of technology and functionality. Our new line of products integrates seamlessly with Alexa, allowing you to command your workspace with your voice.<br/><br/>At the core of our identity are values that resonate with every member of the VersaDesk family. Taking ownership of our responsibilities, staying committed to excellence, and ensuring unparalleled customer satisfaction are not just the principles but the very fabric of our culture. Honesty, accountability, and transparency are the guiding lights that drive our decisions and actions.<br/><br/>Join us on this journey to transform the way people work. Experience the thrill of a workspace that adapts to your needs, enhances your well-being, and reflects individuality. VersaDesk - where innovation meets tradition, and the future of work begins today.<br/><br/><strong>Job Description<br/><br/></strong>VersaDesk is seeking a highly motivated and enthusiastic individual to join our team as an experienced Account Executive. In this role, you will play a pivotal part in driving our business growth by establishing and nurturing strong relationships with customers. As a key member of our sales team, you will be responsible for generating leads, qualifying prospects, and ultimately closing sales deals. This position offers an excellent opportunity for career advancement and growth within a dynamic and innovative company.<br/><br/>If you are a seasoned account executive who thrives in a fast-paced environment and loves sales, we invite you to apply and be a driving force in propelling VersaDesk to the forefront of the industry.<br/><br/>Duties and Responsibilities<br/><br/><ul><li>Excellent verbal and written communication skills with the ability to effectively interact with and present to all stakeholders</li><li>Identifies, bids on, negotiates, and closes new sales opportunities to meet and exceed established sales revenue quota</li><li>Provides input to sales and marketing management about trends and changes taking place within the customer’s organization</li><li>Makes recommendations about future courses of action necessary of the company towards improving VersaDesk’s position with the customer</li><li>Develop and manage relationships with acquired and/or existing customers to gain strategic positioning with decision makers, attain additional business, and retain existing revenue</li><li>Provides comprehensive account plans and strategies to win new business from new and/or existing accounts</li><li>Provides accurate and detailed weekly forecast funnel of identified and proposed opportunities to meet or exceed sales quota requirements</li><li>Understand each target customer's business model and related organizational structure and identify the customer's unique needs</li><li>Self-motivated, proactive, results-oriented professional with an ability to work with minimum direction</li><li>Increased awareness of VersaDesk’s value proposition and total portfolio across assigned accounts, can clearly articulate VersaDesk’s value proposition vs. competition<br/><br/></li></ul>Basic Requirements<br/><br/><ul><li>Bachelor's degree in Marketing, Business, or a related field</li><li>Must have a minimum of 2-3 years of previous selling experience focusing on mid-market and enterprise sized corporations</li><li>Must have a minimum of 2-3 years of previous selling experience within SLED vertical</li><li>Strong passion for sales, coupled with excellent communication and interpersonal skills</li><li>Self-motivated and driven to achieve sales targets and exceed customer expectations</li><li>Ability to work independently and as part of a team, with a proactive approach</li><li>Exceptional presentation and negotiation skills</li><li>Strong problem-solving abilities and the ability to think creatively</li><li>Proficient using CRM software and other sales tools<br/><br/></li></ul>Powered by JazzHR<br/><br/>Zg83NuPNKx", "responsibilities": "<ul><li>Excellent verbal and written communication skills with the ability to effectively interact with and present to all stakeholders</li><li>Identifies, bids on, negotiates, and closes new sales opportunities to meet and exceed established sales revenue quota</li><li>Provides input to sales and marketing management about trends and changes taking place within the customer’s organization</li><li>Makes recommendations about future courses of action necessary of the company towards improving VersaDesk’s position with the customer</li><li>Develop and manage relationships with acquired and/or existing customers to gain strategic positioning with decision makers, attain additional business, and retain existing revenue</li><li>Provides comprehensive account plans and strategies to win new business from new and/or existing accounts</li><li>Provides accurate and detailed weekly forecast funnel of identified and proposed opportunities to meet or exceed sales quota requirements</li><li>Understand each target customer's business model and related organizational structure and identify the customer's unique needs</li><li>Self-motivated, proactive, results-oriented professional with an ability to work with minimum direction</li><li>Increased awareness of VersaDesk’s value proposition and total portfolio across assigned accounts, can clearly articulate VersaDesk’s value proposition vs. competition<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree in Marketing, Business, or a related field\nMust have a minimum of 2-3 years of previous selling experience focusing on mid-market and enterprise sized corporations\nMust have a minimum of 2-3 years of previous selling experience within SLED vertical\nStrong passion for sales, coupled with excellent communication and interpersonal skills\nSelf-motivated and driven to achieve sales targets and exceed customer expectations\nAbility to work independently and as part of a team, with a proactive approach\nExceptional presentation and negotiation skills\nStrong problem-solving abilities and the ability to think creatively\nProficient using CRM software and other sales tools", "preferred": ""}, "skills": ["CRM", "Sales", "Communication", "Presentation", "Negotiation"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997885198"}