{"jobTitle": "Retail Sales Consultant", "company": {"name": "Ulrich Lifestyle Structures", "industry": "Construction", "size": "Not specified", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$40,000.00 - $48,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Construction", "description": "Ulrich Lifestyle Structures is seeking a motivated individual to join our team of sales and design professionals to build a strong presence for our brand. If you are a professional interested in custom structure design who enjoys communicating through traditional and online channels, we would like to meet you!", "responsibilities": "As a Retail Sales Consultant, you will prospect to our target audience by creating engaging social media classified ad content to engage the community, specifically homeowners, using internet-generated leads to contact prospective customers, and using our existing database of prospects to engage them in the buying process. Platforms for engaging potential prospects include Facebook Marketplace, Next Door, Offer Up, and others. You will be responsible for warmly welcoming customers and learning about the solution they desire. By leveraging our proven process and a keen ability to listen to the customer's actual needs, you will work with our design program to build their dream. In addition, you will be responsible for the store's presentation, making and receiving incoming calls, managing inbound leads from the internet, scheduling meetings with the store team, conducting customer outreach, and following up on referrals and reviews of their experience while leveraging our CRM system.", "qualifications": {"required": "Maintain a professional appearance, Vital skill set in graphic design for digital media, Experience with CRM systems-HubSpot preferred, Proficient in Microsoft Word, Excel, PowerPoint, Excellent communication, people, and negotiating skills, Excellent organizational, project management, and time management skills, Excels at working in a collaborative team environment, Excels at working with teams both in person and virtually, Ability to lead with a growth mindset and have a thorough grasp of customer needs, Attention to detail and process requirements", "preferred": "Self-motivated, results-driven professional who consistently delivers high-quality work, Expertise in multiple social media platforms (Facebook, Pinterest, Instagram, etc.), Ability to deliver creative content (text, image, and video), Familiarity with online marketing strategies and marketing channels, Ability to find future trends in digital technologies and act proactively, Strategic thinker with a desire to learn and grow with our company, Highly coachable, able to learn quickly, and retain knowledge, Familiarity with Google Suite, Able to lift up to 40 lbs."}, "skills": ["Graphic Design", "CRM Systems", "Microsoft Office", "Communication", "Project Management", "Social Media Marketing"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Excellent company benefits, including paid time off, health insurance, 401K plan, and more.", "remoteWork": "This position is not remote.", "url": "https://www.linkedin.com/jobs/view/3997277796"}