{"jobTitle": "Supply Chain Manager", "company": {"name": "FPC of Savannah", "location": "San Fernando, CA"}, "location": "San Fernando, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00/yr - $145,000.00/yr", "currency": "USD"}, "jobFunction": "Supply Chain", "industry": "Manufacturing, Aviation and Aerospace Component Manufacturing, and Defense and Space Manufacturing", "description": "<strong>Supply Chain Manager - Chatsworth, California</strong><p>Our growing manufacturing client seeks a skilled Supply Chain Manager to join the team. Reports to GM, high visibility.</p><p><br/></p><p>If you are a Dynamic and Results-Driven Supply Chain People Leader, have Aerospace experience, can Manage and build out a Supply Base while Optimizing inventory, this could be a great fit<strong>!</strong></p><p><strong>Responsibilities:</strong></p><ul><li>Implementing material practices which ensure availability to meet customer demand, revenue requirements and controlled inventory levels</li><li>Negotiating terms and prices with suppliers, monitoring and assessing their performance</li><li>Identifying and minimizing risk by assessing future demand for products and adopting new approaches and new suppliers with no interruption to operations</li><li>Managing supplier relationships and, with Quality Assurance, supplier performance</li><li>Track and report on key performance metrics. Use process and business knowledge to recommend and implement improvements</li><li>Interact with customers and suppliers, answering questions and resolving issues</li><li>Reviewing and updating supply chain practices in line with company policies, standards, laws and regulations</li><li>Support internal and external audits</li><li>Direct leadership of supply chain, planning, and stockroom personnel</li></ul><p><br/></p><p><strong>Qualifications and Experience:</strong></p><ul><li>Must have a practical business background including management principles in resource allocation, strategic planning, management, production and leadership</li><li>Bachelor’s or higher degree in Finance, Supply Chain/Operations Management, Engineering, or similar. Experience may qualify in lieu of a degree</li><li>Demonstrated success in managing a complex supply chain and implementing improvements</li><li>7+ years of manufacturing experience, strong preference to a cabling/electronics background</li><li>5+ years of experience in aerospace and defense industry working within AS9100 regulations is strongly preferred, as is experience with Government customers (DFAS, DLA, etc.)</li><li>3+ years in a leadership role with direct reports</li><li>Commitment to Lean </li><li>MS Office, Root Cause Analysis, 8D and CI mentality are key </li><li>Familiarity with ERP and configuration management tools</li></ul>", "postedDate": "1 week ago", "skills": ["Supply Chain", "Manufacturing", "Aerospace", "Inventory Management", "Supplier Management", "Negotiation", "Risk Management", "Lean", "MS Office", "Root Cause Analysis", "8D", "CI", "ERP", "Configuration Management"], "url": "https://www.linkedin.com/jobs/view/3997282510"}