{"jobTitle": "Registered Nurse (Case Manager Experience) - Remote | WFH", "company": {"name": "Get It Recruit - Healthcare", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Health Care Provider", "industry": "Human Resources Services", "description": "<strong>About Us<br/><br/></strong>We are a dedicated community-based health and care provider committed to enhancing the well-being of those who need it most. Our mission is to improve health outcomes by breaking down barriers and delivering care as close to home as possible, including in-home care whenever feasible.<br/><br/>We recognize the importance of race, culture, and environment in achieving effective healthcare outcomes. Our approach is centered around understanding our patients, their unique needs, and their care plans. We focus on local physicians, nurses, and caregivers to offer personalized care and support.<br/><br/>Our goal is to improve the health and well-being of underserved populations, with a special commitment to Black and Brown communities. We believe in the privilege of providing care and are committed to creating a world where health and care are accessible and not burdensome.<br/><br/><strong>About You<br/><br/></strong>We are looking for a compassionate and experienced RN Case Manager with the following qualifications:<br/><br/>Education: Active Registered Nursing license in California; BSN required.<br/><br/>Experience: Minimum of 5 years of clinical experience, with at least 3 years in care management within health plans, home health, or hospice.<br/><br/>Entrepreneurial Spirit: Ability to independently drive change and address long-standing gaps in care delivery.<br/><br/>Communication Skills: Excellent verbal and written communication skills, with the ability to present complex concepts in an accessible manner.<br/><br/>Relationship Building: Skill in developing and managing relationships with patients, community leaders, and external partners.<br/><br/>Culture Fit: Good judgment, strong ethics, and a team-oriented approach. A desire to grow in a fast-paced, dynamic environment.<br/><br/><strong>About The Role<br/><br/></strong>As an RN Case Manager, you will report to the Director of Clinical Operations and will be responsible for:<br/><br/>Collaborating with an interdisciplinary team to ensure high-quality outcomes for members with chronic diseases.<br/><br/>Developing care pathways and action plans based on alerts and risk levels.<br/><br/>Utilizing remote monitoring and telehealth tools for high-risk conditions.<br/><br/>Conducting in-home or telehealth assessments as needed.<br/><br/>Responding promptly to member alerts and maintaining communication via text and phone.<br/><br/>Coordinating care, including navigation, chronic disease management, and interdisciplinary collaboration.<br/><br/>Engaging patients in proactive health management and referring them to community-based resources.<br/><br/>Following evidence-based guidelines and using electronic medical records for documentation and care coordination.<br/><br/>Participating in team-based rounds to support program development and process improvement.<br/><br/>Reassessing care plans post-discharge and adapting priorities as needed.<br/><br/>Leadership and Strategy<br/><br/>Lead efforts to define and execute strategies that create value in clinical practice and business outcomes.<br/><br/>Establish and innovate strategies to improve member outcomes, enhance business efficacy, and explore market opportunities.<br/><br/>Ensure cohesive clinical capabilities and collaborate with other divisions to meet business objectives.<br/><br/>Provide expertise in clinical solutions and maintain a productive, inclusive work environment.<br/><br/>Work Environment<br/><br/>This position involves both in-home visits and office-based work. It requires frequent travel in various weather conditions and the ability to work indoors in a traditional office setting. The role involves regular communication via telephone and email, extended periods of sitting, occasional lifting up to 30 lbs, and good manual dexterity for office equipment use.<br/><br/>Employment Type: Full-Time", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3997176976"}