{"jobTitle": "Associate Director of Operations, Learning Therapy Provider, Full Time", "company": {"name": "Association of Test Preparation, Admissions, and Private Tutoring", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000 + bonus", "currency": "USD"}, "jobFunction": "Customer Service", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Do you believe that we all learn differently—and that all learners can reach their full learning potential? Are you passionate about creating layers of support for learners and their families?<br/><br/>Our mission is to provide the individual insights and educational resources that kids, parents, and educators need to inspire and achieve heightened results.<br/><br/>The Role<br/><br/>We're looking for someone passionate, mission-driven, and thrilled to support our established Learning Therapy Education Team. You will be the first point of contact for many families as well as the engine behind scheduling and service coordination.<br/><br/>Ideal candidates are quick learners who are comfortable working independently to meet company objectives. We are looking for individuals who are experts at thinking two steps ahead to anticipate the needs of learners, their families, and our educators. If you're a strong leader and a self starter who wants to be part of this growing team we want to hear from you!<br/><br/>Responsibilities include, but are not limited to:<br/><br/><ul><li>First point of contact for clients/prospective clients, and employees for all questions regarding operations. Including, but not limited to: scheduling, accounts, and billing procedures</li><li>Answer phones &amp; emails provide information about programs</li><li>Develop and maintain positive, collaborative relationships with community members, learners, families, and colleagues</li><li>Support marketing events</li><li>Work with clients to find unique solutions for learning support</li><li>Model and uphold culture and expectations</li><li>Communicate with team members and supervisors</li><li>Seek client feedback, and support clients with questions/issues as they arise</li><li>Prepare weekly, monthly, written and verbal reports as requested</li><li>Attend meetings with the Executive team and stakeholders</li><li>Special projects that could include event planning/coordination, external meetings, travel planning and community events<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor's Degree</li><li>Ability to take initiative, work effectively and independently problem solve</li><li>Ideal candidate has previously managed a successful learning center</li><li>Minimum of 2 years experience in a fast-paced office environment</li><li>Excellent organizational skills</li><li>Experience with calendaring/scheduling for staff and learners</li><li>Professional, reliable &amp; flexible</li><li>Phenomenal communication skills: written, verbal and interpersonal</li><li>Passionate about education </li><li>Comfortable with technology platforms including, but not limited to, G Suite (Google Docs, Google Drive, Google Slides, Google Sheets, Google Meet), Microsoft Office, and some CRM experience</li><li>A plus, but not required: A basic understanding of multisensory programming such as Orton-Gillingham, Wilson Reading System, Lindamood-Bell, Social Thinking, Making Math Real and Step up to Writing as well as curricula to support students who struggle with reading, writing, spelling, Executive Functioning and/or math<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong>Employment Type<br/><br/><ul><li>Full-time with benefits</li><li>Salary Range: $75,000 + bonus <br/><br/></li></ul>As an equal opportunity employer, we hire without consideration to race, religion, creed, color, national origin, age, gender, sexual orientation, marital status, veteran status or disability. We are strongly committed to hiring a diverse and multicultural staff and encourage applications from traditionally under-represented backgrounds.", "responsibilities": "Responsibilities include, but are not limited to:<br/><br/><ul><li>First point of contact for clients/prospective clients, and employees for all questions regarding operations. Including, but not limited to: scheduling, accounts, and billing procedures</li><li>Answer phones &amp; emails provide information about programs</li><li>Develop and maintain positive, collaborative relationships with community members, learners, families, and colleagues</li><li>Support marketing events</li><li>Work with clients to find unique solutions for learning support</li><li>Model and uphold culture and expectations</li><li>Communicate with team members and supervisors</li><li>Seek client feedback, and support clients with questions/issues as they arise</li><li>Prepare weekly, monthly, written and verbal reports as requested</li><li>Attend meetings with the Executive team and stakeholders</li><li>Special projects that could include event planning/coordination, external meetings, travel planning and community events<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's Degree, Ability to take initiative, work effectively and independently problem solve, Ideal candidate has previously managed a successful learning center, Minimum of 2 years experience in a fast-paced office environment, Excellent organizational skills, Experience with calendaring/scheduling for staff and learners, Professional, reliable &amp; flexible, Phenomenal communication skills: written, verbal and interpersonal, Passionate about education, Comfortable with technology platforms including, but not limited to, G Suite (Google Docs, Google Drive, Google Slides, Google Sheets, Google Meet), Microsoft Office, and some CRM experience", "preferred": "A basic understanding of multisensory programming such as Orton-Gillingham, Wilson Reading System, Lindamood-Bell, Social Thinking, Making Math Real and Step up to Writing as well as curricula to support students who struggle with reading, writing, spelling, Executive Functioning and/or math"}, "skills": ["G Suite", "Microsoft Office", "CRM", "Orton-Gillingham", "Wilson Reading System", "Lindamood-Bell", "Social Thinking", "Making Math Real", "Step up to Writing"], "postedDate": "1 week ago", "benefits": "Full-time with benefits, Salary Range: $75,000 + bonus", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997383905"}