{"jobTitle": "Scrum Master", "company": {"name": "Kforce Inc", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Associate", "salary": {"amount": "$60.00/hr - $65.00/hr", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Alternative Medicine, Hospitals and Health Care, and Mental Health Care", "description": "<strong>Responsibilities<br/><br/></strong>Kforce has a client that is seeking a Scrum Master in Los Angeles, CA. Key Tasks:<br/><br/><ul><li> Scrum Master III will provide functional coordination for the PMO and IT Project Managers to deliver technical solutions in the context of an Agile SDLC environment</li><li> Conduct the daily scrum sessions, sprint planning, sprint grooming, product demonstrations and retrospective reviews as needed</li><li> Accountable for providing accurate forecasts and the on-going management of the team's workload and progress via the Storyboards</li><li> Leads conflict resolution and will drive the team forward to achieve the sprint goals leveraging business and interpersonal experience to remove project roadblocks</li><li> Scrum Master III will need to understand current and planned business practices in each of the domains, and create excellent relationships with the business stakeholders as well as technical staff</li><li> Responsible for delivering mission critical large-scale projects for the enterprise</li><li> Act as a bridge between the Agile teams and traditional Project Managers</li><li> Mentors and guides other less experienced Scrum Masters</li><li> Facilitates the current sprint daily scrum, storyboard maintenance, sprint demos and retrospective ceremonies</li><li> Create project outlines and timelines and distribute responsibilities to team members</li><li> Forecasts sprint activities, backlog planning and coordinates with the Project Managers</li><li> Oversee design, implementation, QA, and validation of programming code and products</li><li> Ensure milestones are reached and deadlines are met throughout project lifecycle</li><li> Resolves sprint issues and minimizes escalation to Enterprise Integration Services Leadership</li><li> Build excellent relationships with stakeholders, application users, and program owners</li><li> Mentors less experienced Scrum Masters</li><li> Supports and is an evangelist for propagation of agile processes in the company<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li> Bachelor's degree - In lieu of degree, equivalent education and/or experience may be considered</li><li> Certification in Scrum Master (CSM) or Professional in Scrum Master (PSM) I or II</li><li> Minimum 6-8 years of Scrum Master experience in a multi-Scrum environment</li><li> Minimum 3 years of experience managing projects using OCTANE or JIRA</li><li> Minimum of 2 years of experience working as a Project Manager</li><li> Excellent written and verbal communications skills</li><li> Demonstrated strong leadership skills</li><li> Ability to create a highly collaborative environment</li><li> Ability to shape their team behavior through the Agile process as well as other scrum teams</li><li> Must possess the ability to explain succinctly intricate and complicated concepts and ideas to business leaders and technical staff</li><li> Must possess the ability to work well with many different kinds of people, departments, and divisions from executive business and technology leadership to the engineering staff</li><li> Demonstrated ability to set-up OCTANE and/or JIRA to manage sprints</li><li> Demonstrated ability to set-up Projects in MS Project Server<br/><br/></li></ul><strong>Skills Preferred<br/><br/></strong><ul><li> Data analytical skills, working with SQL Server and Oracle databases</li><li> Experience leading teams in the development of services software<br/><br/></li></ul>The pay range is the lowest to highest compensation we reasonably in good faith believe we would pay at posting for this role. We may ultimately pay more or less than this range. Employee pay is based on factors like relevant education, qualifications, certifications, experience, skills, seniority, location, performance, union contract and business needs. This range may be modified in the future.<br/><br/>We offer comprehensive benefits including medical/dental/vision insurance, HSA, FSA, 401(k), and life, disability &amp; ADD insurance to eligible employees. Salaried personnel receive paid time off. Hourly employees are not eligible for paid time off unless required by law. Hourly employees on a Service Contract Act project are eligible for paid sick leave.<br/><br/>Note: Pay is not considered compensation until it is earned, vested and determinable. The amount and availability of any compensation remains in Kforce's sole discretion unless and until paid and may be modified in its discretion consistent with the law.<br/><br/>This job is not eligible for bonuses, incentives or commissions.<br/><br/>Kforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.", "responsibilities": "Kforce has a client that is seeking a Scrum Master in Los Angeles, CA. Key Tasks:<br/><br/><ul><li> Scrum Master III will provide functional coordination for the PMO and IT Project Managers to deliver technical solutions in the context of an Agile SDLC environment</li><li> Conduct the daily scrum sessions, sprint planning, sprint grooming, product demonstrations and retrospective reviews as needed</li><li> Accountable for providing accurate forecasts and the on-going management of the team's workload and progress via the Storyboards</li><li> Leads conflict resolution and will drive the team forward to achieve the sprint goals leveraging business and interpersonal experience to remove project roadblocks</li><li> Scrum Master III will need to understand current and planned business practices in each of the domains, and create excellent relationships with the business stakeholders as well as technical staff</li><li> Responsible for delivering mission critical large-scale projects for the enterprise</li><li> Act as a bridge between the Agile teams and traditional Project Managers</li><li> Mentors and guides other less experienced Scrum Masters</li><li> Facilitates the current sprint daily scrum, storyboard maintenance, sprint demos and retrospective ceremonies</li><li> Create project outlines and timelines and distribute responsibilities to team members</li><li> Forecasts sprint activities, backlog planning and coordinates with the Project Managers</li><li> Oversee design, implementation, QA, and validation of programming code and products</li><li> Ensure milestones are reached and deadlines are met throughout project lifecycle</li><li> Resolves sprint issues and minimizes escalation to Enterprise Integration Services Leadership</li><li> Build excellent relationships with stakeholders, application users, and program owners</li><li> Mentors less experienced Scrum Masters</li><li> Supports and is an evangelist for propagation of agile processes in the company<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree - In lieu of degree, equivalent education and/or experience may be considered, Certification in Scrum Master (CSM) or Professional in Scrum Master (PSM) I or II, Minimum 6-8 years of Scrum Master experience in a multi-Scrum environment, Minimum 3 years of experience managing projects using OCTANE or JIRA, Minimum of 2 years of experience working as a Project Manager, Excellent written and verbal communications skills, Demonstrated strong leadership skills, Ability to create a highly collaborative environment, Ability to shape their team behavior through the Agile process as well as other scrum teams, Must possess the ability to explain succinctly intricate and complicated concepts and ideas to business leaders and technical staff, Must possess the ability to work well with many different kinds of people, departments, and divisions from executive business and technology leadership to the engineering staff, Demonstrated ability to set-up OCTANE and/or JIRA to manage sprints, Demonstrated ability to set-up Projects in MS Project Server<br/><br/>", "preferred": "Data analytical skills, working with SQL Server and Oracle databases, Experience leading teams in the development of services software<br/><br/>"}, "skills": ["Scrum Master", "Agile", "SDLC", "Project Management", "OCTANE", "JIRA", "MS Project Server", "SQL Server", "Oracle"], "postedDate": "2 weeks ago", "benefits": "We offer comprehensive benefits including medical/dental/vision insurance, HSA, FSA, 401(k), and life, disability &amp; ADD insurance to eligible employees. Salaried personnel receive paid time off. Hourly employees are not eligible for paid time off unless required by law. Hourly employees on a Service Contract Act project are eligible for paid sick leave.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997320059"}