{"jobTitle": "Production Manager", "company": {"name": "Interactive Resources - iR", "location": "Compton, CA"}, "location": "Compton, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Supply Chain, Project Management, and Product Management", "industry": "Plastics Manufacturing", "description": "<strong>Job Purpose:</strong> Manage overall operations and is responsible for the effective and successful management of labor, productivity, quality control, and safety measures as established and set for the Operations Department. The experienced operations manager will ensure safe and efficient operations. Serve as a company representative on regulatory issues. Enhance the operational procedure, systems, and principles in the areas of information flow and management, business processes, enhanced management reporting, and look for opportunities to expand systems. Carry out supervisory responsibilities in accordance with the company’s policies and applicable laws.\n<br/>\n*MUST HAVE A BACHELORS DEGREE*\n<br/>\n<strong>Key Responsibilities:</strong>\n<br/>\n<br/>\n<ul><li>Recruit, select, train, assign, schedule, coach, counsel, and discipline employees</li><li>Communicate job expectations; planning, monitoring, appraising, and reviewing job contributions.</li><li>Plan and review compensation actions; enforcing policies and procedures.</li><li>Contribute operations information and recommendations to strategic plans and reviews; prepare and complete action plans; implement production, productivity, quality, and customer-service standards; resolve problems; complete audits; identify trends.</li><li>Analyze and improve organizational process and workflow, employee and space requirements, and equipment layout; implement changes.</li><li>Maintain a safe and healthy work environment by establishing, following, and enforcing standards and procedures, complying with legal regulations.</li><li>Update job knowledge by participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations.</li><li>Meet or exceed operations labor budget expectations.</li><li>Manage staff levels, wages, hours, contract labor to revenues.</li><li>Responsible for all department managers and supervisors, with review/approval responsibility for all operations employees</li><li>Run a safe, injury/accident-free workplace.</li><li>Communicate customer issues with operations team and devise ways of improving the customer experience, including resolving problems and complaints.</li><li>Communicate all operating policies and/or issues at department meetings.</li><li>Work closely with the inventory manager and team to perform analysis of our inventory and ensure we are utilizing our inventory effectively,</li><li>Work with plant personnel to assure all KPIs are clearly delivered, comprehensive and trackable!</li></ul>\n<br/>\n<br/>\n<strong>Core Competencies:</strong>\n<br/>\n<br/>\n<ul><li>Communicate customer issues with operations team and devise ways of improving the customer experience, including resolving problems and complaints.</li><li>Communicate all operating policies and/or issues at department meetings.</li><li>Work closely with the inventory manager and team to perform analysis of our inventory and ensure we are utilizing our inventory effectively,</li></ul>\n<br/>\n<br/>\n<strong>Knowledge, Skills, and Abilities:</strong>\n<br/>\n<br/>\n<ul><li>7-10 years Manufacturing</li><li>5-7 Operation leadership role</li><li>Degree or years’ experience equivalent</li><li>Knowledge ERP</li></ul><p></p>", "responsibilities": "Manage overall operations and is responsible for the effective and successful management of labor, productivity, quality control, and safety measures as established and set for the Operations Department. The experienced operations manager will ensure safe and efficient operations. Serve as a company representative on regulatory issues. Enhance the operational procedure, systems, and principles in the areas of information flow and management, business processes, enhanced management reporting, and look for opportunities to expand systems. Carry out supervisory responsibilities in accordance with the company’s policies and applicable laws.", "qualifications": {"required": "MUST HAVE A BACHELORS DEGREE", "preferred": ""}, "skills": ["ERP"], "postedDate": "2 weeks ago", "benefits": "Medical insurance, Dental insurance, Vision insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997638864"}