{"jobTitle": "SVP, Account Director", "company": {"name": "Monks", "industry": "Advertising Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "$250,000—$275,000", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Advertising Services", "description": "The SVP Account Director maintains agency relationships in a fast-paced, evolving environment. Nimbleness and collaboration is the name of the game. Our approach fosters collaboration not only internally but also with our clients and other agency partners. This is a role for a strategic and growth-minded professional with the industry know-how and rapport to simply get things done. If you’re an experienced go-getter who just gets clients and seeks out new opportunities to create impactful work, then let’s get down to the essentials.", "responsibilities": "Lead and manage an extensive global cross-functional media operations, creative and analytics team. Provide mentorship and direction for service line leadership. Maintain senior level relationships with key global client stakeholders and act as the primary point of escalation. Maintain account health including acting as primary internal POC for all account related forecasting. Be the primary subject matter leader for the team and the client. Identify and capitalize on new opportunities for growth.", "qualifications": {"required": "15+ years of experience in performance agency leadership working with enterprise level clients; ideally in technology. Ability to own senior level relationships to ensure account stability and growth and to project thought leadership and cultivate respect as a trusted adviser and partner. Direct experience managing both digital media and creative teams is a major plus. Proven experience aligning client expectations with limitations and capacity of available team and a willingness to push back when expectations threaten quality of delivery. Proven leadership of global and diverse teams in complex and high-pressure environments. Demonstrated ability to lead and optimize output in a cross-functional and interdependent team. Understanding and experience with the use of technology (especially AI tools) in performance optimization and creative production. Deep understanding of digital marketing trends and technologies. A keen eye for process efficiency and output improvement. Ability to communicate confidently, directly, and empathetically.", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Excellent, full coverage medical, dental, and vision insurance with employer-paid HRA. Generous PTO and 15 company-wide holidays. 401k with company contribution. Paid parental leave. Work-life balance with an emphasis on personal well-being. Career growth in a disruptor space & entrepreneurial opportunities within the Media.Monks network. A globally diverse & inclusive culture with employee resource groups such as S4 Melanin, Pride.Monks, Cultura.Monks, and more! Authentic commitment to DEI efforts and sustainable growth.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3997692887"}