{"jobTitle": "Planner Lead", "company": {"name": "Aitech Systems ", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Project Management and Information Technology", "industry": "Defense and Space Manufacturing", "description": "Responsible for leading the team of Planners in executing the smooth flow of product through production and subcontractors. Manage customer orders from engineering to the customer, and are a major support to production and procurement to remove barriers to satisfy complex customer requirements. Responsible for shipments, material and order status to support on-time delivery goals on most demand and critical projects. Manage production progress and shipping status of key customer orders. Provide support in creating documentation packages, monitoring shortages, maintaining floor stock, providing order status updates, data entry, and coordinating the flow of work orders.<br/><br/><ul><li>Guidance for assigned programs by maintaining status of orders, units, and material for assigned programs. Responsible for planned completion dates, bringing any schedule risks to program team. Committed to the smooth flow of product through production and subcontractors. Ensures accurate data for shipping, configuration, and reasons for late orders.</li><li>Lead and guide team of Planners in resolving execution roadblocks.</li><li>Management of MRP &amp; accurate material demand by reviewing new orders &amp; working with procurement for long lead items.</li><li>Manages forecasts and recommends production location for production and COTS products to achieve the best cost and delivery solutions for the global company. </li><li>Responsible for MRP for accurate demand, including open SO demand to provide accurate requirements for purchasing. Liaison between engineering and procurement and between program management and procurement to improve the accuracy and flow of demand to procurement, while working for alternative options, including global for shortages and other barriers to costly and timely production.</li><li>Coordinate and support sales orders for accurate information in the Sales Order including accuracy of part numbers, ship to address &amp; shipping account numbers.</li><li>Maintain and drive schedules for assigned programs and with thorough knowledge status of all sub-assemblies and assemblies in WIP in regards to shortages and expected completion dates. Coordinates with subcontractors for timely management and delivery of material, build challenges, and receipt of subassemblies.</li><li>Focal point for production, test, and program management to build accurate schedules that achieve company commitments and goals. Coordinate &amp; maintain schedule progress with program management and junior planner to orchestrate required activities, outside processing, subcontracting, and risks to programs.</li><li>Focal point for kitting activities Schedules kitting activities as part of program/order schedules to ensure commitment to on-time delivery raising any risks to the team. Reviews component availability &amp; coordinates with procurement to identify challenges and solutions. Reviews material availability prior to kit release and coordinates kit releases with Junior Planner, kitting, and production.</li><li>Focal point for review of planning processes for continual improvements to floor and MRP system practices to strengthen overall efficiency of the planning organization with weekly status reports to the Group Manager.</li><li>Maintains cost accuracy for assigned programs through the coordination of orderly and timely transactions to ensure proper costs in work orders. Verifies and reviews kit returns to ensure proper demand and costs in work orders when orders are received to stock. Verify bill of material costs in work orders via the WIP Report to ensure accurate costs in work in process for accurate recording of costs and WIP value. Accurate and timely data input that supports accurate costs and account numbers for components, including transactions required for creating shipment documentation.</li><li>Focal point for Engineering Support &amp; Coordination by working with program management and engineering to obtain part numbers and bills of material. Participates in meetings and follows design updates for new programs. Provide support in creating documentation packages to junior planner. Responsible for correct update of components due to ECNs on work order bills of material.</li><li>Provide SOW with specifications to request RFQ for subcontractors for board assemblies with a risk assessment to ensure suppliers with best costs, quality, lead-time and program fit are chosen. </li><li>Coordinate and maintain accurate inventory while working with junior planner and kitting for programs to facilitate ultimate inventory levels, waste reduction, and ability to satisfy forecasts while balancing output with sales.</li><li>Oversee the lifecycle of materials from the moment they’re ordered to the moment they leave the factory as finished products, including shipment of material, subcontractors and shipment to the customer. <br/><br/></li></ul>Requirements:<br/><br/><strong>Education/Experience:<br/><br/></strong><ul><li>4 year College Degree (BS or BA) preferred</li><li>15+ Years of Planner Experience</li><li>10+ years in aerospace leadership<br/><br/></li></ul><strong>Minimum Requirements:<br/><br/></strong><ul><li>In depth knowledge of MRP and ERP Systems. </li><li>Candidates must have a sense of urgency, excellent organizational skills, and attention to detail. </li><li>Team leadership experience</li><li>Knowledge of production processes.</li><li>Must be a US Citizen or authorized to work in the US</li></ul>", "postedDate": "1 week ago", "skills": ["MRP", "ERP", "Production", "Procurement", "Aerospace", "Team Leadership", "Schedule Management", "Inventory Management", "Data Entry", "Communication", "Problem Solving", "Organization", "Attention to Detail"], "url": "https://www.linkedin.com/jobs/view/3997060671"}