{"jobTitle": "Demand Supply Planner", "company": {"name": "SEB Professional", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "67,000 - 87,000", "currency": "USD"}, "jobFunction": "Supply Chain", "industry": "Industrial Machinery Manufacturing and Food and Beverage Services", "description": "<strong>Who are we?</strong>\n<p>Our passion for coffee makes SEB Professional North America a growing company!</p>\n<p><br/></p>\n<p>We are in the professional coffee machine business managing three leading global brands: Schaerer, WMF, and Wilbur Curtis.</p>\n<p><br/></p>\n<p>You can find our coffee machines in convenience stores, hotels, and restaurants worldwide. Chances are you have enjoyed a cup of coffee brewed by one of our products during your morning coffee run at McDonald’s, Dunkin Donuts, Starbucks, or Tim Hortons.</p>\n<p><br/></p>\n<p>SEB Professional is a subsidiary of Groupe SEB, a large French consortium and the world’s largest manufacturer of cookware in more than 150 countries, with 33,000 employees and over €8,1 b in sales annually. Notable brand names associated are Tefal, T-Fal, Krups, Lagostina, Rowenta, Moulinex, SUPOR, Arno, Emsa, All-Clad. Our Company operates in the Professional Coffee Machine division.</p>\n<p><br/></p>\n<p><strong>Salary Range:</strong> $67,000 - $87,000</p>\n<p><br/></p>\n<p><strong>What you’ll do? </strong></p>\n<p>The Demand Supply Planner is in charge of leading and developing the supply and demand planning for SEB Professional North America to ensure optimal S&amp;OP process, superior demand forecast, ideal stock levels &amp; high customer service level while minimizing SLOBS, cost and complexity. The Supply &amp; Demand Planner actively analyzes and communicates KPIs to find opportunities for continuous improvement including cross functional projects.</p>\n<p><br/></p>\n<p><strong>Key Responsibilities: </strong></p>\n<ul>\n<li>Work with Central and local Supply Chain functions, Sales, Service &amp; Marketing to ensure optimal S&amp;OP process and 12 months rolling Forecast.</li>\n<li>Participate and contribute to preparation of monthly Demand review/ S&amp;OP meetings.</li>\n<li>Assist the Demand &amp; Supply Manager to early identification of possible gaps in the business plan to proactively define and implement countermeasures ensuring budget targets achievement in terms of net sales, inventories and customer service level.</li>\n<li>Ensure stock availability and provide reliable ETA to share with internal stakeholders (customer service, sales, service etc.)</li>\n<li>Creating and following up on purchase orders. Follow up and tracking of inbound shipments.</li>\n<li>Master data management duties as assigned.</li>\n<li>Manage escalations for example of stock availability with suppliers/factories and questions about Allocations/Reservations of stock.</li>\n<li>Work together with the Demand Manager to find appropriate actions to reach KPIs and meet objectives including proposals for continuous improvement.</li>\n<li>Ensure the right level of stock availability by managing the safety stock, lead-times, customer/supplier collaboration etc. Manage SLOBS (obsolete &amp; slow movers) by developing corresponding action plan</li>\n<li>In cooperation with product development and central teams, manage the product life cycle.</li>\n</ul>\n<p><br/></p>\n<p><strong>What you need to be successful in this role: </strong></p>\n<ul>\n<li>Bachelors in logistics or supply chain preferred but not required. Experience can be substituted for a degree.</li>\n<li>A minimum of 2 years’ experience in a planning role. Strong sense of urgency and customer centricity.</li>\n<li>Strategic long-term vision in combination with possibility to take calculated risks</li>\n<li>Excellent communication and relationship building skills.</li>\n<li>Commercial &amp; Business awareness.</li>\n<li>Team player with a LEAN mindset seeing opportunities rather than problems.</li>\n<li>MS Office (Excel and PowerPoint) – advanced level.</li>\n<li>SAP experience.</li>\n</ul>\n<p><br/></p>\n<p><strong>Physical Requirements: </strong></p>\n<ul>\n<li>Standing, Walking</li>\n<li>Manual dexterity</li>\n<li>Ability to Lift up to 50lbs occasionally</li>\n</ul>\n<p><br/></p>\n<p><strong>Overview:</strong></p>\n<ul>\n<li>Type of employment: full time – Non-exempt</li>\n<li>Workplace type: Hybrid, Irvine, CA - Irvine, CA - In office: Monday, Wednesday &amp; Thursday. Work From Home: Tuesday &amp; Friday.</li>\n</ul>\n<p><br/></p>\n<p><strong>Why SEB Professional North America?</strong></p>\n<p>Whether working in one of our offices, or flexing between the two, we offer a number of benefits and perks to support you and your family. Please ask your recruiter for additional details regarding our benefits.</p>\n<p><br/></p>\n<ul>\n<li>Medical, Dental and Vision insurance – Generous Employer Contribution</li>\n<li>Competitive 401(K) program w/ 9% employer contribution</li>\n<li>On-site Gym</li>\n<li>Life insurance</li>\n<li>12 Paid Holidays</li>\n<li>Other voluntary benefits and discounts programs</li>\n</ul>\n<p><br/></p>\n<p><strong>Equal Employment Opportunity (EEO)</strong></p>\n<p>SEB Professional is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability. For more information, please see OFCCP Equal Employment.</p><p></p>", "responsibilities": "The Demand Supply Planner is in charge of leading and developing the supply and demand planning for SEB Professional North America to ensure optimal S&amp;OP process, superior demand forecast, ideal stock levels &amp; high customer service level while minimizing SLOBS, cost and complexity. The Supply &amp; Demand Planner actively analyzes and communicates KPIs to find opportunities for continuous improvement including cross functional projects.", "qualifications": {"required": "A minimum of 2 years’ experience in a planning role. Strong sense of urgency and customer centricity.", "preferred": "Bachelors in logistics or supply chain preferred but not required. Experience can be substituted for a degree."}, "skills": ["Supply Chain", "Demand Planning", "S&OP", "Inventory Management", "Customer Service", "Communication", "Relationship Building", "Business Awareness", "LEAN", "MS Office", "Excel", "PowerPoint", "SAP"], "postedDate": "1 week ago", "benefits": "Medical, Dental and Vision insurance – Generous Employer Contribution, Competitive 401(K) program w/ 9% employer contribution, On-site Gym, Life insurance, 12 Paid Holidays, Other voluntary benefits and discounts programs", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3997930916"}