{"jobTitle": "Warehouse Associate - Oxnard Outlet", "company": {"name": "MillerKnoll", "industry": "Retail"}, "location": "Oxnard, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "16.45/hr - 20.33/hr", "currency": "USD"}, "jobFunction": "Purchasing", "industry": "Retail", "description": "Why join us?<br/><br/>At Design Within Reach, home comes first. We believe in creating and sourcing pieces that move with you and are meant to be enjoyed over a lifetime - from home to home, generation to generation. For us, that means exceptionally crafted, built-to-last, and beautifully designed furnishings.<br/><br/>Our purpose is to design for the good of humankind. It's the ideal we strive toward each day in everything we do. Being a part of Design Within Reach means being a part of something larger than your work team, or even your brand. We are redefining modern for the 21st century. And our success allows Design Within Reach to support causes that align with our values, so we can build a more sustainable, equitable, and beautiful future for everyone.<br/><br/>Design Within Reach is looking for Warehouse Associates to join our team! To uphold our high shipping standards, you'll work in a fast-paced environment as you receive, pack and ship DWR merchandise.<br/><br/><strong>What You'll Do<br/><br/></strong>You'll have opportunities to improve processes, foster teamwork and build relationships every day as you:<br/><br/><ul><li>Unload or pack freight.</li><li>Prepare receipts to help separate freight by SKU #.</li><li>Stack and palletize product to utilize storage.</li><li>Label each carton with barcode labels in a uniform manner.</li><li>Count and verify quantities to a Packing list.</li><li>Maintain a clean and safe work environment.<br/><br/></li></ul>Does this sound like you?<br/><br/><ul><li>This might be you if you have the following experience, skills and abilities:</li><li>The ability to thrive in a very fast-paced environment.</li><li>The ability to fulfill the responsibilities of a physically demanding position - constant lifting.</li><li>The ability to consistently lift up to 50 - 75lbs.</li><li>The ability to team-lift up to 250 lbs occasionally</li><li>Strong communication skills.</li><li>Flexible availability for overtime and weekend work.<br/><br/></li></ul>Who We Hire?<br/><br/>Simply put, we hire everyone. Design Within Reach is comprised of people of all abilities, gender identities and expressions, ages, ethnicities, sexual orientations, veterans from every branch of military service, and more. Here, you can bring your whole self to work. We're committed to equal opportunity employment, including veterans and people with disabilities.<br/><br/>A starting compensation range for this role is $16.45 - $20.33. Relevant salary considerations will include candidate qualifications and experience, other business/organizational needs and market factors . You may also be eligible to receive a geographic premium, annual discretionary incentive and equity awards which are subject to the rules governing these programs. The company offers a full spectrum of benefits including Medical, Prescription Drug, Dental, Vision, Health Savings Account, Dependent Day Care Savings Account, Life Insurance, Disability and Other Insurance Plans, Paid Time Off (including Vacation and Parental Leave), Holidays, 401(k), and Short/Long Term Disability, in addition to other special perks reserved for our associates.<br/><br/>This organization participates in E-Verify Employment Eligibility Verification. In general, MillerKnoll positions are closed within 45 days and are open for applications for a minimum of 5 days. We encourage our prospective candidates to submit their application(s) expediently so as not to miss out on our opportunities. We frequently post new opportunities and encourage prospective candidates to check back often for new postings.<br/><br/>MillerKnoll complies with applicable disability laws and makes reasonable accommodations for applicants and employees with disabilities. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please contact MillerKnoll Talent Acquisition at careers_help@millerknoll.com.", "responsibilities": "You'll have opportunities to improve processes, foster teamwork and build relationships every day as you:<br/><br/><ul><li>Unload or pack freight.</li><li>Prepare receipts to help separate freight by SKU #.</li><li>Stack and palletize product to utilize storage.</li><li>Label each carton with barcode labels in a uniform manner.</li><li>Count and verify quantities to a Packing list.</li><li>Maintain a clean and safe work environment.<br/><br/></li></ul>", "qualifications": {"required": "This might be you if you have the following experience, skills and abilities:\n<ul><li>The ability to thrive in a very fast-paced environment.</li><li>The ability to fulfill the responsibilities of a physically demanding position - constant lifting.</li><li>The ability to consistently lift up to 50 - 75lbs.</li><li>The ability to team-lift up to 250 lbs occasionally</li><li>Strong communication skills.</li><li>Flexible availability for overtime and weekend work.<br/><br/></li></ul>"}, "skills": ["communication", "teamwork", "lifting", "packing", "freight", "labeling", "storage", "safety"], "postedDate": "1 week ago", "benefits": "The company offers a full spectrum of benefits including Medical, Prescription Drug, Dental, Vision, Health Savings Account, Dependent Day Care Savings Account, Life Insurance, Disability and Other Insurance Plans, Paid Time Off (including Vacation and Parental Leave), Holidays, 401(k), and Short/Long Term Disability, in addition to other special perks reserved for our associates.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997373658"}