{"jobTitle": "Program Coordinator", "company": {"name": "EnCorps - STEM Teachers", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Associate", "jobFunction": "Education and Training", "industry": "Non-profit Organizations, Education, and Primary and Secondary Education", "description": "EnCorps advocates for STEM educational equity. Anchored in our belief that traditionally under-represented students belong in STEM, we prepare STEM role models to educate and inspire students who lack equitable access to a high-quality science, technology, engineering, and math education.\n\nEnCorps connects highly effective STEM educators with public school students to counter the systemic injustice preventing children in under-resourced communities from accessing a high-quality STEM education. The EnCorps STEMx Tutors Program matches middle school students, currently under-performing in math, with volunteer STEM professionals, subject-matter experts and STEM college students to increase math skills and confidence prior to students entering high school.\n\n<br/>\n\n**Position Summary: **\n\nReporting to and in partnership with the STEMx Tutor Program Manager, the STEMx Program Coordinator (referred to as Program Coordinator moving forward in this document) will provide essential support to EnCorps’ mission to support and mentor the best and brightest science, technology, engineering, and math (STEM) professionals as an innovative, long-term solution to the shortage of high-quality, impactful educators for underrepresented students in high-needs communities.\n\nEnduring STEM achievement, access, and literacy gaps disproportionately limit low-income, under-resourced, and minority student opportunities. STEM professionals, when thoroughly prepared, are uniquely positioned to meaningfully utilize their talent and real-world expertise as EnCorps STEM Teachers to deliver an authentic, rigorous, and relevant STEM education to students who need it most.\n\nThe Program Coordinator is a part-time (20 hours/week) position **located in Los Angeles**. The Program Coordinator will serve as a point of contact for STEMx tutors as they volunteer to tutor students with the EnCorps program. The Program Coordinator will assist in the onboarding and management of STEMx tutors’ experiences, as well as provide coaching and mentoring as they tutor students at a partner school.\n\nThe STEMx Program Manager will support the program coordinator at every step and be in frequent contact. The Program Coordinator will benefit from having tools and protocols developed in-house that shape and guide all aspects of a STEMx tutor’s experience and will have the opportunity to provide feedback to improve these tools and protocols.\n\n<br/>\n\n**Position Start Date: **October 1, 2024\n\n**Location: **Hybrid remote <u>(</u>**<u>must reside in Los Angeles</u>**<u>)</u>\n\n<br/>\n\n**Benefits of Working at EnCorps: **\n\nBe part of a hard-working and entrepreneurial culture with fun and passionate people where your ideas and opinions matter!\n\n● Work from home and create your own flexible PDT daytime hours;\n\n● Mileage reimbursement;\n\n● Room for position to grow into full-time\n\n● $27 hourly/20 hours a week, depending on experience;\n\n● 1.5 weeks and US national holidays paid time off;\n\n<br/>\n\n**Essential Functions (specific responsibilities will include, but are not limited to): **\n\n● Coordinate, organize, and oversee the daily operations of the tutoring program;\n\n● Meet weekly with the STEMx Program Manager;\n\n● Monitor the work of tutors by reviewing tutor feedback weekly and provide feedback on tutoring/teaching methods and techniques;\n\n● Assist in the screening and onboarding process for potential tutors in the STEMx program;\n\n● Work in collaboration with the school site coordinator of each partner school to successfully match students to EnCorps STEMx tutors;\n\n● Serve as liaison between tutors and school site coordinators in the training of tutors on the school’s math curriculum and online learning platform;\n\n● Work with the school site coordinator and STEMx Program Manager in conducting periodic reviews of the tutoring program and professional development provided;\n\n● With the help of the school site coordinator, investigate any concerns expressed by either tutors or students and resolve or refer the matter to EnCorps’ STEMx Program Manager if warranted;\n\n● <u>Periodically visit school sites and tutoring programs in the Los Angeles area;</u>\n\n● Meet with the school site coordinator at least twice monthly to solicit input for continual improvement of the tutoring program and services provided;\n\n● Review and respond to all requests from EnCorps tutors for assistance;\n\n● Update and maintain tutoring database on a regular basis;\n\n● Collaborate with STEMx Program Manager to host monthly tutor events, trainings, and workshops;\n\n● Assess, gather evidence, analyze data, and use reports to improve the effectiveness of the tutoring program;\n\n● Complete other duties as assigned by the STEMx Program Manager.\n\n<br/>\n\n**Accountabilities: **\n\n● Collaborate within and across departments to create and support a culture of continuous improvement, collaboration, teamwork, and empowerment;\n\n● Provide excellent customer service to internal and external constituents;\n\n● Ensure timely communication with tutors, staff, and partners;\n\n● Maintain current knowledge of all EnCorps STEMx tutor programming;\n\n● Represent a positive and professional image of EnCorps;\n\n● Understand and comply with the policies and practices outlined in EnCorps Staff Handbook.\n\n<br/>\n\n**Qualifications: **\n\nWe are seeking candidates who believe deeply in our organization's mission, who thrive in an entrepreneurial and dynamic environment, and who have a record of successfully coaching teachers, interns, or student teachers.\n\n**Note that <u>middle or high school teaching experience is necessary for this role,</u> ** and experience as an instructional coach, school administrator, field supervisor, or teacher leader is preferred. Like all good classroom teachers, successful candidates will also demonstrate:\n\n**● At least one year of middle or high school teaching experience as a teacher of record; ** \n\n● Knowledge of the local education community;\n\n● Experience in program development and implementation (e.g. leading workshops, trainings, events, etc.);\n\n● Comfort with virtual communication, chat, and video conference, along with Google Suite of\nproducts;\n\n● Some experience with Salesforce preferred\n\n● Experience in working with underrepresented and underserved students\n\n● Excellent communication and writing skills;\n\n● Impeccable organization and attention to detail;\n\n● Outstanding interpersonal, relationship-building, and teamwork skills;\n\n● The ability to learn quickly, take initiative, work in a fast-paced environment, and multi-task effectively;\n\n● Ability to consistently display a high level of professionalism in all interactions;\n\n● Ability to work autonomously once trained;\n\n● Willingness to engage in some regional travel (to attend staff meetings and visit school sites).\n\n<br/>\n\n**Compensation and Benefits: **\n\nBe part of a hard-working and entrepreneurial culture with enthusiastic, fun, and passionate people.\n\n● Work from home\n\n● Create your own flexible schedule\n\n● Room for growth within the organization\n\n● Your ideas and opinions matter\n\n<br/>\n\n**For Posting Purposes: **\n\nTO APPLY: Please submit a resume and thoughtful cover letter, outlining how your skills and experience meet the qualifications of the position and stating how you heard about this opportunity, by **September 20, 2024 at <u>hr@encorps.org</u>.** We will not consider applications without a cover letter tailored to this position, which can be addressed to Human Resources.\n\n<br/>\n\nEnCorps is an equal-opportunity employer. All applicants will be considered for employment without considering race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.\n\n<br/>\n\n<br/>\n\n**EnCorps is an EOE dedicated to workforce diversity. **\n\n**For more information about EnCorps, visit us at www.encorps.org**\n\n<br/>", "responsibilities": "● Coordinate, organize, and oversee the daily operations of the tutoring program;\n● Meet weekly with the STEMx Program Manager;\n● Monitor the work of tutors by reviewing tutor feedback weekly and provide feedback on tutoring/teaching methods and techniques;\n● Assist in the screening and onboarding process for potential tutors in the STEMx program;\n● Work in collaboration with the school site coordinator of each partner school to successfully match students to EnCorps STEMx tutors;\n● Serve as liaison between tutors and school site coordinators in the training of tutors on the school’s math curriculum and online learning platform;\n● Work with the school site coordinator and STEMx Program Manager in conducting periodic reviews of the tutoring program and professional development provided;\n● With the help of the school site coordinator, investigate any concerns expressed by either tutors or students and resolve or refer the matter to EnCorps’ STEMx Program Manager if warranted;\n● <u>Periodically visit school sites and tutoring programs in the Los Angeles area;</u>\n● Meet with the school site coordinator at least twice monthly to solicit input for continual improvement of the tutoring program and services provided;\n● Review and respond to all requests from EnCorps tutors for assistance;\n● Update and maintain tutoring database on a regular basis;\n● Collaborate with STEMx Program Manager to host monthly tutor events, trainings, and workshops;\n● Assess, gather evidence, analyze data, and use reports to improve the effectiveness of the tutoring program;\n● Complete other duties as assigned by the STEMx Program Manager.", "qualifications": {"required": "● At least one year of middle or high school teaching experience as a teacher of record; ", "preferred": "● Knowledge of the local education community;\n● Experience in program development and implementation (e.g. leading workshops, trainings, events, etc.);\n● Comfort with virtual communication, chat, and video conference, along with Google Suite of\nproducts;\n● Some experience with Salesforce preferred\n● Experience in working with underrepresented and underserved students"}, "skills": ["Salesforce", "Google Suite", "Program Development", "Workshop Facilitation", "Training Delivery", "Event Management", "Tutoring", "Teaching", "Instructional Coaching", "School Administration", "Field Supervision", "Teacher Leadership", "Communication", "Writing", "Organization", "Attention to Detail", "Interpersonal Skills", "Relationship Building", "Teamwork", "Learning", "Initiative", "Multitasking", "Professionalism", "Autonomy", "Regional Travel"], "postedDate": "1 week ago", "benefits": "● Work from home\n● Create your own flexible schedule\n● Room for growth within the organization\n● Your ideas and opinions matter", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3997568623"}