{"jobTitle": "Buyer", "company": {"name": "Johnson Health Tech North America", "industry": "Wholesale", "size": "Not specified", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000-$90,000", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Wholesale", "description": "Position Overview: Under the direction of the Vice President of Fujiiryoki, the Buyer is someone who will be responsible for supporting the development of regional demand plans and working closely with internal and external supplier partners to fulfill and execute those plans, with the objective of optimizing inventory levels for both finished goods and parts in accordance with company policies and procedures. Duties include demand planning, purchasing, material master maintenance, and keeping the sales team informed regarding inventory availability and the timing of inbound shipments. This is a non-supervisory position.", "responsibilities": "Demand Planning (20%): Continually monitor inventory levels, sales trends, and dealer behavior to create accurate forecasts for each product, vendor, and customer. Purchasing (20%): Convert demand plan to regular purchase orders to our internal and 3rd party vendors to ensure products are produced on time and delivered to customers or our warehouses per planned dates. Track shipped orders and report estimated arrival dates to Accounting, Logistics, Warehouse, and Sales Teams. Analyze and revise future shipment plans as needed, includes expediting, delaying, or cancelling orders. Material Master Maintenance (20%): Create and maintain materials and purchase orders in SAP. Identify and correct data integrity issues through sustainable business practices. Inventory Management (20%): Analyze and revise future shipment plans as needed: includes expediting, delaying, or cancelling orders. Make recommendations and contribute to efforts to reduce aged inventory. Work with the sales team to reduce excess inventory, focusing on lowering inventory and increasing fulfillment. Set up new products and coordinate with internal customers on phase in/phase out planning of all items. Maintain strong attention to detail to ensure integrity of product attributes in master data. Communicate regularly with internal teams regarding inventory availability. Reporting (10%): Responsible for updating existing reports and developing new ones. Responsible for tracking departmental performance metrics. Work closely with Accounting, Logistics, Warehouse, and Sales teams on projects related to inventory management. Complete and maintain reports and metrics for analysis and distribution to staff and management. Working with the sales team create and maintain a master sales forecasting and buying sheet. Update monthly to reflect updated sales trends and alert vendors of changes to purchasing needs. Other (10%): Actively participate in cross-functional meetings when required. Work closely with all internal and external suppliers and vendors. Promote a positive team atmosphere with co-workers. Maintain SOPs (Standard Operating Procedure) for all duties and tasks.", "qualifications": {"required": "BS/BA, or equivalent experience; Operations Management or Supply Chain Management emphasis a plus", "preferred": "4+ years’ experience in B2B operations, with preference to supply chain management. SAP experience required. Advanced Microsoft Excel skills (knowledge of pivot tables, v-lookup, auto filers, etc.) required. Well versed with Microsoft Office Suite. Aptitude for self-management, taking initiative, and problem solving. Ability to communicate well both verbally and written with all levels of personnel and management. Strong multi-tasking, prioritization, and organization skills required. Ability to analyze and organize large amounts of data. Minimal domestic, local and international travel may be required (HQ, warehouse, and vendor visits)."}, "skills": ["Demand Planning", "Purchasing", "Material Master Maintenance", "Inventory Management", "Reporting", "SAP", "Microsoft Excel", "Microsoft Office Suite"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "We offer an excellent compensation package and team-oriented work environment with growth opportunities. Some of our outstanding benefits include: Health & Dental Insurance, Company paid Life Insurance, 401(k), Paid Time Off benefits, Product discounts, Wellness programs.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3997240612"}