{"jobTitle": "Video Production Assistant", "company": {"name": "Salem Media Group", "industry": "Broadcast Media Production and Distribution", "size": "Not specified", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Broadcast Media Production and Distribution", "description": "Salem Media Group’s fast growing Salem News Channel is seeking a Video Production Assistant to facilitate enhancing our lineup of shows. SNC features America’s leading conservative commentators. Salem Media Group is one of America’s leading radio broadcasters, Internet content providers, and magazine and book publishers. The Salem News Channel launched in 2021 with the goal of achieving a leadership position in the expanding CTV/OTT/streaming landscape.", "responsibilities": "The Salem News Channel Video Production Assistant is responsible for assisting in the production of live and pre-recorded show content for Salem News Channel. This involves filling control room roles as needed including switching video of live shows via a Ross Graphite switcher, finding and playing back video clips, setting up remote guests, framing camera shots, and inserting/controlling show graphics. This position will also be responsible for assisting in the studio whenever necessary, including micing guests, moving cameras, and adjusting studio lights. Other duties may be assigned by the Studio Manager or Director of Network Operations.", "qualifications": {"required": "Not specified", "preferred": "Experience switching video and mixing audio for live shows, Exposure to a video control room environment, Familiar with operating simple robotic camera systems, Ability to start and end live streams, and troubleshoot if necessary, Has a creative eye for framing shots and contributing to a show creatively, Works well with a team and adapting to established work environments and systems, Experience editing video using Adobe Premiere pro, Comfortable working in Adobe After Effects and Photoshop for on screen graphic and thumbnail creation, Experience archiving media and posting to servers for playback, Experience harvesting and sourcing video and audio b-roll, Willing to learn new skills on the job, Able to take direction and instruction well."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Competitive pay structure based on experience, Health, dental, vision and life insurance, 401k retirement plan, Paid holidays and vacation time", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3997387945"}