{"jobTitle": "Event Sales & Services Coordinator", "company": {"name": "Accor", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Hospitality", "description": "Company Description<br/><br/>Why work for Accor?<br/><br/>We are far more than a worldwide leader. We welcome you as you are and you can find a job and brand that matches your personality. We support you to grow and learn every day, making sure that work brings purpose to your life, so that during your journey with us, you can continue to explore Accor’s limitless possibilities.<br/><br/>By joining Accor, every chapter of your story is yours to write and together we can imagine tomorrow's hospitality. Discover the life that awaits you at Accor, visit https://careers.accor.com/<br/><br/>Do what you love, care for the world, dare to challenge the status quo! #BELIMITLESS\"<br/><br/>Job Description<br/><br/>Event Sales &amp; Services Coordinator<br/><br/>You are a multi-tasker and are able to work independently as well as part of a team, performing a wide range of sales and administrative duties to support the event sales and conference services department and all levels of our luxury hotel team. You communicate well with all contacts, anticipate and resolve issues, and update leaders on your various projects.<br/><br/>What Is In It For You<br/><br/><ul><li>Discounted hotel rooms and food &amp; beverage rates to employees at our sister properties around the globe.</li><li>We provide learning programs through our Academies to promote growth and development so that you can perform at your full potential</li><li>Opportunity to develop your talent and grow within your property and across the world!</li><li>Ability to make a difference through our Corporate Social Responsibility activities, like Planet 21 and WATCH</li><li>Hourly Rate: $31.97<br/><br/></li></ul>What You Will Be Doing<br/><br/><ul><li>Work with the event sales &amp; conference services team and other team. members to ensure accurate data reporting internally and to the client.</li><li>Distribute all documents correctly and on a timely basis to the client and necessary internal departments.</li><li>Following up leads and inquiries to convert them into bookings.</li><li>Coordinating with vendors, suppliers and internal departments to fulfill client’s requests.</li><li>Collaborate with other team members to ensure seamless coordination between sales and operations.<br/><br/></li></ul>Qualifications<br/><br/>Your experience and skills include:<br/><br/><ul><li>Proven success in a similar role and environment. </li><li>Ability to effectively multitask in a dynamic and fast-paced environment.</li><li>Positive attitude and excellent communication skills.</li><li>Strong customer service and rapport-building skills.</li><li>Polished personal presentation with a warm, confident, and hospitable personality.<br/><br/></li></ul>Additional Information<br/><br/>Your Team And Working Environment<br/><br/>What was true in 1966 remains true to this day: The Century Plaza Hotel is part of a visionary development intent on doing what others could only imagine. Previously deemed the “Western White House,” (as the only venue outside the White House to host state dinners), Century Plaza’s place in history remains unshakeable. A modernized take on luxury and elevated guest experience from product to people enlivens the real wow factor.<br/><br/>This experience begins with a new kind of workplace, one where the energy is contagious, the stories are invigorating, and the challenges present inspiring opportunities to make your mark. We provide an environment of trust, respect, and integrity. A home away from home. Where diversity and inclusion are celebrated. Privacy and personal information are protected. Through Accor’s Employee Value Proposition, we ensure fair treatment and a workplace free from discrimination &amp; harassment.<br/><br/>Visa Requirements: Must provide proof of eligibility to be employed in the United States of America.<br/><br/>Our Commitment To Diversity &amp; Inclusion<br/><br/>We are an inclusive company and our ambition is to attract, recruit and promote diverse talent. We commit to a future where diverse identities are celebrated, and equitable and inclusive practices are woven into the fabric of everything we do as an organization.<br/><br/>Fairmont Century Plaza is an Equal Opportunity Employer EEO M/F/V/D<br/><br/>", "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997830878"}