{"jobTitle": "Madrid Lifestyle ESL Program Coordinator", "company": {"name": "Canterbury English", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Education and Training", "industry": "Higher Education", "description": "Exciting Opportunities with Canterbury English Teaching Academy in Madrid<br/><br/>Are you considering taking a break after college, exploring new career paths, or seeking a vibrant international experience in Spain? Canterbury English Teaching Academy provides one-year Madrid Lifestyle &amp; TEFL Programs tailored for individuals from various backgrounds and aspirations.<br/><br/>Are You the Right Fit?<br/><br/><ul><li> Recent College Graduates looking to gain valuable experience before further studies or corporate roles.</li><li> Those tired of the corporate world and eager to embark on a new journey.</li><li> Existing English teachers interested in enhancing their skills with or without TEFL or CELTA certification.</li><li> Individuals dreaming of becoming ESL teachers from a young age.</li><li> Retired or semi-retired individuals seeking a fresh challenge in life.</li><li> Economic independent individuals yearning to immerse themselves in the Spanish lifestyle.<br/><br/></li></ul>Why Choose Madrid?<br/><br/><ul><li> Madrid offers a dynamic setting with a reasonable cost of living and modern transportation facilities.</li><li> Experience a melting pot of cultures and people along with a vibrant nightlife scene.</li><li> Immerse yourself in rich history, tradition, and stunning architecture while residing in one of the safest capitals globally.<br/><br/></li></ul>Discover the Canterbury English Advantage<br/><br/>Since 1991, Canterbury English has empowered over 7,500 English speakers to teach in Spain while relishing the excitement of living abroad. Our commitment is to inspire individuals to create a fulfilling life beyond just earning a living.<br/><br/><strong>Our Programs Offer<br/><br/></strong><ul><li> One-year Student Visa for non-EU members enabling work opportunities for up to 30 hours per week.</li><li> Instituto Cervantes accredited Spanish language programs.</li><li> Affordable tuition fees for both Madrid Lifestyle and TEFL Programs.</li><li> Comprehensive support including job placements, social activities, and an instant community of expats.<br/><br/></li></ul>Unlock Your Path to Success<br/><br/><ul><li> Engage in a 120-hour TEFL course to kickstart your teaching journey.</li><li> Enjoy a ten-month Spanish program to meet student visa requirements.</li><li> Access job placements with Canterbury English and partner academies.</li><li> Embark on cultural and social adventures through weekend activities.<br/><br/></li></ul>Join Us Today<br/><br/>Seize the opportunity to live and work in Spain, ranked among the top cities globally for an exceptional quality of life. Become a part of the Canterbury English ex-pat family and make your Spanish dreams a reality!<br/><br/>Employment Type: Full-Time", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3997162306"}