{"jobTitle": "Warehouse Shipping and Receiving", "company": {"name": "MSI", "industry": "Building Materials", "size": "51-200 employees", "location": "Orange, CA"}, "location": "Orange, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$18 - $21 per hour", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Building Materials", "description": "The shipping and receiving is responsible for unloading inbound containers, conducting quality control on received products, and organizing them in the warehouse. Additionally, responsibilities include reviewing shipping orders, Picking product for orders, ensuring accuracy in shipping documents, operating equipment safely, and maintaining a clean work environment.", "responsibilities": "Unload inbound containers, perform quality control on incoming products, and organize products in the warehouse. Review shipping orders to determine necessary quantity and transportation requirements. Ensure accuracy of all shipping documents and maintain shipping-related data. Collect and organize documentation for outbound freight. Pick product and stage for outbound loading. Safely and efficiently operate equipment such as forklifts and pallet jacks. Maintain a clean, neat, and organized work environment. Keep an equipment checklist and perform preventative maintenance of equipment. Perform additional duties as required and or requested.", "qualifications": {"required": "High School Education or equivalent required. 1-2 years of Warehouse experience. One (1) year of experience operating a Forklift. Ability to use a computer or tablet a plus. Good communication and organizational skills. Ability to follow instructions and work under pressure. Ability to lift up to 50 lbs.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "MSI offers a comprehensive benefits package that includes: Referral, Holiday, and Annual Bonuses, Annual pay increases, Paid Time Off, Medical, Dental, and Vision Insurance, Company-paid Short Term and Long Term disability, Company-paid Life Insurance, Tuition Reimbursement, Traditional and Roth 401(k) plans with company matching contributions, Charitable donation matching programs, Free, company-sponsored 1-on-1 tutoring for children/dependents of MSI employees in grades k-12, including free tutoring for SAT and ACT tests.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997493207"}