{"jobTitle": "Sales Executive", "company": {"name": "Edison Smart®", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00/yr - $119,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Telecommunications", "description": "<strong>Job Title: Senior Sales Executive - Wireless Telecommunications</strong><p><strong>Location: </strong>Irvine, CA </p><p><strong>Base:</strong> $100-119k base + commission</p><p><br/></p><p>Work with a leading telecommunications providers based within the United States who are looking to expand their teams within Irvine.</p><p><br/></p><p><strong>Position Summary:</strong> As a Senior Sales Executive, you will play a pivotal role in expanding our client base by selling our wireless telecommunications services to Fortune 1000 companies in the local area.</p><p><br/></p><p><strong>Key Responsibilities:</strong></p><ul><li>Develop and execute a strategic sales plan to achieve revenue targets and drive business growth in the Irvine, CA market.</li><li>Identify and prospect new business opportunities within Fortune 1000 companies, building and maintaining a robust sales pipeline.</li><li>Establish and nurture strong relationships with key decision-makers and stakeholders within target organizations.</li><li>Conduct comprehensive needs assessments to understand client requirements and present tailored wireless telecommunications solutions that address their business challenges.</li></ul><p><br/></p><p><strong>Qualifications:</strong></p><ul><li>Bachelor's degree in Business, Marketing, Telecommunications, or a related field.</li><li>Minimum of 5 years of experience in sales, with a focus on selling wireless telecommunications services.</li><li>Proven track record of successfully selling into Fortune 1000 companies and achieving or exceeding sales targets.</li><li>In-depth knowledge of the wireless telecommunications industry, including technologies, products, and market trends.</li></ul>", "responsibilities": "Develop and execute a strategic sales plan to achieve revenue targets and drive business growth in the Irvine, CA market. Identify and prospect new business opportunities within Fortune 1000 companies, building and maintaining a robust sales pipeline. Establish and nurture strong relationships with key decision-makers and stakeholders within target organizations. Conduct comprehensive needs assessments to understand client requirements and present tailored wireless telecommunications solutions that address their business challenges.", "qualifications": {"required": "Bachelor's degree in Business, Marketing, Telecommunications, or a related field. Minimum of 5 years of experience in sales, with a focus on selling wireless telecommunications services. Proven track record of successfully selling into Fortune 1000 companies and achieving or exceeding sales targets. In-depth knowledge of the wireless telecommunications industry, including technologies, products, and market trends."}, "skills": [], "postedDate": "4 days ago", "benefits": "401(k), Medical insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997237658"}