{"jobTitle": "Senior Programs Manager - Remote | WFH", "company": {"name": "Get It Recruit - Transportation", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$90,000 - $105,000", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Human Resources Services", "description": "**Job Title: Senior Programs Manager**<br/><br/><ul><li>Location:** Anaheim, CA. Currently operating on a hybrid schedule with three days in-person and two days remote. Occasional travel throughout the Greater Los Angeles Area is required (vehicle and driver's license necessary).</li><li>Term:** Full-time, with occasional evening and weekend work required.</li><li>Position Status:** Exempt</li><li>Pay Range:** $90,000 - $105,000 annually, commensurate with skills and experience.</li><li>Reports to:** Executive Director<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li> 100% employer-paid medical and dental insurance for employees &amp; dependents.</li><li> 3% employer-matched retirement plan.</li><li> 12 vacation days, 10 sick days, and 12 holidays.</li><li> Hybrid work schedule utilized temporarily.<br/><br/></li></ul><strong>Position Summary<br/><br/></strong>We are seeking a dynamic and experienced Senior Programs Manager to join our team. This pivotal role will support the Development Director in managing and addressing technological needs within grants. The successful candidate will provide strategic guidance, fundraising managerial oversight, and effective coordination to advance our mission and promote the civil rights and well-being of the American-Muslim community in the Greater Los Angeles Area.<br/><br/><strong>Responsibilities<br/><br/></strong>**Leadership and Management:**<br/><br/><ul><li> Provide strategic direction and leadership for the Programs team.</li><li> Oversee and guide the work of department directors and managers, ensuring alignment with our mission and goals.</li><li> Develop and implement comprehensive work plans, objectives, and performance metrics for respective programs.</li><li> Support the hiring process, budget development, and fundraising initiatives.</li><li> Represent our organization at conferences, events, meetings, and other gatherings.<br/><br/></li></ul><strong>Programs<br/><br/></strong><ul><li> Direct and support the effective functioning of our programs, ensuring high-quality service delivery and impactful outcomes.</li><li> Provide guidance to the programs team in developing, implementing, and evaluating program activities.</li><li> Support fundraising, resource allocation, and budget management to meet community needs and program deliverables.</li><li> Maintain strategic relationships with government officials, funders, and key community stakeholders.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Bachelor's degree in a relevant field (advanced degree preferred).</li><li> Minimum of 5-7 years of experience in program management, advocacy, or related fields.</li><li> At least five years of experience managing a team in the nonprofit, government, legal, or related field.</li><li> Proven leadership and management skills, with the ability to supervise and mentor a large, diverse team.</li><li> Strong knowledge of civil rights issues, particularly those affecting the American-Muslim community.</li><li> Excellent verbal and written communication skills, including public speaking and media engagement.</li><li> Experience managing digital and print content creation, with some understanding of graphic design, layout, and publishing.</li><li> Familiarity with social media platforms and social media marketing.</li><li> Demonstrated experience in strategic planning, project management, and budget oversight.</li><li> Ability to build and maintain relationships with diverse stakeholders, including community members, partner organizations, and policymakers.</li><li> Passion for social justice, civil liberties, and promoting equality and inclusivity.</li><li> Proficiency in utilizing digital communication tools, social media platforms, and content management systems.</li><li> Knowledge of relevant applications such as SharePoint, Office365, OneDrive, and case management software is preferred.</li><li> Access to reliable transportation to attend meetings and events in various Southern California cities.</li><li>To Apply:** Submit a cover letter, updated resume, and three references.<br/><br/></li></ul>We are an equal-opportunity employer and adhere to all federal, state, and local laws prohibiting employment discrimination.<br/><br/>Employment Type: Full-Time", "responsibilities": "**Leadership and Management:**<br/><br/><ul><li> Provide strategic direction and leadership for the Programs team.</li><li> Oversee and guide the work of department directors and managers, ensuring alignment with our mission and goals.</li><li> Develop and implement comprehensive work plans, objectives, and performance metrics for respective programs.</li><li> Support the hiring process, budget development, and fundraising initiatives.</li><li> Represent our organization at conferences, events, meetings, and other gatherings.<br/><br/></li></ul><strong>Programs<br/><br/></strong><ul><li> Direct and support the effective functioning of our programs, ensuring high-quality service delivery and impactful outcomes.</li><li> Provide guidance to the programs team in developing, implementing, and evaluating program activities.</li><li> Support fundraising, resource allocation, and budget management to meet community needs and program deliverables.</li><li> Maintain strategic relationships with government officials, funders, and key community stakeholders.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree in a relevant field (advanced degree preferred). Minimum of 5-7 years of experience in program management, advocacy, or related fields. At least five years of experience managing a team in the nonprofit, government, legal, or related field. Proven leadership and management skills, with the ability to supervise and mentor a large, diverse team. Strong knowledge of civil rights issues, particularly those affecting the American-Muslim community. Excellent verbal and written communication skills, including public speaking and media engagement. Experience managing digital and print content creation, with some understanding of graphic design, layout, and publishing. Familiarity with social media platforms and social media marketing. Demonstrated experience in strategic planning, project management, and budget oversight. Ability to build and maintain relationships with diverse stakeholders, including community members, partner organizations, and policymakers. Passion for social justice, civil liberties, and promoting equality and inclusivity. Proficiency in utilizing digital communication tools, social media platforms, and content management systems. Knowledge of relevant applications such as SharePoint, Office365, OneDrive, and case management software is preferred. Access to reliable transportation to attend meetings and events in various Southern California cities.", "preferred": "To Apply:** Submit a cover letter, updated resume, and three references.<br/><br/>"}, "skills": ["Program Management", "Advocacy", "Leadership", "Management", "Civil Rights", "Communication", "Public Speaking", "Media Engagement", "Digital Content Creation", "Graphic Design", "Layout", "Publishing", "Social Media", "Social Media Marketing", "Strategic Planning", "Project Management", "Budget Oversight", "Relationship Building", "Social Justice", "Civil Liberties", "Equality", "Inclusivity", "Digital Communication Tools", "Social Media Platforms", "Content Management Systems", "SharePoint", "Office365", "OneDrive", "Case Management Software"], "postedDate": "1 week ago", "benefits": "100% employer-paid medical and dental insurance for employees &amp; dependents. 3% employer-matched retirement plan. 12 vacation days, 10 sick days, and 12 holidays. Hybrid work schedule utilized temporarily.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3997180596"}