{"jobTitle": "Executive Assistant", "company": {"name": "Confidential", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$95,000.00/yr - $105,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Financial Services and Real Estate", "description": "<strong><u>Executive Assistant to C-Suite Executive - Professional Services Firm - Onsite in West Los Angeles - $90-110K</u></strong><p><br/></p><p>A prestigious financial services firm is looking for a strong right-hand to two of their C-Suite executives. The company has an incredible culture and always takes care of their people. The idea candidate will be looking for an opportunity to build a career and plant roots within a great firm.</p><p><br/></p><p>The right person will have a warm and outgoing personality, and be a strong communicator. This person will be managing heavy calendaring, booking complex travel, and corresponding on the executive's behalf.</p><p><br/></p><p><strong>Responsibilities</strong></p><ul><li>Administrative support to a senior leader as well as the department needed</li><li>Maintain scheduling through Outlook calendar</li><li>Responding to correspondence (emails and phone calls) on behalf of the executive</li><li>Create and maintain all travel itineraries; make reservations as requested</li><li>Schedule complex meetings with multiple calendars and conference room bookings</li><li>Draft slides, meeting notes and documents for executive</li><li>Perform other general administrative duties and projects as needed</li><li>Handle sensitive information with good judgment, discretion and absolute confidentiality</li></ul><p><br/></p><p><strong>Qualifications</strong></p><ul><li>Bachelor's degree or equivalent experience</li><li>Proficient in Microsoft Office suite</li><li>Experience in managing multiple priorities, administrative coordination, and logistics</li><li>Well-organized, detail-oriented, ability to multi-task with great follow-up skills</li><li>Strong written and verbal communication skills</li></ul><p><br/></p><p><em>Please submit your resume to be considered.</em></p>", "responsibilities": "Administrative support to a senior leader as well as the department needed, Maintain scheduling through Outlook calendar, Responding to correspondence (emails and phone calls) on behalf of the executive, Create and maintain all travel itineraries; make reservations as requested, Schedule complex meetings with multiple calendars and conference room bookings, Draft slides, meeting notes and documents for executive, Perform other general administrative duties and projects as needed, Handle sensitive information with good judgment, discretion and absolute confidentiality", "qualifications": {"required": "Bachelor's degree or equivalent experience, Proficient in Microsoft Office suite, Experience in managing multiple priorities, administrative coordination, and logistics, Well-organized, detail-oriented, ability to multi-task with great follow-up skills, Strong written and verbal communication skills"}, "skills": ["Microsoft Office", "Outlook", "Calendar Management", "Travel Booking", "Meeting Scheduling", "Correspondence", "Administrative Support", "Communication", "Problem Solving", "Organization", "Detail-Oriented", "Multitasking", "Follow-up"], "postedDate": "1 week ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Paid maternity leave", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997598351"}