{"jobTitle": "Manager Regional Facilities (Remote - CA)", "company": {"name": "Jobs via eFinancialCareers", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "<strong>Overview<br/><br/></strong>This is a remote role that may only be hired in the following location: California<br/><br/>The Manager Regional Facilities is responsible for managing and overseeing the performance of the maintenance, business operations, and physical assets of Bank facilities at an advanced level of scope and ability for an assigned region. May be responsible for implementing space planning strategy, overseeing daily operations, preventative and reactive maintenance, and capital project work for locations within the assigned region, and location type. Ensures department activities and methodologies create value for the Bank, as well as align with business goals and objectives through expertise and familiarity with facility infrastructure. Implements policies or procedures that enforce regulatory and corporate policy compliance. Maximizes operational efficiencies, improves service quality and delivery, and manages risks through oversight of facility activities and research, and recommends industry best practices. Manages and develops regional staff responsible for maintenance and repair of branch facilities.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Facility Support - Oversees maintenance and repairs efforts towards the functionality of Bank facilities. Dispatches and ensures timely completion of work order requests. Manage and provide training to Facilities Manager for preventative maintenance activities and schedule to minimize disruption in business operations. Perform, manages, and trains Facilities Managers to preform facilities inspections, troubleshoot technical issues, provides reports, and develops effective asset management strategies. Aids execution of department projects including major works, renovations, capital improvements, relocations, mergers, acquisitions, and other special initiatives. Assists with emergency preparedness plans, standard operating procedures, and playbooks.</li><li>Facility Strategy - Develops and manages continuous relationships with key department leaders ensuring continuous alignment of the workplace with business needs. Collaborates with management and Department Heads on strategic activities related to forecast growth and space needs, prioritizing projects, and initiatives. Supports acquisition integration activities.</li><li>Vendor Management - Manages and oversees key vendor relationships to optimize the value of the engagement on pricing and service levels. Works with key vendors to determine if improvements or changes are needed. Coordinates with procurement and vendor management on contract activity as needed.</li><li>Budget Planning - Develops, creates, tracks, and maintains short and long-term (3-5 years) capital and expense budgets, got assigned locations, including business case recommendations for proposed major expenditures or budget variances. Ensures long-term schedule and capital plans are stablished and maintained for locations within the region. Reports on budget performance and plan versus actual variations. Identifies cost savings and cost reduction opportunities.</li><li>Managerial Functions - Manages facilities staff for the region, providing coaching and support for professional development. Establishes and monitors expectations to achieve company and department goals. Makes appropriate changes to guidelines, procedures, and routines to meet objectives. Manages the selection, hiring, performance, training, and evaluation of assigned staff, which may include professional development.</li><li>Project Management - Completes, plans, and executes enhancement projects at assigned regional locations. Supports projects outside the Department that involve the workplace projects.<br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong>Bachelor's Degree and 8 years of experience in Corporate Real Estate Facilities/Facilities Management<br/><br/><ul><li>OR- High School Diploma or GED and 12 years of experience in Corporate Real Estate Facilities/Facilities Management<br/><br/><br/></li></ul>Additional Required Qualifications:<br/><br/><ul><li>Experience with Corporate Real Estate Facilities and Maintenance</li><li>Knowledge and familiarity with troubleshooting electrical and mechanical products </li><li>Experience managing electrical and mechanical vendors </li><li>Experience Managing Facilities Managers and Sr. Facilities Managers is required</li><li>Experience performing in-depth building assessments </li><li>Ability to communicate and collaborate effectively </li><li>Ability to think strategically </li><li>30% percent travel<br/><br/><br/></li></ul>Preferred:<br/><br/><ul><li>Preferred Certifications: ASHRAE, BOMA, and/or IFMA </li><li>Chief Engineering background</li><li>Commissioning background </li><li>Financial Services background <br/><br/><br/></li></ul>If hired in California, the base pay for this position is generally between $108,913 and $167,000 per year. Actual starting base pay will be determined based on skills, experience, location, and other non-discriminatory factors permitted by law. For some roles, total compensation may also include variable incentives, bonuses, benefits, and/or other awards as outlined in the offer of employment.<br/><br/>First Citizens benefits programs are designed to meet our associates where they are in life. Full-time associates (20+ hours) are offered a comprehensive benefits program, with customized offerings, including those designed to support families, however defined. More information regarding our benefits offerings can be found here: https://jobs.firstcitizens.com/benefits", "postedDate": "1 week ago", "salary": {"amount": "$108,913.00 - $167,000.00", "currency": "USD"}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3997162706"}