{"jobTitle": "Regional US Communication Manager", "company": {"name": "Stanley/Stella", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Strategy/Planning", "industry": "Retail Apparel and Fashion", "description": "<strong>Mission</strong><p><br/></p><p>Stanley Stella has built a strong brand in Europe over the past decade and is now expanding globally, entering the US market in 2025. We are excited to announce a new role within the team, designed for individuals who enjoy starting from scratch: a US Communication Manager. The primary responsibilities of this regional role include leading and executing a results-driven marketing communications and activation plan aligned with corporate and brand direction. The Communication Manager will develop the US communication funnel, starting from building brand awareness to generating leads. As the brand's ambassador, this role will ensure that Stanley Stella's identity is effectively represented across all local touchpoints, reaching the appropriate target audience. Additionally, this position involves supporting the development and execution of channel marketing programs and initiatives to drive sales through indirect channels such as distributors, partners, and digital platforms (POD).</p><p><br/></p><p>Based on the West Coast of the US, in the Los Angeles area, you will work in a matrix organization, reporting to the Senior Marketing Manager based in Europe, with a dotted line to the US General Manager. You will have two direct reports: the US Communication Coordinator and the Digital Channel Specialist, who will assist in implementing the plan locally. Since the US team is still small, you should be ready to be hands-on while working in a scale-up environment.</p><p><br/></p><p><strong>Main responsibilities</strong></p><p><br/></p><p><strong>BRAND AND COMMUNICATION REFERRER:</strong></p><p>Act as the primary liaison between the Senior Marketing Manager in the US and the local team. As the main single point of contact (SPOC) for Brand and Communication between both continents, you will provide valuable insights and feedback to ensure alignment with Stanley Stella's objectives and priorities. You will adapt and implement global brand, communication, and activation concepts to meet the unique requirements of our direct business, distributor, and Print-on-Demand business units. It is essential to ensure consistency with Stanley Stella's global strategy.</p><p><br/></p><p><strong>CUSTOMER INSIGHT DEVELOPMENT:</strong></p><p>Develop a deep understanding of Stanley Stella's customers' needs and behaviors from a business and brand communication perspective. Use this knowledge to inform decision-making and strategy development for brand, product and communication activities. Additionally, monitor competitor activities, including collection updates, communication campaigns, sustainability, and commercial developments.</p><p><br/></p><p><strong>LOCAL &amp; CHANNELS COMMUNICATION STRATEGY:</strong></p><p>Develop actionable plans for local markets and channels that align with the global strategic plan. Collaborate closely with HQ and the US local team to translate and execute the global 360° communication plan into localized and channel-specific strategies tailored to specific needs. This involves organizing events, creating targeted samples, developing email campaigns, and building a database to foster loyalty and engagement. You will also be responsible for producing relevant content across various channels (social media, web) and should have a strong understanding of digital media buying (paid ads, Google) and dynamic website content creation.</p><p><br/></p><p><strong>SUPPORT PARTNER NETWORK:</strong></p><p>Collaborate closely with the sales team to support our distributor and new partners by providing the necessary online and offline content, materials, and tools based on segment and local requirements. Serve as the primary contact for coordinating promotional activities with trade organizations such as ASI and PPAI. Develop a comprehensive marketing program, including the creation and execution of channel marketing programs and campaigns aimed at increasing brand awareness, driving demand, and generating sales.</p><p>Content and Collateral Development: Create tailored marketing materials and collateral for channel partners, including product brochures, sales presentations, training materials, and promotional assets.</p><p><br/></p><p><strong>TRAININGS TO EMPOWERING STST TEAMS AND PARTNERS</strong> to effectively execute STST strategy. This includes training of sales team on the brand, communication and tools, materials, and key brand messages to enhance their sales efforts. Conduct training sessions for local partners, ensuring they are proficient in utilizing both offline and online tools to maximize their business potential.</p><p><br/></p><p><strong>PERFORMANCE MONITORING AND ANALYSIS</strong>:</p><p>Monitor and analyze key performance metrics to evaluate the effectiveness of communication and marketing initiatives. Use data-driven insights to make recommendations for continuous improvement.</p><p><br/></p><p><strong>Your profile</strong></p><p><br/></p><ul><li>You hold a master degree in Marketing or a related field and are based in the US</li><li>You have a minimum of 10 years of experience in B2B Marketing and BtoC is a plus</li><li>You have experience working with Europe, launching a new brand in a new market, used to work in matrix organisation</li><li>You have experience with Communication &amp; Digital strategy, omnichannel content funnel creation</li><li>You have worked in the US market, international experience is a plus</li><li>You have experience in a premium and lifestyle environment</li><li>You can draw up and monitor budgets</li><li>You are proactive with excellent project management skills</li><li>You are ready to work for a fast-paced, international company that sets the bar within the industry, willing to be operational and strategic</li><li>You are English native speaker, Spanish is a strong asset</li><li>You have a start up mentality, being able to think and work collaboratively</li></ul><p><br/></p><p>You’re happy to travel and spend some time in Europe on a quarterly basis.</p><p>Working with flexible hours to match different time zone is not an issue for you</p>", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3997303756"}