{"jobTitle": "Operations Analyst", "company": {"name": "Two Dots", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "75,000.00/yr - 95,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Software Development", "description": "<strong>About Two Dots<br/><br/></strong>Two Dots is a fraud prevention and consumer underwriting focused financial technology company. We improve outdated processes at our clients and give them superpowers they can use to make better decisions.<br/><br/><strong>About The Role<br/><br/></strong>We are seeking an Operations Analyst to join our team and play a critical role in dealing with complicated support cases, advising on operational and support management programs, and performing financial document analysis. You will work closely with engineering, operations management, and customer success.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Consumer underwriting - collect information from messy financial documents, using a combination of AI tools, manual inspection, and forensic tools, to detect fraud or help consumers that have unclear or complicated financial situations express that to our clients</li><li>Collaborate with cross-functional teams to resolve customer complaints and provide solutions</li><li>Manage and maintain inbound support inquiries through Intercom</li><li>Ensure compliance with company policies and procedures<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor's degree, quantitative or analytical degrees preferred</li><li>Strong analytical and problem-solving skills</li><li>Excellent verbal and written communication skills</li><li>Ability to work well under pressure and manage multiple tasks simultaneously<br/><br/></li></ul>Additional equity compensation will be provided in the form of an option grant", "responsibilities": "Consumer underwriting - collect information from messy financial documents, using a combination of AI tools, manual inspection, and forensic tools, to detect fraud or help consumers that have unclear or complicated financial situations express that to our clients, Collaborate with cross-functional teams to resolve customer complaints and provide solutions, Manage and maintain inbound support inquiries through Intercom, Ensure compliance with company policies and procedures", "qualifications": {"required": "Bachelor's degree, quantitative or analytical degrees preferred, Strong analytical and problem-solving skills, Excellent verbal and written communication skills, Ability to work well under pressure and manage multiple tasks simultaneously"}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997193522"}