{"jobTitle": "Interior Designer", "company": {"name": "Wedgewood LLC", "location": "Redondo Beach, CA"}, "location": "Redondo Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "70,000- $90,000.00", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Real Estate", "description": "Maverick Design is an award-winning design studio specializing in the renovation, revitalization, and reimagination of homes and commercial projects nationwide. Maverick brings an elevated, signature approach that resonates across a wide range of styles, and is known for developing tastefully creative and invitingly livable spaces. Maverick Design is the creative division of its larger parent company, Wedgewood Homes, specializing in the development market-focused, value-driven design. Wedgewood Homes is a privately held real estate company operating in 21 states with a rich history in revitalizing communities, one home at a time. Wedgewood, the parent company of Wedgewood Homes, has been in business since 1985.<br/><br/>Why you should apply:<br/><br/>Wedgewood offers our team members a competitive compensation, 401K, and traditional benefits like medical, dental, and vision. We also have many additional perks:<br/><br/><ul><li>INVEST WITH US -With Wedgewood’s In-house Investment Programs, you get to participate in the growth and profitability of the company through our in-house investment programs. </li><li>STUDENT LOAN PAYDOWN -Wedgewood recognizes the importance of quality education so we have partnered up with Gradifi to assist you with your student loans.</li><li>MAKE A DIFFERENCE - This is a great place to contribute to the community! Through our volunteer service, sustainable initiatives, charitable giving, and work with local universities, Wedgewood provides opportunities throughout the year for its employees to give back to the community for the greater good.</li><li>COLLABORATION AND REVITALIZATION - Join a team dedicated to revitalizing communities through collaboration and innovation. We believe in working together to create vibrant, sustainable neighborhoods and supporting each other in achieving our goals.<br/><br/></li></ul>About the role:<br/><br/>As part of the Maverick team, you'll be part of a dynamic and exhilarating design environment, crafting interior and exterior designs that redefine the essence of residential living. Collaborating closely with a diverse team of visionaries, project managers, and directors, you'll unleash the full potential of each home through a blend of cutting-edge design strategies and methods.<br/><br/>The Designer will collaborate closely with the design team, directors, and renovation team to bring our home renovation plans to life. Key responsibilities include, but are not limited to, designing residential projects. This role involves brainstorming design concepts, specifying and sourcing materials, coordinating with vendors, conducting site visits, staging, developing design guidebooks, and creating AutoCAD drawings, sketches, and renderings.<br/><br/>What you'll do:<br/><br/><ul><li>Work with design team to establish interior design concept for each project, including but not limited to interior, landscape and exterior design within the established Maverick Design style</li><li>Completion of site visits and field verification</li><li>Interface and collaborate with team, property managers, contractors, and vendors</li><li>Support development of guide books to bring design guidance to specific regions </li><li>Develop preliminary drawings, sketches, and AutoCAD plans </li><li>Complete space planning, floorplan, elevation and detail drawings to team to implement </li><li>Review millwork/cabinet drawings, redline, and coordinate necessary revisions </li><li>Development of guide books to bring design guidance to specific regions </li><li>Complete materials selection, specification documentation, and budgeting while factoring in budget</li><li>Coordinate with team members to ensure design is implemented</li><li>Select interior furnishings, accessories, art and furniture for in-house staging as needed</li><li>Source outside staging in line with the Maverick aesthetic Coordinate booking, scheduling, and making payments at project completion </li><li>Support in house staging, light staging, installation and take down as needed </li><li>Oversee local material library </li><li>Source new vendors </li><li>Provide mentorship to junior employees and assist in their development </li><li>Research and follow industry changes, evolutions and best practices </li><li>Represent Maverick Design and Wedgewood with positivity, strive for excellence and integrity<br/><br/></li></ul><strong><strong>What you'll need:<br/><br/></strong></strong><ul><li>Bachelor’s degree in Interior Design or Architecture </li><li>+3 or more years of experience in designer role (residential preferred)</li><li>Strong AutoCAD and Photoshop proficiency</li><li>Experience with space planning, floorplans and sketching</li><li>Sharp eye for design, materials, and spatial awareness</li><li>Strong space planning skills</li><li>Self-starter, motivated, passionate about design </li><li>Highly organized, detail oriented and self-motivated to perform at a high level </li><li>Excellent follow through ability </li><li>Strong attention to detail </li><li>Technical capabilities in AutoCAD, Photoshop, Sketchup, Microsoft Office and related programs </li><li>Ability to visualize concepts and explain them to others</li><li>Ability to plan, communicate and effectively carry out plans </li><li>Understanding of residential architecture and style</li><li>Ability to think outside the box and develop creative solutions</li><li>Understanding of cost vs. value analysis</li><li>Strong graphic presentation skills </li><li>Excellent verbal and written communication skills </li><li>Team Player attitude that embraces collaborative work and Wedgewood’s company values</li><li>Role requires active listening, critical thinking, making decisions, and time management skills </li><li>Ability to interact courteously and professionally with team and outside vendors </li><li>Support and coordinate landscape design as needed</li><li>Enjoys creative research and problem solving <br/><br/></li></ul>The salary range for this position is $70,000- $90,000.00 annually. In addition, the position is eligible for an annual discretionary bonus. Wedgewood occupies 50,000 square feet in a state of the art headquarters in Redondo Beach, California and has been named Company of the Year by the city. Wedgewood has additional office locations in Las Vegas and Dallas, and along with smaller offices throughout the country.<br/><br/>Wedgewood is an Equal Opportunity Employer and welcomes applications from all suitably qualified persons regardless of their race, sex, disability, religion/belief, sexual orientation or age.<br/><br/><strong>APPLY TODAY</strong>, Let’s start your future with Wedgewood!", "responsibilities": "As part of the Maverick team, you'll be part of a dynamic and exhilarating design environment, crafting interior and exterior designs that redefine the essence of residential living. Collaborating closely with a diverse team of visionaries, project managers, and directors, you'll unleash the full potential of each home through a blend of cutting-edge design strategies and methods.<br/><br/>The Designer will collaborate closely with the design team, directors, and renovation team to bring our home renovation plans to life. Key responsibilities include, but are not limited to, designing residential projects. This role involves brainstorming design concepts, specifying and sourcing materials, coordinating with vendors, conducting site visits, staging, developing design guidebooks, and creating AutoCAD drawings, sketches, and renderings.<br/><br/>What you'll do:<br/><br/><ul><li>Work with design team to establish interior design concept for each project, including but not limited to interior, landscape and exterior design within the established Maverick Design style</li><li>Completion of site visits and field verification</li><li>Interface and collaborate with team, property managers, contractors, and vendors</li><li>Support development of guide books to bring design guidance to specific regions </li><li>Develop preliminary drawings, sketches, and AutoCAD plans </li><li>Complete space planning, floorplan, elevation and detail drawings to team to implement </li><li>Review millwork/cabinet drawings, redline, and coordinate necessary revisions </li><li>Development of guide books to bring design guidance to specific regions </li><li>Complete materials selection, specification documentation, and budgeting while factoring in budget</li><li>Coordinate with team members to ensure design is implemented</li><li>Select interior furnishings, accessories, art and furniture for in-house staging as needed</li><li>Source outside staging in line with the Maverick aesthetic Coordinate booking, scheduling, and making payments at project completion </li><li>Support in house staging, light staging, installation and take down as needed </li><li>Oversee local material library </li><li>Source new vendors </li><li>Provide mentorship to junior employees and assist in their development </li><li>Research and follow industry changes, evolutions and best practices </li><li>Represent Maverick Design and Wedgewood with positivity, strive for excellence and integrity<br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s degree in Interior Design or Architecture , +3 or more years of experience in designer role (residential preferred), Strong AutoCAD and Photoshop proficiency, Experience with space planning, floorplans and sketching, Sharp eye for design, materials, and spatial awareness, Strong space planning skills, Self-starter, motivated, passionate about design , Highly organized, detail oriented and self-motivated to perform at a high level , Excellent follow through ability , Strong attention to detail , Technical capabilities in AutoCAD, Photoshop, Sketchup, Microsoft Office and related programs , Ability to visualize concepts and explain them to others, Ability to plan, communicate and effectively carry out plans , Understanding of residential architecture and style, Ability to think outside the box and develop creative solutions, Understanding of cost vs. value analysis, Strong graphic presentation skills , Excellent verbal and written communication skills , Team Player attitude that embraces collaborative work and Wedgewood’s company values, Role requires active listening, critical thinking, making decisions, and time management skills , Ability to interact courteously and professionally with team and outside vendors , Support and coordinate landscape design as needed, Enjoys creative research and problem solving ", "preferred": ""}, "skills": ["AutoCAD", "Photoshop", "Sketchup", "Microsoft Office", "Space Planning", "Design", "Residential Architecture", "Graphic Presentation", "Communication", "Teamwork"], "postedDate": "2 weeks ago", "benefits": "Wedgewood offers our team members a competitive compensation, 401K, and traditional benefits like medical, dental, and vision. We also have many additional perks:<br/><br/><ul><li>INVEST WITH US -With Wedgewood’s In-house Investment Programs, you get to participate in the growth and profitability of the company through our in-house investment programs. </li><li>STUDENT LOAN PAYDOWN -Wedgewood recognizes the importance of quality education so we have partnered up with Gradifi to assist you with your student loans.</li><li>MAKE A DIFFERENCE - This is a great place to contribute to the community! Through our volunteer service, sustainable initiatives, charitable giving, and work with local universities, Wedgewood provides opportunities throughout the year for its employees to give back to the community for the greater good.</li><li>COLLABORATION AND REVITALIZATION - Join a team dedicated to revitalizing communities through collaboration and innovation. We believe in working together to create vibrant, sustainable neighborhoods and supporting each other in achieving our goals.<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997672883"}