{"jobTitle": "Strategy and Operations Associate, Measurement, Data and Privacy", "company": {"name": "Google", "location": "Los Angeles, CA", "industry": "Information Services and Technology, Information and Internet"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "93,000.00/yr - 136,000.00/yr", "currency": "USD"}, "jobFunction": "General Business, Strategy/Planning, and Consulting", "industry": "Information Services and Technology, Information and Internet", "description": "This role may also be located in our Playa Vista, CA campus.<br/><br/>Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <strong>New York, NY, USA; Atlanta, GA, USA; Chicago, IL, USA; Mountain View, CA, USA; Los Angeles, CA, USA; San Francisco, CA, USA; Washington D.C., DC, USA</strong>.<strong>Minimum qualifications:<br/><br/></strong><ul><li>Bachelor's degree or equivalent practical experience.</li><li>2 years of experience in a management consulting, sales operations, business strategy, investment banking, venture capital, or private equity role, or 1 year of experience with an advanced degree.<br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>Experience running analysis that identifies insights that drive decisions.</li><li>Experience managing projects with cross-functional collaboration and stakeholder management, from design to execution.</li><li>Experience managing ambiguity with processes.</li><li>Ability to influence senior stakeholders.</li><li>Excellent written and verbal communication skills, with the ability to adapt styles depending on stakeholders.</li><li>Excellent problem solving and business skills.<br/><br/></li></ul><strong>About The Job<br/><br/></strong>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.<br/><br/>Americas Large Customer Sales (ALCS) Global Client and Agency Solutions (GCAS) Go-to-Market (GTM) Measurement, Data, and Privacy (MDP) team connects product and sales teams by designing product go-to-market strategy, enabling sales team, aligning on responsibilities, and providing market feedback to product teams<br/><br/>The Strategy and Operations team provides business critical insights using analytics, ensures cross-functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. You will be leading the strategy and operations to drive impact to Clients and Google’s Data, Measurement, and Privacy priorities.<br/><br/>The Go-to-Market Operations (GtM) team ensures Google's complex and ever-evolving Ads business runs smoothly. We are instrumental in setting go-to-market strategy, and ensuring flawless execution and operations against the strategy. We have teams embedded in each of the major Ads business areas as well as global teams that work across the business areas. Team members are analytical and strategic, with a pragmatic sense of how to get things done.<br/><br/>The US base salary range for this full-time position is $93,000-$136,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Contribute to the development of comprehensive strategies that solve business challenges and address the needs of stakeholders across various functions to drive incremental growth.</li><li>Lead and support cadence from design to day-to-day execution, collaborate with cross-functional teams across Product, go-to-market, and ALCS. </li><li>Support Data, Measurement, and Privacy planning process for MDP and ALCS, managing stakeholders and processes.</li><li>Manage strategic projects that will shape the operating model driving efficiency and impact to Google and clients.</li><li>Partner with Americas Business Strategy and Operations teams to manage reporting operations to demonstrate progress on product development goals.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Contribute to the development of comprehensive strategies that solve business challenges and address the needs of stakeholders across various functions to drive incremental growth.</li><li>Lead and support cadence from design to day-to-day execution, collaborate with cross-functional teams across Product, go-to-market, and ALCS. </li><li>Support Data, Measurement, and Privacy planning process for MDP and ALCS, managing stakeholders and processes.</li><li>Manage strategic projects that will shape the operating model driving efficiency and impact to Google and clients.</li><li>Partner with Americas Business Strategy and Operations teams to manage reporting operations to demonstrate progress on product development goals.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience. 2 years of experience in a management consulting, sales operations, business strategy, investment banking, venture capital, or private equity role, or 1 year of experience with an advanced degree.", "preferred": "Experience running analysis that identifies insights that drive decisions. Experience managing projects with cross-functional collaboration and stakeholder management, from design to execution. Experience managing ambiguity with processes. Ability to influence senior stakeholders. Excellent written and verbal communication skills, with the ability to adapt styles depending on stakeholders. Excellent problem solving and business skills."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "The US base salary range for this full-time position is $93,000-$136,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3997586939"}