{"jobTitle": "Manager, Facilities - Baja Field Station", "company": {"name": "Glendale Community College", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Higher Education", "description": "<strong>Glendale Community College<br/><br/></strong><strong>Salary:</strong> $8,377.00 - $10,690.00 Monthly<br/><br/><strong>Job Number:</strong> 941-2024<br/><br/><strong>Location:</strong> Glendale, CA<br/><br/><strong>Department:</strong> Office of VP Instructional Services<br/><br/><strong>Closing:</strong> Continuous<br/><br/><strong>Description<br/><br/></strong>Glendale Community College seeks a leader who is dedicated to all aspects of student success and closing equity gaps, to apply for its Manager, Facilities - Baja Field Station position. GCC seeks a true collaborator who will prioritize our students in decision-making and setting strategy for the College's continuing education operations that support teaching and learning. We prioritize applicants who demonstrate they understand the benefits that a diverse student population brings to a community college.<br/><br/>Our College Recognizes That Institutions Are Greatly Strengthened When Their Leadership Is Guided By Diverse Perspectives And Approaches To Problem Solving And Innovation. GCC Is Committed To Hiring a Facilities - Baja Field Station Manager Who Exemplifies Equity-focused Behaviors Such As<br/><br/><ul><li>implementing institutional practices that both develop and sustain culturally responsive student support, teaching, and learning environments; </li><li>encouraging positive race-consciousness and embracing of human differences; </li><li>strategically building support for and participation in equity-related initiatives across both our internal and external communities; and </li><li>promoting and modeling the importance of holding ourselves accountable as educators for closing equity gaps and actively engaging in equitable practices. <br/><br/></li></ul>The successful candidate will join a college dedicated to the students it serves. We are proud to be a designated Hispanic-Serving Institution (HSI). We serve students from a broad range of cultural heritages, socioeconomic backgrounds, genders, abilities, and orientations, and we actively work to provide a welcoming environment for all. We especially encourage individuals who bring perspectives from lived experiences that our students from underrepresented groups at GCC will connect to and uniquely benefit from in their learning journey at our college.<br/><br/>Position is open until filled. First review date: August 23, 2024.<br/><br/>Applications received after the first review date may or may not be advanced in the process for further consideration.<br/><br/><strong>Definition<br/><br/></strong>Under administrative direction, plans, organizes and manages ongoing and preventative maintenance and operations of the facilities at the College's Baja Field Station located in Bahia de los Angeles, Baja California, Mexico; maintains and completes repairs of the field station, its grounds, and related equipment; performs maintenance and basic repairs to vehicles and outboard motors; coordinates and provides direction for the work of assigned contractors or other third-parties completing work on-site.; coordinates local support for all logistical needs of visitors to the Baja Field Station.<br/><br/><strong>Supervision<br/><br/></strong>Supervision is provided by the Director, Facilities.<br/><br/>Does not directly or indirectly supervise other District employees; provides direction to contractors and may supervise temporary hourly employees when assigned to site.<br/><br/><strong><strong>Examples of Duties<br/><br/></strong></strong><em>The following duties and responsibilities are typical of those performed by employees in this classification.<br/><br/></em><ul><li>Plans, organizes and manages ongoing maintenance and operations of the facilities at the College's Baja Field Station located in Bahia de los Angeles, Baja California, Mexico.</li><li>Maintains and completes repairs of the field station, its grounds, and related equipment using skills such as carpentry, roofing, plumbing, basic electrical repair; performs maintenance and basic repairs to vehicles and outboard motors, including estimating costs and resources, inspecting work and maintaining accurate records of work, inventory, and purchases.</li><li>Coordinates and provides direction for the work of assigned contractors or other third-parties completing work on-site; determines priorities and estimates needed resources</li><li>Coordinates local support for all logistical needs of the Baja program and visitors to the Baja Field Station.</li><li>Coordinates inspections with external agencies to ensure compliance with District standards and other applicable laws and regulations. </li><li>Responds promptly to emergencies involving Baja station facilities; inspects site for damage, coordinates repairs with personnel and vendors, and ensures problems have been resolved. </li><li>Operates vehicles at the field station. </li><li>Develops and maintains written security, safety and emergency plans for the facility.</li><li>Assists with the development, implementation, and establishment policies, processes, and procedures for applicable area(s); monitors and evaluates program, operational, departmental, and/or service quality; may recommend, develop, and implement quality improvement assessment tools and/or methods with administration and/or regulatory agencies.</li><li>Assists in the development and implementation of short- and long-term strategies and plans, including the program review process.</li><li>Recommends, monitors, and/or administers budgets for assigned areas; oversees and administers budget allocations and procurements for all assigned funds as appropriate; analyzes and reviews budgetary and financial data.</li><li>Handles and resolves conflicts and issues and reports complaints as appropriate. </li><li>Promotes diversity, equity, inclusion, cultural competency, and a positive work and academic environment.</li><li>Coordinates and oversees the implementation and modification of technology.</li><li>Supervises department employees; assigns and monitors employee's work and evaluates employee performance; trains employees; participates in employee selection. </li><li>Monitors and reviews programs and/or operations for legal compliance.</li><li>Analyzes and interprets data; prepares, reviews, and/or approves documents and reports.</li><li>May direct and/or conduct surveys and special studies; may maintain statistics. </li><li>May participate and/or chair campus committees and task forces.</li><li>Performs other related duties as assigned.<br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><em>The education, training and experience qualifications are considered likely to provide the required knowledge and abilities to perform the above essential duties. <br/><br/></em><strong>Education And Experience<br/><br/></strong>High School Diploma or equivalent.<br/><br/>Two years' experience in logistics coordination and performing building and construction maintenance and repairs at a field/research station, or comparable facility.<br/><br/>Fluent in Spanish and English.<br/><br/><strong>Licenses/Certificates/Other Requirements<br/><br/></strong><ul><li>Must possess a valid driver's license. </li><li>Must possess/obtain Red Cross First-Aid and CPR certificates (may obtain after appointment).<br/><br/></li></ul><strong>Knowledge Of<br/><br/></strong><ul><li>Recycling, waste, and energy management and conservation programs, systems, best practices, and state usage and reporting requirements.</li><li>Standard and ongoing maintenance needs for buildings, grounds, facilities, and related equipment.</li><li>Methods, materials, tools and equipment used in building, utility, and grounds construction, repair, and maintenance activities.</li><li>Operational and engineering principles of complex plumbing, electrical, and mechanical systems for buildings and facilities and their utility infrastructure.</li><li>Standard vehicle maintenance and registration requirements.</li><li>Principles and practices of contract administration and construction project management.</li><li>Mathematical calculations necessary to determine the capacity and sizing of electrical, mechanical, HVAC, and plumbing system components.</li><li>Safety practices related to maintenance activities and the operation of building and grounds maintenance equipment.</li><li>Management principles and practices.</li><li>Current and emerging technologies that support the applicable area(s).</li><li>Principles and practices of supervision.</li><li>Applicable laws, regulations, standards, and/or requirements.</li><li>Methods of prioritizing, planning, and organizing work.</li><li>Principles and practices of budget administration.</li><li>Principles of data research, collection, organization, interpretation, and reporting. </li><li>General accounting and bookkeeping principles.</li><li>Principles and practices of business communication and writing.</li><li>Principles of knowledge management.</li><li>Presentation techniques.</li><li>Standard office practices or procedures.</li><li>Standard office software and modern office equipment.</li><li>Principles and practices of customer service.</li><li>Interpersonal relations management.<br/><br/></li></ul><strong>Ability To<br/><br/></strong><ul><li>Manage construction projects and contracts.</li><li>Manage and implement the functions of diversified building, grounds, and equipment construction, repair, inspection, and maintenance programs at a field station.</li><li>Develop, implement, administer, and analyze the effectiveness of recycling, energy conservation, grounds, and maintenance programs.</li><li>Estimate and monitor materials, timelines, and labor costs for maintenance, remodeling, and minor construction projects.</li><li>Interpret and evaluate architectural and engineering drawings and specifications.</li><li>Inspect plans, drawings, and work for compliance with specifications, laws, regulations, and appropriate code requirements.</li><li>Evaluate new custodial, grounds and maintenance products and equipment and select materials and supplies. </li><li>Respond promptly to and assess building and grounds emergencies to determine and implement the best course of action.</li><li>Safely operate building and grounds maintenance equipment.</li><li>Oversee the development of policies and procedures for maintenance, custodial and groundskeeping functions.</li><li> Assist with outreach efforts to attract prospective users to the field station and develop additional funding sources.</li><li>Develop and implement goals with identifiable outcomes and assist with development of strategic plans, as needed.</li><li>Identify and implement appropriate technology and resources.</li><li>Research, develop, apply, explain, and/or ensure the compliance of applicable laws, regulations, policies and/or procedures.</li><li>Identify needs, analyze problems, and provide recommendations and/or alternative solutions.</li><li>Manage and prioritize work, projects and/or programs within established deadlines</li><li>Prepare, manage, monitor, oversee, and/or administer budgets.</li><li>Supervise, train, and evaluate the work of assigned employees.</li><li>Stay abreast of information, trends, and theories applicable to areas of assignment.</li><li>Analyze data and compile and present narrative and statistical reports.</li><li>Prepare and review reports, correspondence, and other documents using multiple business formats.</li><li>Manage the maintenance of records.</li><li>Prepare and deliver presentations.</li><li>Utilize standard office software and equipment.</li><li>Maintain confidentiality of sensitive and/or protected information.</li><li>Provide customer service with a high level of sensitivity, tact and patience.</li><li>Communicate effectively, both orally and in writing.</li><li>Establish and maintain cooperative and effective working relationships with all employees and others encountered in the course of work.</li><li>Demonstrate a sensitivity to, and understanding of, the diverse academic, socioeconomic, cultural, disability, gender identity, sexual orientation, and ethnic backgrounds of community college students.<br/><br/></li></ul><strong><strong>Additional Information<br/><br/></strong></strong><strong>Salary<br/><br/></strong>Starting salary: Step 1 $8,377 to Step 6 $10,690 per month, based on training and experience.<br/><br/>Salary range: Step 1 $8,377 to Step 11 $14,031 per month (including longevity steps).<br/><br/>For more information, please refer to the Management Salary Schedule<br/><br/><strong>Application Process<br/><br/>This position requires the following documents to be attached to your online application in order to be considered:<br/><br/></strong><ul><li>Current resume</li><li>Cover letter of interest that addresses minimum and desirable qualifications </li><li>List of three (3) professional references, including one supervisor. Please provide names, telephone numbers, and e-mail address for each reference.<br/><br/></li></ul>Applications will be accepted until the position is filled. However, to ensure full consideration, applications and any required attachments must be submitted by <strong> August 23, 2024</strong> <strong>. Applications with incomplete information (i.e. statements such as 'see resume') or missing required documents will not be considered.<br/><br/></strong>The College will tentatively hold interviews the week of September 21 - 25.<br/><br/><strong>Travel Reimbursement<br/><br/></strong>Contingent on funding and eligibility, successful candidates selected for a face-to-face interview may be eligible to request partial reimbursement of travel expenses. Please contact the office of Human Resources for more information.<br/><br/><strong>Position Funding<br/><br/></strong>This position is offered contingent upon funding. GCCD reserves the right to extend, withdraw, and/or reopen this position at any time. Additional openings, for the same position, which become available prior to the end of the hiring process may be filled by qualified applicants that applied to this job announcement.<br/><br/><strong>Commitment to Diversity and Equal Employment Opportunity Employer <br/><br/></strong>GCCD is committed to employing administrators, faculty, and staff members who are dedicated to student success. GCCD recognizes that diversity in the academic environment fosters cultural awareness, promotes mutual understanding and respect, and provides suitable role models for all students.<br/><br/>GCCD is committed to hiring processes that support equal opportunity, diversity, and provide equitable consideration for all candidates as required in federal and state law. To find out more about GCCD, please visit our website at glendale.edu.<br/><br/><strong>Accommodations<br/><br/></strong>If accommodations are needed for the application process in compliance with the Americans with Disabilities Act, please contact the Office of Human Resources.<br/><br/>Thank you for your interest in employment opportunities with Glendale Community College.<br/><br/><strong>To apply, please visit https://www.schooljobs.com/careers/gccedu/jobs/4589921/manager-facilities-baja-field-station<br/><br/></strong>jeid-b532c8a834af3f479025575b3542b3d0<br/><br/>Copyright ©2024 Jobelephant.com Inc. All rights reserved.<br/><br/>Posted by the FREE value-added recruitment advertising agency Education and Experience: High School Diploma or equivalent. Two years experience in logistics coordination and performing building and construction maintenance and repairs at a field/research station, or comparable facility. Fluent in Spanish and English. Licenses/Certificates/Other Requirements Must possess a valid drivers license. Must possess/obtain Red Cross First-Aid and CPR certificates (may obtain after appointment).", "responsibilities": "Plans, organizes and manages ongoing maintenance and operations of the facilities at the College's Baja Field Station located in Bahia de los Angeles, Baja California, Mexico. Maintains and completes repairs of the field station, its grounds, and related equipment using skills such as carpentry, roofing, plumbing, basic electrical repair; performs maintenance and basic repairs to vehicles and outboard motors, including estimating costs and resources, inspecting work and maintaining accurate records of work, inventory, and purchases. Coordinates and provides direction for the work of assigned contractors or other third-parties completing work on-site; determines priorities and estimates needed resources Coordinates local support for all logistical needs of the Baja program and visitors to the Baja Field Station. Coordinates inspections with external agencies to ensure compliance with District standards and other applicable laws and regulations.  Responds promptly to emergencies involving Baja station facilities; inspects site for damage, coordinates repairs with personnel and vendors, and ensures problems have been resolved.  Operates vehicles at the field station.  Develops and maintains written security, safety and emergency plans for the facility. Assists with the development, implementation, and establishment policies, processes, and procedures for applicable area(s); monitors and evaluates program, operational, departmental, and/or service quality; may recommend, develop, and implement quality improvement assessment tools and/or methods with administration and/or regulatory agencies. Assists in the development and implementation of short- and long-term strategies and plans, including the program review process. Recommends, monitors, and/or administers budgets for assigned areas; oversees and administers budget allocations and procurements for all assigned funds as appropriate; analyzes and reviews budgetary and financial data. Handles and resolves conflicts and issues and reports complaints as appropriate.  Promotes diversity, equity, inclusion, cultural competency, and a positive work and academic environment. Coordinates and oversees the implementation and modification of technology. Supervises department employees; assigns and monitors employee's work and evaluates employee performance; trains employees; participates in employee selection.  Monitors and reviews programs and/or operations for legal compliance. Analyzes and interprets data; prepares, reviews, and/or approves documents and reports. May direct and/or conduct surveys and special studies; may maintain statistics.  May participate and/or chair campus committees and task forces. Performs other related duties as assigned.", "qualifications": {"required": "High School Diploma or equivalent. Two years' experience in logistics coordination and performing building and construction maintenance and repairs at a field/research station, or comparable facility. Fluent in Spanish and English.", "preferred": "Must possess a valid driver's license. Must possess/obtain Red Cross First-Aid and CPR certificates (may obtain after appointment)."}, "skills": ["Recycling", "Waste", "Energy Management", "Conservation", "Building Maintenance", "Grounds Maintenance", "Equipment Maintenance", "Construction", "Repair", "Plumbing", "Electrical", "Mechanical", "HVAC", "Contract Administration", "Project Management", "Mathematical Calculations", "Safety Practices", "Management", "Supervision", "Technology", "Data Analysis", "Reporting", "Accounting", "Bookkeeping", "Business Communication", "Customer Service", "Interpersonal Relations"], "postedDate": "3 weeks ago", "salary": {"amount": "8,377.00 - 10,690.00", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997695322"}