{"jobTitle": "Content Operation Manager", "company": {"name": "BIGO", "industry": "Advertising Services and Technology, Information and Internet", "size": "Not specified", "location": "Los Angeles Metropolitan Area"}, "location": "10250 Constellation Blvd, Century City, Los Angeles, US (hybrid style, 3 days working in the office)", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Advertising and Marketing", "industry": "Advertising Services and Technology, Information and Internet", "description": "The Content Operation Manager will be responsible for overseeing and optimizing all content on the platform, ensuring quality, relevance, and user engagement. You will lead the content team, develop and execute content strategies, and ensure alignment with the brand's vision and business objectives. You'll need to demonstrate the ability to organize creative processes, communicate their intent and progress, and measure their results against clearly communicated business outcomes.", "responsibilities": "Actively innovate and plan content partnerships with internal and external creators and manage day-to-day relationships to empower them for new content ideas and support platform growth. Identify, strategize and innovate content initiatives to serve business growth and increase user activeness by leveraging our core product functions. Create, plan, and execute programs and events, including seasonal events, core-community events and identifying new opportunities to increase engagement for all creators related activities and partnerships. Create and manage content calendar and project plans including objectives, target, roadmap, promotion tactics and step-by-step action plans, ensuring timely and high-quality delivery, and coordinate cross-departmental collaboration. Set and report on key performance indicators (KPIs) for all content campaigns, such as DAU, retention, livestream hours, watch time and measure campaign performance against the KPIs. Perform deep-dive analysis on creators' content performance, review data and effectively implement strategy while identifying areas of success and needed improvement. Develop company overview and project presentations for business meetings and pitch on new content opportunities. Act as the main interface between the content and marketing team; Work with cross-functional teams including creative, user operation, legal, finance, PR to develop joint platform plans. Monitor and analyze market and industry trends, new topics, emerging content creators, and competitor performance to provide insights and recommendations for content development. This position may require travel, both domestically and internationally, as necessary to fulfill job responsibilities. Travel frequency and destinations will vary based on business needs and specific job duties. All travel arrangements will be coordinated in accordance with company policies.", "qualifications": {"required": "Bachelor's Degree above, preferably in Marketing, Communications, Journalism, or related fields. Minimum 8 years of experience in a content development or content marketing role in the tech or entertainment industry. Extensive experience in campaign management and creator partnerships is a must. Proven and demonstrable track record in creating new content ideas and producing live content. Must be proactive, fast-thinking, self-starter who can own and lead projects. Ability to work cross-functionally across multiple teams, stakeholders, and time zones. Solid knowledge about the Internet users, market trends and major social platforms. Strong analytic skills; Ability to derive actionable insights from campaign metrics and marketing data. Strong attention to detail and organizational skills while working within tight deadlines and resource constraints. Exceptional writing and editing skills with a keen eye for detail.", "preferred": "Not specified"}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Competitive pay package that includes a base salary and performance-related bonus. Generous paid time off starting at 4 weeks + 10 sick days and 9 Holidays per year. Free medical, dental, and vision insurance. 401k. Free gym membership and meal allowance.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3997515972"}