{"jobTitle": "Customs Trade Coordinator- 2nd Shift", "company": {"name": "Custom Brands Group", "industry": "Truck Transportation", "size": "Not specified", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Manufacturing", "industry": "Truck Transportation", "description": "Responsible for coordination of the documentation required by US Customs/Government Agencies for entry of goods into the US on behalf of importers. Provide impeccable customer service. Obtain correct classification of goods for customs release from database, SOP's, tariff book, internet or customs. Data entry and processing of various import related documentation for submission to US Customs and may handle all PGA's (participating Government Agencies). Maintain and keep current all shipment documentation in compliance with all record keeping requirements. Adhere to all international importing and exporting regulations. Work closely with other internal staff, departments, other fedex operations, and customers to deliver high level of service to customers. Process agency brokerage shipments. May handle remote filings. Ensure all government and organizational policies are followed. HS Diploma or GED required. No industry experience required. Minimum of 6 months work experience preferred. Data entry/keyboard experience required. Required - MS Office, Outlook, Office equipment (phone, fax, photocopier, printer, scanner). Excellent communication skills, verbal and written. Organizational Skills. Inter-personal skills. Problem solving Skills. Handle high volume of work. Handle time sensitive work. Ability to work independently with minimum supervision. Ability to use multiple systems and reference material. Interact with customers, carriers, brokers, government agencies, internal staff, management of all levels, internal departments. Performs other or additional duties as assigned. Paid Training Provided.", "responsibilities": "Responsible for coordination of the documentation required by US Customs/Government Agencies for entry of goods into the US on behalf of importers. Provide impeccable customer service. Obtain correct classification of goods for customs release from database, SOP's, tariff book, internet or customs. Data entry and processing of various import related documentation for submission to US Customs and may handle all PGA's (participating Government Agencies). Maintain and keep current all shipment documentation in compliance with all record keeping requirements. Adhere to all international importing and exporting regulations. Work closely with other internal staff, departments, other fedex operations, and customers to deliver high level of service to customers. Process agency brokerage shipments. May handle remote filings. Ensure all government and organizational policies are followed.", "qualifications": {"required": "HS Diploma or GED required. No industry experience required. Minimum of 6 months work experience preferred. Data entry/keyboard experience required. Required - MS Office, Outlook, Office equipment (phone, fax, photocopier, printer, scanner). Excellent communication skills, verbal and written. Organizational Skills. Inter-personal skills. Problem solving Skills. Handle high volume of work. Handle time sensitive work. Ability to work independently with minimum supervision. Ability to use multiple systems and reference material. Interact with customers, carriers, brokers, government agencies, internal staff, management of all levels, internal departments.", "preferred": "Not specified"}, "skills": ["Customer Service", "Data Entry", "MS Office", "Organizational Skills", "Communication Skills", "Problem Solving Skills"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Paid Training Provided.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3997601036"}