{"jobTitle": "Merchandise Planner", "company": {"name": "PACSUN", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "68,896 - $85,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Retail", "description": "<strong>Join the Pacsun Community</strong>\n<p><strong> </strong></p>\n<p>Pacsun is dedicated to delivering an exclusive collection of the most relevant brands and styles to a community of inspired youth. Through partnerships with brands such as adidas, Brandy Melville, Essentials Fear of God, our own brands, and many more.</p>\n<p><br/></p>\n<p>Our Pacsun community believes in and understands the importance of using our voice, platform, and resources to inspire and bring about positive development. Our program PacCares supports and partners with organizations that align with our internal and external initiatives surrounding mental health, diversity, and equality. Join the Pacsun Community.</p>\n<p><br/></p>\n<p>Learn more here: LinkedIn- Our Community</p>\n<p><br/></p>\n<p><strong>About the Job:</strong></p>\n<p>Develop, execute and communicate merchandise financial plans and strategies that support the company's overall merchandising objectives for a specific category of merchandise for both retail and ecommerce.</p>\n<p><br/></p>\n<p><strong>A day in the life, what you’ll be doing:</strong></p>\n<ul><li>Create and maintain strategic financial plans tied to merchandising strategies</li><li>Responsible for planning sales, inventory, markdowns and margins at a department/ class and/or program level</li><li>Pre-season topside merchandise planning at a department/class level/style-color level, as well as in-season planning adjusting forecasts to trend.</li><li>Responsible for building pre-season class plans at the price type (regular and markdown) and weekly level</li><li>Analysis of business around risk and opportunities at division, class and/or program level</li><li>Quantify in-season risks and opportunities and making the appropriate recommendations to merchant teams and management</li><li>Partner with management, merchants and allocation in order to strategically move business toward increasing profit</li><li>Communicate monthly Open-to-Buy forecasts &amp; supporting action plans as well as presentation of this data to Management and Cross Functional teams</li><li>Recap and analyze actual sales results to plan and forecast in-season sales and inventories on a weekly, monthly, quarterly basis and ad hoc basis</li><li>Manage the financial success of the department by meeting sales, merchandise margin, gross margin return on investment (GMROI) and inventory goals; analyze historical data and current trends to identify risks and opportunities</li><li>Work with merchants and allocation to determine and manage exit strategies recommending items for clearance and controlling aged inventory</li><li>Develop and maintain effective working relationships with Cross Functional team members; i.e., Merchandising, Product Development, Store Operations, Visual and Finance</li><li>Performs other related duties as assigned</li></ul>\n<p><br/></p>\n<p><strong>What it takes to Join: </strong></p>\n<ul><li>Minimum of 1-2-years experience in inventory management and overseeing planning at an item level within a large specialty retailer (300+ stores)</li><li>Bachelor's Degree in a related field preferred</li><li>Demonstrated logical analysis and problem solving skills</li><li>Solid understanding of financial measurements including: sales, gross margin, GMROI, inventory turn, weeks of supply and how to impact them</li><li>Flexible and adaptive to changing priorities; ability to organize and prioritize workload to meet deadlines</li><li>Ability to build and maintain productive relationships with peers and cross-functional teams</li><li>Ability or aptitude to learn technical applications quickly; must be proficient with Microsoft Excel</li></ul>\n<p><br/></p>\n<p><strong>Salary Range</strong>: $68,896 - $85,000</p>\n<p><br/></p>\n<p><strong>Pac Perks:</strong></p>\n<ul><li>Dog friendly office environment</li><li>On-site Cafe</li><li>On-site Gym</li><li>$1,000 referral incentive program</li><li>Generous associate discount of 30-50% off merchandise online and in-stores</li><li>Competitive long term and short-term incentive program</li><li>Immediate 100% vested 401K contributions and employer match</li><li>Calm Premium access for all employees</li><li>Employee perks throughout the year</li></ul>\n<p><br/></p>\n<p><strong>Physical Requirements:</strong></p>\n<p><br/></p>\n<p>The physical demands described here are representative of those that are required by an associate to successfully perform the essential functions of this job.</p>\n<ul><li>While performing the duties of this job, the associate is regularly required to talk or hear. The associate is frequently required to sit; stand; walk; use hands to finger, handle or feel; as well as reach with hands and arms.</li><li>Specific vision abilities required by this job include close vision, distance vision, depth perception and ability to adjust focus.</li><li>Ability to work in open environment with fluctuating temperatures and standard lighting.</li><li>Ability to work on computer and mobile phone for multiple hours; with frequent interruptions.</li><li>Required to travel in elevator or stairwells to attend meetings and engage with associates on multiple floors throughout building.</li><li>Hotel, Airplane, and Car Travel may be required.</li></ul>\n<p><strong> </strong></p>\n<p><strong>Position Type/Expected Hours of Work:</strong></p>\n<p><br/></p>\n<p>This is a full-time position. As a National Retailer, occasional evening and/or weekend work may be required during periods of high volume. This role operates in a professional office environment and routinely uses standard office equipment.</p>\n<p><br/></p>\n<p><strong>Other Considerations:</strong></p>\n<p><br/></p>\n<p>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the associate for this job. Duties, responsibilities and activities may change at any time with or without notice. Reasonable accommodations may be made to qualified individuals with disabilities to enable them to perform the essential functions of the role.</p><p></p>", "responsibilities": "Develop, execute and communicate merchandise financial plans and strategies that support the company's overall merchandising objectives for a specific category of merchandise for both retail and ecommerce.", "qualifications": {"required": "Minimum of 1-2-years experience in inventory management and overseeing planning at an item level within a large specialty retailer (300+ stores), Demonstrated logical analysis and problem solving skills, Solid understanding of financial measurements including: sales, gross margin, GMROI, inventory turn, weeks of supply and how to impact them, Flexible and adaptive to changing priorities; ability to organize and prioritize workload to meet deadlines, Ability to build and maintain productive relationships with peers and cross-functional teams, Ability or aptitude to learn technical applications quickly; must be proficient with Microsoft Excel", "preferred": "Bachelor's Degree in a related field"}, "skills": ["Inventory Management", "Financial Analysis", "Problem Solving", "Microsoft Excel"], "postedDate": "1 week ago", "benefits": "Dog friendly office environment, On-site Cafe, On-site Gym, $1,000 referral incentive program, Generous associate discount of 30-50% off merchandise online and in-stores, Competitive long term and short-term incentive program, Immediate 100% vested 401K contributions and employer match, Calm Premium access for all employees, Employee perks throughout the year", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997592336"}