{"jobTitle": "Senior Program Manager, Talent Acquisition", "company": {"name": "Snap Inc.", "industry": "Software Development", "size": "1001-5000 employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$97,000.00/yr - $171,000.00/yr", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Software Development", "description": "Snap Inc is a technology company. We believe the camera presents the greatest opportunity to improve the way people live and communicate. Snap contributes to human progress by empowering people to express themselves, live in the moment, learn about the world, and have fun together. The Company’s three core products are Snapchat, a visual messaging app that enhances your relationships with friends, family, and the world; Lens Studio, an augmented reality platform that powers AR across Snapchat and other services; and its AR glasses, Spectacles.\n\nThe People Team drives our values of being kind, smart and creative across Snap's global workforce. We work together to empower our teams to hire thoughtful and passionate innovators, help people do their best work, grow their careers and build healthy and productive workspaces in a safe, and cohesive community. Together, we are Talent, Total Rewards, IDEA (Inclusion, Diversity, Equity, and Awareness), HR Tech, People Analytics, People Operations, People Services, Council, Learning & Development, Employer Brand and Employee Relations.\n\nWe’re looking for a Talent Acquisition Program Manager with a passion for diversity to join Snap Inc.’s Talent Acquisition team! You will ensure that our programs are inclusive and equitable, fostering a culture where everyone can thrive and contribute to Snap Inc.'s success. By focusing on increasing the diversity of our candidate pool, this role will help us build a more inclusive and innovative workforce.", "responsibilities": "Manage projects and implement programs for various initiatives tied to Snap’s Talent Acquisition DEI strategic plan. Coordinate and execute various talent acquisition programs focused on achieving our diversity goals, including but not limited to Snap Up and Global Talent Inclusive Hiring Plans. Oversee the coordination and execution of the Snap Up program (11-month new grad rotational software engineering program), managing rotational assignments, performance management processes (with the HR Business Partners), and ensuring that the new hires transition smoothly into their roles as full-time Software Engineer Apprentice. Work with Engineering Managers across Snap to ensure that Apprentices have the opportunity to engage in impactful projects and gain hands-on industry experience. Focus on using data-driven insights to advance program initiatives and enhancements. Partner with our DEI Team, Talent Acquisition Leadership, University Recruiters, and Employer Brand team to further our recruiting efforts, our brand, and our mission to be recognized as a leading employer in the DEI space. Identify and manage third-party partnerships to engage across Talent Acquisition including the university space for curriculum creation and execution for the Snap Up Program. Collaborate with Talent Acquisition leaders and University Recruiters to establish connections with organizations that cultivate and provide access to a diverse pool of qualified candidates. Continue internal partnerships to drive engagement and nurturing of candidates.", "qualifications": {"required": "Bachelor's degree or equivalent work experience or equivalent years of experience. 5+ years work experience in Talent Acquisition or HR", "preferred": "2+ years experience working within Talent Acquisition. 2+ years DEI expertise as it relates to recruiting and partnership management. 2+ years of project management and program coordination in a matrixed organization."}, "skills": ["Project Management", "Talent Acquisition", "Diversity and Inclusion", "Data Analysis", "Communication", "Program Coordination"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Paid parental leave, comprehensive medical coverage, emotional and mental health support programs, and compensation packages that let you share in Snap’s long-term success!", "remoteWork": "Default Together Policy at Snap: At Snap Inc. we believe that being together in person helps us build our culture faster, reinforce our values, and serve our community, customers and partners better through dynamic collaboration. To reflect this, we practice a “default together” approach and expect our team members to work in an office 4+ days per week.", "url": "https://www.linkedin.com/jobs/view/3997026365"}