{"jobTitle": "Production Coordinator (Starshield)", "company": {"name": "SpaceX", "location": "Hawthorne, CA"}, "location": "Hawthorne, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "20.00 - 23.00/hour", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Aviation and Aerospace Component Manufacturing", "description": "SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Today SpaceX is actively developing the technologies to make this possible, with the ultimate goal of enabling human life on Mars.<br/><br/><strong>PRODUCTION COORDINATOR (STARSHIELD)<br/><br/></strong>The Production Coordinator is a linchpin position within our Starshield team. This role is responsible for serving as a liaison between all ancillary input and output organizations to ensure that components and assemblies flow smoothly through the production area to meet stringent deadlines and quality standards.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Monitor, track, and move parts as required through the production flow to ensure timely delivery to the next production location</li><li>Coordinate the physical movement of parts through receiving inspection, stock rooms, purchasing, production resources, or any applicable work center within SpaceX</li><li>Ensure parts are handled and protected properly and within SpaceX specifications</li><li>Coordinate off-site processing of parts to ensure on-time delivery as required</li><li>Work with the planning, procurement, engineering, and production teams to ensure MRP/ERP data is and remains clean and accurate</li><li>Assist with the resolution of incorrect system data which is driving inappropriate demand, schedules, or could result in general failure</li><li>Analyze available data and develop metrics as required to drive optimal results</li><li>Work with production personnel to ensure metric goals are understood</li><li>Update and utilize target management system to drive results as applicable</li><li>Work with production supervisors and managers to ensure all metrics driven action requirements are completed</li><li>Develop and maintain reports to highlight needs, deliverables, and constraints as required for internal and customer use</li><li>Communicate part status and estimated completion dates to leadership weekly</li><li>Assist production leadership and project teams with action item updates as required</li><li>Support logistics process through the innovative staging of workflow as required</li><li>Management of material certifications as required; prevent use of un-certified materials</li><li>Support production and inventory personnel with “return to stock” and inventory purge actions</li><li>Support purchase requisition creation for scheduled contract work as required</li><li>Organize and maintain the physical and electronic library for production related tooling and calibration database as required</li><li>Support projects or productivity development activities within assigned production cells</li><li>Support assigned production cells with work order management activities as required<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>High school diploma or equivalency certificate</li><li>1+ years of experience supporting administrative processes<br/><br/></li></ul><strong>Preferred Skills And Experience<br/><br/></strong><ul><li>Strong computer skills, familiar with the full suite of MS Office products</li><li>Bachelor’s degree</li><li>Experience organizing files and documents</li><li>Knowledge of MRP/ERP systems</li><li>Experience in aerospace, automotive, semiconductor, or electronic manufacturing environments</li><li>SQL and Tableau experience</li><li>APICS certification<br/><br/></li></ul><strong>Additional Requirements<br/><br/></strong><ul><li>Must be willing to work all shifts, overtime, and/or weekends as needed. Nominal hours - 1st shift: 5:00 AM - 2:30 PM</li><li>Able to lift up to 25 lbs unassisted</li><li>Able to stand for extended periods – 8 hours min<br/><br/></li></ul><strong>Compensation And Benefits<br/><br/></strong>Pay range:<br/><br/><ul><li>Production Coordinator/Level 1: $20.00 - $23.00/hour </li><li>Production Coordinator/Level 2: $22.50 - $27.00/hour </li><li>Production Coordinator/Level 3: $25.00 - $30.00/hour <br/><br/></li></ul>Your actual level and base salary will be determined on a case-by-case basis and may vary based on the following considerations: job-related knowledge and skills, education, and experience.<br/><br/>Base salary is just one part of your total rewards package at SpaceX. You may also be eligible for long-term incentives, in the form of company stock, stock options, or long-term cash awards, as well as potential discretionary bonuses and the ability to purchase additional stock at a discount through an Employee Stock Purchase Plan. You will also receive access to comprehensive medical, vision, and dental coverage, access to a 401(k) retirement plan, short and long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation and will be eligible for 10 or more paid holidays per year.<br/><br/><strong>Itar Requirements<br/><br/></strong><ul><li>To conform to U.S. Government export regulations, applicant must be a (i) U.S. citizen or national, (ii) U.S. lawful, permanent resident (aka green card holder), (iii) Refugee under 8 U.S.C.</li><li>1157, or (iv) Asylee under 8 U.S.C.</li><li>1158, or be eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR here. <br/><br/></li></ul>SpaceX is an Equal Opportunity Employer; employment with SpaceX is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.<br/><br/>Applicants wishing to view a copy of SpaceX’s Affirmative Action Plan for veterans and individuals with disabilities, or applicants requiring reasonable accommodation to the application/interview process should notify the Human Resources Department at (310) 363-6000.", "responsibilities": "The Production Coordinator is a linchpin position within our Starshield team. This role is responsible for serving as a liaison between all ancillary input and output organizations to ensure that components and assemblies flow smoothly through the production area to meet stringent deadlines and quality standards.", "qualifications": {"required": "High school diploma or equivalency certificate", "preferred": "Strong computer skills, familiar with the full suite of MS Office products, Bachelor’s degree, Experience organizing files and documents, Knowledge of MRP/ERP systems, Experience in aerospace, automotive, semiconductor, or electronic manufacturing environments, SQL and Tableau experience, APICS certification"}, "skills": ["MRP/ERP", "MS Office", "SQL", "Tableau", "APICS"], "postedDate": "1 week ago", "benefits": "Base salary is just one part of your total rewards package at SpaceX. You may also be eligible for long-term incentives, in the form of company stock, stock options, or long-term cash awards, as well as potential discretionary bonuses and the ability to purchase additional stock at a discount through an Employee Stock Purchase Plan. You will also receive access to comprehensive medical, vision, and dental coverage, access to a 401(k) retirement plan, short and long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation and will be eligible for 10 or more paid holidays per year.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997314191"}