{"jobTitle": "Operations Supervisor", "company": {"name": "Univar Solutions", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "87,200.00/yr - $130,800.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Human Resources", "description": "<strong>A Place Where People Matter. <br/><br/></strong>Start your career journey with Univar Solutions! Here you can make an impact on the world around you and accelerate your career in areas that energize and excite you.<br/><br/>Our Operations Supervisor is responsible for the efficient day-to-day operations of the branch, including supervision of the employees, facility, budget and driving operations related activities in a large facility.<br/><br/><strong>WHAT YOU'LL DO:<br/><br/></strong><ul><li>Facilitating compliance to corporate health, safety, and environmental affairs policies, including completion of all required training, documentation and record keeping.</li><li>Supporting sales efforts consistent with corporate and regulatory compliance, health, safety and environmental standards.</li><li>Leading the emergency response team in the branch.</li><li>Supporting branch health and safety program and conducts safety audits in conjunction with Branch Operations Manager.</li><li>Conducting daily pre-shift meetings and communicates expectations to employees.</li><li>Creating a positive work environment and cultivates employee ownership of branch operations and performance.</li><li>Participating in inspections from outside agencies (DOT,EPA,FDA,DHS).</li><li>Direct supervision for Material Handlers.<br/><br/><br/></li></ul><strong>WHAT YOU'LL NEED:<br/><br/></strong><ul><li>High School Diploma/GED required</li><li>Bachelor’s degree preferred or equivalent experience</li><li>3 - 5 years of proven experience in operations</li><li>Knowledge of chemical distribution facility operation</li><li>SAP or experience with similar ERP systems is beneficial</li><li>Working knowledge of Microsoft Office applications; Excel and Word<br/><br/><br/></li></ul><strong>WHERE YOU'LL WORK:<br/><br/></strong><strong>Our location:</strong> 2600 Garfield Ave., Commerce, CA 90040-2608<br/><br/>The salary range for this position is $87,200 - $130,800. The specific salary offered to a candidate may be influenced by a variety of factors including the candidate’s relevant experience, education, training, certifications, qualifications, and work location. In addition, this position is eligible for incentive pay. Available employee benefits include health, vision, and dental. We also provide 401k matching for retirement and paid time off.<br/><br/>Univar Solutions is a leading, global distributor of chemicals and ingredients <strong>essential to the safety, health, and wellbeing of our daily lives</strong> from life-saving medicines and vitamins to hand sanitizers and industrial materials used for cleaning, construction, and more. Our global team of more than <strong>10,000 employees </strong>support our vision to redefine distribution and be the most valued chemical and ingredient distributor on the planet!<br/><br/>We offer a <strong>Total Rewards package </strong>that includes market aligned pay and incentives as well as a diverse benefits offering to<strong> support our employees’ physical, emotional, and financial wellbeing.<br/><br/></strong>Univar Solutions supports <strong>sustainable solutions </strong>for the world around us so that we can do our part to<strong> help keep our communities healthy, fed, clean, and safe! <br/><br/></strong><strong>We are committed to a diverse workforce and a culture of inclusion.</strong> Together, we are building a culture that acknowledges the unique experiences, perspectives and expertise of individuals and provides the development and growth opportunities to empower us to redefine our industry.<br/><br/>Univar Solutions is an equal opportunity employer. All qualified applicants will receive consideration for employment and will not be discriminated against based on their race, gender, sexual orientation, gender identity, religion, national origin, age, disability, veteran status, or other protected classification.<br/><br/><em>Univar Solutions does not accept unsolicited resumes from recruiters, employment agencies, or staffing firms (collectively Recruiting Firms). Recruiting Firms must enter into a Master Services Agreement (MSA) with Univar Solutions prior to submitting any information relating to a potential candidate. All searches must be initiated by Univar Solutions' Talent Acquisition team and candidates must be submitted via Applicant Tracking System (ATS) by approved vendors who have been expressly requested to make a submission for a specific job opening. No placement fees will be paid to any firm unless the aforementioned conditions have been met. Contacting our hiring managers directly is prohibited.</em>", "responsibilities": "Our Operations Supervisor is responsible for the efficient day-to-day operations of the branch, including supervision of the employees, facility, budget and driving operations related activities in a large facility.", "qualifications": {"required": "High School Diploma/GED required", "preferred": "Bachelor’s degree preferred or equivalent experience"}, "skills": ["SAP", "Microsoft Office", "Excel", "Word"], "postedDate": "2 weeks ago", "benefits": "The salary range for this position is $87,200 - $130,800. The specific salary offered to a candidate may be influenced by a variety of factors including the candidate’s relevant experience, education, training, certifications, qualifications, and work location. In addition, this position is eligible for incentive pay. Available employee benefits include health, vision, and dental. We also provide 401k matching for retirement and paid time off.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997650991"}