{"jobTitle": "Experiential Marketing Event Manager", "company": {"name": "Xsolla", "location": "Los Angeles, CA", "industry": "Computer Games"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "80,000 - 100,000", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Computer Games", "description": "We are seeking an experienced Global Experiential Marketing Event Coordinator  to join our global marketing team here at Xsolla. You will be working closely with our Global Director of Experiential Marketing, Global Experiential Marketing Event Manager, and our Regional Marketing Managers to assist with event research, logistics planning, administration and onsite delivery of Xsolla’s series of 80+ global events annually.<br/><br/>A large part of the role is logistics-based, such as implementing deliverables of our sponsorship packages at the events that we partner with. In addition, you will be sourcing international venues and vendors, obtaining quotes for services for booth build, production, branding, swag and merchandise etc. Experience working on a global level is essential with an understanding of regional nuances and budgets. <br/><br/>In this role, you will be collaborating with internal teams on event marketing activities such as social media campaigns, creation of landing pages, email campaign planning, creation of graphics, and branding.<br/><br/>The ideal candidate will have experience working in Games, Tech or Software industries and have a good understanding and experience in delivering B2B Conferences, trade shows, networking events and speaking engagements. These are predominately large-scale LIVE events. <br/><br/>The chosen candidate will be based out of our Los Angeles, CA or Raleigh, NC offices (hybrid, remote, or flexible schedules available.) <br/><br/>This is a global role and working within various time zones to match current projects is required.<br/><br/>Responsibilities<br/><br/><ul><li>Reporting to the Global Director of Experiential Marketing you will undertake tasks to support the global experiential marketing. Additionally, you will have your own key areas of responsibility and events on which you will take the lead. Your tasks will include but are not limited to: </li><li>Venue searches in all locations, including negotiating venue hire charges, food and beverage costs and other associated event items</li><li>Vendor sourcing, comparing costs and negotiating hire charges for event equipment and hire of services, specifically booth production companies, AV companies, event rentals, video and photography, and merchandise producers</li><li>Updating event budgets regularly, keeping diligent records of correct currency of each event</li><li>Research the best hotels and prices for staff attending events; including booking hotel blocks in conjunction with our venue and hotel sourcing agency of choice</li><li>Setting up new events on the Xsolla events page, including adding copy about the event, venue information, event logos</li><li>Setting up and managing networking events on our event registration and marketing platform Splash. This includes but is not limited to adding copy about the event, graphics, building the registration form, creating email templates and testing</li><li>Working with our Integrated Marketing Manager to create and plan our email marketing campaigns for events, including drafting copy, adding event information, logos, and requesting graphics where required</li><li>Working with our Social Media Manager to create and plan social media campaigns for our events; including drafting copy, adding event information, logos, helping to draft messaging and requesting graphics where requiredLiaising with event organizers to research new events and review sponsorship options suitable for the company. Duties will include confirming sponsorship packages, working with the organizer on all aspects of the planning, and delivery of event to fulfill deliverables</li><li>Coordinating speaking sessions with our Business Development team, product team and creative team to ensure session content is prepared, reviewed, and approved proactively for speaking engagements and events</li><li>Regularly updating the event roadmap tracker with sponsor information received, dates, links to the events</li><li>Placing Jira ticket requests with our in-house creative team and adding detailed information for each item in the brief section along with deadlines</li><li>Working with our creative team on a regular basis to ensure all event materials are completed, approved and then sent to vendors or event organizers to fulfill</li><li>Create opportunities to gather, capture and validate new business leads through each event. Ensure leads can be generated if lead scanning is not available at events.</li><li>Coordinating across the organization with multiple teams to ensure they have all the necessary event information, briefing documents, and are aware of the meeting booking process at events </li><li>Creating detailed event plans for events – following the template already in use, add all necessary information for the staff attending the event. Setting up pre-event briefings with the team attending the event.</li><li>Creating detailed video and photography briefs for our vendors and overseeing the production of highlights reels and VOD of our speaking sessions</li><li>Liaising with all event vendors before the event to ensure a smooth event set up</li><li>At events, deliver upon all aspects of event activations between customers and the company, and ensure a positive customer service experience</li><li>Ensuring all event leads generated at the event are processed by our CRM team in a timely manner and that all stats and data on meetings are recorded from each event in our template</li><li>Post-event follow-up with attending staff – sending out an internal feedback survey, gathering photos, branding on emails, banners, websites from our events for the post event report</li><li>Assisting with any ad hoc tasks required by the Global Experiential Marketing team </li><li>Communicating promptly to all messages and requests in all chat spaces and on Email where possible<br/><br/><br/></li></ul>Requirements<br/><br/><ul><li>Excellent communication skills (written and verbal)</li><li>Solid command of the english language</li><li>Strong live event management delivery skills</li><li>Excellent administration skills and ability to update documents on a regular basis</li><li>Demonstrable expertise in budgeting and managing projects to tight deadlines</li><li>Understand the need for timely information, able to meet deadlines and manage own workload</li><li>Strong work ethic and exceptional attention to quality and detail is essential</li><li>Ability to work with internal teams to clearly communicate and track project deliverables</li><li>Ability to solve problems and make decisions quickly and efficiently </li><li>Creativity and the ability to think outside the box is a must, we are looking for someone who wants to push the boundaries, try new things and to elevate our experiences to the next level! </li><li>Ability to manage multiple projects through highly effective organizational skills</li><li>Ability to confidently communicate with vendors, organizers and our internal teams about the event plans</li><li>Experience working with Atlassian products such as Jira and Confluence, Google suite is beneficial </li><li>Ability to travel up to 35%<br/><br/><br/></li></ul>", "responsibilities": "Reporting to the Global Director of Experiential Marketing you will undertake tasks to support the global experiential marketing. Additionally, you will have your own key areas of responsibility and events on which you will take the lead. Your tasks will include but are not limited to:  Venue searches in all locations, including negotiating venue hire charges, food and beverage costs and other associated event items Vendor sourcing, comparing costs and negotiating hire charges for event equipment and hire of services, specifically booth production companies, AV companies, event rentals, video and photography, and merchandise producers Updating event budgets regularly, keeping diligent records of correct currency of each event Research the best hotels and prices for staff attending events; including booking hotel blocks in conjunction with our venue and hotel sourcing agency of choice Setting up new events on the Xsolla events page, including adding copy about the event, venue information, event logos Setting up and managing networking events on our event registration and marketing platform Splash. This includes but is not limited to adding copy about the event, graphics, building the registration form, creating email templates and testing Working with our Integrated Marketing Manager to create and plan our email marketing campaigns for events, including drafting copy, adding event information, logos, and requesting graphics where required Working with our Social Media Manager to create and plan social media campaigns for our events; including drafting copy, adding event information, logos, helping to draft messaging and requesting graphics where requiredLiaising with event organizers to research new events and review sponsorship options suitable for the company. Duties will include confirming sponsorship packages, working with the organizer on all aspects of the planning, and delivery of event to fulfill deliverables Coordinating speaking sessions with our Business Development team, product team and creative team to ensure session content is prepared, reviewed, and approved proactively for speaking engagements and events Regularly updating the event roadmap tracker with sponsor information received, dates, links to the events Placing Jira ticket requests with our in-house creative team and adding detailed information for each item in the brief section along with deadlines Working with our creative team on a regular basis to ensure all event materials are completed, approved and then sent to vendors or event organizers to fulfill Create opportunities to gather, capture and validate new business leads through each event. Ensure leads can be generated if lead scanning is not available at events. Coordinating across the organization with multiple teams to ensure they have all the necessary event information, briefing documents, and are aware of the meeting booking process at events  Creating detailed event plans for events – following the template already in use, add all necessary information for the staff attending the event. Setting up pre-event briefings with the team attending the event. Creating detailed video and photography briefs for our vendors and overseeing the production of highlights reels and VOD of our speaking sessions Liaising with all event vendors before the event to ensure a smooth event set up At events, deliver upon all aspects of event activations between customers and the company, and ensure a positive customer service experience Ensuring all event leads generated at the event are processed by our CRM team in a timely manner and that all stats and data on meetings are recorded from each event in our template Post-event follow-up with attending staff – sending out an internal feedback survey, gathering photos, branding on emails, banners, websites from our events for the post event report Assisting with any ad hoc tasks required by the Global Experiential Marketing team  Communicating promptly to all messages and requests in all chat spaces and on Email where possible<br/><br/><br/>", "qualifications": {"required": "Excellent communication skills (written and verbal) Solid command of the english language Strong live event management delivery skills Excellent administration skills and ability to update documents on a regular basis Demonstrable expertise in budgeting and managing projects to tight deadlines Understand the need for timely information, able to meet deadlines and manage own workload Strong work ethic and exceptional attention to quality and detail is essential Ability to work with internal teams to clearly communicate and track project deliverables Ability to solve problems and make decisions quickly and efficiently  Creativity and the ability to think outside the box is a must, we are looking for someone who wants to push the boundaries, try new things and to elevate our experiences to the next level!  Ability to manage multiple projects through highly effective organizational skills Ability to confidently communicate with vendors, organizers and our internal teams about the event plans Experience working with Atlassian products such as Jira and Confluence, Google suite is beneficial  Ability to travel up to 35%<br/><br/><br/>"}, "skills": ["Event Management", "Marketing", "Communication", "Budgeting", "Project Management", "Teamwork", "Problem Solving", "Creativity", "Organization", "Jira", "Confluence", "Google Suite"], "postedDate": "2 weeks ago", "benefits": "At Xsolla, we know it isn’t just about the paycheck. That’s why our Benefits Program is designed to meet and enhance our team’s physical, mental, and emotional well-being. Our Benefits Program includes 100% company-paid medical, dental, and vision plans for full-time employees AND their families! Additionally, disability and life insurance are company-paid. Chiropractic coverage and flexible spending accounts are there for you, should you need them. And our 401(k) retirement plan includes a company match to help you plan for the future.<br/><br/>Burnout is bad for people and bad for business. That’s why we offer unlimited Flexible Time Off and 14 paid holidays each year.<br/><br/>We are all about personal and professional growth! Every Xsolla employee has a customized career roadmap, curated by the employee alongside their manager, that helps align company goals with individualized personal goals. In an effort to foster your growth at Xsolla, we offer opportunities for in-house training, independent study, conference attendance, and higher education.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3997188642"}