{"jobTitle": "Data Science Analyst III / Office of Enterprise Data", "company": {"name": "Children's Hospital Los Angeles (CHLA)", "location": "Los Angeles, CA", "industry": "Hospitals and Health Care"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "USD $94,244 - USD $169,728", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Hospitals and Health Care", "description": "NATIONAL LEADERS IN PEDIATRIC CARE<br/><br/>Ranked among the top 10 pediatric hospitals in the nation, Children’s Hospital Los Angeles (CHLA) provides the best care for kids in California.<br/><br/>Here world-class experts in medicine, education and research work together to deliver family-centered care half a million times each year. From primary to complex critical care, more than 350 programs and services are offered, each one specially designed for children.<br/><br/>The CHLA of the future is brighter than can be imagined. Investments in technology, research and innovation will create care that is personal, convenient and empowering. Our scientists will work with clinical experts to take laboratory discoveries and create treatments that are a perfect match for every patient. And together, CHLA team members will turn health care into health transformation.<br/><br/>Join a hospital where the work you do will matter—to you, to your colleagues, and above all, to our patients and families. The work will be challenging, but always rewarding.<br/><br/>It’s Work That Matters.<br/><br/>Overview<br/><br/>Purpose Statement/Position Summary: <br/><br/>The Data Science Analyst III, under the direction and supervision of the Director of Analytics, will play a hands-on role in our Office of Enterprise Data (OED). The Data Science Analyst III is a senior-level analyst who independently collaborates with stakeholders across the organization to develop sophisticated analytics to provide information, insights and BI (Business Intelligence) solutions that contribute to sound strategic planning, decision-making, goal setting, and effective performance measurement. The Data Science Analyst III demonstrates an extremely advanced understanding of the healthcare domain, project management, technical data manipulation and analytic development, either BI or Machine Learning. These skills support CHLA’s mission to create hope and build healthier futures.<br/><br/>Minimum Qualifications/Work Experience<br/><br/><ul><li> Required: 8 years of experience in healthcare, including familiarity with hospital systems, diverse healthcare data sets (claims, EHR, clinical data, structured and unstructured data) and analytics, data management, and data visualization. Understanding of Medicaid programs and related health policy is a plus.</li><li> Able to demonstrate advanced analytical, problem-solving and decision-making skills, beyond a DSA II.</li><li> Able to demonstrate advanced data prep skills, beyond a DSA II, using scripting languages like Oracle PL/SQL, MS SQL, R, Python, etc.</li><li> Able to demonstrate advanced BI development skills, beyond a DSA II, using Tableau and/or PowerBI.</li><li> Understanding of and familiarity with Data Analytics platforms like Azure data lake, Azure Synapse, Azure Fabric, Oracle DB, SQL Server, etc</li><li> Demonstrated ability to be self-paced, self-motivated and flexible in a rapidly evolving environment.</li><li> Able to demonstrate strong verbal and written communication and interpersonal skills and able to effectively engage and influence diverse stakeholders at all levels of the organization with varying skill sets, beyond a DSA II.</li><li> Organized and detail-oriented, with proven ability to independently plan and execute projects, prioritize workload, meet deadlines, and manage more than one project at a time.</li><li> Proactive learner with initiative to learn new skills and apply this knowledge on the job.</li><li> Executes all job responsibilities and assignments promptly, reliably, honestly and ethically.</li><li> Proficiency with Microsoft Office Suite (Word, Excel, PowerPoint), including creating charts and graphs.<br/><br/></li></ul>Education/Licensure/Certification<br/><br/><ul><li> Required: Bachelor's degree from an accredited university in a relevant field (Public Health, Computer Science, Information Systems) or HS Diploma/GED plus 8 years of direct experience.</li><li> Preferred: Master’s degree preferred.<br/><br/></li></ul>Pay Scale Information<br/><br/>USD $94,244 - USD $169,728<br/><br/>CHLA values the contribution each Team Member brings to our organization. Final determination of a successful candidate’s starting pay will vary based on a number of factors, including, but not limited to education and experience within the job or the industry. The pay scale listed for this position is generally for candidates that meet the specified qualifications and requirements listed on this specific job description. Additional pay may be determined for those candidates that exceed these specified qualifications and requirements. We provide a competitive compensation package that recognizes your experience, credentials, and education alongside a robust benefits program to meet your needs. CHLA looks forward to introducing you to our world-class organization where we create hope and build healthier futures.<br/><br/>Children's Hospital Los Angeles (CHLA) is a leader in pediatric and adolescent health both here and across the globe. As a premier Magnet teaching hospital, you’ll find an environment that’s alive with learning, rooted in care and compassion, and home to thought leadership and unwavering support. CHLA is dedicated to creating hope and building healthier futures - for our patients, as well as for you and your career!<br/><br/>CHLA has been affiliated with the Keck School of Medicine of the University of Southern California since 1932.<br/><br/>At Children’s Hospital Los Angeles, our work matters. And so do each and every one of our valued team members. CHLA is an Equal Employment Opportunity employer. We consider qualified applicants for all positions without regard to race, color, religion, creed, national origin, sex, gender identity, age, physical or mental disability, sexual orientation, marital status, veteran or military status, genetic information or any other legally protected basis under federal, state or local laws, regulations or ordinances. We will also consider for employment qualified applicants with criminal history, in a manner consistent with the requirements of state and local laws, including the LA City Fair Chance Ordinance and SF Fair Chance Ordinance.<br/><br/>Qualified Applicants with disabilities are entitled to reasonable accommodation under the California Fair Employment and Housing Act and the Americans with Disabilities Act. Please contact CHLA Human Resources if you need assistance completing the application process.<br/><br/>Diversity inspires innovation. Our experiences, perspectives and backgrounds allow us to better serve our patients and create a strong community at CHLA.<br/><br/>Office of Enterprise Data", "responsibilities": "The Data Science Analyst III, under the direction and supervision of the Director of Analytics, will play a hands-on role in our Office of Enterprise Data (OED). The Data Science Analyst III is a senior-level analyst who independently collaborates with stakeholders across the organization to develop sophisticated analytics to provide information, insights and BI (Business Intelligence) solutions that contribute to sound strategic planning, decision-making, goal setting, and effective performance measurement. The Data Science Analyst III demonstrates an extremely advanced understanding of the healthcare domain, project management, technical data manipulation and analytic development, either BI or Machine Learning. These skills support CHLA’s mission to create hope and build healthier futures.", "qualifications": {"required": "8 years of experience in healthcare, including familiarity with hospital systems, diverse healthcare data sets (claims, EHR, clinical data, structured and unstructured data) and analytics, data management, and data visualization. Understanding of Medicaid programs and related health policy is a plus. Able to demonstrate advanced analytical, problem-solving and decision-making skills, beyond a DSA II. Able to demonstrate advanced data prep skills, beyond a DSA II, using scripting languages like Oracle PL/SQL, MS SQL, R, Python, etc. Able to demonstrate advanced BI development skills, beyond a DSA II, using Tableau and/or PowerBI. Understanding of and familiarity with Data Analytics platforms like Azure data lake, Azure Synapse, Azure Fabric, Oracle DB, SQL Server, etc Demonstrated ability to be self-paced, self-motivated and flexible in a rapidly evolving environment. Able to demonstrate strong verbal and written communication and interpersonal skills and able to effectively engage and influence diverse stakeholders at all levels of the organization with varying skill sets, beyond a DSA II. Organized and detail-oriented, with proven ability to independently plan and execute projects, prioritize workload, meet deadlines, and manage more than one project at a time. Proactive learner with initiative to learn new skills and apply this knowledge on the job. Executes all job responsibilities and assignments promptly, reliably, honestly and ethically. Proficiency with Microsoft Office Suite (Word, Excel, PowerPoint), including creating charts and graphs.", "preferred": "Master’s degree preferred."}, "skills": ["Healthcare", "Hospital Systems", "Data Sets", "Analytics", "Data Management", "Data Visualization", "Medicaid", "Health Policy", "Analytical Skills", "Problem Solving", "Decision Making", "Data Prep", "Scripting Languages", "Oracle PL/SQL", "MS SQL", "R", "Python", "BI Development", "Tableau", "PowerBI", "Data Analytics Platforms", "Azure Data Lake", "Azure Synapse", "Azure Fabric", "Oracle DB", "SQL Server", "Self-Paced", "Self-Motivated", "Flexible", "Communication", "Interpersonal Skills", "Stakeholder Engagement", "Influence", "Project Planning", "Project Execution", "Prioritization", "Deadlines", "Proactive Learning", "Microsoft Office Suite", "Word", "Excel", "PowerPoint", "Charts", "Graphs"], "postedDate": "1 week ago", "benefits": "CHLA values the contribution each Team Member brings to our organization. Final determination of a successful candidate’s starting pay will vary based on a number of factors, including, but not limited to education and experience within the job or the industry. The pay scale listed for this position is generally for candidates that meet the specified qualifications and requirements listed on this specific job description. Additional pay may be determined for those candidates that exceed these specified qualifications and requirements. We provide a competitive compensation package that recognizes your experience, credentials, and education alongside a robust benefits program to meet your needs. CHLA looks forward to introducing you to our world-class organization where we create hope and build healthier futures.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997356604"}