{"jobTitle": "Project Manager Assistant", "company": {"name": "Stantec", "industry": "Design Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$28.17/hr - $32.31/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Design Services", "description": "Stantec Buildings is on a mission to become the world’s leading integrated design practice. Our architects, engineers, interior designers, sustainability specialists, and technologists are passionate about the power of design. We take an innovative, collaborative approach to projects, sharing a common belief that sustainable design for the built environment can make the world a better place for future generations. Join us and design your place with Stantec.", "responsibilities": "Provides dedicated project and administrative support to multiple studio leaders and project managers. Assists with proposal writing process. Create project setup forms and project files. Assist Project Manager with maintaining current opportunities in Pipeline. Administering contracts from initialization to close-out. Responsible for tracking the status of proposals/contracts throughout approval process. Codes invoices, verify budgets on tasks and correspond with subconsultants on revisions. Work with Project Managers to keep project financials in order. Assists with inputting project Estimates to Complete (ETC) on Oracle PM Dashboard. Assist Office leader with project management compliance and internal project audits. Develops and edits specification documents, if necessary. Enters data and produces, analyzes, and distributes reports. Assists Project Managers with project finance documentation. Utilizes a variety of software programs to produce and manage deliverables. Partners with studio members to enter and track project schedules and deliverables. Assists with expense reporting. Schedules and facilitates meetings, travel, and events. Occasionally provides coverage for administrative staff assisting with staff inquiries and requests. Handles special projects in support of studio and BC objectives.", "qualifications": {"required": "Associate of Arts degree or higher in related field. 3-5 years’ experience in a professional office environment as an administrative professional or equivalent combination of education and experience. Familiarity with Newforma transfer and record-keeping software a plus.", "preferred": "Professional experience in the architecture/engineering/planning industry is preferred, but not required."}, "skills": ["Strong analytical and research skills", "Strong knowledge of business communication standards", "Strong detail orientation", "Understanding of project accounting principles", "Ability to operate standard office equipment", "Strong verbal and written communication skills", "Excellent interpersonal skills", "Working knowledge of Microsoft Office with expertise in Outlook, Word, and Excel"], "postedDate": "Aug 9, 2024", "applicationDeadline": "Not specified", "benefits": "Regular full-time and part-time employees have access to medical, dental, and vision plans, a wellness program, health saving accounts, flexible spending accounts, 401(k) plan, employee stock purchase program, life and accidental death & dismemberment (AD&D) insurance, short-term/long-term disability plans, emergency travel benefits, tuition reimbursement, professional membership fee coverage and paid family leave. Regular full-time and part-time employees will receive ten paid holidays in each calendar year. In addition, employees will be eligible to accrue vacation between 10 and 20 days per year and eligible for paid sick leave (and if more generous, in accordance with state and local law).", "remoteWork": "Primarily remote position, but will require periodic office attendance for meetings, trainings, or additional project requirements.", "url": "https://www.linkedin.com/jobs/view/3997650997"}