{"jobTitle": "Integrated Business Planning Data Analyst", "company": {"name": "Jazwares, LLC", "industry": "Manufacturing", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$66,000.00 - $70,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Manufacturing", "description": "At Jazwares, we believe an innovative idea can come from anywhere, and anyone. We work collaboratively to achieve our goals and we have fun doing it! Jazwares, a Berkshire Hathaway company, is a leading global toy manufacturer with an award-winning, robust portfolio of wholly owned and licensed brands. Founded in 1997, Jazwares celebrates imaginative play with a progressive focus on identifying new and relevant trends to transform into high-quality products for consumers of all ages. Jazwares engages consumers through innovative play experiences with popular brands such as Squishmallows, Pokémon, Star Wars, CoComelon, Fortnite, AEW, Adopt Me!, Hello Kitty, and many more. In addition to toys, offerings also include Metaverse gaming, costumes, and products for pets. Headquartered in Sunrise, Florida, Jazwares has offices worldwide and sells its products in over 100 countries.\n\nThe IBP Data Analyst position is needed to ensure the company is enabled to make smart business decisions with the reliable data from the new planning software (Arkieva). This role will conduct comprehensive data analysis by combining and analyzing data from various databases and sources and provide actionable recommendations for areas of improvement. This role will leverage the technical expertise and business knowledge to maximize the company's investment in the planning software and process improvement.", "responsibilities": "Perform data analysis from the planning software (Arkieva) and diagnose discrepancies or missing data elements connected to the ERP system and other sources. Act as the main point of contact to run complex data analysis, monitor both master and transactional data quality in Arkieva and suggest valuable suggestions with diagnostic reports. Partner with IT, Business Intelligence and other functional business owners to identify anomalies within a data set, researching underlying causes, and designing or recommending solutions to the teams. Support the Planning team to test system enhancements, data pipeline changes, other user requests to verify the results in the development environment before moving to the production environment. Work closely with the Sales & Planning team to gather market intelligence and sales insights to ensure the stat forecast model in Arkieva provides the acceptable results. Assume responsibility for the entire lifecycle of a data project, including planning, data ingestion, quality assurance and preparation for visualization or/and reports.", "qualifications": {"required": "Bachelor's degree or above in data science, data engineering or/and business management fields. Minimum 2 years of working experience in data analysis, statistics, data modeling related work after graduation. Passionate about the benefits of accurate and actionable data, driving consistency and enjoy partnering with others to accomplish the task. Solutions-oriented critical thinker. Deep technical knowledge and experience in data analysis, data quality management, and/or data governance. Strong influencer to help build and foster strong business relationships, leveraging those relationships to seek consensus amongst IT, Business Intelligence, Finance and Sales/Planning Teams. Ability to translate business issues and requirements into actionable plans, and to deliver against those plans. Have exceptional ability to make timely and effective decisions to meet fluid deadlines. Capable to work autonomously and make independent decisions to meet deliverables with minimal oversight. Passionate about continuous improvement with a strong desire to continue learning in order to stay relevant to business changes and industry trends. Able to effectively handle and maintain confidential information. Experience with Data analysis, reporting, and visualization tools such as Excel, Tableau, and Power BI. Proficient in SQL with a thorough understanding of data and systems' infrastructures. Can keep up with the fast-growing business pace, be brave for pressure and flexible for changes.", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Jazwares offers a full spectrum of benefits, including Medical, Prescription Drug, Dental, Vision, Flexible Spending Accounts, Insurance, Disability and Other Insurance Plans, Paid Time Off (including Sick Leave, Parental Leave and Vacation), Holidays, 401(k), and Short/Long Term Disability, in addition to other special perks reserved for our employees.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3997644585"}