{"jobTitle": "Strategic Planning Analyst", "company": {"name": "Ultimate Staffing", "location": "Fountain Valley, CA"}, "location": "Fountain Valley, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "26.00/hr - 38.00/hr", "currency": "USD"}, "jobFunction": "Supply Chain", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "We are searching for an experienced Strategic Planning Analyst for a 6-12 Month assignment. Awesome opportunity to work for a global, GROWING company. Onsite role in Fountain Valley, CA; Up to $38/hr.\n\nThe Strategic Planning Analyst will collect data, perform data analysis, and report on a variety of requests related to inventory management. This person will help support the attainment of KPI's, Purchase Orders, Fill Rate, Back Order lines, Claims Submission/Closure time, and inventory objectives. High level analysis will be performed utilizing Excel or Access and summarized for management. They will be responsible for developing and improving SOP's for claims processing.\n\n* Support team with reports and analysis related to inventory management on a regular basis and upon special requests\n* Research and resolve any issues related to supply department, recommend an action plan for aging claims and maintain accurate records for reporting all claims.\n* Create/Run queries in database based on requirements specified by management.\n* Participate in the design, testing, and implementation of short and long-term system enhancements.\n* Monitor KPIs and provide direction to meet objectives.\n\n**Education Requirements**\n\n* Bachelor's degree in Supply Chain, Business, or related field preferred or combination of education and related experience\n\n**Experience Requirements**\n\n* 3 years of directly-related experience in inventory management.\n* Supplier Claims Experience\n* Demonstrated ability to identify problems/issues, recommend appropriate solutions, and follow-up to ensure positive results is required.\n\n**Certifications**\n\n* APICS (American Production and Inventory Control Society) or other supply chain related certifications or affiliations a plus.\n\n**Skills**\n\n* Experience with inventory planning required\n* Intermediate to advanced experience with Microsoft Excel required\n* Intermediate to advanced experience with Microsoft Access\n* Experience with MS Word, PowerPoint or other SQL preferred\n* Strong analytical and creative problem-solving skills required.\n\n\n <br/>\n\n*All qualified applicants will receive consideration for employment without regard to race, color, national origin, age, ancestry, religion, sex, sexual orientation, gender identity, gender expression, marital status, disability, medical condition, genetic information, pregnancy, or military or veteran status. We consider all qualified applicants, including those with criminal histories, in a manner consistent with state and local laws, including the California Fair Chance Act, City of Los Angeles' Fair Chance Initiative for Hiring Ordinance, and Los Angeles County Fair Chance Ordinance. To the extent our customers require a background check for certain positions, the Company faces a significant risk to its business operations and business reputation unless a review of criminal history is conducted for those specific job positions.*", "responsibilities": "The Strategic Planning Analyst will collect data, perform data analysis, and report on a variety of requests related to inventory management. This person will help support the attainment of KPI's, Purchase Orders, Fill Rate, Back Order lines, Claims Submission/Closure time, and inventory objectives. High level analysis will be performed utilizing Excel or Access and summarized for management. They will be responsible for developing and improving SOP's for claims processing.", "qualifications": {"required": "3 years of directly-related experience in inventory management.\nSupplier Claims Experience\nDemonstrated ability to identify problems/issues, recommend appropriate solutions, and follow-up to ensure positive results is required.", "preferred": "Bachelor's degree in Supply Chain, Business, or related field preferred or combination of education and related experience\nAPICS (American Production and Inventory Control Society) or other supply chain related certifications or affiliations a plus."}, "skills": ["Inventory Management", "Supply Chain", "Microsoft Excel", "Microsoft Access", "MS Word", "PowerPoint", "SQL"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997543168"}