{"jobTitle": "Retail Warehouse Associate", "company": {"name": "Best Buy", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "As a Retail Warehouse Associate, you’ll be part of an energetic and efficient team that’s dedicated to delivering tech products from the store’s warehouse to our customers when, where and how they need them. You’ll retrieve and ship products, restock shelves and take inventory to ensure a great shopping experience. When the situation calls for it, you’ll also directly assist customers and collaborate with other employees on the sales floor.<br/><br/><strong>What You’ll Do<br/><br/></strong><ul><li>Unload trucks and record store inventory</li><li>Prepare products to be shipped to other stores and costumers’ homes</li><li>Stock shelves and organize merchandise displays to help customers see what’s possible and quickly purchase products</li><li>Follow established safety guidelines while operating store equipment</li><li>Replenish products daily to ensure they’re fully stocked on the sales floor</li><li>Process online orders and assist other employees with store pickup orders<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>Working and thriving in a fast-paced, team-oriented environment</li><li>Working a flexible schedule that matches your availability (weekends, nights, holidays, etc.)</li><li>Moving up to 100 pounds with or without accommodation<br/><br/></li></ul><strong>What’s In It For You<br/><br/></strong>We’re committed to helping our people thrive at work and at home. We offer generous benefits that address your total well-being and provide support as you need it, especially key moments in your life.<br/><br/><strong>Our Benefits Include<br/><br/></strong><ul><li>Competitive pay</li><li>Generous employee discount</li><li>Financial savings and retirement resources</li><li>Support for your physical and mental well-being<br/><br/></li></ul><strong>About Us<br/><br/></strong>As part of the Best Buy team, you’ll help us fulfill our purpose to enrich lives through technology. We bring that to life every day by humanizing and personalizing tech solutions for every stage of life — in our stores, online and in customers’ homes.<br/><br/>Our culture is built on deeply supporting and valuing our amazing employees who make it all possible. We’re committed to being a great place to work, where you can unlock unique career possibilities. Above all, we aim to provide a place where you can bring your full, authentic self to work now and into the future. Tomorrow works here.™<br/><br/>Best Buy is an equal opportunity employer.<br/><br/><strong>Application deadline: </strong>Minimum of 5 days from the posting date. You can find that date above the job title at the top of the page.<br/><br/>PandoLogic. Keywords: Warehouse Worker, Location: Torrance, CA - 90505", "responsibilities": "As a Retail Warehouse Associate, you’ll be part of an energetic and efficient team that’s dedicated to delivering tech products from the store’s warehouse to our customers when, where and how they need them. You’ll retrieve and ship products, restock shelves and take inventory to ensure a great shopping experience. When the situation calls for it, you’ll also directly assist customers and collaborate with other employees on the sales floor.<br/><br/><strong>What You’ll Do<br/><br/></strong><ul><li>Unload trucks and record store inventory</li><li>Prepare products to be shipped to other stores and costumers’ homes</li><li>Stock shelves and organize merchandise displays to help customers see what’s possible and quickly purchase products</li><li>Follow established safety guidelines while operating store equipment</li><li>Replenish products daily to ensure they’re fully stocked on the sales floor</li><li>Process online orders and assist other employees with store pickup orders<br/><br/></li></ul>", "qualifications": {"required": "Working and thriving in a fast-paced, team-oriented environment, Working a flexible schedule that matches your availability (weekends, nights, holidays, etc.), Moving up to 100 pounds with or without accommodation"}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Minimum of 5 days from the posting date. You can find that date above the job title at the top of the page.", "benefits": "Competitive pay, Generous employee discount, Financial savings and retirement resources, Support for your physical and mental well-being", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997186141"}