{"jobTitle": "Quality Assurance Supervisor - Food Manufacturing", "company": {"name": "ModernHR, Inc.", "location": "Carson, CA"}, "location": "Carson, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Quality Assurance", "industry": "Human Resources Services", "description": "In 1987, Kathy Taggares founded KT’s Kitchens, which rapidly grew into one of the largest contract manufacturing and private label frozen pizza companies in the country. Today, its 120,000 square foot USDA facility produces frozen pizzas for every class of trade – retail grocers, food service, and contract manufacturing. We pride ourselves to stay on the cutting edge of the pizza world to serve all of your needs!<br/><br/>We are looking for a skilled <strong>Quality Assurance Supervisor</strong> to join our team. The <strong>Quality Assurance Supervisor</strong> has the primary responsibility for supervising the QA/QC employees to confirm that all food safety standards are met. The QA Supervisor roles impact all the major operations in the facility by working with all department supervisors and managers to successfully produce a safe, good quality product.<br/><br/><strong>Duties<br/><br/></strong><ul><li>Confirm that all employees are following GMP, HACCP, USDA, and FDA standards. </li><li>Oversee all functions of QA and QC. </li><li>Oversee QA Leads and all QA technicians to assure they are performing their job duties accordingly. </li><li>Ensure that all company food safety and quality assurance procedures are always followed and documented correctly (HACCP, Listeria, water potability, Calibration, Temperature, etc). </li><li>Oversee the traceability and record keeping of all areas in production, to make sure that all items are being documented correctly. </li><li>Review, sign off and file paperwork for each production run. </li><li>Conduct facility food safety and GMP self-audits. </li><li>Conduct quarterly Glass and Hard Plastic inspections and oversee the corrections necessary. </li><li>Communicate with other departments to ensure any quality issue is corrected and ensure products made meet all regulatory and company standards. </li><li>Act as the company liaison to the USDA and respond to Non-Compliance Reports. </li><li>Work with Plant Manager to develop and provide training for food safety and quality requirements. </li><li>Work with Plant Manager on special projects to improve the overall performance of the company </li><li>Participate in 3rd Party Audits and work with Plant Manager on any Corrective Actions. </li><li>Other duties as assigned.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Must have working knowledge of how to identify, prioritize and address problems using appropriate tools and techniques that eliminate reoccurrence and must demonstrate initiative and drive to make improvements to the quality processes. </li><li>Experience as quality Supervisor/lead in food manufacturing. </li><li>AA/BS in related field highly preferred. </li><li>Bilingual in English / Spanish is required. </li><li>Knowledge of HACCP, cGMP’s, USDA, SOP, SSOP’s and GFSI Standards. </li><li>HACCP, BRC, and PCQI Certified </li><li>Must possess strong computer skills, including MS Office and Excel. </li><li>Must be a good team player capable of working within a highly effective team; responsible, supportive, and supportive communicator.</li></ul>", "responsibilities": "The <strong>Quality Assurance Supervisor</strong> has the primary responsibility for supervising the QA/QC employees to confirm that all food safety standards are met. The QA Supervisor roles impact all the major operations in the facility by working with all department supervisors and managers to successfully produce a safe, good quality product.", "qualifications": {"required": "Must have working knowledge of how to identify, prioritize and address problems using appropriate tools and techniques that eliminate reoccurrence and must demonstrate initiative and drive to make improvements to the quality processes. Experience as quality Supervisor/lead in food manufacturing. Bilingual in English / Spanish is required. Knowledge of HACCP, cGMP’s, USDA, SOP, SSOP’s and GFSI Standards. Must possess strong computer skills, including MS Office and Excel. Must be a good team player capable of working within a highly effective team; responsible, supportive, and supportive communicator.", "preferred": "AA/BS in related field highly preferred. HACCP, BRC, and PCQI Certified"}, "skills": ["HACCP", "GMP", "USDA", "FDA", "QA", "QC", "Food Safety", "Quality Assurance", "Traceability", "Record Keeping", "Auditing", "Training", "Problem Solving", "MS Office", "Excel", "Teamwork", "Communication"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997398185"}