{"jobTitle": "Sr. Business Systems Analyst (BSA)", "company": {"name": "ShiftCode Analytics, Inc.", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting", "description": "Local Only.<br/><br/>We would strongly prefer candidates who are LOCAL to the Long Beach, CA area. A VIDEO interview will be required and the selected candidate will work in a hybrid manner, with at least 2 days per week in the Long Beach office .<br/><br/>We need a Sr. Business Systems Analyst (BSA) for a 9+ month contract for a client in Long Beach, CA.<br/><br/>The client is implementing new systems in domains such as Disaster Recovery, IT Asset Management and Cybersecurity .<br/><br/>This new BSA resource MUST live in southern CA as he or she will need to be onsite in Long Beach part-time .<br/><br/>Primary responsibility will be performing as a senior business analyst and test lead under the direction of a senior project manager. Should be highly skilled in all aspects of business process analysis, Business/system requirements analysis, user support, user documentation, testing, and training.<br/><br/><strong>Essential Duties<br/><br/></strong><ul><li> Assist and support senior project manager and business lead as needed</li><li> Represent the Department at working sessions, document business requirements</li><li> Identify, document, and communicate risks, issues, and status to project team</li><li> Document and organize test scenarios elicited from IT SMEs</li><li> Perform functional testing</li><li> Lead User Acceptance Testing and track test results</li><li> Lead functional issue resolution within project team</li><li> Create user training materials; lead user training sessions</li><li> Support users and system after go-live<br/><br/></li></ul><strong>Required Knowledge<br/><br/></strong><ul><li> Experienced with translating business requirements to system requirements</li><li> Functional testing experience including test scenario creation and testing of large complex systems</li><li> Understanding of software development life cycle processes</li><li> Experience creating user materials and leading user training sessions</li><li> Experience working on an IT system implementation team</li><li> Ability to work effectively both independently and as part of a team</li><li> Exceptional verbal, writing and presentation skills at all levels of the organization</li><li> Proficient with Outlook, Word, Excel, PowerPoint, Visio<br/><br/></li></ul><strong>Required Education And Experience<br/><br/></strong><ul><li> Bachelor's Degree</li><li> Functional Testing Experience: Test scenario creation and testing of large complex systems</li><li> Experience with at least one successful full lifecycle system implementation</li><li> 7+ years of overall IT experience</li><li> Public Sector experience will be very helpful</li></ul>", "postedDate": "1 week ago", "skills": ["Business Process Analysis", "Business Requirements", "User Support", "User Documentation", "Testing", "Training", "Functional Testing", "Software Development Life Cycle", "User Acceptance Testing", "Issue Resolution", "User Training Materials", "Outlook", "Word", "Excel", "PowerPoint", "Visio"], "url": "https://www.linkedin.com/jobs/view/3997928217"}