{"jobTitle": "Senior Manager of Special Projects, Ruggable X", "company": {"name": "Ruggable", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management and Information Technology", "industry": "Retail", "description": "<strong>About Ruggable:<br/><br/></strong>Ruggable is a leading direct-to-consumer e-commerce brand based in Los Angeles, California with an extraordinary track record of high, profitable growth. We pride ourselves on having an extremely loyal customer base and a talented team made up of genuinely caring people who take action and deliver results. We are venture-backed and own a patented washable rug design that's disrupting the home décor industry. Our mission is to empower our customers to live vibrantly with beautiful products that don't compromise on function. If you're passionate about consumer products, e-commerce, and high-growth start-ups, keep reading!<br/><br/>Job Summary:<br/><br/>RuggableX is Ruggable’s partnerships &amp; licensing program - the makers of the amazing collaborations you see with Jonathan Adler, Justina Blakeney, Architectural Digest, goop, Morris &amp; Co, Iris Apfel, The Hiltons, and more. We’ve skyrocketed our growth in recent years and are looking for a rockstar Manager / Senior Manager of Partnerships &amp; Licensing to help grow the business and ensure we maintain a stellar relationship with our partners over time. This role is highly cross-functional, collaborative, and strategic. We’re looking for strong strategic, big picture thinkers who are excellent both at developing and selling a vision and being highly detail-oriented to ensure flawless execution. The right person balances systematic thinking, data-driven reasoning, and scrappy tenacity with a passion and eye for delighting consumers - and ideally has a creative intuition as well. It is a unique opportunity to operate at scale, with the speed and agility of a small start-up. You will report to the VP of Strategy and Business Development and work closely with multiple stakeholders, including design, creative, performance marketing, marketing operations, and legal. You will be a foundational, key member of this business unit as it continues its rocketship growth and be a trusted, key “right hand person” to the unit’s leadership.<br/><br/>What You’ll Do:<br/><br/><ul><li>Build out &amp; evaluate partnership pipeline across categories, including forecasting partnership revenue potential</li><li>Own partner outreach and drive proposals, negotiations, and general communication strategy</li><li>Manage partner onboarding &amp; account administration</li><li>Partner with internal cross-functional stakeholders to ensure flawless execution</li><li>Support post-launch account and partner management to support strong ongoing relationships, including business reviews and planning<br/><br/></li></ul>What You’ll Need to Have:<br/><br/>Required:<br/><br/><ul><li>Ability to both “sell” to potential partners and negotiate effectively, thinking quickly on your feet</li><li>Strong business acumen and data analytics capabilities</li><li>Must be a poised, professional communicator</li><li>Extremely detail-oriented</li><li>Experience leading high stakes marketing projects as a mid-level member of a management consulting firm, or have comparable years of experience in industry focused on cross-brand partnerships, licensing, and/or sales</li><li>Must possess strong leadership experience or demonstrate clear leadership potential</li><li>Experience building clear, high impact materials (i.e. presentations)<br/><br/></li></ul>Preferred:<br/><br/><ul><li>Familiarity and comfort with partnership and licensing contracts is a plus</li><li>Ideally you have some experience as a creative, or deep knowledge of the creative design process<br/><br/></li></ul>Compensation:<br/><br/><ul><li>$100-120k per year base salary</li><li>An annual bonus percentage that varies based on level of role</li><li>Employer matching (up to 3% of base salary) for company sponsored 401K plan<br/><br/></li></ul>At Ruggable, we offer competitive compensation and benefits packages. Ruggable is an Equal Employment Opportunity employer. We proudly recruit and hire a diverse workforce and are committed to creating an inclusive environment for all employees.<br/><br/><em>If you are based in California, we encourage you to read this important information for California residents </em>linked here.<br/><br/><strong>To all recruitment agencies:</strong> Ruggable does not accept unsolicited agency resumes. Please do not forward resumes to our jobs alias, Ruggable employees or any other company destination. Ruggable is not responsible for any fees related to unsolicited resumes.", "responsibilities": "<ul><li>Build out &amp; evaluate partnership pipeline across categories, including forecasting partnership revenue potential</li><li>Own partner outreach and drive proposals, negotiations, and general communication strategy</li><li>Manage partner onboarding &amp; account administration</li><li>Partner with internal cross-functional stakeholders to ensure flawless execution</li><li>Support post-launch account and partner management to support strong ongoing relationships, including business reviews and planning<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Ability to both “sell” to potential partners and negotiate effectively, thinking quickly on your feet</li><li>Strong business acumen and data analytics capabilities</li><li>Must be a poised, professional communicator</li><li>Extremely detail-oriented</li><li>Experience leading high stakes marketing projects as a mid-level member of a management consulting firm, or have comparable years of experience in industry focused on cross-brand partnerships, licensing, and/or sales</li><li>Must possess strong leadership experience or demonstrate clear leadership potential</li><li>Experience building clear, high impact materials (i.e. presentations)<br/><br/></li></ul>", "preferred": "<ul><li>Familiarity and comfort with partnership and licensing contracts is a plus</li><li>Ideally you have some experience as a creative, or deep knowledge of the creative design process<br/><br/></li></ul>"}, "skills": ["Partnerships", "Licensing", "Sales", "Marketing", "Business Development", "Communication", "Negotiation", "Leadership", "Project Management", "Data Analytics"], "postedDate": "2 weeks ago", "benefits": "At Ruggable, we offer competitive compensation and benefits packages.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997696711"}