{"jobTitle": "Program Manager / Bioethics, Biodiscovery", "company": {"name": "Children's Hospital Los Angeles (CHLA)", "industry": "Hospitals and Health Care", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$76,128.00 - $137,030.00", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Hospitals and Health Care", "description": "NATIONAL LEADERS IN PEDIATRIC CARE\n\nRanked among the top 10 pediatric hospitals in the nation, Children’s Hospital Los Angeles (CHLA) provides the best care for kids in California. Here world-class experts in medicine, education and research work together to deliver family-centered care half a million times each year. From primary to complex critical care, more than 350 programs and services are offered, each one specially designed for children. The CHLA of the future is brighter than can be imagined. Investments in technology, research and innovation will create care that is personal, convenient and empowering. Our scientists will work with clinical experts to take laboratory discoveries and create treatments that are a perfect match for every patient. And together, CHLA team members will turn health care into health transformation. Join a hospital where the work you do will matter—to you, to your colleagues, and above all, to our patients and families. The work will be challenging, but always rewarding. \n\nIt’s Work That Matters.\n\nOverview\n\nPurpose Statement/Position Summary: The Program Manager will provide support to (1) the Biodiscovery Core (BDC) and other key initiatives at The Saban Research Institute and (2) the Center for Bioethics at CHLA. The program manager will work with the scientific leadership team of the Biodiscovery Core to oversee the project. The project’s goal is to establish and maintain an institutional biobank consisting of biospecimens from prospectively consented CHLA patients and family members, along with clinical and genome sequencing data. The program manager’s responsibilities will include: (a) working with faculty leads to oversee participant recruitment, (b) developing and maintaining a community advisory board for the BDC; and (c) supporting other initiatives at The Saban Research Institute (CHLA) as time permits, and at the discretion of The Saban’s Chief Scientific Officer. (2) Working under the direction of the Director of CHLA’s Center for Bioethics, the Program Manager will lead implementation of several key elements of the Center’s strategic plan, including: coordinating ethics education for multiple groups of learners throughout the hospital; supporting ethics policy development, practice improvement, and compliance; and supporting initiatives to engage diverse communities and to advance health equity, including efforts to ensure more equitable access to genomic medicine for diverse patient populations.", "responsibilities": "The program manager will work with the scientific leadership team of the Biodiscovery Core to oversee the project. The project’s goal is to establish and maintain an institutional biobank consisting of biospecimens from prospectively consented CHLA patients and family members, along with clinical and genome sequencing data. The program manager’s responsibilities will include: (a) working with faculty leads to oversee participant recruitment, (b) developing and maintaining a community advisory board for the BDC; and (c) supporting other initiatives at The Saban Research Institute (CHLA) as time permits, and at the discretion of The Saban’s Chief Scientific Officer. (2) Working under the direction of the Director of CHLA’s Center for Bioethics, the Program Manager will lead implementation of several key elements of the Center’s strategic plan, including: coordinating ethics education for multiple groups of learners throughout the hospital; supporting ethics policy development, practice improvement, and compliance; and supporting initiatives to engage diverse communities and to advance health equity, including efforts to ensure more equitable access to genomic medicine for diverse patient populations.", "qualifications": {"required": "6+ years’ experience managing multiple parallel projects with research and administrative components, including generating verbal and written communications.", "preferred": "Experience in community engagement and collaborative partnerships between academic medical centers and community organizations strongly preferred. Fluency in both English and Spanish preferred."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "CHLA values the contribution each Team Member brings to our organization. Final determination of a successful candidate’s starting pay will vary based on a number of factors, including, but not limited to education and experience within the job or the industry. The pay scale listed for this position is generally for candidates that meet the specified qualifications and requirements listed on this specific job description. Additional pay may be determined for those candidates that exceed these specified qualifications and requirements. We provide a competitive compensation package that recognizes your experience, credentials, and education alongside a robust benefits program to meet your needs. CHLA looks forward to introducing you to our world-class organization where we create hope and build healthier futures.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3997086696"}