{"jobTitle": "Concert & Artist Administrative Assistant - Remote | WFH", "company": {"name": "Get It Recruit - Hospitality", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Human Resources Services", "description": "Job Description: Western Region Administrative Assistant<br/><br/><strong>Position Summary<br/><br/></strong>We are seeking a dedicated and organized Western Region Administrative Assistant to join our dynamic team based in Los Angeles. Reporting directly to the Senior Manager, you will play a crucial role in the day-to-day operations of our Concert &amp; Artist (C&amp;A) markets across major cities such as LA, San Diego, San Francisco, Portland, Seattle, Scottsdale, Miami, Denver, and Chicago, with potential for expansion to additional American cities.<br/><br/><strong>Main Responsibilities<br/><br/></strong><ul><li> **Event Coordination and Logistics:**</li><li> Coordinate and confirm event logistics with production staff.</li><li> Confirm bookings with movers and tuners for new and recurring C&amp;A orders, under the guidance of the Senior Manager.</li><li> **Financial Management:**</li><li> Process customer payments, including receiving and depositing checks, credit card payments, and wire transactions.</li><li> Post approved rental sales invoices in the company's ERP system.</li><li> Follow up on delinquent customer accounts to maintain a clean accounts receivable report.</li><li> **Vendor Management:**</li><li> Organize and submit approved vendor invoices to the accounting department.</li><li> Communicate with vendors regarding payment status updates.</li><li> **Inventory and Maintenance:**</li><li> Maintain up-to-date maintenance records for over 45 pianos in the western region C&amp;A inventory pool.</li><li> Log work performed and technician recommendations for required maintenance.</li><li> Prepare requisitions for replacement supplies, parts, and materials.</li><li> **Marketing and Social Media:**</li><li> Maintain an up-to-date photo gallery of all C&amp;A pianos from our Western markets, with a focus on pianos featured in major performance halls, live TV, film, or music videos.</li><li> Share these photos on our local and global social media channels.</li><li> **On-Call Support:**</li><li> Be available on a rotating schedule to respond to \"piano emergencies\" when the Senior Manager, Chief Concert Technician, Department Coordinator, and other team members are unavailable.</li><li> **Event Support:**</li><li> Assist with the overall needs of our west coast operations, which may include working on a limited basis to help staff special retail and institutional events.</li><li> **Performance Calendar:**</li><li> Stay informed about performances by notable artists in each market and maintain an up-to-date calendar to be shared with retail managers and sales representatives.</li><li> **Flexible Work Environment:**</li><li> Ability to work in both in-office and remote locations. (Must reside within reasonable commuting distance to the Concert &amp; Artist Office in the Arts District of Downtown Los Angeles)<br/><br/></li></ul><strong>Requirements<br/><br/></strong>**Qualifications:**<br/><br/><ul><li> Bachelor's degree required.</li><li> Prior experience working in a professional business setting.</li><li> Highly organized and detail-oriented.</li><li> Strong written and verbal communication skills.</li><li> Ability to focus intensely and meet daily deadlines.</li><li> A background in music is preferred but not required.<br/><br/></li></ul>If you are passionate about music, highly organized, and thrive in a fast-paced environment, we would love to hear from you. Join our team and contribute to the success of our Concert &amp; Artist department!<br/><br/>Employment Type: Full-Time", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3997736241"}