{"jobTitle": "Supply Chain Analyst", "company": {"name": "Cypress HCM", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "65,000.00/yr - 85,000.00/yr", "currency": "USD"}, "jobFunction": "Manufacturing, Supply Chain, and Production", "industry": "Manufacturing and Pharmaceutical Manufacturing", "description": "<strong>Supply Chain Analyst</strong><p><strong>Job Overview:</strong></p><p>The Supply Chain Planning Analyst will lead the supply process. This consists of the daily management and execution of our MRP processes and technologies. Additionally, the position requires proficiency in reporting and data analytics to support strategic decision-making. </p><p><strong>Duties &amp; Responsibilities:</strong></p><ul><li>Own the MRP parameters within SAP.</li><li>Run periodic analysis to ensure MRP parameters are accurate and reflective of current state of the company</li><li>Support the S&amp;OP and Monthly Business Review processes by providing analytical and documentation </li><li>Maintain the company’s inventory classification model, ensuring it’s updated frequently and accurately</li><li>Build monthly production plan based on sales order and production order data, capacity, material availability and other factors. (current &amp; next month)</li><li>Develop 3+ month production plan</li><li>Perform various planning analysis to identify and resolve material availability issues.</li><li>Identify all newly generated production proposals with approved sales orders to ensure dosage and quantity accuracy and alignment.</li><li>Work with other internal cross-functional key stakeholders (PD, Sales, Finance, Customer Ops, Operations, Procurement, and Logistics) to ensure the timely and accurate processing and execution of customer sales orders with a heavy focus on meeting or exceeding our on-time and in-full performance metrics.</li><li>Run ad hoc data analysis at the request of departmental Director and Vice President</li><li>Play an integral role in the change management process by placing production orders on hold, releasing them when ready, and collaborating with other departments to capture changes and associated costs.</li><li>Collaborate with other departments to ensure seamless integration of changes and maintain effective communication throughout the production process.</li><li>Undertake any other responsibilities assigned by management to support the overall success of the planning functions.</li><li>Additional duties as assigned.</li></ul><p><strong>Qualifications:</strong></p><ul><li>Minimum of 5 years of experience in a supply chain planning or other supply chain related role within a manufacturing environment.</li><li>Exceptional attention to detail.</li><li>Strong analytical and problem-solving skills.</li><li>Excellent communication and interpersonal skills, with the ability to work collaboratively with cross-functional teams and key stakeholders.</li><li>Proficiency in Microsoft Office Suite with above average skills in Excel strongly desired.</li><li>Proficient in working with ERP systems, preferably experience with SAP by Design.</li><li>Ability to multitask, prioritize and meet deadlines in a fast-paced environment.</li><li>Manufacturing Methods and Procedures Knowledge of ERP systems</li></ul><p><strong>Salary Range: $66,828.00-$84,500.00</strong></p>", "responsibilities": "The Supply Chain Planning Analyst will lead the supply process. This consists of the daily management and execution of our MRP processes and technologies. Additionally, the position requires proficiency in reporting and data analytics to support strategic decision-making. ", "qualifications": {"required": "Minimum of 5 years of experience in a supply chain planning or other supply chain related role within a manufacturing environment., Exceptional attention to detail., Strong analytical and problem-solving skills., Excellent communication and interpersonal skills, with the ability to work collaboratively with cross-functional teams and key stakeholders., Proficiency in Microsoft Office Suite with above average skills in Excel strongly desired., Proficient in working with ERP systems, preferably experience with SAP by Design., Ability to multitask, prioritize and meet deadlines in a fast-paced environment., Manufacturing Methods and Procedures Knowledge of ERP systems"}, "skills": ["MRP", "SAP", "Supply Chain Planning", "Data Analytics", "Reporting", "Microsoft Office Suite", "Excel", "ERP Systems", "SAP by Design"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998680960"}