{"jobTitle": "Senior Product Designer", "company": {"name": "National Football League (NFL)", "location": "Inglewood, CA", "industry": "Spectator Sports"}, "location": "Inglewood, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "120,000.00—180,000 USD", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Spectator Sports", "description": "The NFL is looking for a Senior Product Designer to bring compelling, innovative and user-centered design digital experiences to life across the NFL portfolio. The ideal candidate will be a passionate product designer, adept in balancing the nuances of user flows, product requirements and UX practices with a love of the details that bring thoughtful, well-crafted designs to life. We will look to you for strategic design thinking as well as best in class execution, along with a passion for collaboration, a curious mind, and an enthusiastic approach to making great products.<br/><br/>This role will work closely with Product Management, UX and User Research across all products and platforms to creatively solve problems and partner with all facets of the NFL organization to help bring those ideas to life for the incredible NFL fan base.<br/><br/>This is an exciting opportunity to have a major impact on all of the products within the NFL portfolio and help shape our process to continuously improve and ship them.<br/><br/><strong>Please submit a resume and portfolio (pdf or website link) with your application.<br/><br/></strong><strong>Responsibilities<br/><br/></strong><ul><li>Design compelling, informative, and engaging user experiences &amp; flows</li><li>Deliver high-fidelity UI and UX specs that clearly communicate requirements</li><li>Be an excellent communicator and storyteller both verbally and visually, bringing ideas to life using sketches, workshops, journeys, comps, prototypes, presentations and more to communicate clearly and move the needle within creative teams and with less design-fluent stakeholders</li><li>Collaborate with the UX, User Research, Product Managers and Engineering teams to identify needs, determine approaches, create design solutions and iteratively refine ideas through development and launch</li><li>Advocate for design and experience priorities within interdisciplinary teams in creating products that consider users, push for innovation, prioritize usability, and balance business objectives from ideation to launch through maintenance on live products</li><li>Identify, align, and establish shared user experience patterns across different platform features</li><li>Contribute to creating and managing a cohesive design system across the NFL digital portfolio via flexible and reusable components</li><li>Be a champion for experience cohesion, helping the expansive NFL digital ecosystem function in one unified voice<br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong><ul><li>5+ years of Product Design experience developing user experiences and interface design for digital products</li><li>Bachelor’s degree in design, graphic design, fine arts, or equivalent field preferred</li><li>Strong portfolio with engaging, diverse designs in the digital space, demonstrating a passion for design</li><li>Demonstrated experience designing and shipping end to end products with complicated flows, multiple scenarios and edge cases</li><li>A strong understanding of interactivity, accessibility, design systems, and the fundamentals of typography, hierarchy, and layout</li><li>Motivated, detail oriented, organized, and accountable, with the ability to work both independently and in highly collaborative settings</li><li>Strategic problem-solving skills and the capacity to distill complex information into meaningful concepts, ideas, and designs</li><li>Strong experience working in Figma, particularly with building and managing component libraries; a comfort with additional tools for design, collaboration &amp; prototyping is a plus</li><li>Experience collaborating with other designers, giving and accepting constructive criticism</li><li>Experience with the agile development methodology and ability to work in a fast-paced environment, often juggling multiple priorities and successfully balancing immediate short-term needs while maintaining strategic vision for the long-term<br/><br/></li></ul><strong>Terms / Expected Hours of Work<br/><br/></strong><ul><li>NFL full-time employees are required to work a minimum of 40 hours per week.</li><li>Must be able to work flexible hours, which may include holidays and/or weekends.</li><li>The NFL maintains a Flexible Workplace Policy that provides members of our workforce with opportunities to periodically work from a location of their choice, while maintaining a priority on in-person work at an NFL office, which enables us to more effectively collaborate, connect and build a workplace culture that will drive our continued success. </li><li>The NFL is committed to building a diverse, equitable and inclusive work environment that reflects our incredibly diverse fan base. We provide an environment of mutual respect where equal employment opportunities are available to all employees and applicants without regard to status as protected by applicable federal, state, or local law. <br/><br/></li></ul><strong>Salary / Pay Range<br/><br/></strong>This job posting contains a pay range, which represents the range of salaries or hourly rates that the NFL believes, in good faith, at the time of this posting that it might be willing to pay for the posted job in the location(s) specified. The NFL expects to hire for this position near the middle of the range. Only in truly rare and exceptional circumstances, where an external candidate has experience, credentials or expertise that far exceed those required or expected for the position, would the NFL consider paying a salary or rate near the higher end of the range.<br/><br/>Salary<br/><br/>$120,000—$180,000 USD<br/><br/><em>The NFL maintains a Flexible Workplace Policy that provides members of our workforce with opportunities to periodically work from a location of their choice while maintaining a priority on in-person work at an NFL office, which enables us to more effectively collaborate, connect, and build a workplace culture that will drive our continued success. <br/><br/></em><em>The NFL is committed to building a diverse, equitable, and inclusive work environment that reflects our incredibly diverse fan base. We provide an environment of mutual respect where equal employment opportunities are available to all employees and applicants without regard to status as protected by applicable federal, state, or local law.</em>", "responsibilities": "Design compelling, informative, and engaging user experiences & flows\nDeliver high-fidelity UI and UX specs that clearly communicate requirements\nBe an excellent communicator and storyteller both verbally and visually, bringing ideas to life using sketches, workshops, journeys, comps, prototypes, presentations and more to communicate clearly and move the needle within creative teams and with less design-fluent stakeholders\nCollaborate with the UX, User Research, Product Managers and Engineering teams to identify needs, determine approaches, create design solutions and iteratively refine ideas through development and launch\nAdvocate for design and experience priorities within interdisciplinary teams in creating products that consider users, push for innovation, prioritize usability, and balance business objectives from ideation to launch through maintenance on live products\nIdentify, align, and establish shared user experience patterns across different platform features\nContribute to creating and managing a cohesive design system across the NFL digital portfolio via flexible and reusable components\nBe a champion for experience cohesion, helping the expansive NFL digital ecosystem function in one unified voice", "qualifications": {"required": "5+ years of Product Design experience developing user experiences and interface design for digital products\nBachelor’s degree in design, graphic design, fine arts, or equivalent field preferred\nStrong portfolio with engaging, diverse designs in the digital space, demonstrating a passion for design\nDemonstrated experience designing and shipping end to end products with complicated flows, multiple scenarios and edge cases\nA strong understanding of interactivity, accessibility, design systems, and the fundamentals of typography, hierarchy, and layout\nMotivated, detail oriented, organized, and accountable, with the ability to work both independently and in highly collaborative settings\nStrategic problem-solving skills and the capacity to distill complex information into meaningful concepts, ideas, and designs\nStrong experience working in Figma, particularly with building and managing component libraries; a comfort with additional tools for design, collaboration & prototyping is a plus\nExperience collaborating with other designers, giving and accepting constructive criticism\nExperience with the agile development methodology and ability to work in a fast-paced environment, often juggling multiple priorities and successfully balancing immediate short-term needs while maintaining strategic vision for the long-term", "preferred": ""}, "skills": ["Product Design", "User Experience", "Interface Design", "Digital Products", "Design", "Graphic Design", "Fine Arts", "Portfolio", "Digital Space", "End to End Products", "Interactivity", "Accessibility", "Design Systems", "Typography", "Hierarchy", "Layout", "Figma", "Component Libraries", "Collaboration", "Prototyping", "Agile Development Methodology", "Strategic Problem-Solving"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "The NFL maintains a Flexible Workplace Policy that provides members of our workforce with opportunities to periodically work from a location of their choice, while maintaining a priority on in-person work at an NFL office, which enables us to more effectively collaborate, connect and build a workplace culture that will drive our continued success.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998517845"}