{"jobTitle": "Trade Marketing Project Coordinator", "company": {"name": "Moose Toys", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "USD $28-$32 per hour", "currency": "USD"}, "jobFunction": "Other", "industry": "Manufacturing", "description": "Moose Toys exists to make kids superhappy. For this revolutionary brand, happiness lies at the heart of everything we do. Known for our trailblazing toy design, development and manufacturing, and strong commitment to the future of our planet, our toys are consistently recognised with global awards and accolades.<br/><br/><strong> Our Culture <br/><br/></strong>At Moose we are playful with a purpose. Fun is at the heart of everything we do, but we’re also very serious about the important stuff: our people, our values, and the planet:<br/><br/><ul><li> We're officially a Great Place to Work! </li><li> We're a family. </li><li> We dream big. </li><li> We love diversity. </li><li> We're always learning. </li><li> We prioritise well-being. </li><li> We give back in a big way. </li><li> We're serious about sustainability. </li><li> We bring the fun! <br/><br/></li></ul>Visit our website or our LinkedIn Life page for more information on our amazing brands and people.<br/><br/><strong>Position Title<br/><br/></strong><strong> Trade Marketing Project Coordinator <br/><br/></strong><strong>Classification<br/><br/></strong>Non-exempt<br/><br/><strong>Position Status<br/><br/></strong>Full Time<br/><br/><strong>Reports To<br/><br/></strong>Senior Project Manager, Trade Marketing<br/><br/><strong>Direct Reports<br/><br/></strong>None<br/><br/><strong>Role Objectives<br/><br/></strong>The Trade Marketing Project Coordinator will help support projects , such as retail in-store displays, displays for trade shows and product mock ups, while working closely with the Senior Marketing Project Manager to execute projects. The role will work cross functionally with Marketing, Sales, Operations and Analytics to support project execution.<br/><br/><strong>Qualifications<br/><br/></strong><ul><li> Associate degree or higher in Marketing, Project Management, or related field required. </li><li> 3 + years of professional experience, ideally in a marketing, or project management environment. </li><li> Experience in project management, from conception to delivery, required. </li><li> Competence in creating and managing Excel spreadsheets to track projects required. <br/><br/></li></ul><strong>Responsibilities<br/><br/></strong><strong> Support of POP Process <br/><br/></strong><ul><li> C ollaborate with Sales and Brand Marketing to complete new project briefs. </li><li> Submit briefs to Creative &amp; ensure milestones &amp; deadlines are hit. </li><li> Working with Marketing team / vendors to collect project information and costs and complete project feasibility (calculate profitability). </li><li> Communicate with Operations to ensure stock is available. </li><li> Manage milestones and on-time delivery with cross functional teams &amp; external vendors. </li><li> Process/track vendor PO’s and invoices. </li><li> Proactively communicate clearly in a timely manner the status of all projects to the sales team &amp; marketing team. <br/><br/></li></ul>This position description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the role. Other duties, responsibilities and activities may change or be assigned at any time with or without notice.<br/><br/><strong> Work Hours <br/><br/></strong>8:30am – 5:30pm, Monday to Thursday<br/><br/>8:30am – 3:00pm, Friday<br/><br/>30-minute unpaid lunch break each day.<br/><br/>Plus, reasonable additional hours due to multiple time-zones.<br/><br/>38 hours a week.<br/><br/><strong> Salary Band <br/><br/></strong>USD $28-$32 per hour<br/><br/><strong> Physical Demands <br/><br/></strong><ul><li> While performing the duties of this job, the employee is regularly required to stand, sit, talk, hear, and use hands and fingers to operate a computer, telephone and other office productivity machinery, may need to reach, stoop, kneel to access items</li><li> Must be able to sit at a computer terminal for an extended period of time</li><li> Specific vision abilities required by this job include close vision requirements due to computer work</li><li> Light to moderate lifting is required</li><li> Frequently communicates with other employees and third-parties, must be able to speak clearly and exchange accurate information.</li><li> Regular, predictable attendance is required<br/><br/></li></ul>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this position. Reasonable accommodations may be made to enable individuals with disabilities to perform the functions.<br/><br/><strong> Work Environment <br/><br/></strong><ul><li> Moderate noise (i.e. business office with computers, phones, printers and light traffic)</li><li> Indoor business office environment with windows; light foot traffic within work areas</li><li> Ability to sit at a computer terminal for an extended period of time<br/><br/></li></ul>The work environment characteristics described here are representative of those a teammate encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><strong> All Welcome <br/><br/></strong>Just like the wide range and variety of brands, Moose embraces diversity and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment regardless of race, colour, religion, sex, sexual orientation, gender identity, age, national origin or on the basis of disability. If you require any assistance to be included in our process, please contact recruitment@moosetoys.com, quoting the job title and reference number.<br/><br/><strong>Primary Location<br/><br/></strong>US-CA-Los Angeles<br/><br/><strong>Job<br/><br/></strong>Sales &amp; Marketing<br/><br/><strong>Employee Status<br/><br/></strong>Permanent<br/><br/><strong>Schedule<br/><br/></strong>Full-time<br/><br/><strong>Unposting Date<br/><br/></strong>12/Sep/2024, 4:59:00 PM<br/><br/>", "responsibilities": "The Trade Marketing Project Coordinator will help support projects , such as retail in-store displays, displays for trade shows and product mock ups, while working closely with the Senior Marketing Project Manager to execute projects. The role will work cross functionally with Marketing, Sales, Operations and Analytics to support project execution.", "qualifications": {"required": "Associate degree or higher in Marketing, Project Management, or related field required. \n3 + years of professional experience, ideally in a marketing, or project management environment. \nExperience in project management, from conception to delivery, required. \nCompetence in creating and managing Excel spreadsheets to track projects required. ", "preferred": null}, "skills": ["Excel"], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3998524357"}