{"jobTitle": "Demand Planning and Purchasing Specialist", "company": {"name": "Pacific World Corporation", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000.00/yr - $80,000.00/yr", "currency": "USD"}, "industry": "Consumer Goods", "description": "<strong>THE COMPANY</strong><p>We’re on a mission to empower everyday lives with our diverse family of brands! Pacific World Corporation is a major player in the beauty industry, owning a range of popular and diverse beauty brands that cater to various customer needs. In addition, Pacific World Corporation, also the #1 leader in private labels, offers private label services for major retailers, providing high-quality products with custom branding. We pride ourselves on innovation, integrity, and excellence in all aspects of our operations. As a leader in our field, we are committed to fostering a collaborative and empowering work environment where employees can thrive and contribute to our continued success.</p><p>  </p><p><strong>POSITION TITLE</strong></p><p>Demand Planning and Purchasing Specialist </p><p> </p><p><strong>REPORTS TO</strong></p><p>Director of Global Supply Chain</p><p> </p><p><strong>LOCATION</strong></p><p>Headquarters is in Downtown Los Angeles, CA</p><p>  </p><p><strong>ABOUT THE POSITION</strong></p><p>The Demand Planning and Purchasing Specialist is responsible for the forecasting and demand planning and purchasing of assigned categories or vendors. Accountable for achieving prescribed company objectives in regard to cost, productivity, inventory turn and customer service (fill rate and on time delivery).</p><p>The ideal candidate should be ambitious and entrepreneurial. She/he should contribute to a positive culture and have outstanding team-building skills. This role is hybrid (on-site/remote) and you will be working in our new corporate headquarters at ROW DTLA in downtown Los Angeles.</p><p> </p><p><strong>KEY RESPONSIBILITIES</strong></p><ul><li>Develop and maintain up-to-date and accurate forecast based on historical data analysis on assigned accounts.</li><li>Plan weekly/monthly requirements and release purchase requisition. Take necessary corrective actions to bring inventory to optimal level.</li><li>Monitor inventory level to achieve service level and inventory turn objectives</li><li>Work closely with assigned vendors and sourcing team</li><li>Interface with Marketing, Sales, Distribution, Customer Service, Finance, and Product Development as required to support Supply Chain and Corporate objectives.</li><li>Coordinate introduction/change/deletion of SKU’s for the assigned accounts.</li></ul><p> </p><p><strong>QUALIFICATIONS</strong></p><ul><li>3+ years of related experience (in consumer goods industry a plus)</li><li>College degree required, Industry Engineering, Marketing or Operations Management preferred</li><li>Advanced MS Excel skills required.</li><li>Solid computer skills including proficiency in MS Word &amp; MS Outlook.</li><li>Oracle and NetSuite experience</li><li>Problem solver with strong attention to detail, communication, and organizational skills</li><li>Ability to work independently and collaboratively within a team while managing multiple projects simultaneously</li><li>Ability to work quickly under pressure and thrive in a rapidly changing, fast-paced environment</li><li>A team player possessing strong interpersonal skills with an ability to develop relationships and communicate with all levels of management</li><li>Organized, positive, and high-energy individual with an entrepreneurial spirit and an ability to execute.</li><li>Skills to exercise independent judgment to research, analyze, troubleshoot, and problem solve inquiries and concerns in an objective and constructive manner; excellent problem-solving skills and ability to provide conflict resolution without guidance.</li><li>Understands the importance of timelines and meeting deadlines</li><li>A Collaborative team player with the confidence to take the lead, when appropriate</li><li>Experience working in smaller, high-growth companies is a plus</li></ul><p> </p><p>Our new headquarters at ROW DTLA provides Pacific World Corporation with a modern and spacious facility that will support the company's continued growth and success. The building's prime location is in the heart of downtown Los Angeles and offers easy access to major transportation networks and a range of amenities that will benefit both employees and customers. The new facility boasts advanced technology and amenities, including an on-site fitness center, a modern open floor plan with flexible workspaces, and cutting-edge telecommunications infrastructure.</p><p> </p><p>At Pacific World Corporation, we are an equal employment opportunity and affirmative action employer seeking diversity in qualified applicants for employment. We do not discriminate based on race, color, religion, age, gender, marital status, physical or mental disability, medical condition, pregnancy, sexual orientation, gender identity or expression, national origin, veteran status, genetic information, or any other status protected under federal, state, or local law. Pacific World Corporation is committed to providing access, equal opportunity, and reasonable accommodation for individuals with disabilities in employment, its services, programs, and activities.</p>", "responsibilities": "The Demand Planning and Purchasing Specialist is responsible for the forecasting and demand planning and purchasing of assigned categories or vendors. Accountable for achieving prescribed company objectives in regard to cost, productivity, inventory turn and customer service (fill rate and on time delivery).", "qualifications": {"required": "3+ years of related experience (in consumer goods industry a plus), College degree required, Industry Engineering, Marketing or Operations Management preferred, Advanced MS Excel skills required., Solid computer skills including proficiency in MS Word &amp; MS Outlook., Oracle and NetSuite experience, Problem solver with strong attention to detail, communication, and organizational skills, Ability to work independently and collaboratively within a team while managing multiple projects simultaneously, Ability to work quickly under pressure and thrive in a rapidly changing, fast-paced environment, A team player possessing strong interpersonal skills with an ability to develop relationships and communicate with all levels of management, Organized, positive, and high-energy individual with an entrepreneurial spirit and an ability to execute., Skills to exercise independent judgment to research, analyze, troubleshoot, and problem solve inquiries and concerns in an objective and constructive manner; excellent problem-solving skills and ability to provide conflict resolution without guidance., Understands the importance of timelines and meeting deadlines, A Collaborative team player with the confidence to take the lead, when appropriate, Experience working in smaller, high-growth companies is a plus", "preferred": ""}, "skills": ["MS Excel", "MS Word", "MS Outlook", "Oracle", "NetSuite", "Problem Solving", "Communication", "Organizational Skills", "Teamwork", "Entrepreneurial Spirit", "Conflict Resolution"], "postedDate": "1 week ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3998693148"}