{"jobTitle": "Aerospace Shipping and Receiving", "company": {"name": "LA Gauge Company", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Defense and Space Manufacturing", "description": "<strong>Reports To:</strong> Production Control Manager<br/><br/><strong>Position Overview<br/><br/></strong>The Shipping and Receiving Specialist plays a crucial role in the logistics operations of our aerospace manufacturing facility. This position is responsible for managing the efficient and accurate handling, packaging, shipping, and receiving of aerospace components and materials. The role requires strict adherence to quality standards, safety protocols, and regulatory requirements to ensure the safe and timely delivery of high-value items.<br/><br/><strong>Receiving<br/><br/></strong><strong>Key Responsibilities:<br/><br/></strong><ul><li>Inspect and verify incoming shipments against orders and packing lists.</li><li>Unload, unpack, and record items in the inventory system.</li><li>Report any discrepancies or damaged goods.</li><li>Store materials safely and according to regulations.<br/><br/></li></ul><strong>Shipping<br/><br/></strong><ul><li>Prepare and package items securely for shipment.</li><li>Arrange pickups and deliveries with carriers.</li><li>Complete necessary shipping paperwork.</li><li>Track shipments and address any issues to ensure on-time delivery.<br/><br/></li></ul><strong>Inventory Management<br/><br/></strong><ul><li>Keep accurate inventory records and conduct regular checks.</li><li>Monitor stock levels and reorder supplies as needed.</li><li>Ensure proper storage conditions for sensitive materials.<br/><br/></li></ul><strong>Compliance And Safety<br/><br/></strong><ul><li>Follow all safety procedures and wear appropriate PPE.</li><li>Comply with industry regulations like ITAR and AS9100.</li><li>Participate in safety training and contribute to process improvements.<br/><br/></li></ul><strong>Communication And Coordination<br/><br/></strong><ul><li>Work with other departments to ensure smooth operations.</li><li>Update management on shipping and receiving activities.</li><li>Help improve processes to boost efficiency and accuracy <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Experience: Minimum of 2-3 years of experience in shipping and receiving, preferably in an aerospace or manufacturing environment.</li><li>Education: High school diploma or equivalent; additional training in logistics or supply chain management is a plus.<br/><br/></li></ul><strong>Skills<br/><br/></strong><ul><li>Proficiency with inventory management systems and shipping software.</li><li>Excellent communication skills and the ability to work in a team-oriented environment.</li><li>Knowledge of ITAR and AS9100 regulations is preferred.</li><li>Strong attention to detail and organizational skills.</li></ul>", "postedDate": "1 week ago", "skills": ["Inventory Management", "Shipping", "Receiving", "ITAR", "AS9100", "Logistics", "Supply Chain Management", "Communication", "Teamwork", "Attention to Detail", "Organization"], "url": "https://www.linkedin.com/jobs/view/3998251754"}