{"jobTitle": "Business Solutions Analyst, UP&E Data & Analytics", "company": {"name": "Universal Products & Experiences", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "size": "Not specified", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$85,000.00 - $105,000.00", "currency": "USD"}, "jobFunction": "Business Development", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "description": "The Business Solutions Analyst for data and analytics will provide valuable analysis and insight to all activities relating to the continued support and ongoing expansion of the data warehouse for the Universal Products & Experiences (UP&E) business solutions group. Reporting to the Director in charge of data and analytics for UP&E, this individual will be a key member of the team with focus on the following areas of responsibility: Data Analysis and Sourcing, Functional Data Requirements, Data Model Design review and approval, and ETL design review and approval. The Business Solutions Analyst will work with both internal and external technical resources, as well as our business partners, to develop and deliver solutions for everything from production bugs and minor enhancements to major business projects and initiatives.", "responsibilities": "Partner with our Engineering and Data Architecture support teams to implement new structures and/or modify existing ones, providing meaningful input to data modeling discussions as well as ETL functional design and development. Evaluate all new incoming data sources, profiling for data type and content, and ensuring that new integration processes meet established standards for format and transmission protocols. Participate in designing, testing, and implementing system changes specifically related to any new or modified data structures, working with both onshore partners and offshore technical teams. Continuous Improvement: Work with our Engineering and production support teams to recognize and implement opportunities for increased automation, better performance, scheduling optimization, etc. Monitor ongoing development efforts and provide regular progress reporting of current activities to IT leadership and business partners.", "qualifications": {"required": "Minimum 2+ years of experience with developing and supporting data integration solutions for medium to large-scale data warehouses. Minimum 2+ years of recent experience supporting a large SQL database platform (Oracle, Snowflake, Teradata, etc.) and tools available to query/analyze them. Solid knowledge of data architecture and modeling principles, including data normalization, dimensional modeling, and referential integrity. Strong SQL skills with hands-on experience both reading and writing statements with complex joins and advanced functions. Bachelor’s degree in Computer Science, Data Science/Analytics, Software Engineering, or related field, or equivalent experience.", "preferred": "Prior experience in the media industry is a plus. Experience with one or more of the following specific data disciplines: Retail Point-of-Sale Analysis, Contracts and/or IP Rights Management, Revenue Forecasting, Accounting/Controllership reporting. Familiarity with major reporting and analytics platforms tools such as Power BI, Tableau, MicroStrategy, etc. Experience with Python scripting."}, "skills": ["Data Analysis", "SQL", "Data Modeling", "ETL", "Data Integration", "Cloud Architectures (AWS, Azure)"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks.", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3998504216"}