{"jobTitle": "Influencer & Stylist Associate (LA)", "company": {"name": "Pickle", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Internship", "salary": {"amount": "18/hour", "currency": "USD"}, "jobFunction": "Marketing", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "**How to Apply: ** Please apply by email, following the application instructions in the Requirements section below**<br/><br/>**Company Summary<br/><br/>**Pickle is a rental marketplace. We seek to make fashion more affordable, sustainable, and accessible by enabling people to rent clothes directly from one another right in their city. Our unique peer-to-peer model allows Pickle to have the coolest and freshest fashion out there. And our same-day local courier delivery not only allows our users to find a last minute outfit when they're \"in a Pickle\", but also helps people avoid fast fashion &amp; shop sustainably! Check out our app here and our Instagram here!<br/><br/>**Position Summary<br/><br/>**We're excited to offer a dynamic and hands-on opportunity for a creative and action-oriented new grad. You'll get a unique chance to contribute to the early growth of our platform in Los Angeles. You'll work closely with our LA Community Manager and Director of Operations to drive awareness, conversion and retention of our user base.<br/><br/>**Hours: ** This role is full-time. Hours are 9-6PM. We're an early-stage startup, so additional hours may be required evenings and weekends as you'll help run some of our awesome community events and activations!<br/><br/>**Location** : You'll work out of our pop-up office in Culver City 5 days/week.<br/><br/>**Salary: ** $18/hour<br/><br/>**Key Responsibilities<br/><br/>**Events + Activations<br/><br/>**A key element of your role will be engaging directly with existing and prospective users through curated events and activations across LA. Here's what you'll own:<br/><br/><ul><li>Collaborate with the LA community manager to develop an LA activation strategy</li><li>Activation planning and execution, including: location sourcing, invite creation, set-up + tear-down</li><li>Engage with attendees on-site and post-activation</li><li>Identify ways to amplify events through UGC, word-of-mouth and owned social media<br/><br/><br/></li></ul>**Content Creation + Social Media Support<br/><br/>**Being in-the-know on what's trending, and creating relevant content that is hyper local to LA, will be critical for this role. You'll leverage social media to increase brand awareness and drive user acquisition. Here's what you'll own:<br/><br/><ul><li>Identify and conduct outreach to up-and-coming IG and TikTok content creators in LA</li><li>Identify content ideas niche to LA across IG and TikTok to drive brand awareness and engagement</li><li>Compose weekly IG and TikTok creatives that are original, relatable, fun, informational, and on brand</li><li>Work with the social team to understand performance, and adjust creative for optimizing posts</li><li>Engage with followers in DMs/comments where needed, across social media platforms<br/><br/><br/></li></ul>**Closet Management<br/><br/>**We house and manage closets for select owners on our platform. This is a fun opportunity to interact directly with influencers and get an inside look into their side hustle. Here's what you'll own:<br/><br/><ul><li>Supporting LA Community Manager on direct communications with influencers</li><li>Handle user questions and orders for the managed closets, within target response times</li><li>Set up inventory management and maintain inventory control, including damage audits and cleaning<br/><br/><br/></li></ul>**Ad Hoc Growth Initiatives *these will change based on need, but might include:<br/><br/>**<ul><li>Building lists of top LA-focused substacks, niche media outlets or potential partners</li><li>Drafting, sending and tracking emails and push notifications to specific user cohorts<br/><br/><br/></li></ul>**Requirements<br/><br/>**Qualifications<br/><br/>**Required<br/><br/>**<ul><li>Excellent attention to detail with strong organizational skills</li><li>Ability to multi-task with excellent follow through and task completion </li><li>Problem solver, able to take initiative and work independently to produce quality results</li><li>Very comfortable behind (and in front of) a camera and passionate about creating video content </li><li>Innate user of social media with knowledge of what types of content perform well on IG and TikTok</li><li>In-depth knowledge of the LA consumer in our demo (20-35 y/o, female), and can translate that knowledge into ways we should be tapping into the local community (through socials, influencer outreach, events and collabs)</li><li>Has spent at least 2 years living in LA, with strong knowledge of LA social and influencer scene</li><li>Internship experience across any of the following: fashion, an early stage startup, influencers partnerships, social media, or related</li><li>Passion for fashion<br/><br/><br/></li></ul>**Ideal<br/><br/>**<ul><li>College graduate with a Bachelor's degree in Business, Marketing, or related field from an LA school (eg. UCLA or USC). Connections to sororities is a big perk! In lieu of a college degree, alternatively, has 2+ years of early stage startup experience</li><li>Actively part of LA communities where our target audience spends time (eg. UCLA, influencer groups, fashion communities, gyms, meetup groups)</li><li>Has relationships with LA-based influencers / similar that we could tap into to amplify growth</li><li>Lives within our core operational area (between or near Santa Monica to Hollywood)</li><li>Demonstrated ability to execute in a fast and scrappy fashion, with limited budget and resources</li><li>Valid license and access to a car (helpful for event setup and closet management)<br/><br/><br/></li></ul>**How To Apply:<br/><br/>We are only reviewing applications that follow this submission process<br/><br/>**Email: recruiting@shoponpickle.com<br/><br/>Subject: LA Influencer &amp; Stylist Associate Application<br/><br/>Body: include...<br/><br/><ul><li>Your resume</li><li>Your Pickle username (not downloaded yet? Use this link)</li><li>1-2 bullets on what makes you the most excited about Pickle</li><li>2-5 bullets on what sets you apart for this role</li><li>Let us know if you have access to a car</li><li>Links to your Instagram and TikTok profile(s) with your application, if available (a portfolio with previous work also accepted) <br/><br/><br/></li></ul>**Benefits<br/><br/>**Learning Outcomes <br/><br/>Being at an early-stage startup is fun! Things move quickly and we're always testing and learning something new. That means you'll be able to gain lots of exposure and hands-on experience, while you build your social media know-how and executional capabilities.<br/><br/><ul><li>plus, you'll get:</li><li>Credits to try out our platform and rent the hottest items (!!)</li><li>An opportunity to contribute directly to a platform that is changing the way people shop, while promoting sustainability and empowerment</li></ul>", "responsibilities": "A key element of your role will be engaging directly with existing and prospective users through curated events and activations across LA. Here's what you'll own:<br/><br/><ul><li>Collaborate with the LA community manager to develop an LA activation strategy</li><li>Activation planning and execution, including: location sourcing, invite creation, set-up + tear-down</li><li>Engage with attendees on-site and post-activation</li><li>Identify ways to amplify events through UGC, word-of-mouth and owned social media<br/><br/><br/></li></ul>Being in-the-know on what's trending, and creating relevant content that is hyper local to LA, will be critical for this role. You'll leverage social media to increase brand awareness and drive user acquisition. Here's what you'll own:<br/><br/><ul><li>Identify and conduct outreach to up-and-coming IG and TikTok content creators in LA</li><li>Identify content ideas niche to LA across IG and TikTok to drive brand awareness and engagement</li><li>Compose weekly IG and TikTok creatives that are original, relatable, fun, informational, and on brand</li><li>Work with the social team to understand performance, and adjust creative for optimizing posts</li><li>Engage with followers in DMs/comments where needed, across social media platforms<br/><br/><br/></li></ul>We house and manage closets for select owners on our platform. This is a fun opportunity to interact directly with influencers and get an inside look into their side hustle. Here's what you'll own:<br/><br/><ul><li>Supporting LA Community Manager on direct communications with influencers</li><li>Handle user questions and orders for the managed closets, within target response times</li><li>Set up inventory management and maintain inventory control, including damage audits and cleaning<br/><br/><br/></li></ul>These will change based on need, but might include:<br/><br/><ul><li>Building lists of top LA-focused substacks, niche media outlets or potential partners</li><li>Drafting, sending and tracking emails and push notifications to specific user cohorts<br/><br/><br/></li></ul>", "qualifications": {"required": "Excellent attention to detail with strong organizational skills, Ability to multi-task with excellent follow through and task completion , Problem solver, able to take initiative and work independently to produce quality results, Very comfortable behind (and in front of) a camera and passionate about creating video content , Innate user of social media with knowledge of what types of content perform well on IG and TikTok, In-depth knowledge of the LA consumer in our demo (20-35 y/o, female), and can translate that knowledge into ways we should be tapping into the local community (through socials, influencer outreach, events and collabs), Has spent at least 2 years living in LA, with strong knowledge of LA social and influencer scene, Internship experience across any of the following: fashion, an early stage startup, influencers partnerships, social media, or related, Passion for fashion", "preferred": "College graduate with a Bachelor's degree in Business, Marketing, or related field from an LA school (eg. UCLA or USC). Connections to sororities is a big perk! In lieu of a college degree, alternatively, has 2+ years of early stage startup experience, Actively part of LA communities where our target audience spends time (eg. UCLA, influencer groups, fashion communities, gyms, meetup groups), Has relationships with LA-based influencers / similar that we could tap into to amplify growth, Lives within our core operational area (between or near Santa Monica to Hollywood), Demonstrated ability to execute in a fast and scrappy fashion, with limited budget and resources, Valid license and access to a car (helpful for event setup and closet management)"}, "skills": ["Social Media", "Influencer Marketing", "Event Management", "Content Creation", "TikTok", "Instagram", "Fashion", "Marketing", "Community Management", "Startup"], "postedDate": "1 week ago", "benefits": "Credits to try out our platform and rent the hottest items (!!), An opportunity to contribute directly to a platform that is changing the way people shop, while promoting sustainability and empowerment", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998802577"}