{"jobTitle": "Product Manager, Growth & Retention", "company": {"name": "Thrive Market", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Product Management and Marketing", "industry": "Wellness and Fitness Services", "description": "About Thrive Market<br/><br/>Thrive Market was founded in 2014 with a mission to make healthy and sustainable living easy and affordable for everyone. As an online, membership-based market, we deliver the highest quality healthy, and sustainable products at member-only prices. Every day, we help our 1.4M+ Members find better products, support better brands, and build a better world in the process. We are a profitable, half-billion-dollar revenue business proving that mission-focused companies can succeed. We are also a Certified B Corporation, recently became a Public Benefit Corporation, and are a Climate Neutral Certified company. Join us as we bring healthy and sustainable living to millions of Americans in the years to come.<br/><br/>THE ROLE<br/><br/>Thrive Market’s Product Management team is seeking a highly quantitative individual who will be an exceptional addition to our Product team. Our ideal candidate is passionate about delivering consumer-facing e-commerce and subscription membership solutions through delivering a unique and world-class shopping experience to our Thrive Market customers. With your experience, you will create, own, and ruthlessly prioritize key strategic product initiatives from inception to delivery while working with the executive team, key stakeholders, engineers, product design, and other cross-functional teams. You should love solving member experience problems and seeing new business opportunities utilizing qualitative and quantitative data through the empathetic lens of the user journey and by working closely with our Member Services department. To succeed in this role, you must be a data-driven innovator, charismatic influencer, curious problem solver, and persuasive communicator. This is an opportunity to contribute and be a part of a revolutionary new way to bring healthy foods and sustainably produced goods at affordable prices to all our members.<br/><br/>Responsibilities<br/><br/><ul><li>Effective backlog management, diligent prioritization, and communication of customer and business requirements to development and cross-functional teams while always aligned to business KPIs and company pillars</li><li>Continually and effectively create product briefs, presentations (as needed), and communication plans for leadership, key stakeholders, and development teams</li><li>Evaluate end-to-end customer journeys and continuously identify opportunities to improve member engagement and retention experiences across desktop and native mobile applications</li><li>Helming thoughtful experimentation across products to constantly improve the prospect and member experience through feedback and A/B testing</li><li>Demonstrate the ability to own driving ideas through problem definition, solutions discovery, and delivery, as well as thinking big and influencing across all levels of an organization to champion product lines</li><li>Develop and execute strategic initiatives to drive member acquisition and retention, utilizing insights from customer behavior and market trends to enhance the subscription model</li><li>Identify opportunities to optimize the subscription experience, including pricing models, member benefits, and renewal processes, to increase customer satisfaction and reduce churn</li><li>Close collaboration with our Member Services team to understand retention opportunities, optimize customer-facing experiences, and work diligently to improve retention rates in a cost-effective manner</li><li>Efficient in gathering and transforming business needs into product requirements and developing actionable and measurable programs for development and product design teams</li><li>Experience with agile or other PDLC methodologies<br/><br/></li></ul>Qualifications<br/><br/><ul><li>5+ years of product management experience</li><li>3+ years of experience on native consumer mobile apps</li><li>E-commerce and/or subscription product experience is a must</li><li>Extensive experience with A/B testing</li><li>Ability to pull your data to create insights and discover trends from our users</li><li>Driven by data and exceptional analytical skills; you know how to use both quantitative and qualitative data to build products</li><li>Strong communication and storytelling skills with stakeholders in all departments</li><li>Superior organization and project management skills with the ability to juggle multiple projects, deadlines, and communication lines</li><li>Craft the product strategy for your area of ownership based on data, including transactional data, usage statistics, primary customer research, competitive analysis, and industry analyst reports</li><li>Affinity for the social mission of Thrive Market and a deep appreciation and empathy for the needs of the customer<br/><br/></li></ul>Belong To a Better Company<br/><br/><ul><li>Comprehensive health benefits (medical, dental, vision, life and disability)</li><li>Competitive salary (DOE) + equity</li><li>401k plan</li><li>9 Days of Observed Holiday</li><li>Flexible Paid Time Off</li><li>Subsidized ClassPass Membership with access to fitness classes and wellness and beauty experiences</li><li>Ability to work in our beautiful co-working space at WeWork in Playa Vista and other locations</li><li>Free Thrive Market membership with exclusive employee discount</li><li>Coverage for Life Coaching &amp; Therapy Sessions on our holistic mental health and well-being platform<br/><br/></li></ul>We're a community of more than 1 Million + members who are united by a singular belief: It should be easy to find better products, support better brands, make better choices, and build a better world in the process.<br/><br/>At Thrive Market, we believe in building a diverse, inclusive, and authentic culture. If you are excited about this role along with our mission and values, we encourage you to apply.<br/><br/><em>Thrive Market is an EEO/Veterans/Disabled/LGBTQ employer<br/><br/></em><em>At Thrive Market, our goal is to be a diverse and inclusive workplace that is representative, at all job levels, of the members we serve and the communities we operate in. We’re proud to be an inclusive company and an Equal Opportunity Employer and we prohibit discrimination and harassment of any kind. We believe that diversity and inclusion among our teammates are critical to our success as a company, and we seek to recruit, develop, and retain the most talented people from a diverse candidate pool. If you’re thinking about joining our team, we expect that you would agree!<br/><br/></em><em>If you need assistance or accommodation due to a disability, please email us at eeo@thrivemarket.com and we’ll be happy to assist you.<br/><br/></em>Ensure your Thrive Market job offer is legitimate and don't fall victim to fraud. Thrive Market never seeks payment from job applicants. Thrive Market recruiters will only reach out to applicants from an @thrivemarket.com email address. For added security, where possible, apply through our company website at www.thrivemarket.com .<br/><br/>© Thrive Market 2024 All rights reserved.<br/><br/>Job Information<br/><br/><ul><li>Compensation Description - The base salary range for this position is $165,000 - $200,000/Per Year. </li><li>Compensation may vary outside of this range depending on several factors, including a candidate’s qualifications, skills, competencies and experience, and geographic location. </li><li>Total Compensation includes Base Salary, Stock Options, Health and Wellness Benefits, Flexible PTO, and more!</li></ul>", "responsibilities": "<ul><li>Effective backlog management, diligent prioritization, and communication of customer and business requirements to development and cross-functional teams while always aligned to business KPIs and company pillars</li><li>Continually and effectively create product briefs, presentations (as needed), and communication plans for leadership, key stakeholders, and development teams</li><li>Evaluate end-to-end customer journeys and continuously identify opportunities to improve member engagement and retention experiences across desktop and native mobile applications</li><li>Helming thoughtful experimentation across products to constantly improve the prospect and member experience through feedback and A/B testing</li><li>Demonstrate the ability to own driving ideas through problem definition, solutions discovery, and delivery, as well as thinking big and influencing across all levels of an organization to champion product lines</li><li>Develop and execute strategic initiatives to drive member acquisition and retention, utilizing insights from customer behavior and market trends to enhance the subscription model</li><li>Identify opportunities to optimize the subscription experience, including pricing models, member benefits, and renewal processes, to increase customer satisfaction and reduce churn</li><li>Close collaboration with our Member Services team to understand retention opportunities, optimize customer-facing experiences, and work diligently to improve retention rates in a cost-effective manner</li><li>Efficient in gathering and transforming business needs into product requirements and developing actionable and measurable programs for development and product design teams</li><li>Experience with agile or other PDLC methodologies<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>5+ years of product management experience</li><li>3+ years of experience on native consumer mobile apps</li><li>E-commerce and/or subscription product experience is a must</li><li>Extensive experience with A/B testing</li><li>Ability to pull your data to create insights and discover trends from our users</li><li>Driven by data and exceptional analytical skills; you know how to use both quantitative and qualitative data to build products</li><li>Strong communication and storytelling skills with stakeholders in all departments</li><li>Superior organization and project management skills with the ability to juggle multiple projects, deadlines, and communication lines</li><li>Craft the product strategy for your area of ownership based on data, including transactional data, usage statistics, primary customer research, competitive analysis, and industry analyst reports</li><li>Affinity for the social mission of Thrive Market and a deep appreciation and empathy for the needs of the customer<br/><br/></li></ul>", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "benefits": "<ul><li>Comprehensive health benefits (medical, dental, vision, life and disability)</li><li>Competitive salary (DOE) + equity</li><li>401k plan</li><li>9 Days of Observed Holiday</li><li>Flexible Paid Time Off</li><li>Subsidized ClassPass Membership with access to fitness classes and wellness and beauty experiences</li><li>Ability to work in our beautiful co-working space at WeWork in Playa Vista and other locations</li><li>Free Thrive Market membership with exclusive employee discount</li><li>Coverage for Life Coaching &amp; Therapy Sessions on our holistic mental health and well-being platform<br/><br/></li></ul>", "remoteWork": "No", "salary": {"amount": "165,000.00 - 200,000.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3998445802"}