{"jobTitle": "Seasonal Client Experience Coordinator - Topanga", "company": {"name": "Cartier", "industry": "Retail Luxury Goods and Jewelry", "location": "Topanga, CA"}, "location": "Topanga, CA", "jobType": "Temporary", "employmentType": "Temporary", "jobFunction": "Sales, Business Development, and Administrative", "industry": "Retail Luxury Goods and Jewelry", "description": "At Cartier North America, we are proud to employ talent from many different backgrounds, experiences, and identities. We believe that when diversity and inclusion are fully embraced and empowered, creativity and knowledge emerge to deliver excellence. We continue to work towards creating a workforce that represents the diversity of our clients and our communities.<br/><br/>Our objective is to create the most exceptional client experience with the most productive environment and team. Doing so with consistency across the network – giving our clients a unified experience throughout North America while enhancing our client development opportunities. To do so, we operate in an appointment recommended model, allowing us to provide clients with the best possible boutique experience,<br/><br/>including personalized product curation, attention, and services for their creation.<br/><br/><strong>Client Experience Coordinator - Cartier, Topanga<br/><br/></strong><strong>Job Mission <br/><br/></strong>Support the execution of the client experience strategy and identify opportunities for improvement in boutique with a 360 view to ensure values and standards are upheld while providing exceptional service. In partnership with boutique management, support the execution of individualized client experience journeys to ensure seamless and memorable experiences fostering brand loyalty. Consistently engage and partner with the overall boutique team to effectively execute all touchpoints of client experience.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Create exceptional client experiences </li><li>Deliver an exceptional welcome to every client upon entry and ensure outstanding hospitality throughout the client visit, while supporting the needs of our hybrid environment </li><li>Support with all duties at the front podium, ensuring that all appointments and walk-in clients are assisted in a timely fashion </li><li>Utilize Maison storytelling and heritage to enhance the client experience </li><li>As part of appointment support, assist sales associates to set the stage with impactful discovery and pre appointment browsing </li><li>Assist the commercial team front-of-house and back-of-house with various activities to facilitate seamless client experiences, including appointment preparation, client entertainment, product presentation, sales finalization (e.g., running product, gathering sales accessories, gift wrapping, food &amp; beverage service, client data capture, Cartier Care, farewell) </li><li>Assist clients with quick service requests, repair drop off or pick up, personalization requests, such as complimentary services including strap changes, bracelet sizing, steam cleaning, cord changes, engraving, embossing, etc. </li><li>Assist the commercial and management teams with client development related activities, including data entry, various report management, and execution of client treatments </li><li>Provide recommendations and personal services of the highest level that may include directions, restaurant reservations, entertainment requests, floral orders, etc.; support the creation of maps, literature, and other materials as needed </li><li>Assist with phone duties, supporting with incoming calls, retrieval of messages and appointment setting for phone inquiries </li><li>Consistently reach and aim to exceed all KPIs <br/><br/></li></ul><strong>Optimize the boutique environment <br/><br/></strong><ul><li>Support the flow of boutique traffic and daily management of the boutique appointment booking tool (RDV) and queue </li><li>Support the general upkeep and appearance of the sales floor, wrap rooms, and CS areas </li><li>Assist with merchandising and overall display maintenance of the boutique (e.g., maintain proper visual standards, product maintenance and understock organization, cleanliness) </li><li>Partner with the Operations Coordinator to manage the boutique supply inventory including replenishment needs for sales and hospitality areas, support the order process (as needed) and optimal storage organization </li><li>Partner with the Operations Coordinator to ensure proper movement of product in/out of boutique including, but not limited to, shipments, transfers, consignments, and movement throughout the boutique while maintaining quality control and preventing stock losses </li><li>Assist with inventory control processes (e.g., daily/weekly/monthly counts and stock movements) to ensure a successful annual inventory </li><li>Participate in daily set up and break down of boutique for opening/closing as needed </li><li>Assist with organization and tracking of client experience tools such as food and beverage, Cartier gifts, stationery, and fragrance samples </li><li>Assist with special projects as needed <br/><br/></li></ul><strong>Maison / industry knowledge and compliance <br/><br/></strong><ul><li>Develop fundamental brand knowledge to convey Cartier heritage and values </li><li>Understand and comply with security and operational procedures (e.g., product handling, inventory control, transaction processing, including payments, etc.) </li><li>Remain current on all industry news, local/global competition, and connection to community </li><li>Strive for operational excellence related to the boutique environment and upholding standards </li><li>Share and collaborate best practices with the boutique team <br/><br/></li></ul><strong>Teamwork <br/><br/></strong><ul><li>Uphold the Cartier standards with the ability to project an approachable and professional image in personal appearance, manner, and demeanor </li><li>Contribute to a positive and productive boutique environment by leveraging both personal and team savoir-faire to always create a highly collaborative network both in person and via telephone <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Education <br/><br/></strong><ul><li>Associate’s or Bachelor’s degree preferred <br/><br/></li></ul><strong>Industry Experience<br/><br/></strong><ul><li>Previous experience especially in luxury retail, service or hospitality industry is a plus <br/><br/></li></ul><strong>Technical Skills / Abilities<br/><br/></strong><ul><li>Excellent computer skills and use of technology </li><li>MS Office experience required; SAP knowledge preferred </li><li>Additional language skills are a plus <br/><br/></li></ul><strong>Personal Skills<br/><br/></strong><ul><li>Must be available to work retail hours (including weekends) and travel for trainings as needed </li><li>Ability to work in a fast-paced, evolving environment </li><li>Excellent analytical, organizational, and interpersonal communication skills are required </li><li>Strong understanding of client service needs and priorities (internal and external) </li><li>Strong attention to detail with the ability to handle multiple tasks simultaneously with accuracy and precision </li><li>Collaborative approach with ability to foster a united work environment with a “can do” attitude </li><li>Intellectual curiosity and passion for learning <br/><br/></li></ul><em><strong>Expected Salary Range: $23 to $24.<br/><br/></strong></em><em><strong>Please note, salaries will be negotiated based on relevant skills and experience.<br/><br/></strong></em><strong>This position is payrolled by a third party. <br/><br/></strong><ul><li>This job description may not be inclusive of all assigned duties, responsibilities, or job aspects described and is subject to amendment as needed at the sole discretion of the employer<br/><br/></li></ul>", "experienceLevel": "Entry level", "salary": {"amount": "23.00/hr - 24.00/hr", "currency": "USD"}, "skills": ["MS Office", "SAP", "Client Service", "Communication", "Hospitality", "Retail", "Luxury", "Sales", "Teamwork", "Organization", "Detail Oriented", "Multitasking", "Problem Solving", "Technology", "Computer Skills"], "postedDate": "1 week ago", "benefits": null, "remoteWork": null, "responsibilities": "Support the execution of the client experience strategy and identify opportunities for improvement in boutique with a 360 view to ensure values and standards are upheld while providing exceptional service. In partnership with boutique management, support the execution of individualized client experience journeys to ensure seamless and memorable experiences fostering brand loyalty. Consistently engage and partner with the overall boutique team to effectively execute all touchpoints of client experience.", "qualifications": {"required": "Excellent computer skills and use of technology, MS Office experience required; SAP knowledge preferred, Additional language skills are a plus, Must be available to work retail hours (including weekends) and travel for trainings as needed, Ability to work in a fast-paced, evolving environment, Excellent analytical, organizational, and interpersonal communication skills are required, Strong understanding of client service needs and priorities (internal and external), Strong attention to detail with the ability to handle multiple tasks simultaneously with accuracy and precision, Collaborative approach with ability to foster a united work environment with a “can do” attitude, Intellectual curiosity and passion for learning", "preferred": "Associate’s or Bachelor’s degree, Previous experience especially in luxury retail, service or hospitality industry is a plus"}, "url": "https://www.linkedin.com/jobs/view/3998635775"}