{"jobTitle": "Sr. Operations & Engineering Manager", "company": {"name": "Enclave Search Group", "location": "Orange County, CA"}, "location": "Orange County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Engineering and Information Technology", "industry": "Staffing and Recruiting", "description": "<strong><em>Medical Equipment Manufacturer<br/><br/></em></strong><strong>Summary<br/><br/></strong>This position reports to the President and functions as the top level for Manufacturing Operations and Engineering. Directs activities of personnel engaged in the R&amp;D, Manufacturing Engineering and production of Medical Equipment including oxygen chambers, air mixers and stretchers. With the focus on exceeding expectations, plays an active role in the product development, new technology implementation and providing expert guidance. Responsible for providing management, leadership and support to achieve annual revenue, quality, labor efficiency, customer satisfaction and new product development targets. Responsibility includes managing labor, expense budgets, capital expenditures, Operations and R&amp;D budgets.<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong><ul><li>Provide management, leadership and support for R&amp;D, Manufacturing Engineering and Manufacturing Operations departments toward the accomplishment of the Company’s objectives including customer satisfaction, manufacturing cost reduction, outsourcing, new product introduction, product improvement, new product development, facility design and layout, employee training and development, employee satisfaction and planning. Develop and implement the Company’s manufacturing operating policies and processes to maximize quality and efficiency. </li><li>Manage manufacturing operations resources to ensure monthly on-time shipment of products. Act as a resource for the solution of general manufacturing operations issues. </li><li>Direct, evaluate and confirm product design and changes. Organize and manage projects, making detailed plans that work towards the fulfillment of objectives. </li><li>Plan and implement world class manufacturing practices including 5S and Six Sigma. Build and manage high performance teams. </li><li>Generate and monitor the annual operating and capital budgets. Allocate resources for specific short- and long-range plans and programs. </li><li>Ensure all manufacturing operations processes are well defined and implemented in accordance with FDA and ISO requirements. </li><li>Provide input to Marketing and Sales for short and long-term sales, marketing and planning objectives for all products. </li><li>Work collaboratively with the Sales, Marketing, Customer Service, Finance and Quality organizations to ensure all company goals for all products are met. </li><li>Manage the installation, testing, operation, maintenance and repair of facilities and equipment. </li><li>Maintains facility in compliance with regulations of various government agencies and safe working environment. Serves as Safety Director for the company. </li><li>Assures the Quality Policy is implemented throughout Operations. </li><li>Leads by example in support of sustained compliance with FDA and ISO regulations</li></ul>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3998012319"}