{"jobTitle": "Executive, Office and Staff Administrator", "company": {"name": "Greenlane™ Infrastructure", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "80,000.00/yr - 90,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Services for Renewable Energy", "description": "<strong>About Greenlane</strong><p>Greenlane is a joint venture between Daimler Truck North America, LLC (DTNA), NextEra Energy Resources, LLC and BlackRock, through a fund managed by its Climate Infrastructure business. Greenlane's mission is to design, develop, install and operate a nationwide, high-performance zero-emission public charging and hydrogen fueling network for medium- and heavy-duty battery-electric and hydrogen fuel cell vehicles. Greenlane addresses the urgent need for publicly available, nationwide electric charging infrastructure for commercial vehicles, especially for long-haul freight operations, and is a critical step toward the development of a sustainable zero-emission vehicle ecosystem across North America. For more, visit www.drivegreenlane.com.</p><p><br/></p><p><strong>Executive, Office and Staff Administrator</strong></p><p>Greenlane is building a nationwide, high-performance zero-emission public charging and hydrogen refueling network for medium- and heavy-duty battery-electric and hydrogen fuel cell vehicles. The Executive, Office and Staff Administrator is responsible for providing comprehensive support and managing administrative operations for the Greenlane Senior Leadership Team, and staff as required. This dynamic position requires the ability to anticipate needs, think critically, and offer solutions to problems with a high level of professionalism and confidentiality. Responsibilities include handling multifaceted preparation and planning for internal and external meetings, travel, preparation of staff for meetings; onboarding new hires; managing hardware and software. In addition, the Executive, Office and Staff Administrator contributes to special projects, plans the details for various events including offsites, conventions and more. This role will also set up a master repository for document management via SharePoint. The ideal candidate has a desire to grow, a strong interest in helping to shape company culture, and a mindset toward continuous improvement.</p><p><br/></p><p><strong>What you Drive at Greenlane</strong></p><ul><li>Provide highly competent administrative support to the Sr Leadership team at Greenlane</li><li>Effectively handle sensitive, confidential, and proprietary information.</li><li>Help build and maintain a SharePoint document management system for company use. </li><li>Coordinate the onboarding process for new hires</li><li>Manage mobile phone ordering, inventory and the account for all corporate phones</li><li>Manage the ordering, delivery and inventory of computers and peripherals.</li><li>Maintain company documents securely (contracts, NDA’s, personnel files, etc)</li><li>Proactively manage executive's calendar - arrange and coordinate meetings by identifying priority and content.</li><li>Plan meetings and events; select event facilities, coordinate catering, and technical equipment as needed.</li><li>Prepare PowerPoint presentations for meetings, as needed.</li><li>Prepare and process various documentation and reports, including non-disclosure agreements.</li><li>Route incoming authorization requests (NDAs, contracts, purchase requests) for internal review prior to obtaining approval. Execute on behalf of Senior Leader with explicit approval for each instance.</li><li>Arrange domestic and international business travel, including air, hotel, and ground travel.</li><li>Prepare and process expense reports.</li><li>Stays knowledgeable of company's top customers and maintains contact information for key client relationships.</li><li>Effectively handle sensitive, confidential, and proprietary information.</li><li>Prepare and process various documentation and reports, including non-disclosure agreements.</li><li>Understand and operate meetings using virtual conferencing including Zoom and Teams and facilitate meetings featuring polling and breakout rooms. Lead meetings as needed.</li><li>Other duties as assigned.</li></ul><p> </p><p><strong>Benefits</strong></p><p>Compensation offered depends on knowledge, skills, and experience.</p><p>Benefits include annual bonus program; 401k company contribution with company safe harbor match up to 5%; Paid vacation; 14 calendar holidays; 8 weeks paid parental leave; employee assistance program; comprehensive healthcare plans and wellness programs; volunteer paid time off; continuing education reimbursement; and short-term and long-term disability.</p><p><br/></p><p><strong>Requirements</strong></p><p><strong>Knowledge You Should Bring</strong></p><ul><li>3 years+ of relevant experience as an Executive Assistant, Administrative Assistant or similar, supporting executives in a progressive office setting</li><li>Strong written and verbal communication skills</li><li>Excellent time management and prioritization abilities</li><li>Highly proficient using Microsoft Office, specifically SharePoint, but also Word, Excel, PowerPoint, and Outlook </li><li>Must be technically competent and comfortable using new technologies and making suggestions on how to optimize administrative tasks using technology</li><li>An attached resume is required</li></ul><p><br/></p><p><strong>Exceptional Candidates Might Have</strong></p><ul><li>Bachelors or Associates degree preferred</li><li>Experience building and maintaining SharePoint sites</li><li>Prior experience in EV, charging, or similar</li><li>Experience scheduling and facilitating virtual meetings</li><li>Experience booking executive travel and processing expense reports</li><li>Experience and interest in planning team building activities and department events</li></ul>", "responsibilities": "The Executive, Office and Staff Administrator is responsible for providing comprehensive support and managing administrative operations for the Greenlane Senior Leadership Team, and staff as required. This dynamic position requires the ability to anticipate needs, think critically, and offer solutions to problems with a high level of professionalism and confidentiality. Responsibilities include handling multifaceted preparation and planning for internal and external meetings, travel, preparation of staff for meetings; onboarding new hires; managing hardware and software. In addition, the Executive, Office and Staff Administrator contributes to special projects, plans the details for various events including offsites, conventions and more. This role will also set up a master repository for document management via SharePoint. The ideal candidate has a desire to grow, a strong interest in helping to shape company culture, and a mindset toward continuous improvement.", "qualifications": {"required": "3 years+ of relevant experience as an Executive Assistant, Administrative Assistant or similar, supporting executives in a progressive office setting, Strong written and verbal communication skills, Excellent time management and prioritization abilities, Highly proficient using Microsoft Office, specifically SharePoint, but also Word, Excel, PowerPoint, and Outlook, Must be technically competent and comfortable using new technologies and making suggestions on how to optimize administrative tasks using technology, An attached resume is required", "preferred": "Bachelors or Associates degree preferred, Experience building and maintaining SharePoint sites, Prior experience in EV, charging, or similar, Experience scheduling and facilitating virtual meetings, Experience booking executive travel and processing expense reports, Experience and interest in planning team building activities and department events"}, "skills": ["SharePoint", "Microsoft Office", "Communication", "Time Management", "Prioritization"], "postedDate": "1 week ago", "benefits": "Compensation offered depends on knowledge, skills, and experience.\nBenefits include annual bonus program; 401k company contribution with company safe harbor match up to 5%; Paid vacation; 14 calendar holidays; 8 weeks paid parental leave; employee assistance program; comprehensive healthcare plans and wellness programs; volunteer paid time off; continuing education reimbursement; and short-term and long-term disability.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998454430"}