{"jobTitle": "Principal Engineer, Performance Tuning", "company": {"name": "Okta", "industry": "Computer and Network Security, Software Development, and IT Services and IT Consulting", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$188,000—$282,000 USD", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Computer and Network Security, Software Development, and IT Services and IT Consulting", "description": "Get to know Okta\n\nOkta is The World’s Identity Company. We free everyone to safely use any technology—anywhere, on any device or app. Our Workforce and Customer Identity Clouds enable secure yet flexible access, authentication, and automation that transforms how people move through the digital world, putting Identity at the heart of business security and growth.\n\nAt Okta, we celebrate a variety of perspectives and experiences. We are not looking for someone who checks every single box - we’re looking for lifelong learners and people who can make us better with their unique experiences.\n\nJoin our team! We’re building a world where Identity belongs to you.\n\nThe Okta Customer Identity Cloud (CIC) is a product unit of Okta focussed on the Customer Identity and Access Management (CIAM) space. We are looking for exceptional new team members to join our team and help drive our next level of success. One team, one score!\n\nOur vision is to free everyone to safely use any technology. We provide secure access for everyone, but not just anyone. We process billions of logins per month (and growing!). So, if you’re a big thinker who is nimble and adaptable, Okta CIC may be an ideal place for you to shine.\n\nThe Team & Role:\n\nOkta is looking for a Principal Software Engineer to join our Performance Engineering team.\n\nOkta’s customer identity business is growing and evolving quickly. Traffic volume has grown substantially and new features are continually introduced. As a cloud-based SaaS provider, bringing scalable, high performance identity solutions to production at an attractive price is a priority for our business. The Performance Engineering team has a cross-functional charter that involves investigating, identifying, and remediating performance bottlenecks across all parts of our distributed system machinery. This includes the code we write, datastores, messaging systems, infrastructure, and the points at which different parts of the system communicate with one another. The Performance Engineering team works closely with component owners, test engineers, and architects to identify performance bottlenecks, and then develops software changes or other recommendations to improve performance.\n\nWhat You Will Do\n\nAs a Principal Engineer, you will serve as a senior technical expert within the team, performing complex analysis and writing code to remove performance bottlenecks throughout our software.\nDevelop software in Node.js and some Golang in multiple services that will run in production and help us serve billions of logins per month.\nWrite decision records and RFC’s to communicate technical tradeoffs and approaches and drive awareness and consensus.\nYou will work cross-functionally with service owners, architects, project managers, as well as platform and quality teams to drive performance improvements across our tech stack.\nYou will nurture a “shift left” culture for performance. You will work to improve knowledge and awareness of performance management techniques, tools, patterns, and solutions throughout Engineering in order to address performance issues earlier in the software development life cycle.\nYou will have the opportunity to work with all parts of the Customer Identity Cloud service offering, including code, infrastructure, and architecture.\n\nWhat You Bring\n\nExperience in senior software engineering roles in a remote work environment.\nStrong self-motivation and aptitude for investigation and experimentation.\nExperience developing application software in Node.js using frameworks such as Hapi.js or Fastify. Familiarity with Golang is also a plus.\nExperience with API-driven cloud-native distributed system application architecture running in Kubernetes, AWS, and Azure.\nExperience with APM tools such as Datadog APM, Splunk, Honeycomb, New Relic, Dynatrace, or similar.\nFamiliarity with PostgreSQL and MongoDB.\nExperience designing and executing performance experiments designed to validate performance improvements in key metrics such as requests per second (RPS), P95 and P99 latency, query performance, request concurrency, CPU/memory utilization, and cost efficiency.\nExcellent written and verbal communication skills. In particular, the ability to convey technical issues and solutions in written form and work with disparate teams is important in a remote-friendly team.\nPassion for driving performance improvement in software without sacrificing reliability or security.\nExcellent collaboration skills and a track record of cross-functional collaboration. One team, one score!\n\nBelow is the annual base salary range for candidates located in California, Colorado, New York and Washington. Your actual base salary will depend on factors such as your skills, qualifications, experience, and work location. In addition, Okta offers equity (where applicable), bonus, and benefits, including health, dental and vision insurance, 401(k), flexible spending account, and paid leave (including PTO and parental leave) in accordance with our applicable plans and policies. To learn more about our Total Rewards program please visit: https://rewards.okta.com/us.\n\nThe annual base salary range for this position for candidates located in California (excluding San Francisco Bay Area), Colorado, New York, and Washington is between:\n\n$188,000—$282,000 USD\n\nThe annual base salary range for this position for candidates located in the San Francisco Bay area is between:\n\n$210,000—$316,000 USD\n\nWhat you can look forward to as an Full-Time Okta employee!\n\nAmazing Benefits\nMaking Social Impact\nFostering Diversity, Equity, Inclusion and Belonging at Okta\n\nOkta cultivates a dynamic work environment, providing the best tools, technology and benefits to empower our employees to work productively in a setting that best and uniquely suits their needs. Each organization is unique in the degree of flexibility and mobility in which they work so that all employees are enabled to be their most creative and successful versions of themselves, regardless of where they live. Find your place at Okta today! https://www.okta.com/company/careers/.\n\nOkta is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, marital status, age, physical or mental disability, or status as a protected veteran. We also consider for employment qualified applicants with arrest and convictions records, consistent with applicable laws. If reasonable accommodation is needed to participate in the job application or interview process, please use this Form to request an accommodation.\n\nOkta is committed to complying with applicable data privacy and security laws and regulations. For more information, please see our Privacy Policy at https://www.okta.com/privacy-policy/.\n", "responsibilities": "As a Principal Engineer, you will serve as a senior technical expert within the team, performing complex analysis and writing code to remove performance bottlenecks throughout our software. Develop software in Node.js and some Golang in multiple services that will run in production and help us serve billions of logins per month. Write decision records and RFC’s to communicate technical tradeoffs and approaches and drive awareness and consensus. You will work cross-functionally with service owners, architects, project managers, as well as platform and quality teams to drive performance improvements across our tech stack. You will nurture a “shift left” culture for performance. You will work to improve knowledge and awareness of performance management techniques, tools, patterns, and solutions throughout Engineering in order to address performance issues earlier in the software development life cycle. You will have the opportunity to work with all parts of the Customer Identity Cloud service offering, including code, infrastructure, and architecture.", "qualifications": {"required": "Experience in senior software engineering roles in a remote work environment. Strong self-motivation and aptitude for investigation and experimentation. Experience developing application software in Node.js using frameworks such as Hapi.js or Fastify. Familiarity with Golang is also a plus. Experience with API-driven cloud-native distributed system application architecture running in Kubernetes, AWS, and Azure. Experience with APM tools such as Datadog APM, Splunk, Honeycomb, New Relic, Dynatrace, or similar. Familiarity with PostgreSQL and MongoDB. Experience designing and executing performance experiments designed to validate performance improvements in key metrics such as requests per second (RPS), P95 and P99 latency, query performance, request concurrency, CPU/memory utilization, and cost efficiency. Excellent written and verbal communication skills. In particular, the ability to convey technical issues and solutions in written form and work with disparate teams is important in a remote-friendly team. Passion for driving performance improvement in software without sacrificing reliability or security. Excellent collaboration skills and a track record of cross-functional collaboration. One team, one score!", "preferred": "Not specified"}, "skills": ["Node.js", "Golang", "API-driven cloud-native distributed system application architecture", "Kubernetes", "AWS", "Azure", "APM tools", "PostgreSQL", "MongoDB", "Performance management techniques", "Excellent written and verbal communication skills", "Collaboration skills"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Amazing Benefits, Making Social Impact, Fostering Diversity, Equity, Inclusion and Belonging at Okta", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3998884414"}