{"jobTitle": "Content Strategist", "company": {"name": "Meta", "industry": "Technology, Information and Internet", "size": "Not specified", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$143,000.00 - $208,000.00", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Technology, Information and Internet", "description": "Meta’s Culture Programs team is looking for an experienced and innovative learning or communications professional with exceptional creative writing and content strategy skills to join our team and to help contribute to building and sustaining a culture of compliance and ethics at Meta by enabling Meta Personnel to comply with company policies and navigate ethical considerations. This individual will work closely with other team members, cross-functional partners and external vendors, to develop and execute engaging and informative Legal, Compliance & Ethics content across our areas of focus including new hire, annual, role and risk based, leader/manager learning, and for various platforms and formats including ongoing learning reinforcement activities, reference resources, refresher campaigns and experiential events. You're right for this role if you are obsessed with creating the best learner experience, demystifying complex concepts, bringing creativity to your work while staying focused on the business need and culture, and you align with Meta's values, and thrive in a collaborative environment.", "responsibilities": "For specific projects, identify the business need and craft an effective solution to deliver strategic learning content to Meta’s workforce that helps shape perceptions about and build compliance & ethics acumen. Contribute to the development of an ongoing engagement and content strategy to enable Meta Personnel to comply with company policies and navigate ethical considerations. Leverage exceptional creative writing and storytelling skills to craft compelling, engaging, relevant content to make legal and compliance concepts accessible and understandable to a company-wide audience. Where needed, oversee contingent workers and vendor resources in the development of engaging learning assets for a global audience, including instructor-led materials, communications, employee engagement activities, e-learns, video/animations, and resources to support people in the flow of their work. Demonstrate strong ability to engage with partners and team members of all levels including leaders, communicating effectively, driving alignment, staying focused on goals and target outcomes, and facilitating progress. Work in partnership with our Learning & Analytics & Measurement team to develop measurement plans, assess impact and effectiveness of projects, and utilize insights gathered to inform future work on the programs. Demonstrate attention to detail in executing and reviewing work products to ensure the highest quality deliverables within approved timelines and budget. Display effective organizational skills while managing multiple and competing priorities. Managing project timelines and tasks, and keep project plans and statuses up-to-date. Contribute to shaping our team's strategic direction, bringing innovative ideas that help achieve our team's mission and vision. This job may require occasional travel for team on-sites or for stakeholder meetings at various domestic Meta offices. Identify and escalate issues or roadblocks quickly and find appropriate solutions to keep project(s) moving forward.", "qualifications": {"required": "10+ years of experience in learning & development, communications, or a related field, designing and/or writing for different modalities and for the purposes of influencing and shaping mindsets and behaviors. Experience leading projects, facilitating partnerships and leading meetings with senior business stakeholders. Experience working in a fast-paced, deliverables-based environment.", "preferred": "Degree (or equivalent continuing education) in Learning Science, Education, Writing, Communications, Media Production, Legal, Compliance, or related field. Experience designing solutions that integrate less traditional learning modalities, including interactive video, produced segments for communications, podcasts, experiential activities, just-in-time support. Experience working in the Legal, Compliance & Ethics space in a heavily regulated environment."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Meta offers benefits including bonus and equity.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3998549185"}