{"jobTitle": "3D Capture Producer", "company": {"name": "Sony", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Entertainment Providers", "description": "<strong>Sony Corporation of America</strong>, located in New York, NY, is the U.S. headquarters of Sony Group Corporation, based in Tokyo, Japan. Sony's principal U.S. businesses include Sony Electronics Inc., Sony Interactive Entertainment LLC, Sony Music Entertainment, Sony Music Publishing and Sony Pictures Entertainment Inc. With some 900 million Sony devices in hands and homes worldwide today, a vast array of Sony movies, television shows and music, and the PlayStation Network, Sony creates and delivers more entertainment experiences to more people than anyone else on earth. To learn more: <strong>www.sony.com/en</strong>.<br/><br/><strong>Position Summary<br/><br/></strong>Sony Corporation of America is seeking a highly organized and detail-oriented 3D Capture Producer to join our team in Culver City, CA. In this pivotal role, you will oversee the scheduling, coordination, and execution of 3D capture sessions, ensuring seamless communication between talent, crew members, and various production departments. You will play a critical role in managing the entire capture process, from the talent's arrival to the completion of their session, while also contributing to the creative and technical improvement of our 3D content production pipeline.<br/><br/><strong>This is a one-year fixed term role.<br/><br/></strong><strong>Responsibilities<br/><br/></strong><ul><li>Oversee and manage the full schedule of 3D capture sessions, ensuring efficient operation from the talent’s arrival through their exit.</li><li>Serve as the primary point of contact for talent and casting, facilitating smooth communication and addressing any concerns.</li><li>Handle all necessary paperwork, including contracts and release forms, and manage hospitality arrangements for talent.</li><li>Monitor and track the capture session schedule, providing regular updates to crew members on progress and any arising issues.</li><li>Collaborate closely with capture directors, R&amp;D teams, and other crew members to address and resolve technical challenges during production.</li><li>Participate in team brainstorming sessions, offering analytical and creative input to enhance productivity and elevate the quality of 3D content.<br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong><ul><li>Bachelor’s degree in Film, Communications, or a related field.</li><li>Minimum of 3 years of hands-on experience as a producer, ideally within game, film, or TV animation studios.</li><li>Exceptional organizational skills with a keen eye for detail.</li><li>Proven ability to multitask and thrive in a fast-paced, deadline-driven environment.</li><li>Strong communication and interpersonal skills, with the ability to liaise effectively with diverse teams.</li><li>Proficiency in basic office software (e.g., Microsoft Office) and familiarity with production software (e.g., Adobe Creative Suite) is a plus.</li><li>Authorization to work in the USA.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Basic skills in make-up application and hair preparation for talent, ensuring they are camera-ready.<br/><br/></li></ul><strong>Benefits:</strong><strong> </strong>   <br/><br/>SCA offers fixed term temporary employees (scheduled to work 30 or more hours a week) the following benefits-<br/><br/> <br/><br/>  What we offer you: <br/><br/><ul><li>Comprehensive medical, prescription drug, dental, and vision coverage with coverage for spouses/domestic partners and child dependents</li><li>Employee assistance plan</li><li>Access to a Wellness Program<br/><br/></li></ul>  <br/><br/>Other Programs:  <br/><br/><ul><li>Time off to include paid holidays, sick leave, Summer Fridays (early release), and a winter break between Christmas and New Year’s Day (based on business needs)  </li><li>A wide variety of employee business resource groups (EBRGs)    </li><li>Special discounts on Sony products<br/><br/></li></ul><em>The anticipated annual base salary for this position is $75,000 to $85,000. This range does not include any other compensation components or other benefits that an individual may be eligible for. The actual base salary offered depends on a variety of factors, which may include as applicable, the qualifications of the individual applicant for the position, years of relevant experience, specific and unique skills, level of education attained, certifications or other professional licenses held, and the location in which the applicant lives and/or from which they will be performing the job. <br/><br/></em>Sony is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religious creed, sex (including pregnancy), gender, national origin, citizenship, ancestry, age, physical or mental disability, military status, status as a veteran or disabled veteran, sexual orientation, gender identity or expression, marital or family status, genetic information, medical condition, or any other basis protected by applicable federal, state, or local law, ordinance, or regulation.<br/><br/><strong>Disability Accommodation for Applicants to Sony Corporation of America<br/><br/></strong>Sony Corporation of America provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in job application procedures. For reasonable accommodation requests, please contact us by email at careers@sonyusa.com or by mail to: Sony Corporation of America, Human Resources Department, 25 Madison Avenue, New York, NY 10010. Please indicate the position you are applying for.<br/><br/>EEO is the Law<br/><br/>EEO is the Law Supplement<br/><br/>Right to Work (English/Spanish)<br/><br/>E-Verify Participation (English/Spanish)<br/><br/><em>While SCA does not require employees to be vaccinated against COVID-19, there are certain Sony offices that require employees to be vaccinated in order to enter. If you will be located at or travel to those offices, you will be required to be fully vaccinated to enter. The Company will consider requests for reasonable accommodations for documented medical reasons and for sincerely held religious beliefs in accordance with applicable law. Please do not include proof of vaccination status or any indication of a possible request for a vaccination accommodation when submitting your application materials. If applicable, the Company will follow up with you directly to request proof of vaccination and to discuss any potential accommodations.</em>", "responsibilities": "<ul><li>Oversee and manage the full schedule of 3D capture sessions, ensuring efficient operation from the talent’s arrival through their exit.</li><li>Serve as the primary point of contact for talent and casting, facilitating smooth communication and addressing any concerns.</li><li>Handle all necessary paperwork, including contracts and release forms, and manage hospitality arrangements for talent.</li><li>Monitor and track the capture session schedule, providing regular updates to crew members on progress and any arising issues.</li><li>Collaborate closely with capture directors, R&amp;D teams, and other crew members to address and resolve technical challenges during production.</li><li>Participate in team brainstorming sessions, offering analytical and creative input to enhance productivity and elevate the quality of 3D content.<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Bachelor’s degree in Film, Communications, or a related field.</li><li>Minimum of 3 years of hands-on experience as a producer, ideally within game, film, or TV animation studios.</li><li>Exceptional organizational skills with a keen eye for detail.</li><li>Proven ability to multitask and thrive in a fast-paced, deadline-driven environment.</li><li>Strong communication and interpersonal skills, with the ability to liaise effectively with diverse teams.</li><li>Proficiency in basic office software (e.g., Microsoft Office) and familiarity with production software (e.g., Adobe Creative Suite) is a plus.</li><li>Authorization to work in the USA.<br/><br/></li></ul>", "preferred": "<ul><li>Basic skills in make-up application and hair preparation for talent, ensuring they are camera-ready.<br/><br/></li></ul>"}, "skills": ["3D Capture", "Production", "Scheduling", "Coordination", "Communication", "Talent Management", "Paperwork", "Hospitality", "Problem Solving", "Brainstorming", "Microsoft Office", "Adobe Creative Suite"], "postedDate": "1 week ago", "benefits": "SCA offers fixed term temporary employees (scheduled to work 30 or more hours a week) the following benefits-<br/><br/> <br/><br/>  What we offer you: <br/><br/><ul><li>Comprehensive medical, prescription drug, dental, and vision coverage with coverage for spouses/domestic partners and child dependents</li><li>Employee assistance plan</li><li>Access to a Wellness Program<br/><br/></li></ul>  <br/><br/>Other Programs:  <br/><br/><ul><li>Time off to include paid holidays, sick leave, Summer Fridays (early release), and a winter break between Christmas and New Year’s Day (based on business needs)  </li><li>A wide variety of employee business resource groups (EBRGs)    </li><li>Special discounts on Sony products<br/><br/></li></ul>", "remoteWork": "No", "salary": {"amount": "75,000 to 85,000", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3998500575"}