{"jobTitle": "Secretary", "company": {"name": "NBCUniversal", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "description": "We create world-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world-renowned theme parks and attractions through Universal Destinations &amp; Experiences. NBCUniversal is a subsidiary of Comcast Corporation.<br/><br/>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever-changing face of the world.<br/><br/><strong>Universal Products &amp; Experiences Overview<br/><br/></strong>Universal Products &amp; Experiences (UP&amp;E) globally drives the expansion and elevation of NBCUniversal’s iconic collection of brands, intellectual properties, characters, and stories based on the company’s extensive portfolio of properties created by Universal Pictures, Illumination, DreamWorks Animation and NBCUniversal Television and Streaming. The division executes this through innovative physical and digital products, engaging retail and product experiences across our expansive global theme park destinations (for both owned and 3rd party IP), location-based venues, e-commerce product platforms, and retailers around the world. Along with global brand strategy and creative, UP&amp;E’s three lines of business include Consumer Products, Games and Digital Platforms, as well as Theme Parks Products &amp; Retail. UP&amp;E is a division of Universal Destinations &amp; Experiences, part of NBCUniversal, a subsidiary of Comcast Corporation. https://www.universalproductsexperiences.com/<br/><br/>Universal Products &amp; Experiences is committed to attracting and retaining a diverse workforce of the highest caliber. We are committed to fostering equitable and inclusive environments that honor the experiences, perspectives, and uniqueness of each colleague.<br/><br/>It is the policy of NBCUniversal and NBCUniversal's affiliated businesses to consider all qualified applicants for employment without regard to race, color, religion, national origin, sex (including pregnancy) sexual orientation, age, disability, veteran status or other characteristics protected by applicable law.<br/><br/><strong>Job Description<br/><br/></strong>The Secretary is responsible for managing schedules, coordinating meetings and handling travel arrangements for multiple VP’s in the Universal Products &amp; Experiences division.<br/><br/><ul><li>Hybrid: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.</li><li>Must join Local 174<br/><br/></li></ul>Hourly Rate: $20.50<br/><br/><strong>Qualifications<br/><br/></strong><strong>Essential Responsibilities:<br/><br/></strong><ul><li>Manages complex schedules and coordinates meetings with internal and external parties utilizing multiple calendars</li><li>Coordinates travel schedules and arrangements, collects required travel documentation</li><li>Prepares and processes P-card and expense reports in accordance with established divisional travel policy guidelines; Ensures the timely processing of expenses utilizing the latest electronic processes for payment to Corporate credit card</li><li>Maintains proper recordkeeping and filing system for all work</li><li>Composes and types routine e-mail correspondence</li><li>Performs basic administrative tasks, e.g. faxing, photocopying and filing</li><li>Assists other department members as necessary</li><li>May assist in making arrangements for temporary help, storage, meeting offsites etc.</li><li>Handles phones (including logging, placing and rolling calls) -- Acts as backup for other assistants on the team</li><li>Maintains contact lists<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>At least 2 years of administrative experience</li><li>Proficient in Microsoft Word, Outlook, PowerPoint, and Excel</li><li>Knowledge of all basic office equipment required</li><li>Bachelor's degree (or a High School Diploma/GED and a minimum of 5 years of administrative assistant experience)<br/><br/></li></ul><strong>Eligibility Requirements<br/><br/></strong><ul><li>Interested candidates must submit a resume/CV online to be considered</li><li>Must have unrestricted work authorization to work in the United States</li><li>Must be willing to submit to a background investigation</li><li>Must be willing to join the union.</li><li>Must be covered by Solutions, NBCU’s Alternative Dispute Resolution Program<br/><br/></li></ul><strong>Desired<br/><br/></strong><ul><li>Bachelor's degree strongly preferred</li><li>Prior experience in an entertainment or consumer products environment is highly desired</li><li>Excellent verbal and written communication skills</li><li>Initiative - Demonstrate initiative by confidently self-starting improvements to office procedures, reports and processes and requires minimal supervision</li><li>Detailed Oriented - Pays attention to multiple details and multiple tasks while minimizing errors</li><li>Organization - In order to manage multiple tasks effectively, must be organized in approach and execution of work</li><li>Team Player - Demonstrates ability to work on a team and willingness to give assistance to co-workers in other areas</li><li>Confidentiality - Must be able to maintain department business with the utmost confidentially</li><li>Flexibility - Demonstrates experience working in, and a positive attitude toward a rapidly changing business environment<br/><br/></li></ul><strong>Additional Information<br/><br/></strong>NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.<br/><br/>If you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access nbcunicareers.com as a result of your disability. You can request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.", "jobFunction": "Other", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "postedDate": "1 week ago", "qualifications": {"required": "At least 2 years of administrative experience, Proficient in Microsoft Word, Outlook, PowerPoint, and Excel, Knowledge of all basic office equipment required, Bachelor's degree (or a High School Diploma/GED and a minimum of 5 years of administrative assistant experience)", "preferred": "Bachelor's degree strongly preferred, Prior experience in an entertainment or consumer products environment is highly desired, Excellent verbal and written communication skills, Initiative - Demonstrate initiative by confidently self-starting improvements to office procedures, reports and processes and requires minimal supervision, Detailed Oriented - Pays attention to multiple details and multiple tasks while minimizing errors, Organization - In order to manage multiple tasks effectively, must be organized in approach and execution of work, Team Player - Demonstrates ability to work on a team and willingness to give assistance to co-workers in other areas, Confidentiality - Must be able to maintain department business with the utmost confidentially, Flexibility - Demonstrates experience working in, and a positive attitude toward a rapidly changing business environment"}, "skills": ["Microsoft Word", "Outlook", "PowerPoint", "Excel"], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998867240"}