{"jobTitle": "Sr. Analyst, Content Strategy and Corporate Development", "company": {"name": "MRC", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Internet Publishing", "description": "MRC is a diversified global entertainment company with divisions including Film and Television.<br/><br/><strong>Role Description<br/><br/></strong>The Senior Analyst role is an integral part of the Content Strategy, Corporate Development, and Finance teams. MRC is a cross-functional organization, and the Senior Analyst will work with colleagues across divisions and business units, learning the business inside-and-out. Primary responsibilities include building and maintaining film, TV, and corporate financial forecast models, performing greenlight analyses on prospective film and TV projects, and helping to support strategic and financial corporate and divisional initiatives. A successful candidate has strong financial modeling and analytical skills,multitasks effectively, has a desire to learn, and thrives in a fast-paced, entrepreneurial environment<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Build and maintain film &amp; TV project models to analyze acquisition, financing, production, and distribution opportunities</li><li>Build and maintain corporate and divisional financial models in support of M&amp;A activity and strategic initiatives</li><li>Develop and manage processes for maintaining internal databases and conducting relevant performance analyses</li><li>Perform various financial analyses and industry-related research, tracking and compiling industry trends and performing competitive analyses to inform strategic decision-making</li><li>Assist in monthly reporting and analysis for corporate and divisional financial planning (including management of MRC’s credit facilities)</li><li>Support FP&amp;A team in the preparation of Quarterly Business Reviews, Annual Operating Plans, and 5yr Long-Range Business Plans</li><li>Partner with FP&amp;A and Accounting teams to identify and implement process efficiencies to improve productivity and quality of forecasts<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Minimum 2 years of experience in investment banking, management consulting, corporate development, content strategy, or other analytical role; media/entertainment experience is a plus</li><li>Bachelor's degree from a leading university (preferably in the finance, business, or related fields) with a strong GPA</li><li>Advanced financial modeling and PowerPoint presentation skills with demonstrated experience in qualitative and quantitative analysis</li><li>Demonstrated communication and interpersonal skills; high degree of professionalism and ability to interact with senior management</li><li>Intellectual curiosity, desire to learn, and a passion for media and entertainment</li><li>Detail-oriented with exceptional organizational skills, including ability to prioritize and manage evolving deadlines</li><li>Strong independent problem-solving skills with ability to thrive in a fast-paced and entrepreneurial environment<br/><br/></li></ul><em>Hiring Salary Range is $95,000 - $105,000 annually. Starting pay for the successful applicant depends on a variety of job-related factors, including, but not limited to, market demands, experience/training, and education.<br/><br/>MRC is an equal employment opportunity employer. All applicants and potential candidates are evaluated on the basis of their qualifications, consistent with applicable local, state, and federal laws.<br/><br/></em>Powered by JazzHR<br/><br/>60yrHfEApZ", "responsibilities": "Build and maintain film & TV project models to analyze acquisition, financing, production, and distribution opportunities, Build and maintain corporate and divisional financial models in support of M&A activity and strategic initiatives, Develop and manage processes for maintaining internal databases and conducting relevant performance analyses, Perform various financial analyses and industry-related research, tracking and compiling industry trends and performing competitive analyses to inform strategic decision-making, Assist in monthly reporting and analysis for corporate and divisional financial planning (including management of MRC’s credit facilities), Support FP&A team in the preparation of Quarterly Business Reviews, Annual Operating Plans, and 5yr Long-Range Business Plans, Partner with FP&A and Accounting teams to identify and implement process efficiencies to improve productivity and quality of forecasts", "qualifications": {"required": "Minimum 2 years of experience in investment banking, management consulting, corporate development, content strategy, or other analytical role; media/entertainment experience is a plus, Bachelor's degree from a leading university (preferably in the finance, business, or related fields) with a strong GPA, Advanced financial modeling and PowerPoint presentation skills with demonstrated experience in qualitative and quantitative analysis, Demonstrated communication and interpersonal skills; high degree of professionalism and ability to interact with senior management, Intellectual curiosity, desire to learn, and a passion for media and entertainment, Detail-oriented with exceptional organizational skills, including ability to prioritize and manage evolving deadlines, Strong independent problem-solving skills with ability to thrive in a fast-paced and entrepreneurial environment", "preferred": ""}, "skills": ["Financial Modeling", "PowerPoint", "Analysis", "Communication", "Problem Solving"], "postedDate": "1 week ago", "salary": {"amount": "$95,000 - $105,000", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998210856"}