{"jobTitle": "Associate Account Manager", "company": {"name": "Pandora", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "<strong>Who We Are<br/><br/></strong>SiriusXM and its brands (Pandora, SiriusXM Media, AdsWizz, Simplecast, and SiriusXM Connect) are leading a new era of audio entertainment and services by delivering the most compelling subscription and ad-supported audio entertainment experience for listeners -- in the car, at home, and anywhere on the go with connected devices. Our vision is to shape the future of audio, where everyone can be effortlessly connected to the voices, stories and music they love wherever they are.<br/><br/>This is the place where a diverse group of emerging talent and legends alike come to share authentic and purposeful songs, stories, sounds and insights through some of the best programming and technology in the world. Our critically-acclaimed, industry-leading audio entertainment encompasses music, sports, comedy, news, talk, live events, and podcasting. No matter their individual role, each of our employees plays a vital part in bringing SiriusXM’s vision to life every day.<br/><br/><strong>SiriusXM Media</strong> is the gateway for marketers to the largest digital audio advertising ecosystem in North America. As the combined advertising revenue organization of Sirius XM Holdings Inc., SiriusXM Media spans across leading owned and operated audio platforms Pandora and SiriusXM; innovative ad tech solutions powered by AdsWizz; sonic creative consultancy Studio Resonate; and an extended content network featuring exclusive monetization agreements with Audiochuck, NBCUniversal, SoundCloud, and many more. Reaching more than 150 million listeners each month, SiriusXM Media delivers audiences the tailored brand experiences they crave while putting creators first, making it easy for every marketer to produce, plan, buy and measure across its entire audio universe.<br/><br/><strong>How You’ll Make An Impact<br/><br/></strong>The Associate Account Manager will support the day-to-day needs of the Client Services team, helping Account Managers to flawlessly execute campaigns for Advertisers/Agencies and drive revenue for SXM Media. Your team will include thoughtful, problem-solving individuals who are passionate about growing the SXM Media brands.<br/><br/><strong>What You’ll Do<br/><br/></strong><ul><li>Partner with Account Managers to execute a myriad of operational tasks including building media plans, executing insertion orders, ensuring creative is deployed properly and assisting with research requests</li><li>Align with core pod teams to support high-touch clients and their campaign needs</li><li>Learn the ins and outs of advertising from a collaborative and passionate team</li><li>Assist in monitoring campaigns and ensure campaign delivery across various ad serving systems</li><li>Collaborate with billing team to resolve monthly invoicing queries (as assigned)</li><li>Provide other ad-hoc account-related support</li><li>Delegate work as necessary to internal resources<br/><br/></li></ul><strong>What You’ll Need<br/><br/></strong><ul><li>Experience in digital/radio/mobile planning, buying, or account/project management</li><li>Previous customer service-oriented role a plus</li><li>Excellent written and verbal communication</li><li>Ability to be self-motivated, organized, detail-oriented, able to prioritize, and excel in a fast-paced environment</li><li>Strong work ethic</li><li>Previous experience with Google Drive and Microsoft Office Suite, particularly in Excel &amp; PowerPoint is a plus</li><li>Must have legal right to work in the U.S.<br/><br/></li></ul>At SiriusXM, we carefully consider a wide range of factors when determining compensation, including your background and experience. These considerations can cause your compensation to vary. We expect the base salary for this position to be in the range of $48,000 to $65,000 and will depend on your skills, qualifications, and experience. Additionally, this role might be eligible for discretionary short-term and long-term incentives. We encourage all interested candidates to apply.<br/><br/>Our goal at SiriusXM is to provide and maintain a work environment that fosters mutual respect, professionalism and cooperation. SiriusXM is an equal opportunity employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, national origin, ancestry, alienage or citizenship status, age, disability or handicap, sex, gender identity, marital status, familial status, veteran status, sexual orientation or any other characteristic protected by applicable federal, state or local laws.<br/><br/>The requirements and duties described above may be modified or waived by the Company in its sole discretion without notice.<br/><br/>R-2024-06-126", "jobFunction": "Advertising", "industry": "Entertainment Providers and Broadcast Media Production and Distribution", "postedDate": "1 week ago", "skills": ["Digital", "Radio", "Mobile", "Customer Service", "Communication", "Google Drive", "Microsoft Office Suite", "Excel", "PowerPoint"], "url": "https://www.linkedin.com/jobs/view/3998502897"}