{"jobTitle": "SHIPPING ADMINISTRATOR II", "company": {"name": "Marvin Engineering Company", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$23.00/hr - $26.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing", "description": "Date: Jul 25, 2024<br/><br/>Location:<br/><br/>Inglewood, CA, US, 90302<br/><br/>Company: Marvin Engineering Co.<br/><br/>Req ID: 928<br/><br/>FLSA Status: Non Exempt<br/><br/>Pay Range: $23.00 - 26.00<br/><br/><strong>The Marvin Group is a Strategic Partner for Global Alternate Mission Equipment and Sustainment<br/><br/></strong>The Marvin Group, a leading defense contractor, plays a crucial role in the development and manufacturing of various systems for military aerospace and vehicles. Based in Southern California near the Los Angeles International Airport, The Marvin Group consists of Marvin Engineering (MEC), Marvin Test Solutions (MTS) and Marvin Land Systems (MLS). Marvin Engineering designs and produces military Alternate Mission Equipment. Marvin Test Solutions designs and manufactures armament Test Equipment. Marvin Land Systems specializes in the design and build of power and thermal management systems. For over 60 years we have maintained “<em>A Tradition of Excellence</em>”, serving as a trusted source for our unwavering commitment to supporting all branches of the Department of Defense and our global allies. Our collaboration extends across a diverse array of programs and platforms, including major military prime contractors such as Lockheed Martin, Northrop Grumman, and Raytheon.<br/><br/><strong>POSITION SUMMARY: </strong>Administrator II performs tasks with minimal supervision. Confidently completes routine administrative tasks such as, but not limited to cross-referencing delivery note information with contractual requirements. Create and submit supporting documentation for approval prior to shipping out.<br/><br/><ul><li>Prepare initial delivery note supporting documentation for subsequent process review.</li><li>Ensure data entry in ERP system (SAP) and supporting documentation is accurate for domestic and international orders including hazardous material. </li><li>Support Shipping Administrator III &amp; I by performing peer reviews for exactness, neatness, and conformance to contractual requirements, policies, and procedures.</li><li>Complete administrative tasks in the most organized, efficient, and productive manner. </li><li>Provide guidance and instructions to Shipping Administrator I when applicable.</li><li>Accurately create and submit Wide Area Workflow Report (WAWF), Shipping Instruction Request (SIR), FOB Destination, TMS Issues, TMS Lockout &amp; Post Goods Issue (PGI).</li><li>Prepares the final acceptance copies and includes the necessary documents in the jacket or folder for the specific item or product. </li><li>Provide customer service to internal customers, such as Program Management and DCMA Liaison…etc. </li><li>Provide feedback to management for process and procedure improvements and assist with implementation.</li><li>Identify and escalate process issues to Shipping Administrator III and Supervisor<br/><br/><br/></li></ul><strong>SKILLS AND REQUIREMENTS:<br/><br/></strong><ul><li>Attendance and punctuality are an essential job duty.</li><li>High School Diploma or G.E.D.</li><li>3+ years of working experience in complex warehouse and distribution environments, preferably in the aerospace or military industry.</li><li>Some understanding of Military Shipment process is a plus.</li><li>Must be able to speak, read and write in English proficiently.</li><li>Basic math skills. </li><li>Strong data entry skills. </li><li>Proficient use of MS Office and ERP systems. (SAP experience preferred) </li><li>Ability to multitask in a fast-paced environment.</li><li>Ability to work independently and be a team player.</li><li>Must be detail oriented. </li><li>Must be able to lift 35lbs. </li><li>Adherence to Marvin Engineering Co, Inc. policies and procedures.</li><li>May be required to work overtime.<br/><br/><br/></li></ul><strong>WORK ENVIRONMENT:<br/><br/></strong><ul><li>Office / Warehouse <br/><br/><br/></li></ul><strong>TRAVEL REQUIREMENTS:<br/><br/></strong>There are typically no travel requirements for this position (0%)<br/><br/><strong>NOTES: </strong>This job description in no way states or implies that these are the only duties to be performed by this position's employee(s). Employees will be required to follow any other job-related instructions and perform any other job-related duties requested by anyone authorized to give instructions or assignments. All duties and responsibilities are essential functions and requirements and are subject to possible modification to accommodate individuals with disabilities reasonably. To perform this job successfully, the employee(s) will possess the skills, aptitudes, and abilities to perform each duty proficiently. Some requirements may exclude individuals who pose a direct threat or significant risk to the health or safety of themselves or others. The requirements listed in this document are the minimum levels of knowledge, skills, or abilities. This document does not create an employment contract, implied or otherwise, other than an at-will relationship.<br/><br/><em>This position must meet export control compliance requirements. All applicants must be “U.S. persons” within the meaning of ITAR, as defined: a U.S. Citizen, a lawful permanent resident, political asylee, or refugee.<br/><br/></em><em>Interested parties please apply online and submit resume to </em><em>https://jobs.marvingroup.com/ <br/><br/></em><em>Visit us at </em><em>https://http://marvingroup.com/<br/><br/>The Marvin Group is an EEO/AA/Disability/Vets Employer.<br/><br/>Our company uses E-Verify to confirm the employment eligibility of all newly hired employees. To learn more about E-Verify, including your rights and responsibilities, please visit www.dhs.gov/E-Verify.<br/><br/>If you are an individual with a disability and require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact People &amp; Culture at 310.674.5030.<br/><br/></em><strong>Nearest Major Market: </strong>Los Angeles", "responsibilities": "Administrator II performs tasks with minimal supervision. Confidently completes routine administrative tasks such as, but not limited to cross-referencing delivery note information with contractual requirements. Create and submit supporting documentation for approval prior to shipping out.<br/><br/><ul><li>Prepare initial delivery note supporting documentation for subsequent process review.</li><li>Ensure data entry in ERP system (SAP) and supporting documentation is accurate for domestic and international orders including hazardous material. </li><li>Support Shipping Administrator III &amp; I by performing peer reviews for exactness, neatness, and conformance to contractual requirements, policies, and procedures.</li><li>Complete administrative tasks in the most organized, efficient, and productive manner. </li><li>Provide guidance and instructions to Shipping Administrator I when applicable.</li><li>Accurately create and submit Wide Area Workflow Report (WAWF), Shipping Instruction Request (SIR), FOB Destination, TMS Issues, TMS Lockout &amp; Post Goods Issue (PGI).</li><li>Prepares the final acceptance copies and includes the necessary documents in the jacket or folder for the specific item or product. </li><li>Provide customer service to internal customers, such as Program Management and DCMA Liaison…etc. </li><li>Provide feedback to management for process and procedure improvements and assist with implementation.</li><li>Identify and escalate process issues to Shipping Administrator III and Supervisor<br/><br/><br/></li></ul>", "qualifications": {"required": "Attendance and punctuality are an essential job duty.<br/>High School Diploma or G.E.D.<br/>3+ years of working experience in complex warehouse and distribution environments, preferably in the aerospace or military industry.<br/>Some understanding of Military Shipment process is a plus.<br/>Must be able to speak, read and write in English proficiently.<br/>Basic math skills. <br/>Strong data entry skills. <br/>Proficient use of MS Office and ERP systems. (SAP experience preferred) <br/>Ability to multitask in a fast-paced environment.<br/>Ability to work independently and be a team player.<br/>Must be detail oriented. <br/>Must be able to lift 35lbs. <br/>Adherence to Marvin Engineering Co, Inc. policies and procedures.<br/>May be required to work overtime.", "preferred": null}, "skills": ["SAP", "ERP", "MS Office", "Data Entry", "Customer Service", "Military Shipment", "Warehouse", "Distribution", "Aerospace", "Military"], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": null, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998115810"}