{"jobTitle": "Intermediate Architect", "company": {"name": "Studio Murnane", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Design Services", "description": "Intermediate Architect<p><br/></p><p>We are seeking a design-oriented, problem-solving, creative person to fill a full-time, mid-level Architect position. This role is ideal for someone looking to gain valuable design and construction experience in a team and individually driven environment. Main responsibilities will include assisting in the design process from schematic phases to construction documentation and permitting (LADBS experience a plus). Candidates must have previous experience working on presentation materials and construction drawing sets. This position requires a highly motivated individual ready to learn and perform project management duties.</p><p><br/></p><p>What You Will Do:</p><ul><li>Assist the Director of Architecture and Creative Director with architecture and interior design-related project tasks, such as assisting in creative development through research, imagery presentations, technical drawings, 3D renderings, and BIM modeling.</li><li>Assist the Director of Architecture with schematic and design development, including sourcing, speciﬁcations, and rendering. Work closely with Studio architects and other designers to support their needs. Schedule, facilitate, and attend client-facing and on-site GC meetings; track notes and next steps; delegate tasks to support team members.</li><li>Coordinate responses to RFI’s and lead construction administration related to architecture and interior design detailing – Produce architectural and construction drawings.</li><li>Assist with permitting and permit corrections as needed.</li></ul><p><br/></p><p>Your Qualifications:</p><ul><li>Professional degree in architecture from an accredited university.</li><li>Minimum 4-7 years professional experience.</li><li>Strong conceptual, 3D, and technical construction ability.</li><li>Experience producing drawing sets – all phases, including presentations.</li><li>Fluency in AutoCAD, Revit, Adobe Suite, Rhino, and V-Ray.</li><li>Physical Model-building.</li><li>Knowledge of construction detailing and drawing composition.</li><li>Excellent communication skills and work ethic.</li><li>Come to the Studio ready to work, energetic, consistent, and reliable.</li><li>Organized and experienced at managing time and multiple projects.</li><li>Exceptionally detail-oriented, highly professional, and self-motivated.</li><li>Excellent written and verbal communication skills.</li><li>Strong project management skills.</li><li>Work as part of a team, be a team player, problem-solver, and holistic thinker – Mindful of design trends, awards, and tradeshows.</li></ul><p><br/></p><p>About Studio Murnane:</p><p>Cleo and McShane Murnane oversee a group of inspired designers that make up Studio Murnane, an integrated design and architecture firm in the Silver Lake neighborhood of Los Angeles, CA. With various residential, commercial, and development projects, this young firm offers creative 2D and 3D design solutions to a diverse range of clients.</p><p><br/></p><p>Please send CV / Resume, Portfolio web-link and/or pdf work sample to info@studiomurnane.com with the subject line: Full Time Architect</p>", "responsibilities": "Assist the Director of Architecture and Creative Director with architecture and interior design-related project tasks, such as assisting in creative development through research, imagery presentations, technical drawings, 3D renderings, and BIM modeling. Assist the Director of Architecture with schematic and design development, including sourcing, speciﬁcations, and rendering. Work closely with Studio architects and other designers to support their needs. Schedule, facilitate, and attend client-facing and on-site GC meetings; track notes and next steps; delegate tasks to support team members. Coordinate responses to RFI’s and lead construction administration related to architecture and interior design detailing – Produce architectural and construction drawings. Assist with permitting and permit corrections as needed.", "qualifications": {"required": "Professional degree in architecture from an accredited university. Minimum 4-7 years professional experience. Strong conceptual, 3D, and technical construction ability. Experience producing drawing sets – all phases, including presentations. Fluency in AutoCAD, Revit, Adobe Suite, Rhino, and V-Ray. Physical Model-building. Knowledge of construction detailing and drawing composition. Excellent communication skills and work ethic. Come to the Studio ready to work, energetic, consistent, and reliable. Organized and experienced at managing time and multiple projects. Exceptionally detail-oriented, highly professional, and self-motivated. Excellent written and verbal communication skills. Strong project management skills. Work as part of a team, be a team player, problem-solver, and holistic thinker – Mindful of design trends, awards, and tradeshows."}, "skills": ["AutoCAD", "Revit", "Adobe Suite", "Rhino", "V-Ray", "Project Management", "Communication", "Construction", "Design", "Architecture"], "postedDate": "1 week ago", "url": "https://www.linkedin.com/jobs/view/3998458137"}