{"jobTitle": "Sales Director - Merchant Services Sales", "company": {"name": "Aces Payments", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "description": "Company: Aces Payments<br/><br/>Position: Sales Director<br/><br/>Reports to: VP of Sales<br/><br/>Department: Sales<br/><br/>Sub Department: Sales Leadership<br/><br/>Industry: Merchant Services Sales<br/><br/>Position Overview<br/><br/>At Aces, our Sales Directors have the unique opportunity to be pioneers in the payments space, bringing their vision to life from the ground up. As a rapidly growing start-up, led by a team of industry veterans, we offer an exciting and dynamic environment where you can apply your proven sales strategies and leadership skills to build and lead your own team of high-performing sales professionals. This hybrid role allows you to continue expanding your own portfolio through personal sales while also earning overrides on your growing team’s bonuses and residuals. Without restrictive territory constructs, you'll have the freedom to prospect merchants and manage sales professionals wherever your network takes you.<br/><br/>Key Responsibilities<br/><br/>\n<ul><li>Leadership and Mentorship: Lead, train, and mentor a team of Senior Payments Advisors, fostering a collaborative and high-performance culture.</li><li>Portfolio Expansion: Actively prospect and close new business deals to expand your personal portfolio while supporting your team’s sales efforts.</li><li>Client Relationship Management: Cultivate and maintain strong relationships with key clients and partners, ensuring satisfaction and loyalty.</li><li>Performance Monitoring: Regularly review team performance metrics and provide constructive feedback and coaching to drive continuous improvement.</li><li>Utilize Advanced Lead Mining Tools: Leverage our comprehensive sales and marketing intelligence platform which provides access to extensive databases of contact information, company profiles, and other business-related data to help you identify leads and target prospects.<br/><br/></li></ul>Key Requirements<br/><br/>\n<ul><li>Experience: Minimum of 3 years of experience selling payment processing/merchant services, with a proven track record of success.</li><li>Commitment: A full-time, remote outside sales position requiring a commitment of at least 32 hours per week.</li><li>Time Allocation: Dedicate a minimum of 50% of your time prospecting and meeting with potential clients and referral partners outside your home office.</li><li>Team Expansion: Prospecting, recruiting and building your team of Senior Payments Advisors.</li><li>Reporting: Report directly to the Vice President of Sales, providing regular updates on team performance and market conditions.<br/><br/></li></ul>Who We’re Looking For<br/><br/>\n<ul><li>Top-tier talent and leading experts with an in-depth understanding of the payments industry, including merchant acquiring, payment processing, and related technologies.</li><li>Sales leaders who can develop and implement effective sales strategies, leveraging their industry knowledge and network.</li><li>Professionals dedicated to delivering exceptional service and support to both customers and team members.</li><li>Individuals who will embody our company values, leading with integrity and holding themselves to the highest standards of excellence.</li><li>Ability to thrive in a dynamic environment, managing multiple priorities and adapting to changing market conditions.</li><li>A guiding force who understands the importance of empathy in client relationships and team management, ensuring everyone feels valued and supported.<br/><br/></li></ul>At Aces Payments, we're on the lookout for trailblazers in the payments industry who thrive in the exhilarating world of startups. Our leadership team, composed of industry veterans with a proven track record, sets the stage for innovation and growth. We’re seeking visionary individuals driven by a deep-seated desire to innovate and create, making a meaningful impact on our company's trajectory. Embracing our startup ethos means diving into a fast-paced, dynamic environment where flexibility and adaptability reign supreme. Our environment fosters unparalleled growth opportunities, allowing team members to take on diverse roles and responsibilities that accelerate professional development. We welcome candidates with an entrepreneurial spirit, eager to build something transformative and navigate the challenges of scaling a new venture.<br/><br/>What We Offer<br/><br/>\n<ul><li>Experienced leadership team with a combined 90+ years of industry experience, committed to supporting your success.</li><li>Our W-2 commissioned compensation model is performance-based, offering no base salary; however, the earning potential exceeds most traditional base salaries.</li><li>Generous bonus advance percentages and recurring residual splits that surpass those offered by major industry processors.</li><li>Ownership of portfolio with true lifetime reoccurring residuals and no forced buyouts.</li><li>Autonomous working environment where potential is unlimited, respect is a given, and shared success is the ultimate goal.</li><li>Territorial freedom that empowers you to leverage your network to fill your sales and recruiting pipelines.</li><li>Dedicated concierge support for seamless onboarding and client support.</li><li>Recognition of excellence through team-building activities and incentive contests, including exclusive trips and prizes.</li><li>Access to powerful lead-generation tools and resources.<br/><br/></li></ul>Comprehensive Benefits<br/><br/>\n<ul><li>401(k) with company match</li><li>Medical insurance</li><li>Vision insurance</li><li>Dental insurance</li><li>Monthly cell phone stipend<br/><br/></li></ul>Become an Ace<br/><br/>Aces Payments emerged as a refuge from corporations that prioritize profits over the genuine needs of their customers and employees. With a bold mission to redefine the payments industry, we seek to assemble a team of visionary experts who embody Aces' core values and lead the charge in transforming the payment landscape.<br/><br/>If you are a seasoned sales leader looking to build your own merchant sales team, creating a legacy of success from the ground up, we invite you to apply for the Sales Director position at Aces Payments.<br/><br/>Join a community of like-minded individuals dedicated to shaping the future of payment solutions and driving meaningful change in the industry.<br/><br/>_________<br/><br/>About Aces Payments<br/><br/>The story of Aces Payments is one of empowerment, commitment, and unwavering dedication. Founded in 2022, Aces emerged as a sanctuary from corporations that prioritize profits over the genuine needs of customers and employees. With a mission to revolutionize the payments industry, we're building a team of industry experts who embody Aces' core values of integrity, innovation, and customer-centricity. Aces Payments remains privately-owned and self-funded, allowing it the autonomy to prioritize its vision without external influences.<br/><br/>At Aces, we are more than just a payment solutions provider; we are your trusted partner, prioritizing your concerns, feelings, and immediate needs above all else. Business at Aces is personal—we intertwine cutting-edge merchant solutions with a genuine human touch, ensuring the success and happiness of every individual within our network.<br/><br/>Our Vision<br/><br/>Led by a team of industry experts with a combined 90+ years of industry experience, Aces' mission is to revolutionize the payments industry by creating a safe haven for merchants and sales partners alike. We aim to empower growth, stability, and success, providing peace of mind in every payment. At Aces, we're dedicated to fostering respect, commitment, and unwavering support, empowering industry professionals to thrive autonomously in an environment that prioritizes and recognizes sales aspirations.<br/><br/>What We Offer<br/><br/>Aces offers a reliable partnership with safe, innovative solutions tailored to businesses of all sizes. Our dedicated concierge support swiftly and proactively alleviates concerns, freeing up time and protecting your bottom line. We provide an empowering environment where our sales partners thrive.<br/><br/>Our Commitment<br/><br/>We are committed to building strong, trusting relationships. Every transaction is treated as a partnership, and every partner is treated like family.<br/><br/>✔︎ Human-Centered Approach: We believe in the power of putting people first—both customers and employees drive the heart of our business.<br/><br/>✔︎ Integrity Driven: We operate with integrity and excellence in all endeavors, securing your trust every step of the way.<br/><br/>✔︎ Mutual Success: We cultivate a secure and empowering environment that values each individual behind every transaction, committed to building mutual success.<br/><br/>✔︎ Innovative Solutions: We seamlessly merge cutting-edge solutions with personalized support, empowering sales with tailored care and unmatched proficiency.<br/><br/>✔︎ Unparalleled Support: Our experienced Concierge Support team ensures rapid responses and proactive solutions, alleviating concerns and protecting your bottom line.<br/><br/>✔︎ Trusted Leadership: With over 90 years of combined expertise, our leadership team prioritizes your needs and is dedicated to supporting your success.<br/><br/>✔︎ Peace of Mind: Aces provides a professional safe-haven that genuinely values your well-being and success, standing by you through thick and thin.<br/><br/>At Aces, we are committed to forging transformative partnerships that prioritize your success and well-being, ensuring you thrive in an environment built on trust, innovation, and unwavering support.", "jobFunction": "Sales and Business Development", "industry": "Financial Services", "postedDate": "1 week ago", "benefits": "Experienced leadership team with a combined 90+ years of industry experience, committed to supporting your success.\nOur W-2 commissioned compensation model is performance-based, offering no base salary; however, the earning potential exceeds most traditional base salaries.\nGenerous bonus advance percentages and recurring residual splits that surpass those offered by major industry processors.\nOwnership of portfolio with true lifetime reoccurring residuals and no forced buyouts.\nAutonomous working environment where potential is unlimited, respect is a given, and shared success is the ultimate goal.\nTerritorial freedom that empowers you to leverage your network to fill your sales and recruiting pipelines.\nDedicated concierge support for seamless onboarding and client support.\nRecognition of excellence through team-building activities and incentive contests, including exclusive trips and prizes.\nAccess to powerful lead-generation tools and resources.<br/><br/>\n401(k) with company match\nMedical insurance\nVision insurance\nDental insurance\nMonthly cell phone stipend<br/><br/>", "remoteWork": "Yes", "responsibilities": "Leadership and Mentorship: Lead, train, and mentor a team of Senior Payments Advisors, fostering a collaborative and high-performance culture.\nPortfolio Expansion: Actively prospect and close new business deals to expand your personal portfolio while supporting your team’s sales efforts.\nClient Relationship Management: Cultivate and maintain strong relationships with key clients and partners, ensuring satisfaction and loyalty.\nPerformance Monitoring: Regularly review team performance metrics and provide constructive feedback and coaching to drive continuous improvement.\nUtilize Advanced Lead Mining Tools: Leverage our comprehensive sales and marketing intelligence platform which provides access to extensive databases of contact information, company profiles, and other business-related data to help you identify leads and target prospects.<br/><br/>", "qualifications": {"required": "Experience: Minimum of 3 years of experience selling payment processing/merchant services, with a proven track record of success.\nCommitment: A full-time, remote outside sales position requiring a commitment of at least 32 hours per week.\nTime Allocation: Dedicate a minimum of 50% of your time prospecting and meeting with potential clients and referral partners outside your home office.\nTeam Expansion: Prospecting, recruiting and building your team of Senior Payments Advisors.\nReporting: Report directly to the Vice President of Sales, providing regular updates on team performance and market conditions.<br/><br/>", "preferred": "Top-tier talent and leading experts with an in-depth understanding of the payments industry, including merchant acquiring, payment processing, and related technologies.\nSales leaders who can develop and implement effective sales strategies, leveraging their industry knowledge and network.\nProfessionals dedicated to delivering exceptional service and support to both customers and team members.\nIndividuals who will embody our company values, leading with integrity and holding themselves to the highest standards of excellence.\nAbility to thrive in a dynamic environment, managing multiple priorities and adapting to changing market conditions.\nA guiding force who understands the importance of empathy in client relationships and team management, ensuring everyone feels valued and supported.<br/><br/>"}, "skills": ["Sales", "Leadership", "Mentorship", "Client Relationship Management", "Performance Monitoring", "Lead Mining", "Payment Processing", "Merchant Services", "Sales Strategy", "Customer Service", "Team Management", "Empathy", "Entrepreneurial Spirit", "Innovation", "Growth", "Flexibility", "Adaptability", "Professional Development", "Concierge Support", "Team Building", "Incentive Programs", "Lead Generation"], "url": "https://www.linkedin.com/jobs/view/3998116069"}