{"jobTitle": "Ecommerce Marketing Coordinator", "company": {"name": "Savage X Fenty", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "26.45-28.85", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Retail Apparel and Fashion", "description": "As the Ecommerce Marketing Coordinator, you will collaborate with Brand Marketing, Merchandising, Digital Marketing and the Product Management Team to deliver a seamless online experience for Savage X Fenty customers. This role will support the Ecommerce Marketing Associate to bring the Brand and Merchandising strategy to life. The role will also work closely with the Growth, Product and Data Analytics team to help drive performance in our paid media channels through highly optimized landing pages.<br/><br/><strong>What You Will Do<br/><br/></strong><ul><li>Support the Ecommerce Marketing Associate and ensure website aligns with key Brand and product stories</li><li>Brief the creative team on site/landing page assets needed; project manage and ensure delivery of assets</li><li>Analyze performance of specific site assets, product and media performance to drive optimal user experience</li><li>Work with Product Management Team to maintain, optimize and test Quiz feature to drive qualified leads and New Members</li><li>Support Growth team across media, acquisition, &amp; CRM to drive success across acquisition/retention channels through optimizing customer journey; contributing to the optimization of creative story-telling and digital shopping experiences for new customers, emails, ad creative, landing page creative, quiz and offer optimization</li><li>Continue to develop a highly functional, deeply integrated test-and-learn culture with the Ecommerce Marketing Associate, iterating on the best creative and digital shopping funnel experiences to maximize efficient customer acquisition.</li><li>Communicate weekly insights and strategic recommendations through clear visualizations and presentations appropriately designed for executive-level audiences.<br/><br/></li></ul><strong>What You Can Bring<br/><br/></strong><ul><li>You have 1 - 3 years of experience in a similar role, ideally in a consumer-facing company or a technology company.</li><li>Highly passionate about the future of ecommerce, growth marketing, fashion, and diversity/inclusivity</li><li>Your past experience has provided you with a deep understanding of numbers, a strong business sense for business performance drivers, and the skill to craft compelling and clear narratives</li><li>You'll be skilled in tackling loosely defined challenges, working both independently and as part of a cross-functional analytics and product team</li><li>You have a small company mentality (e.g., test quickly, fail quickly, fix quickly) and a passion for collaboration</li><li>Bonus if you know HTML and/or CSS<br/><br/></li></ul><strong>Compensation &amp; Total Rewards<br/><br/></strong>At Savage X Fenty, we believe work and life should fit together! We continue to build a culture of flexibility, to empower you to do your best and put yourself first. Our Total Rewards program rewards employees for their hard work, supporting their health, well-being, families, and ultimately their life journey. Total Rewards at Savage X Fenty includes: <br/><br/>  <br/><br/><ul><li>Hybrid Work Schedule*  </li><li>Discretionary Paid Time Off*  </li><li>Summer Fridays*  </li><li>Healthcare Plans  </li><li>Employee Discounts  </li><li>401k  </li><li>Annual Bonus Program  </li><li>Equity Program*  </li><li>And More  <br/><br/></li></ul>  <br/><br/><ul><li>Varied for retail and fulfillment roles <br/><br/></li></ul>  <br/><br/>The hourly range for this position is from $26.45-28.85. The range provided includes the base salary that Savage X Fenty expects to pay for the role. Offered base salary will be dependent on factors including the scope and complexity of the role, candidate’s related work experience, subject matter expertise and work location. <br/><br/>Savage X Inc.<strong> </strong>is an equal opportunity employer. We recruit, employ, compensate, develop, and promote regardless of race, national origin, religion, sex, sexual orientation, gender identity, age, disability, genetic information, veteran status, and other protected status as required by applicable. At Savage X Inc., we champion a vibrant workplace culture that thrives on diversity law and do not tolerate discrimination or harassment. We are one team from many backgrounds, innovating through diversity of individuals, who are driven by passion for creating an inclusive space for all. Savage X Inc.<strong> </strong>will continue to champion a workplace culture that prizes diversity and inclusivity.<br/><br/>We encourage you to apply regardless of meeting all qualifications and/or requirements.<br/><br/>", "responsibilities": "As the Ecommerce Marketing Coordinator, you will collaborate with Brand Marketing, Merchandising, Digital Marketing and the Product Management Team to deliver a seamless online experience for Savage X Fenty customers. This role will support the Ecommerce Marketing Associate to bring the Brand and Merchandising strategy to life. The role will also work closely with the Growth, Product and Data Analytics team to help drive performance in our paid media channels through highly optimized landing pages.", "qualifications": {"required": "You have 1 - 3 years of experience in a similar role, ideally in a consumer-facing company or a technology company.", "preferred": "Highly passionate about the future of ecommerce, growth marketing, fashion, and diversity/inclusivity"}, "skills": ["Ecommerce", "Growth Marketing", "Fashion", "Diversity & Inclusion", "Data Analysis", "HTML", "CSS"], "postedDate": "1 week ago", "benefits": "Hybrid Work Schedule, Discretionary Paid Time Off, Summer Fridays, Healthcare Plans, Employee Discounts, 401k, Annual Bonus Program, Equity Program", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998477370"}