{"jobTitle": "Coordinator", "company": {"name": "The WONDER Project", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "65,000 - 70,000", "currency": "USD"}, "jobFunction": "Art/Creative and Administrative", "industry": "Media Production and Entertainment Providers", "description": "<strong>About The WONDER Project</strong><br/>We are excited to introduce The WONDER Project, a transformative new media company for the global faith and values audience. We understand the profound impact that stories have on our lives, and our purpose is to tell stories that restore faith in things worth believing in that will endure for generations. Guided by the principles of courage, collaboration, excellence and service, we strive to see the world through different perspectives, recognizing that empathy fosters understanding and unity.<br/><br/>We are looking for motivated team members who are passionate about their craft and hungry to make a meaningful impact through their work. On our team, we value creativity, curiosity, kindness and a bias towards action. Those with a desire for growth, experience and opportunity who can excel in a dynamic and lean organization will fit right in. We welcome you to join us on this journey, where our work is a testament to our unwavering commitment to restoring faith in things worth believing in.<br/><br/><strong>About the Role:</strong><br/><br/>This role will provide both administrative and creative support to both the Senior Adviser, Film and the Vice President of Film. We’re looking for a candidate deeply passionate about film and interested in contributing to a lean and fast-moving creative team. We believe that every task in the development and production timeline contributes to the quality of our films, and we’re looking for someone excited to push for greatness on our projects on a day-to-day basis. While many of the core responsibilities of this role are administrative, our Coordinator will be expected to contribute in a meaningful creative manner from the outset. This is a growth-oriented role for the right candidate, with ample opportunity to be involved in the creative development process and learn the fundamental skills necessary for film executives and producers.<br/><br/><strong>Day to Day:</strong><br/><ul><li>Manages phones, scheduling, and administrative support for Senior Adviser and VP, Film</li><li>Assesses material for potential development and production, including reading scripts and providing coverage, reviewing finished films, and hearing pitches</li><li>Manages division grids, talent tracking, weekend reads, and submission logs</li><li>Provides clear and productive write-ups/summaries/minutes for pitches, notes meetings, story sessions, and other creative meetings</li><li>Prepares agendas, documentation, and decks for weekly departmental meetings</li><li>Stays aware of industry trends and compiles research and updates on writers, directors, HODs, competitive projects, and more</li></ul><br/><br/><strong>What you bring to the table:</strong><br/><ul><li>~2 years of experience as an assistant at an agency, management company, production company, or studio</li><li>Excellent communication, writing, and interpersonal skills, with a meticulous attention to detail</li><li>Passion for film and storytelling is a must: we need someone with a voracious appetite for reading, watching films and television, tracking creatives, and identifying strong material</li><li>Relationships are also imperative as they drive creative success, and an ideal candidate will be able to represent a strong track record of building valuable industry connections</li><li>A deep understanding of film structure, filmmaking techniques, development and production processes, and industry institutions</li></ul><br/><br/><strong>Salary &amp; Benefits</strong><br/>Salary Range: $65,000 - $70,000<br/>Equity participation in management option pool (Series A company) <br/>Benefits, FSA, 401k <br/><br/><em>The WONDER Project, Inc. is an equal employment opportunity employer. All employees and applicants are evaluated on the basis of their qualifications, consistent with applicable state and federal laws. In addition, The WONDER Project, Inc. will provide reasonable accommodations for qualified individuals with disabilities. The WONDER Project, Inc. will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable state and federal law.</em><br/>", "responsibilities": "This role will provide both administrative and creative support to both the Senior Adviser, Film and the Vice President of Film. We’re looking for a candidate deeply passionate about film and interested in contributing to a lean and fast-moving creative team. We believe that every task in the development and production timeline contributes to the quality of our films, and we’re looking for someone excited to push for greatness on our projects on a day-to-day basis. While many of the core responsibilities of this role are administrative, our Coordinator will be expected to contribute in a meaningful creative manner from the outset. This is a growth-oriented role for the right candidate, with ample opportunity to be involved in the creative development process and learn the fundamental skills necessary for film executives and producers.", "qualifications": {"required": "~2 years of experience as an assistant at an agency, management company, production company, or studio\nExcellent communication, writing, and interpersonal skills, with a meticulous attention to detail\nPassion for film and storytelling is a must: we need someone with a voracious appetite for reading, watching films and television, tracking creatives, and identifying strong material\nRelationships are also imperative as they drive creative success, and an ideal candidate will be able to represent a strong track record of building valuable industry connections\nA deep understanding of film structure, filmmaking techniques, development and production processes, and industry institutions"}, "skills": [], "postedDate": "1 week ago", "benefits": "Salary Range: $65,000 - $70,000\nEquity participation in management option pool (Series A company) \nBenefits, FSA, 401k ", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3998416975"}