{"jobTitle": "Stockroom Clerk", "company": {"name": "AMETEK", "industry": "Manufacturing", "size": "Unknown", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Manufacturing", "description": "The primary role of this position is to receive, inspect, kit and maintain inventory accuracy for the in-plant production and fabrication of machinery in a high technology, low volume, high variation product mix, project-driven, build-to-order production working environment. The person will be responsible for unloading, receiving, inspection, and stocking of all incoming material. The person will also be responsible for kitting orders and participating in the cycle count process. The individual will interface with the procurement, planning, storage, distribution, and production functions in the organization.", "responsibilities": "Unloading and general inspection of incoming material. Inspects purchased parts, assemblies, accessories, and materials for conformance to specifications, using precision measuring instruments and devices. Examines items for defects in materials, workmanship, and damage occurring in transit. Compares quantity and part number of items received with procurement data and other specifications to ensure completeness and accuracy of order. Approves or rejects items, and records inspection and disposition information. Receives material physically and inputs into MRP system (data entry). Interacts with Purchasing matters of vendor delivered quality and vendor rating systems. Performs miscellaneous job-related duties as assigned.", "qualifications": {"required": "GED or High School Diploma with strong math skills", "preferred": "3 years minimum receiving/shipping/inventory experience, 2 years of experience performing a quality control function."}, "skills": ["Forklift Certification or experience", "Understands and experienced in utilizing Geometric Dimensioning and Tolerancing", "Experienced with measuring equipment including micrometers", "Experienced with data entry in computer software systems (MRP)", "Demonstrated understanding of material supply and flow in manufacturing environment"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3998806902"}