{"jobTitle": "SR HR, Business Partner", "company": {"name": "Vaco", "location": "Chatsworth, CA"}, "location": "Chatsworth, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$140,000.00/yr - $150,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Aviation and Aerospace Component Manufacturing", "description": "A growing services company is looking for an HR Business Partner to expand its US operations. This candidate must be able to provide organizational structure, be strategic and manage day-to-day HR operations. This company offers every other Friday off, team collaboration and has the strength to lead strategic initiatives. This is an amazing opportunity for the right candidate! <br/><br/>This role is fully onsite in Chatsworth, CA, with every other Friday WTF <br/><strong>Company Overview:</strong> Join a rapidly growing services company expanding its US operations. We offer a collaborative team environment, bi-weekly Fridays off, and opportunities to lead impactful HR initiatives. <br/><strong>Role Overview:</strong> We are seeking an experienced HR Business Partner to provide strategic leadership and manage day-to-day HR operations. This role will be pivotal in driving organizational structure and enhancing employee engagement. <br/><strong>Key Responsibilities:</strong><ul><li>Develop and implement HR strategies aligned with business objectives.</li><li>Manage the full employment lifecycle, including recruitment, onboarding, and performance management.</li><li>Partner closely with hiring managers to streamline HR processes and support business needs.</li><li>Lead change management initiatives within the HR function.</li><li>Administer benefits programs and ensure compliance with policies.</li><li>Foster cross-functional collaboration to optimize HR strategies across departments.</li><li>Conduct new hire orientation and 30-60-90 day check-ins.</li><li>Maintain stability in employment practices and ensure adherence to legal regulations.<br/></li></ul><strong>Qualifications:</strong><ul><li>Bachelor's degree (BA/BS) in Human Resources or related field.</li><li><strong>Minimum 5 years of progressive experience as an HR Manager or Business Partner.</strong></li><li>Demonstrated stability in previous employment and experience in manufacturing, R&amp;D, or aerospace industries.</li><li>Strong expertise in managing employee engagement and driving HR initiatives.</li><li>Excellent written and verbal communication skills.</li><li>Proven ability to thrive in a fast-paced, dynamic environment.</li><li>Hands-on experience with benefits administration and employment law compliance.<br/></li></ul><strong>Salary:</strong> $125,000 - $150,000 annually<br/><br/>If this sounds like you, please send your resume ASAP. No relocation offered", "responsibilities": "Develop and implement HR strategies aligned with business objectives. Manage the full employment lifecycle, including recruitment, onboarding, and performance management. Partner closely with hiring managers to streamline HR processes and support business needs. Lead change management initiatives within the HR function. Administer benefits programs and ensure compliance with policies. Foster cross-functional collaboration to optimize HR strategies across departments. Conduct new hire orientation and 30-60-90 day check-ins. Maintain stability in employment practices and ensure adherence to legal regulations.", "qualifications": {"required": "Bachelor's degree (BA/BS) in Human Resources or related field. Minimum 5 years of progressive experience as an HR Manager or Business Partner. Demonstrated stability in previous employment and experience in manufacturing, R&amp;D, or aerospace industries. Strong expertise in managing employee engagement and driving HR initiatives. Excellent written and verbal communication skills. Proven ability to thrive in a fast-paced, dynamic environment. Hands-on experience with benefits administration and employment law compliance."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Every other Friday off, team collaboration", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998241726"}