{"jobTitle": "Field Territory Manager - San Fernando & Gabriel Valley", "company": {"name": "Farmers Insurance", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Sales and Distribution", "industry": "Financial Services, Insurance, and Consumer Services", "description": "<strong>We are Farmers!<br/><br/></strong>We are… more than just your favorite commercials.  At Farmers, we strive to deliver peace of mind to our customers by providing protection and comprehensive advice and delivering in the moments of truth. That means having people who can help us meet changing customer and business needs. Farmers high-performance culture is focused on results and the people who achieve them. We hold ourselves and others accountable for sustainably growing the business and each other. We seek solutions, own our actions, and grow through discomfort. We see setbacks as opportunities while continuously asking ourselves how we impact our customers.<br/><br/>Farmers is an award winning, equal opportunity employer, committed to the strength of a diverse workforce. We are dedicated to supporting the well-being of our people through our extensive suite of benefits, as well as the well-being of the communities we serve through employee volunteer programs and nonprofit partnerships. Helping others in their time of need isn’t just our business – it’s our culture!  To learn more about our high-performance culture and open opportunities, check out www.Farmers.com/careers/corporate and be sure to follow us on Instagram, LinkedIn, and TikTok.<br/><br/>Workplace: Remote ( )<br/><br/>Farmers believes in a culture of collaboration, creativity, and innovation, which thrives when we have the ability to work flexibly in a virtual setting as well as the opportunity to be together in person. Our hybrid work environment combines the best of both worlds with at least three (3) days in office and up to two (2) days virtual for employees who live within fifty (50) miles of a Farmers corporate office. Applicants beyond fifty (50) miles may still be considered.<br/><br/><em><strong>This Field Territory Manager position will represent the Foremost® and Bristol West® Insurance brands – which are both part of the Farmers Insurance Group® – in the Independent Agent (IA) Channel.<br/><br/></strong></em><strong>Job Summary<br/><br/></strong><ul><li>Analyzes independent agency activity within a portfolio of assigned agencies and associated premium under management to understand trends and is responsible for realizing premium and profit objectives for those agencies and the portfolio.</li><li>Activities performed to achieve those objectives may include training on products, systems, service, and underwriting, book transfers, development of existing agencies, new business growth and retention, or prospecting for new agencies.</li><li>Serves as the primary contact point for agency support staff to build and maximize the agency/company relationship for Personal Lines; Standard &amp; Specialty Lines products.<br/><br/></li></ul><strong>Essential Job Functions<br/><br/></strong><ul><li>Serves as the primary contact for operations, systems and policy training for agency products as well as liaison for resolving policy service and billing issues for assigned agencies and products.</li><li>Utilizes technology to manage agency data and the performance of the portfolio under management. Documents agency contacts as well as competitor changes as they occur.</li><li>Maintains up to date information for Merchandising and Business Development as well as other functional areas. Builds and maintains agency/company relationships in order to maximize product penetration and sales within the agency.</li><li>Coordinates with the book transfer unit to ensure timely processing of all applications, follows up with the agency contact for additional information, monitors and tracks the hit ratios and successful completion of each committed transfer.</li><li>In conjunction with the agency education strategy, coordinates and delivers new and on-going training on products and systems for all product lines within the agency.</li><li>Active in geographic territory of the assigned portfolio of agencies, prospecting for new agencies as well as business development opportunities.</li><li>Analysis of agency operations and quoting/profiling potential book transfer opportunities are included in this function.</li><li>Promotes industry knowledge by coordinating and attending industry events and participating in continuing education and other learning opportunities.</li><li>Promotes agencies’ use of company-provided education and learning resources. Prepares and maintains a market analysis, including competitor information in order to provide input on distribution, product, price and promotion strategies.</li><li>Promotes safety at all times and complies with safety/ergonomic standards as outlined in relevant company published manuals. Performs other duties as assigned.<br/><br/></li></ul>Physical Actions<br/><br/>Required job duties are essentially sedentary work consisting of occasional walking, standing, lifting and/or carrying 20 lbs., seeing, hearing, reaching and driving.<br/><br/>Physical Environment<br/><br/>Required job duties are normally performed in a climate controlled office environment, with some exposure to uncontrolled outside en vironmental conditions and frequent travel via automobile and/or commercial transportation.<br/><br/>Education Requirements<br/><br/>High school diploma or equivalent required. Bachelor’s degree preferred. Attainment of CIC, CPCU or Insurance License preferred but not required.<br/><br/><strong>Experience Requirements<br/><br/></strong>Minimum of five years insurance sales or other industry sales experience.<br/><br/><strong>Benefits<br/><br/></strong><ul><li>Farmers offers a competitive salary commensurate with experience, qualifications and location.</li><li>CA Only: $82,560 - $131,230</li><li>CO Only: $77,360 - $113,520</li><li>HI Only: $77,360 - $121,220</li><li>IL/MN/VT Only: $77,360 - $121,220</li><li>o MD Only: $77,360 - $121,220</li><li>NY/DC/Jersey City Only: $77,360 - $131,230</li><li>Albany County: $82,560 - $113,520</li><li>WA Only: $77,360 - $137,750 </li><li>Bonus Opportunity (based on Company and Individual Performance)</li><li>401(k)</li><li>Medical</li><li>Dental</li><li>Vision</li><li>Health Savings and Flexible Spending Accounts</li><li>Life Insurance</li><li>Paid Time Off</li><li>Paid Parental Leave</li><li>Tuition Assistance</li><li>For more information, review “What we offer” on https://www.farmers.com/careers/corporate/#offer<br/><br/></li></ul>Job Location(s): Territory will include San Fernando Valley and San Gabriel Valley with occasional travel to Sacramento.<br/><br/>Anticipated application deadline: At Farmers, the recruitment process is designed to ensure that we find the best talent to join our team. As part of this process, we typically close open positions within 8 to 21 days after posting. If you are interested in any of our open positions, we encourage you to submit your application promptly.<br/><br/>Farmers will consider for employment all qualified applicants, including those with criminal histories, in accordance with the Los Angeles Fair Chance Initiative for Hiring Ordinance or other applicable law. Pursuant to 18 U.S.C. Section 1033, Farmers is prohibited from employing any individual who has been convicted of any criminal felony involving dishonesty or a breach of trust without prior written consent from the state Department of Insurance.<br/><br/>Want to learn more about our culture &amp; opportunities? Check out www.Farmers.com/careers/corporate and be sure to follow us on Instagram, LinkedIn, and TikTok.<br/><br/>", "postedDate": "1 week ago", "benefits": "Farmers offers a competitive salary commensurate with experience, qualifications and location.\nCA Only: $82,560 - $131,230\nCO Only: $77,360 - $113,520\nHI Only: $77,360 - $121,220\nIL/MN/VT Only: $77,360 - $121,220\no MD Only: $77,360 - $121,220\nNY/DC/Jersey City Only: $77,360 - $131,230\nAlbany County: $82,560 - $113,520\nWA Only: $77,360 - $137,750 \nBonus Opportunity (based on Company and Individual Performance)\n401(k)\nMedical\nDental\nVision\nHealth Savings and Flexible Spending Accounts\nLife Insurance\nPaid Time Off\nPaid Parental Leave\nTuition Assistance\nFor more information, review “What we offer” on https://www.farmers.com/careers/corporate/#offer", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3998804408"}