{"jobTitle": "Associate Operations Manager, Cloudkitchens - Los Angeles", "company": {"name": "CloudKitchens", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Real Estate", "description": "Who We Are<br/><br/>CloudKitchens helps restaurateurs around the world succeed in online food delivery - our goal is to make food more affordable, higher quality and convenient for everyone.<br/><br/>We take underutilized properties and transform them into smart kitchens so they can better serve restaurateurs, customers and the neighborhoods they’re in. Every time we launch a new facility we create jobs in that neighborhood, and we’re proud to provide a wide range of cuisines and options for healthy food at an affordable price.<br/><br/>We're changing the game for restaurateurs whether they’re entrepreneurs opening their first restaurant all the way through to your favorite global quick-service restaurant chains.<br/><br/>What You’ll Do<br/><br/>As an Associate Operations Manager at one of our ghost kitchen facilities, you will play a pivotal role in overseeing daily operations, ensuring facility maintenance, working to get prospective partners onboarded, and delivering exceptional customer support.<br/><br/>Responsibilities:<br/><br/>Team Management:<br/><br/><ul><li>Lead and train a dedicated facility team, handling scheduling, training, and performance management.</li><li>Manage a highly efficient order fulfillment process, and deliver excellent customer service</li><li>Cultivate positive and inclusive work environments, fostering teamwork and communication across teams and departments.<br/><br/></li></ul>Building Repair and Maintenance:<br/><br/><ul><li>Conduct routine inspections and maintenance audits on HVAC units, refrigeration units, water heaters, and ice machines with training and support from subject matter experts.</li><li>Perform general upkeep and handle minor repairs and maintenance; coordinate with external vendors for specialized services.<br/><br/></li></ul>Health and Cleanliness:<br/><br/><ul><li>Manage a janitorial team (either internal or external, depending on the site); uphold cleaning and sanitation protocols, ensuring compliance with local health and safety regulations.</li><li>Monitor partner compliance with safety and health department protocols.</li><li>Enforce proper waste disposal procedures, responding promptly to cleaning-related emergencies.<br/><br/></li></ul>Customer Support and Retention:<br/><br/><ul><li>Serve as the primary point of contact for restaurant partners, building and maintaining trusting relationships, and solving any issues that arise</li><li>Manage the overall partner experience, preventing churn, and extending partner lifecycle.<br/><br/></li></ul>Administrative &amp; Strategic:<br/><br/><ul><li>Train with senior positions in support, data analytics, and reporting.</li><li>Participate in planning sessions with management and peers.</li><li>Review and report KPI metrics to facility management and contribute to goal setting.</li><li>Manage and report the facility P&amp;L, understanding key drivers for achieving facility-level profitability.<br/><br/></li></ul>Compensation: <br/><br/><ul><li>66,500 USD Base</li><li>Bonus</li><li>Equity in the form of LTIP's<br/><br/></li></ul>Applicant Privacy Notice: https://bit.ly/privacy_css<br/><br/>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3998517078"}