{"jobTitle": "assistant store manager - Hawthorne", "company": {"name": "Starbucks", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "55,900.00/yr - 66,300.00/yr", "currency": "USD"}, "jobFunction": "Management and Customer Service", "industry": "Manufacturing, Food and Beverage Services, and Retail", "description": "Now Brewing – Future Leaders! #tobeapartner<br/><br/>Starbucks is known for developing extraordinary people who drive business success by doing the right thing for partners (employees), customers and communities – globally. As a Starbucks leader you are driven by a deep sense of purpose. You are aspirational - never a bystander. You take action to make a positive difference every day, and you inspire others to do the same.<br/><br/><strong>Benefit Information<br/><br/></strong>This role is a hands-on experience that develops your supervisory experience, coaching skills, coffee/ tea passion and business acumen, all to build your understanding of store management. You will learn how to create success for a multi-million-dollar business, create and develop great teams, and building a meeting place in your community that nurtures customers. These foundational principles set up partners for success for careers in store management and leadership.<br/><br/><em><strong>Using a mix of online learning, classroom training and hands on mentorship, you’ll learn how to:<br/><br/></strong></em><ul><li>Grow a successful, multi-million-dollar business: drive sales leveraging your business acumen, efficiency and problem-solving skills</li><li>Nurture talent &amp; lead a team: engage the hearts and minds of your team and develop their skills so that they realize their personal best, both as individuals and as thriving teams. </li><li>Inspire others: become a dynamic brand ambassador dedicated to driving and achieving results through your team<br/><br/></li></ul><em>As a Starbucks partner, you (and your family) will have access to medical, dental, vision, basic and supplemental life insurance, and other voluntary insurance benefits. Partners have access to short-term and long-term disability, paid parental leave, family expansion reimbursement, paid vacation from date of hire*, sick time (accrued at 1 hour for every 25 hours worked), eight paid holidays, and two personal days per year. Starbucks also offers eligible partners participation in a 401(k) retirement plan with employer match, a discounted company stock program (S.I.P.), Starbucks equity program (Bean Stock), incentivized emergency savings, and financial well-being tools. Additionally, Starbucks offers 100% upfront tuition coverage for a first-time bachelor’s degree through Arizona State University’s online program via the Starbucks College Achievement Plan, student loan management resources, and access to other educational opportunities. You will also have access to backup care and DACA reimbursement. Starbucks will comply with any applicable state and local laws regarding employee leave benefits, including, but not limited to providing time off pursuant to the Colorado Healthy Families and Workplaces Act, and in accordance with its plans and policies. This list is subject to change depending on collective bargaining in locations where partners have a certified bargaining representative. For additional information regarding partner perks and more detailed information about benefits, go to </em><em>starbucksbenefits.com. <br/><br/></em><ul><li>If you are working in CA, CO, IL, LA, ME, MA, NE, ND or RI, you will accrue vacation up to a maximum of 120 hours (190 in CA) for roles below director and 200 hours (316 in CA) for roles at director or above. For roles in other states, you will be granted vacation time starting at 120 hours annually for roles below director and 200 hours annually for roles director and above.<br/><br/></li></ul><em>The actual base pay offered to the successful candidate will be based on multiple factors, including but not limited to job-related knowledge/skills, experience, geographical location, and internal equity. </em><em> At Starbucks, it is not typical for an individual to be hired at the high end of the range for their role, and compensation decisions are dependent upon the facts and circumstances of each position and candidate.<br/><br/></em><em>Starbucks is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, physical or mental disability, sexual orientation, marital status, military or veteran status, gender identity and expression, genetic information, or any other factor protected by law.<br/><br/></em><em>We are committed to creating a diverse and welcoming workplace that includes partners with diverse backgrounds and experiences. We believe that enables us to better meet our mission and values while serving customers throughout our global communities. People of color, women, LGBTQIA+, veterans and persons with disabilities are encouraged to apply.<br/><br/></em><em>Qualified applicants with criminal histories will be considered for employment in a manner consistent with all federal state and local ordinances. Starbucks Corporation is committed to offering reasonable accommodations to job applicants with disabilities. If you need assistance or an accommodation due to a disability, please contact us at applicantaccommodation.<br/><br/></em>", "responsibilities": "This role is a hands-on experience that develops your supervisory experience, coaching skills, coffee/ tea passion and business acumen, all to build your understanding of store management. You will learn how to create success for a multi-million-dollar business, create and develop great teams, and building a meeting place in your community that nurtures customers. These foundational principles set up partners for success for careers in store management and leadership.", "qualifications": {"required": null, "preferred": null}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": "This role is a hands-on experience that develops your supervisory experience, coaching skills, coffee/ tea passion and business acumen, all to build your understanding of store management. You will learn how to create success for a multi-million-dollar business, create and develop great teams, and building a meeting place in your community that nurtures customers. These foundational principles set up partners for success for careers in store management and leadership.", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3998236926"}