{"jobTitle": "Chief Operating Officer", "company": {"name": "The Hiring Advisors", "location": "El Monte, CA"}, "location": "El Monte, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Accounting/Auditing", "industry": "Manufacturing and Consumer Services", "description": "We are seeking an experienced Chief Operating Officer (COO) to oversee the ongoing operations and procedures of a large consumer products company in the El Monte area. As a key member of the executive team, you will work closely with the CEO and other senior leaders to execute the company's strategic initiatives, optimize operational processes, and drive sustainable growth. This is a fast-paced role and an ability to pivot quickly is needed. The ideal candidate will have a strong background in operations management, sales strategy, and financial oversight, within the CPG industry.  Responsibilities: Develop and implement operational policies and procedures to ensure organizational effectiveness Lead and manage day-to-day operations of the entire team, including Sales, Marketing, Customer Service, Distribution, and other functional areas as needed. Oversee budgeting, forecasting, and resource management efforts Drive initiatives in the organization to improve efficiency and effectiveness Acts as a key strategic business advisor to executive leadership. Directs and is ultimately responsible for all operations of the company. Leads the implementation of the strategic plan and other strategic activities. Participates in the hiring, training, evaluating, and professional development of key operations staff Provide leadership and guidance to senior management to ensure operational success Elevate, empower and enable the effective and efficient operation marketing, customer service and sales teams Identify opportunities for growth and improvements in business organization Provide consistency and clarity in communications, awareness and understanding of all business aspects  Requirements: Bachelor’s Degree in Business or related field  Proven experience in a senior leadership role with a minimum of 10 years in operations management within Consumer Packed Goods. Experience leading large sales teams Strong ability to manage change effectively and drive strategic planning initiatives Excellent leadership skills with the ability to inspire and motivate teams Demonstrated success in managing complex programs and project management Compensation for this role will pay up to $300K + Bonus. To learn more, reach out to Lily Mirhashemi at Lily@thehiringadvisors.com", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3998429699"}