{"jobTitle": "Customer Solutions Supervisor", "company": {"name": "Linde", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": null, "industry": "Chemical Manufacturing", "description": "<strong>Company Description<br/></strong> <br/>Linde is a leading global industrial gases and engineering company with 2023 sales of $33 billion. The company serves various end markets including chemicals &amp; energy, food &amp; beverage, electronics, healthcare, manufacturing, metals and mining. Linde's industrial gases are used in diverse applications like providing life-saving oxygen for hospitals and specialty gases for electronics manufacturing. Linde delivers state-of-the-art gas processing solutions to support customer expansion, improve efficiency, and reduce emissions.<br/><br/> <strong>Role Description<br/></strong> <br/>This is a full-time on-site role for a Customer Solutions Supervisor located in the Los Angeles Metropolitan Area. The Customer Solutions Supervisor will be responsible for overseeing and improving business processes, managing a team, ensuring effective communication, analyzing data, and delivering top-notch customer service on a daily basis.<br/><br/> <strong>Qualifications<br/></strong> <br/><ul><li>Supervisory Skills and Business Process Improvement</li><li>Strong Communication and Analytical Skills</li><li>Customer Service expertise</li><li>Experience in managing a team and driving results</li><li>Ability to problem-solve and handle challenging situations</li><li>Bachelor's degree in Business Administration or related field</li><li>Previous experience in a customer service or related role</li></ul>", "responsibilities": null, "qualifications": {"required": null, "preferred": null}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": null, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998421337"}