{"jobTitle": "Warehouse Manager", "company": {"name": "JLL", "industry": "Real Estate", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Real Estate", "description": "We’re seeking a warehouse manager to join our team and manage operations at a client site in Woodland Hills, CA. This professional multitasker will manage and oversee the receiving, handling, storing, picking, and packing activities within the warehouse, ensuring quality standards are met at every turn.", "responsibilities": "Maintain client satisfaction with delivery of Facility Management services and support programs to increase customer satisfaction. Support compliance with Jones Lang LaSalle minimum audit and compliance standards in facility management, financial management and operational policies and procedures. Meet or exceed site Key Performance Indicators (KPI’s). Enforce all Company policies and training requirements regarding safe and efficient operations and work practices. Implement and monitor hazard control and team safety practices. Ensure compliance with local codes and regulations and Jones Lang LaSalle operations standards. Demonstrate strong collaboration and teamwork within the account team, by including driving the development and implementation of IFM best practices and innovations. Ensure the warehouse operates at peak efficiency by supervising, organizing, directing, and training warehouse employees and establishing, monitoring, and managing operation goals. Train and manage a warehouse team to solve day-to-day operational issues and reach short- and long-term performance goals. Oversee daily operations, while controlling and managing inventory and logistics including shipping and receiving. Review and prepare workflow, manning and space requirements, equipment layout, and action plans while ensuring productivity, quality and customer service standards are met. Schedule and oversee warehouse team to meet the demands of the fulfillment center, and manage the flow and quality of work to maximize efficiency and minimize overtime. Maintain a safe and healthy work environment by establishing, following, and enforcing standards and procedures and complying with legal regulations. Any and all other duties and tasks assigned.", "qualifications": {"required": "Minimum of 2 years of industry experience required. Strong leadership and relationship building skills. Strong interpersonal skills and problem-solving ability. Excellent verbal/written communication and presentation skills. Proven record of providing excellent internal and external customer service. Proficient in Microsoft products such as Office, Outlook, Excel, etc.", "preferred": "Bachelor's Degree highly preferred."}, "skills": ["Leadership", "Interpersonal Skills", "Problem Solving", "Communication", "Customer Service", "Microsoft Office"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3998447063"}