{"jobTitle": "Administrative Assistant", "company": {"name": "Sony Music Publishing", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Musicians", "description": "At Sony Music Publishing (“SMP”), we believe every voice matters. We are the #1 global music publisher, advancing the artistry of the world’s greatest songwriters and composers for over 25 years. We keep songwriters at the forefront of everything we do, and design our suite of services to amplify opportunities, build connections, and defend their rights. Our roster benefits from an international team committed to providing support at every career stage. From classic catalogues to contemporary hitmakers, history is always being written. We are a part of the Sony family of global companies. Learn more about SMP at https://www.sonymusicpub.com/en.<br/><br/>Why join Sony Music Group? <br/><br/>Here at Sony Music Group, we are shaping what’s next in a way that creates impact. Forging powerful new ideas at the heart of music, technology, and culture that entertain and move people.<br/><br/>This is your opportunity. Part of a global community, united by individual passion, rising to that challenge every day. Adapting at pace and supporting one another, inspired to influence the future. For the benefit of you, our people; our creators, our business, and wider society too.<br/><br/>Be a part of an organization that is creator first. Committed to fueling excellence and always imagining more, while fostering a supportive culture, one where we elevate each other and act responsibly.<br/><br/>Job Purpose: Sony Music Publishing has an amazing opportunity for a dynamic Administrative Assistant to provide an extremely high level of business support to a C-suite executive within our organization.  The ideal candidate will be an extremely service-driven professional who exemplifies the highest levels of professionalism, discretion, and confidentiality concerning all aspects of the business.<br/><br/>What You’ll Do: (<em>job responsibilities</em>)<br/><br/> <ul><li>Best Class Service: Working in collaboration with an experienced Executive Assistant (EA), you will be responsible for supporting operations and offering extraordinary level of service to the executive </li><li>General Administrative Duties: All administrative support functions including serving as the first point of contact for the Executive Office, supply and gift ordering, maintaining storage inventory records, local errands </li><li>Expenses: Manage, process, and track expense reports in a timely fashion and in accordance with SMP T&amp;E policies </li><li>Approvals: Track, organize, and follow up on incoming licensing requests and other internal requests for approvals </li><li>Meetings and Events: Logistics, planning, and on-site support as needed during activities such as team and cross-functional meetings, conferences, industry events </li><li>Calendar and Scheduling: Assist the Executive Assistant (EA) with calendar and travel management and other administrative support </li><li>Personal: Manage and oversee personal appointments and tasks, as needed <br/><br/></li></ul>Who You Are: (<em>skills and experience required</em>)<br/><br/> <ul><li>A minimum 4 years’ experience in an administrative role </li><li>A proven track record of professionalism working alongside high-profile individuals </li><li>Extremely organized, understands when to reprioritize as initiatives change, and can manage ongoing projects with multiple parties and deadlines </li><li>Strong communication skills with the ability to build and maintain positive relationships with clients and colleagues </li><li>High emotional intelligence, maintains composure and works efficiently under pressure in fast-paced environments </li><li>Takes a proactive approach with a strong sense of urgency and follow up </li><li>Aligned with the company’s Global People Promise, Values and demonstrated Behaviors  </li><li>Comfortable working collaboratively and providing a high level of support to the EA </li><li>Proficient in MS Office (Teams, Word, Excel, Outlook, and SharePoint) </li><li>Ability to work standard 37.5 hours weekly, plus considerable overtime, including weekends and holidays, when needed </li><li>Domestic and international travel may be required </li><li>Must be authorized to work in the United States <br/><br/></li></ul>What We Give You:<br/><br/> <ul><li>You join an inclusive, collaborative and global community where you have the opportunity to fuel the creative journey </li><li>A modern office environment designed to foster productivity, creativity, and teamwork </li><li>An attractive and comprehensive benefits package including medical, dental, vision, life &amp; disability coverage, and 401K + employer matching </li><li>Voluntary benefits like company-paid identity theft protection and resources for pets, mental health and meditation resources, industry-leading fertility coverage, fully paid leave for childbirth or bonding, fully paid leave for caregivers, programs for loved ones with developmental disabilities and neurodiversity, subsidized back-up child and elder care, and reimbursement for adoption, surrogacy, tuition and student loans </li><li>We invest in your professional growth &amp; development </li><li>Time off for a winter recess <br/><br/></li></ul>DISCLAIMER:<br/><br/>The anticipated annual base salary for this position is $55,000 - $60,000. This range does not include any other compensation components or other benefits that an individual may be eligible for. The actual base salary offered depends on a variety of factors, which may include as applicable, the qualifications of the individual applicant for the position, years of relevant experience, specific and unique skills, level of education attained, certifications or other professional licenses held, and the location in which the applicant lives and/or from which they will be performing the job.<br/><br/>Sony is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religious creed, sex (including pregnancy), gender, national origin, citizenship, ancestry, age, physical or mental disability, military status, status as a veteran or disabled veteran, sexual orientation, gender identity or expression, marital or family status, genetic information, medical condition, or any other basis protected by applicable federal, state, or local law, ordinance, or regulation.<br/><br/>EEO is the Law<br/><br/>EEO is the Law Supplement<br/><br/>Right to Work (English/Spanish)<br/><br/>E-Verify Participation (English/Spanish)", "responsibilities": "Best Class Service: Working in collaboration with an experienced Executive Assistant (EA), you will be responsible for supporting operations and offering extraordinary level of service to the executive \nGeneral Administrative Duties: All administrative support functions including serving as the first point of contact for the Executive Office, supply and gift ordering, maintaining storage inventory records, local errands \nExpenses: Manage, process, and track expense reports in a timely fashion and in accordance with SMP T&amp;E policies \nApprovals: Track, organize, and follow up on incoming licensing requests and other internal requests for approvals \nMeetings and Events: Logistics, planning, and on-site support as needed during activities such as team and cross-functional meetings, conferences, industry events \nCalendar and Scheduling: Assist the Executive Assistant (EA) with calendar and travel management and other administrative support \nPersonal: Manage and oversee personal appointments and tasks, as needed", "qualifications": {"required": "A minimum 4 years’ experience in an administrative role \nA proven track record of professionalism working alongside high-profile individuals \nExtremely organized, understands when to reprioritize as initiatives change, and can manage ongoing projects with multiple parties and deadlines \nStrong communication skills with the ability to build and maintain positive relationships with clients and colleagues \nHigh emotional intelligence, maintains composure and works efficiently under pressure in fast-paced environments \nTakes a proactive approach with a strong sense of urgency and follow up \nAligned with the company’s Global People Promise, Values and demonstrated Behaviors  \nComfortable working collaboratively and providing a high level of support to the EA \nProficient in MS Office (Teams, Word, Excel, Outlook, and SharePoint) \nAbility to work standard 37.5 hours weekly, plus considerable overtime, including weekends and holidays, when needed \nDomestic and international travel may be required \nMust be authorized to work in the United States"}, "skills": ["Administrative", "Executive Support", "Communication", "Organization", "Time Management", "Microsoft Office", "Travel Management", "Expense Reporting", "Meeting Planning", "Relationship Building", "Emotional Intelligence", "Proactive", "Collaboration"], "postedDate": "1 week ago", "benefits": "You join an inclusive, collaborative and global community where you have the opportunity to fuel the creative journey \nA modern office environment designed to foster productivity, creativity, and teamwork \nAn attractive and comprehensive benefits package including medical, dental, vision, life &amp; disability coverage, and 401K + employer matching \nVoluntary benefits like company-paid identity theft protection and resources for pets, mental health and meditation resources, industry-leading fertility coverage, fully paid leave for childbirth or bonding, fully paid leave for caregivers, programs for loved ones with developmental disabilities and neurodiversity, subsidized back-up child and elder care, and reimbursement for adoption, surrogacy, tuition and student loans \nWe invest in your professional growth &amp; development \nTime off for a winter recess", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998855029"}