{"jobTitle": "Project Manager, Creative", "company": {"name": "MeUndies", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000-$102,000", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Retail Apparel and Fashion", "description": "MeUndies is a Los Angeles, CA-based underwear and loungewear company best known for its softer-than-soft basics. Founded in 2011, MeUndies disrupted the $110B underwear industry with the first online underwear subscription. Since then, the brand has inspired a passionate community of undie-obsessed individuals with its bold, comfortable products. And that’s only the beginning…<br/><br/>Today MeUndies has sold more than thirty million pairs of underwear and is profitable with double-digit YoY growth. It continues to redefine the subscription market by evolving the transactional subscription to a membership centered on community and relationships with the brand.<br/><br/>The innovative direct-to-consumer brand offers multiple purchasing options, including singles, packs, matching pairs, and monthly membership.<br/><br/>With a growing company comes a growing team full of innovative people. We’re looking for a self-motivated Creative Project Manager to manage the creative pipeline and project life-cycle. You’ll report directly to the Senior Project Manager and support projects that impact the Creative Team from brief through to execution. This person will manage the creative workflow, build schedules and timelines, effectively communicate bottlenecks and continually evaluate processes to help improve overall operational processes at MeUndies.<br/><br/>You will collaborate with key business stakeholders such as Brand, Performance Marketing, Creative, Physical Product, Digital Product &amp; Operations.<br/><br/>What You'll Do<br/><br/> <ul><li>Manage the workflow of the Production and Creative teams by assessing capacity, identifying risks/issues and forming mitigation plans to ensure on-time delivery </li><li>Support projects that impact the Creative Team from brief through execution </li><li>Formulate, update project plans and maintain schedules using Asana, our internal project management software</li><li>Drive project end-to-end delivery by leading kickoff, scoping, and status meetings with internal team and Stakeholders</li><li>Delivers project results through leadership and influence rather than authority and control; leverages organizational dynamics to influence outcomes through leadership and communication skills</li><li>Assesses and reports the health of all projects objectively, maintaining project transparency and accurate status; keeps management informed</li><li>Alleviate coordination and communication-based tasks for the Creative team</li><li>Act as a liaison between Creative + Marketing Teams along with other key departments </li><li>Facilitate clear communication across teams including Brand, Product, Merchandising, Marketing, Creative, Digital, and Operations</li><li>Plan for Monthly photo and campaign shoots, as well as assist with market sample ordering and product management </li><li>Continually evaluate processes to identify gaps and optimizations to execute using a streamlined approach</li><li>Assist with the implementation process improvements</li><li>Facilitate efficient communication between project stakeholders </li><li>Organizing, facilitating, participating, and attending meetings with cross-functional groups and C-Suite executives</li><li>Documenting and following up on important actions and decisions from meetings</li><li>Organize and maintain file structure within Google Drive </li><li>Adhere to best practice project management methodology<br/><br/></li></ul>What You Have<br/><br/> <ul><li>3+ years of relevant experience in project management </li><li>4-year degree or equivalent experience required</li><li>Knowledge of project management tools such as Asana and creative project management soft skills </li><li>Demonstrated ability to prioritize and work on multiple projects concurrently </li><li>Demonstrated ability to effectively communicate cross-functionally with key stakeholders </li><li>Excellent attention to detail and organizational skills </li><li>The ability to work effectively both independently and as part of a team</li><li>A strong drive and desire to learn </li><li>Self-starter mindset <br/><br/></li></ul><em>The base salary range for this full-time position is $75,000-$102,000 Within this range, individual pay is determined by various factors, including job-related skills, experience, and relevant education or training. Please note that the base salary range provided in this posting does not include any bonus, equity, or benefits you may be eligible for.<br/><br/></em>WHY WORK AT MEUNDIES?<br/><br/>It's more than a job.<br/><br/>We have focused on building a team of people who emulate our core values. We look for people who stay balanced, go further, build relationships, champion differences, and are humble. At MeUndies, we continue to maintain a stellar brand by working collaboratively and encouraging growth with learning opportunities. There is no such thing as a small achievement here - we celebrate it all!<br/><br/>We look at the necessities.<br/><br/>We offer competitive equity/salary packages, including targeted annual bonuses, generous parental leave, a 401k, fantastic health benefits, open time off, and more.<br/><br/>We have an office you’ll enjoy going to.<br/><br/>We currently have a hybrid work schedule. We’re set up to support comfortable working - hot desks, lounge, and casual seating areas, a Mother’s Room, an on-site gym &amp; shower, and a kitchen that makes you feel like you’ve never left home. We’re dog-friendly, so your furry coworker can join you anytime.<br/><br/>We don’t forget the most important things.<br/><br/>We want MeUndies to be a place where you feel safe and comfortable, and we encourage our employees to hold us accountable for keeping it that way. We encourage open communication and a People Ops team that is ready to help. When you work at MeUndies, we take your needs as an employee (and a person) seriously. Our doors are always welcome to feedback and suggestions!<br/><br/>Plus those special extra things.<br/><br/>We also know how important it is to connect with your team members outside of everyday work. We offer catered lunches every in-office day, holiday parties, off-sites, happy hours, and an annual retreat. You’ll also get a sweet employee discount to rebuild your underwear drawer with our top-notch prints.<br/><br/><em>MeUndies is an equal opportunity employer and is committed to providing a workplace and hiring process free from discrimination. All employment decisions will be made, and all qualified applicants will be considered, without regard to age, race, creed, color, religion, sex (including gender, pregnancy, sexual orientation, and gender identity), ethnicity, national origin, ancestry, disability status, veteran status, genetic information, marital status, citizenship status or other legally protected characteristic protected by federal, state, or local law. In addition, MeUndies will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable federal, state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.</em>", "responsibilities": "Manage the workflow of the Production and Creative teams by assessing capacity, identifying risks/issues and forming mitigation plans to ensure on-time delivery \nSupport projects that impact the Creative Team from brief through execution \nFormulate, update project plans and maintain schedules using Asana, our internal project management software\nDrive project end-to-end delivery by leading kickoff, scoping, and status meetings with internal team and Stakeholders\nDelivers project results through leadership and influence rather than authority and control; leverages organizational dynamics to influence outcomes through leadership and communication skills\nAssesses and reports the health of all projects objectively, maintaining project transparency and accurate status; keeps management informed\nAlleviate coordination and communication-based tasks for the Creative team\nAct as a liaison between Creative + Marketing Teams along with other key departments \nFacilitate clear communication across teams including Brand, Product, Merchandising, Marketing, Creative, Digital, and Operations\nPlan for Monthly photo and campaign shoots, as well as assist with market sample ordering and product management \nContinually evaluate processes to identify gaps and optimizations to execute using a streamlined approach\nAssist with the implementation process improvements\nFacilitate efficient communication between project stakeholders \nOrganizing, facilitating, participating, and attending meetings with cross-functional groups and C-Suite executives\nDocumenting and following up on important actions and decisions from meetings\nOrganize and maintain file structure within Google Drive \nAdhere to best practice project management methodology", "qualifications": {"required": "3+ years of relevant experience in project management \n4-year degree or equivalent experience required\nKnowledge of project management tools such as Asana and creative project management soft skills \nDemonstrated ability to prioritize and work on multiple projects concurrently \nDemonstrated ability to effectively communicate cross-functionally with key stakeholders \nExcellent attention to detail and organizational skills \nThe ability to work effectively both independently and as part of a team\nA strong drive and desire to learn \nSelf-starter mindset ", "preferred": ""}, "skills": ["Asana", "Project Management", "Creative Project Management", "Communication", "Stakeholder Management"], "postedDate": "1 week ago", "benefits": "We offer competitive equity/salary packages, including targeted annual bonuses, generous parental leave, a 401k, fantastic health benefits, open time off, and more.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998111730"}