{"jobTitle": "Inside Sales Account Manager (Southern California)", "company": {"name": "McGraw Hill", "industry": "Education Administration Programs, E-Learning Providers, and Book and Periodical Publishing", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$45,000.00/yr - $70,000.00/yr", "currency": "USD"}, "jobFunction": "Sales", "industry": "Education Administration Programs, E-Learning Providers, and Book and Periodical Publishing", "description": "Overview\n\nImpact the moment\n\nWe have an opening for an experienced, innovative, strategic Inside Account Manager (Remote Opportunity). This individual will manage and support a designated territory and customer base to attain and surpass quota by strategically working on any given sales-orientated task as directed by the Inside Sales Manager or Inside Sales Vice President.\n\nThis role does require up to 30% travel into your designated territory. Candidates must live in Los Angeles or surrounding area.\n\nHow will you make an impact?\n\n- Attain and surpass sales goals with the proven ability to “advance” the sale and build customer relationships to maintain and expand market penetration.\n- Develop understanding and knowledge of McGraw-Hill Prek-12 Programs.\n- Proficient use of multiple software programs, platforms, and devices.\n- Develop and maintain customer profiles, build new contacts/customers, identify and influence customer needs.\n- Communicate internally and externally to influence sales.\n- Perform targeted customer outreach by phone and email to build and maintain the pipeline.\n- Create and execute strategic territory plans with organization and follow through.\n- Prioritize customer base and ensure availability, visibility, and promotional activity with respect to that base.\n- Develop and deliver product presentations to key accounts as well as school-level stakeholders in a consultative and engaging manner that effectively communicates our solution.\n- Lead site-based introductory consultative meetings with current or potential accounts/stakeholders that develop ongoing relationships.\n- Develop winning professional solution proposals for existing or new accounts.\n\nA successful candidate will have:\n\n- Bachelor’s Degree preferred or experience\n- 3 years’ education and/or sales experience required\n- Microsoft software skills: Outlook and PowerPoint (basic), Word and Excel (intermediate), Salesforce CRM\n- Proven ability to organize daily tasks effectively, manage time efficiently, and complete work without external distractions.\n- Prior experience working in the educational publishing space is highly preferred.\n\nWhy work with us?\n\nAt McGraw-Hill, we leverage cutting-edge technology to create innovative learning solutions that support learners at all stages of their educational journey. Our state-of-the-art digital tools and platforms provide personalized, interactive experiences that enhance understanding and retention. Being part of McGraw-Hill means joining a team dedicated to shaping the future of education and making a real impact on students' lives. It's an exciting opportunity to contribute to a company that values innovation, collaboration, and excellence.", "responsibilities": "Manage and support a designated territory and customer base to attain and surpass quota by strategically working on any given sales-orientated task as directed by the Inside Sales Manager or Inside Sales Vice President.", "qualifications": {"required": "Bachelor’s Degree preferred or experience, 3 years’ education and/or sales experience required, Microsoft software skills: Outlook and PowerPoint (basic), Word and Excel (intermediate), Salesforce CRM, Proven ability to organize daily tasks effectively, manage time efficiently, and complete work without external distractions.", "preferred": "Prior experience working in the educational publishing space is highly preferred."}, "skills": ["Sales", "Customer Relationship Management", "Microsoft Office", "Salesforce CRM"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "A sales commission plan will be provided as part of the compensation package, in addition to a full range of medical and/or other benefits, depending on the position offered.", "remoteWork": "Remote Opportunity", "url": "https://www.linkedin.com/jobs/view/3998519289"}