{"jobTitle": "Assistant, General Services", "company": {"name": "Natural History Museum of Los Angeles County", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other, Information Technology, and Management", "industry": "Museums, Historical Sites, and Zoos", "description": "General Service Assistant<br/><br/>The Natural History Museum of Los Angeles County (“NHMLAC”) was the first museum in L.A. to open its doors 111 years ago and is poised for an exciting new era as it plans for the future. Having recently completed a new strategic framework, the Natural History Museums of Los Angeles County—including NHM at Exposition Park, La Brea Tar Pits and Museum in mid-Wilshire, and the William S. Hart Museum in Newhall—is looking forward to new building projects and campaigns, exhibitions, community outreach, and innovative audience engagement.<br/><br/>The Natural History Museum of Los Angeles County values and endeavors to support diversity, equity, inclusion, and access within its organization and communities. Candidates who identify as Black, Indigenous, or a Person of Color (BIPOC), neurodiverse, a woman, a person with a disability, a veteran, and/or a part of the LGBTQAI+ community are welcome and encouraged to apply.<br/><br/>The NHMLAC is seeking a General Services Assistant for our Operations department. The General Services Assistant works closely with the Manager, General Services to perform general maintenance including moving supplies, equipment, furniture, and other related duties at the Natural History Museum and the La Brea Tar Pits. It is an exciting time as we embark on new journeys of becoming a museum of, for, and with L.A.<br/><br/>Responsibilities for this position include, but are not limited to:<br/><br/><ul><li>Light Facility Maintenance and Repair as needed: Identifies maintenance and repair needs and performs minor jobs such as changing, repairing, and maintaining inventory of light bulbs, fixtures, and other minor mechanical or electrical devices. Maintains water pumps and during rain duty. Works with other Museum staff and volunteers on other repairs, shipping and receiving, and facility clean up.</li><li>Surface Repairs: Performs repairs to various surfaces including, but not limited to, patching broken asphalt, concrete and/or plaster surfaces and replacing loose bricks or ceramic tile</li><li>Meeting SetUp: Sets up and breaks down tables and chairs for Museum and special events. Assist in setting up Audio/Visial if requested.</li><li>Packaging, Transporting and Shipping: May assist in packing and unpacking art, historical and scientific objects including transporting, placing and dismantling and removing exhibits, cases, walls, and necessary Museum materials. May assists in constructing crates and boxes for use in shipping objects from the Museum.</li><li>Storage Facilities: Assists in maintaining Museum warehouse storage facilities and loading dock areas ensuring that all department areas, including the mailroom and shipping and receiving area, are kept in a clean and orderly fashion.</li><li>Sustainability: Ensures all recycle materials are sorted by category( cardboard, white paper, metal, pallets, e-waste)</li><li>Vehicle Maintenance: Transport vehicles to ISD County facilities for preventative maintenance, car wash and fuel<br/><br/></li></ul><strong>This Position Has The Following Requirements<br/><br/></strong><ul><li>Conduct: Must act with integrity and an ability to carry oneself with the demeanor, decorum and professionalism needed for the position and its interaction with others.</li><li>Team: Has demonstrated ability to work with others on teams, across an organization and external audiences. Ability to collaborate effectively with all levels within an organization.</li><li>Initiative: Must possess initiative, strong personal work ethic, and good judgment.</li><li>SelfManagement: Has the capability to organize and prioritize work independently in order to meet agreed-upon deadlines</li><li>Communication: Ability to listen to and understand information and ideas presented through verbally and in writing. Ability to communicate ideas verbally and in writing.</li><li>Computer Experience: Has experience using a personal computer and with MS Office and its Word, Excel and Outlook functions (PC and/or Macintosh).</li><li>A valid California Driver's License and a Personal Automobile Liability Insurance or the ability to utilize an alternative method of transportation needed to carry out job-related essential functions.</li><li>High school diploma, GED or equivalent required.<br/><br/></li></ul>The NHMLAC is especially interested in candidates whose background and experience have prepared them to contribute to our commitment to engagement and inclusion with culturally diverse audiences in museums and in sciences.<br/><br/>The NHMLAC is seeking applicants who have demonstrated experience and commitment to working with a diverse community. Hourly rate for this position is $24.10 with excellent benefits. This is a full-time regular, non-exempt position.<br/><br/>A cover letter and current resume is required for all applicants. Review of applications begins immediately and continues until the position is filled. Interested candidates, please visit www.nhmlac.org/careers-our-museums and click the link of the position you are interested or go directly to the online application.<br/><br/>The Natural History Museum of Los Angeles County is an Equal Opportunity Employer.", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3998444118"}