{"jobTitle": "Digital Marketing Coordinator, Disney+", "company": {"name": "The Walt Disney Company", "location": "Glendale, CA", "industry": "Entertainment Providers"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Entertainment Providers", "description": "Disney Entertainment Studios segment encompasses global entertainment media and content, including streaming. The Disney+ Digital Marketing team oversees digital campaign strategy, social programming, and engagement for @DisneyPlus social platforms. This includes the development, strategy, planning, publishing, and operations for @DisneyPlus (domestic and international) across digital and social platforms. Responsibilities include brand platform development, content creation, event strategies, digital brand marketing, amplification of Disney+ content and product priorities, title marketing campaign integration, and cross-line-of-business support.<br/><br/>The Digital Marketing Coordinator is responsible for developing and influencing social media strategies and tactics that expand Disney+ social media presence and are in alignment with communications business objectives. The goal is to find creative ways to build brand trust and loyalty within internal and external audiences, as well as achieve the greatest reach and shareability through compelling visual storytelling and content. The ideal candidate thrives in an agile and collaborative environment, is willing to take risks and share original, clever and innovative ideas, and has a deep passion for the Disney+ brand. Experience with all aspects of social media and an avid user of various social platforms, especially TikTok, is required for this role.<br/><br/>This person works closely with team members within Disney+ Digital Marketing, Disney Entertainment, and Disney+ Creative and Marketing Strategy across social and digital marketing initiatives. They will manage projects for campaigns as defined by team leadership.<br/><br/>Candidates should be collaborative, creative, and organized, with a strong understanding of all digital platforms. Additionally, the ideal candidate would have a background in digital or social video production. Candidates should be proactive, a strong team player, and possess excellent communication skills. The ability to adapt to processes, meet deadlines, and work with multiple stakeholders across business units within The Walt Disney Company is key.<br/><br/><strong>Responsibilities:<br/><br/></strong>Under the guidance of Managers, this role’s responsibilities include supporting Disney+ social in the following areas:<br/><br/><br/><ul><li>Social Media Coordination</li><ul><li>Daily programming support for social content across all platforms for @DisneyPlus platforms</li><li>Curate community engagement and user generated content for team leader review</li><li>Assist specialists and managers in copy and creative consistent with brand voice and campaign positioning</li><li>Ideate new social concepts to engage digital audiences, leveraging brand-safe trends</li><li>Attend brainstorms and meetings for future projects, ensuring cross-team coordination<br/><br/><br/></li></ul></ul><ul><li>Project &amp; Operations Coordination</li><ul><li>Data input, updates, and maintenance of daily programming and monthly calendars using Airtable</li><li>Tagging for reporting, calendar maintenance, and asset management in collaboration with specialists and coordinators</li><li>Liaise daily with teams, including social and digital campaign team, for priorities amplification in line with Disney+ Brand and Title support</li><li>Draft strategy briefs, and document support plans as assigned by team leader</li><li>Collaborate with internal teams throughout content development lifecycle across all channels domestically<br/><br/><br/></li></ul></ul><ul><li>Asset &amp; Creative Coordination</li><ul><li>Asset tracking, sourcing, and coordination for Disney+ content</li><li>Facilitate production notes with creative partners, including external vendors, for custom social content</li><li>Coordinate partner routing and deliver final approved assets and copy to partners, aligning with wider marketing plans and reporting needs</li><li>Assist in live content coverage and execution for talent press junkets, content shoots, and marketing events</li><li>Provide occasional posting and asset trafficking support to the paid social team<br/></li></ul></ul><strong>Basic Qualifications:<br/><br/><br/></strong><ul><li>BA in marketing, business, communications, production or graphic design or equivalent experience</li><li>Relevant experience, including internships, in social media and/or related digital marketing for regional or global brands</li><li>Familiar with social content &amp; posting for platforms including but not limited to: Instagram, TikTok, YouTube, X, Facebook, and Threads</li><li>Experience with visual storytelling, and producing compelling and engaging social content</li><li>A passion for social media and brand stewardship</li><li>Knowledge of social media zeitgeist, pop culture, and trends</li><li>Demonstrate strong creative strategy, original and outside the box thinking</li><li>Ability to work collaboratively within a group as well as independently with little supervision</li><li>Openness to feedback with the ability to defend a creative choice while respectfully managing revisions</li><li>An affinity for the Disney, Disney+, and associated franchises</li><li>Solution-oriented perspective that manages change well</li><li>Ability to manage time efficiently and work within a deadline-oriented environment</li><li>Proactive mindset</li><li>Ability to work flexible hours including nights and weekends</li><li>Willingness to try new things and gain new skills<br/><br/><br/></li></ul><strong>Preferred Qualifications:<br/><br/><br/></strong><ul><li>Broad understanding of the role of social media in society today and its application to business</li><li>Experience with using and writing social copy for various social media platforms including, but not limited to, Instagram, Facebook, Twitter, LinkedIn, Snapchat and TikTok</li><li>Knowledge and understanding of social media KPIs</li><li>Experience with Airtable, Sprinklr, and Google Suite a plus</li><li>Experience with social graphic design and video editing a plus</li><li>Experience in entertainment industry and/or digital marketing agency a plus</li><li>Can formulate a point of view and clearly articulate it</li><li>A proactive self-starting approach and eager to learn</li><li>Ability to navigate a complex organization<br/><br/><br/></li></ul>The hiring range for this position in California is $52,400 to $70,200 per year based on a 40 hour work week. The amount of hours scheduled per week may vary based on business needs. The base pay actually offered will take into account internal equity and also may vary depending on the candidate’s geographic region, job-related knowledge, skills, and experience among other factors. A bonus and/or long-term incentive units may be provided as part of the compensation package, in addition to the full range of medical, financial, and/or other benefits, dependent on the level and position offered.", "responsibilities": "Under the guidance of Managers, this role’s responsibilities include supporting Disney+ social in the following areas:<br/><br/><br/><ul><li>Social Media Coordination</li><ul><li>Daily programming support for social content across all platforms for @DisneyPlus platforms</li><li>Curate community engagement and user generated content for team leader review</li><li>Assist specialists and managers in copy and creative consistent with brand voice and campaign positioning</li><li>Ideate new social concepts to engage digital audiences, leveraging brand-safe trends</li><li>Attend brainstorms and meetings for future projects, ensuring cross-team coordination<br/><br/><br/></li></ul></ul><ul><li>Project &amp; Operations Coordination</li><ul><li>Data input, updates, and maintenance of daily programming and monthly calendars using Airtable</li><li>Tagging for reporting, calendar maintenance, and asset management in collaboration with specialists and coordinators</li><li>Liaise daily with teams, including social and digital campaign team, for priorities amplification in line with Disney+ Brand and Title support</li><li>Draft strategy briefs, and document support plans as assigned by team leader</li><li>Collaborate with internal teams throughout content development lifecycle across all channels domestically<br/><br/><br/></li></ul></ul><ul><li>Asset &amp; Creative Coordination</li><ul><li>Asset tracking, sourcing, and coordination for Disney+ content</li><li>Facilitate production notes with creative partners, including external vendors, for custom social content</li><li>Coordinate partner routing and deliver final approved assets and copy to partners, aligning with wider marketing plans and reporting needs</li><li>Assist in live content coverage and execution for talent press junkets, content shoots, and marketing events</li><li>Provide occasional posting and asset trafficking support to the paid social team<br/></li></ul></ul>", "qualifications": {"required": "BA in marketing, business, communications, production or graphic design or equivalent experience, Relevant experience, including internships, in social media and/or related digital marketing for regional or global brands, Familiar with social content &amp; posting for platforms including but not limited to: Instagram, TikTok, YouTube, X, Facebook, and Threads, Experience with visual storytelling, and producing compelling and engaging social content, A passion for social media and brand stewardship, Knowledge of social media zeitgeist, pop culture, and trends, Demonstrate strong creative strategy, original and outside the box thinking, Ability to work collaboratively within a group as well as independently with little supervision, Openness to feedback with the ability to defend a creative choice while respectfully managing revisions, An affinity for the Disney, Disney+, and associated franchises, Solution-oriented perspective that manages change well, Ability to manage time efficiently and work within a deadline-oriented environment, Proactive mindset, Ability to work flexible hours including nights and weekends, Willingness to try new things and gain new skills", "preferred": "Broad understanding of the role of social media in society today and its application to business, Experience with using and writing social copy for various social media platforms including, but not limited to, Instagram, Facebook, Twitter, LinkedIn, Snapchat and TikTok, Knowledge and understanding of social media KPIs, Experience with Airtable, Sprinklr, and Google Suite a plus, Experience with social graphic design and video editing a plus, Experience in entertainment industry and/or digital marketing agency a plus, Can formulate a point of view and clearly articulate it, A proactive self-starting approach and eager to learn, Ability to navigate a complex organization"}, "skills": ["Social Media", "Digital Marketing", "Instagram", "TikTok", "YouTube", "Facebook", "Threads", "Visual Storytelling", "Brand Stewardship", "Creative Strategy", "Airtable", "Sprinklr", "Google Suite", "Social Graphic Design", "Video Editing", "Entertainment Industry", "Digital Marketing Agency"], "postedDate": "1 week ago", "salary": {"amount": "52,400.00 to $70,200.00", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998765756"}