{"jobTitle": "Facilities Operations Manager I P3", "company": {"name": "TekWissen ®", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA 90045", "jobType": "Contract", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "IT Services and IT Consulting", "description": "<strong>Overview<br/><br/></strong>TekWissen Group is a workforce management provider throughout the USA and many other countries in the world. Our client produces electronics and HVAC equipment. The Company offers HVAC equipment, building automation, security, fire detection, batteries, and other related products, as well as building control systems, energy management, and integrated facility management services. Client serves customers worldwide.<br/><br/><strong>Position: Facilities Operations Manager I P3<br/><br/></strong><strong>Location: Los Angeles, CA 90045<br/><br/></strong><strong>Duration: 6 Months <br/><br/></strong><strong>Job Type: Contract <br/><br/></strong><strong>Work Type: Onsite<br/><br/></strong><strong>Job Description<br/><br/></strong><strong>RESPONSIBILITY LEVEL:<br/><br/></strong><ul><li>Responsible for managing the day-to-day operations of various facilities to ensure the operations, maintenance, and vendor management standards of the contract are met in a cost effective, safe and efficient manner. Works in cooperation with customer's local management and O&amp;M service subcontractors. Is responsible for managing local facility operations in accordance with approved operating guidelines and managing the corresponding budget. Leads O&amp;M facility staff on large individual sites or a group of remote sites. <br/><br/></li></ul><strong>Principle Duties<br/><br/></strong><ul><li>Ensures that all facilities are operated and maintained in a cost-effective and safe condition in accordance with the approved budget and the customer's requirements to fulfill O&amp;M contractual obligations. </li><li>Maintains a proactive relationship with customer and understand business needs of local customer. Communicates those business needs to client management. </li><li>Reviews and approves expenditures for tools, equipment, supplies, materials and additional contract requirements. May assist with preparation of facility budget. </li><li>Communicates operating philosophy, objectives and expectations to client O&amp;M staff in a continuing effort to build the team. </li><li>Manages, directs and schedules day-to-day and long-range activities for assigned properties and ensures that the O&amp;M staff are properly following processes and procedures. </li><li>Manages and supervises facility personnel including hiring, promotions, recognition, discipline, and performance management. Plans, directs, and monitors the performance objectives of Operations and Maintenance personnel. </li><li>Assist with establishing process performance metrics; tracking, analyzing, and reporting performance in terms of quality, safety, cost, and customer satisfactions. Will take corrective action to bring about required change and ensure contract requirements have been executed at a level above the specified standards. </li><li>Resolves problems and/or conflicts and maintains open communication with the client including providing regular written and oral reports to ensure satisfaction. </li><li>Manages subcontractor specifications, problems/issues, performance and administration. </li><li>Provides technical expertise and guidance to O&amp;M staff and manages resolution of complex problems. </li><li>Provides the technical and management direction for all Facility Management services and utilizes all client resources (i.e. Branch, Procurement, etc.) to reduce costs and increases satisfaction. </li><li>Complies with all company policies and procedures and adheres to company standards. </li><li>Performs other duties as required. <br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor's degree in electrical or mechanical engineering or equivalent experience required. </li><li>Five years of facility management or building operations experience required with three years of supervisory experience in management, budgeting, vendor management, operations and maintenance required. </li><li>Demonstrate leadership abilities and organizational skills </li><li>Demonstrate communication and interpersonal skills. </li><li>Able to manage and train entry-level personnel. </li><li>Able to deal with customers and others at all levels. </li><li>Must be a team player, committed to working in a quality environment. </li><li>Required to report to the jobsite on a daily basis <br/><br/></li></ul><strong>TekWissen Group is an equal opportunity employer supporting workforce diversity.</strong>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3998454382"}