{"jobTitle": "Human Resources Business Partner - Req. 4236", "company": {"name": "UCLA", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "76,200.00/yr - $158,800.00/yr", "currency": "USD"}, "jobFunction": "Education", "industry": "Higher Education", "description": "Join the dynamic team at the UCLA Lake Arrowhead Lodge as the Human Resources (HR) Manager, where you'll play a pivotal role in shaping the employee experience at a historic and award-winning property. Nestled within 50 acres of pristine natural beauty, our boutique resort is a testament to exceptional hospitality, offering a unique blend of charming chalet-style units, historic cottages, and adjacent homes. With accommodations for up to 400 guests during the summer and 200 guests during the academic year, our Lodge provides a mosaic of distinctive lodging options that cater to diverse guest needs. Our property boasts a chef-driven restaurant, numerous recreational activities, and nearly 10,000 square feet of versatile meeting space, including 13 meeting rooms that can host up to 200 guests. Located just 90 miles from the UCLA campus, the Lake Arrowhead Lodge is an integral part of UCLA's renowned hospitality portfolio, which includes premier conference venues, catering services, and overnight accommodations. As the HR Manager, you'll support a dedicated team of 80-120 members, fostering a positive and inclusive workplace environment that upholds the University's mission and values. This role offers the unique opportunity to contribute to a property steeped in a century of heritage while promoting diversity, equity, and inclusion in a vibrant, guest-centered setting.\n\nRequired:\n\n* 2-4 years Experience in human resources, including employee relations, personnel policies, collective bargaining agreements, and payroll processing.\n* Demonstrated knowledge of human resource practices, policies, and procedures in a complex organization regarding employment, compensation, benefits, workers' compensation, employee relations, etc.\n* Demonstrated experience performing standard payroll operations, including auditing time, computing and preparing payrolls, and reconciling errors.\n* Demonstrated skill in organizing and coordinating multiple projects and assignments, establishing or adjusting priorities to reflect the job's importance, accurately meeting campus/departmental deadlines, and following through on assignments when faced with conflicting workplace demands.\n* Written and oral communication skills to produce clear and concise documents of professional quality, and effectively communicate complex information to persons of varying backgrounds and levels of authority.\n* Possess superior communication skills to effectively and professionally communicate tact and diplomacy, identifying correct issues to be communicated, assessing the audience, the method, and timing of communications.\n* Demonstrates skill in prioritizing competing work assignments, employing political acumen and integrating information to determine appropriate courses of action and their implications.\n* Skill in writing concise, logical, and grammatically correct correspondence, analytical reports, evaluations, and other written materials to explain complex policies and procedures\n* Proficient skill using standard business software (e.g. Microsoft Office Suite)\n* Ability and judgment to handle confidential and sensitive information with utmost discretion. Ability to foster collaborative working relationships.\n* Excellent analytical skills to organize data and material to draw appropriate conclusions and make recommendations for solutions.\n\nPreferred:\n\n* Skill in reading, understanding, interpreting, and applying Staff Personnel policies, collective bargaining contracts, and departmental regulations.\n* Demonstrated proficiency in human resources practices, especially in employee relations, preferably within a large and intricate organization or university operating within a collective bargaining framework.", "responsibilities": null, "qualifications": {"required": "2-4 years Experience in human resources, including employee relations, personnel policies, collective bargaining agreements, and payroll processing. Demonstrated knowledge of human resource practices, policies, and procedures in a complex organization regarding employment, compensation, benefits, workers' compensation, employee relations, etc. Demonstrated experience performing standard payroll operations, including auditing time, computing and preparing payrolls, and reconciling errors. Demonstrated skill in organizing and coordinating multiple projects and assignments, establishing or adjusting priorities to reflect the job's importance, accurately meeting campus/departmental deadlines, and following through on assignments when faced with conflicting workplace demands. Written and oral communication skills to produce clear and concise documents of professional quality, and effectively communicate complex information to persons of varying backgrounds and levels of authority. Possess superior communication skills to effectively and professionally communicate tact and diplomacy, identifying correct issues to be communicated, assessing the audience, the method, and timing of communications. Demonstrates skill in prioritizing competing work assignments, employing political acumen and integrating information to determine appropriate courses of action and their implications. Skill in writing concise, logical, and grammatically correct correspondence, analytical reports, evaluations, and other written materials to explain complex policies and procedures Proficient skill using standard business software (e.g. Microsoft Office Suite) Ability and judgment to handle confidential and sensitive information with utmost discretion. Ability to foster collaborative working relationships. Excellent analytical skills to organize data and material to draw appropriate conclusions and make recommendations for solutions.", "preferred": "Skill in reading, understanding, interpreting, and applying Staff Personnel policies, collective bargaining contracts, and departmental regulations. Demonstrated proficiency in human resources practices, especially in employee relations, preferably within a large and intricate organization or university operating within a collective bargaining framework."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": "Medical insurance, Pension plan, Commuter benefits, Vision insurance, Dental insurance", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3998280799"}