{"jobTitle": "Senior Designer, Immersive Branding", "company": {"name": "PepsiCo", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$74,800.00 - $125,250.00", "currency": "USD"}, "jobFunction": "Design", "industry": "Manufacturing and Food and Beverage Services", "description": "<strong>Overview<br/><br/></strong><strong>The Opportunity<br/><br/></strong>Design thinking, applied everywhere. The Brand Experience Design Immersive Branding team supports the full PepsiCo portfolio ecosystem. No physical, digital, or virtual experience can live without bold graphic design storytelling, from color treatments to kinetic typography to animations to entire new sub-brands and brand extensions. Dynamic, electric, iconic—it’s graphic narratives that make every interaction meaningful and have the power to unlock new layers of consumer engagement.<br/><br/>As Senior Brand Designer within the Immersive Branding team, you’ll be tasked with telling complete, 360 stories in the form of all-new immersive sub-brands and brand extensions that connect to consumers across every platform there is. You’re a visionary on all your creative workstreams, liaising with leadership, other team-members, and all partners to deliver world-class creative work every single day.<br/><br/><strong>Why PepsiCo?<br/><br/></strong>PepsiCo products are enjoyed by consumers one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $83 billion in net revenue in 2022, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker, and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales. At the heart of PepsiCo is Performance with Purpose - our goal to deliver top-tier financial performance while creating sustainable growth and shareholder value. In practice, Performance with Purpose means providing a wide range of foods<br/><br/>and beverages from treats to healthy eats; finding innovative ways to minimize our impact on the environment and reduce our operating costs; providing a safe and inclusive workplace for our employees globally; and respecting, supporting and investing in the local communities where we operate.<br/><br/><strong>Why PepsiCo Design?<br/><br/></strong>At PepsiCo design, we have a saying: “We’re crazy enough to think we can inspire the future.” This is what drives us, in everything we imagine, develop and execute.<br/><br/>Our goal is clear: to connect PepsiCo’s beverage, snacks and nutrition portfolios, with today’s hyperconnected, networked users and consumers hungry for meaningful, authentic and relevant brand experiences across multiple touch points and regions of the world.PepsiCo Design &amp; Innovation is a creatively driven team that leverages the power of Design Thinking to solve<br/><br/>brand and business problems that drive meaningful value and growth. Our mission is to elevate the role of design and design thinking as a function, process, mindset, and as culture in PepsiCo and the broader business world.<br/><br/>We are a consumer-centric organization with a start-up mentality within our larger organization; we partner with world-class partners in Marketing, Insights, and R&amp;D to strategically drive business results with purpose.<br/><br/><strong>Why Experience Design?<br/><br/></strong>Experience Design creates transformative, dimensional spaces that manifest a brand’s story in an immersive yet expansive way, forging bold new connections with consumers. We inspire the future!<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Connect with all partners, understanding the synergy of brands + customers + consumers.</li><li>Create immersive, all-new, end-to-end sub-brands, brand extensions, LTOs and collaborations that engage consumers across every platform.</li><li>Purpose-build creative toolkits, establishing clear brand throughlines which can be optimized per platform.</li><li>Support creative direction for all workstreams, through the lens of transformative, immersive experiences.</li><li>Center work in excellence around Design Thinking—from inspiration to vision to concept to narrative to consumer journey.</li><li>Lead cross-functional creative brainstorms, leveraging design thinking to unlock innovative approaches to brand activations.</li><li>Partner with individual brand teams to identify and codify experiential brand language through ownable materials, finishes, colors, lighting, sounds, scents and more.</li><li>Clearly communicate ideas through visualization and effective presentation to cross-functional internal and external stakeholders.</li><li>Own the creative process from brief to execution with emphasis on concept visualization.</li><li>Show vision and skill in defining all design elements, including identity, typography, iconography, illustrations, animations, etc.</li><li>Exhibit peak capability in defining all design materials, including textures, fabrications, and more.</li><li>Develop a reputation for leadership, reliability, and excellence—while bringing out the best in others.</li><li>Balance imagining work with managing work: Dream up world-class executions, then handle project management effectively.</li><li>Extend your reach by connecting with the right freelancers and agency partners.<br/><br/></li></ul><strong>Compensation &amp; Benefits:<br/><br/></strong><ul><li>The expected compensation range for this position is between $74,800 - $125,250 based on a full-time schedule.</li><li> Location, confirmed job-related skills and experience will be considered in setting actual starting salary</li><li> Bonus based on performance and eligibility; target payout is 8% of annual salary paid out annually.</li><li> Paid time off subject to eligibility, including paid parental leave, vacation, sick, and bereavement.</li><li> In addition to salary, PepsiCo offers a comprehensive benefits package to support our employees and their families, subject to elections and eligibility: Medical, Dental, Vision, Disability, Health and Dependent Care Reimbursement Accounts, Employee Assistance Program (EAP), Insurance (Accident, Group Legal, Life), Defined Contribution Retirement Plan.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>A Bachelor's degree in Graphic Design, Visual Communication, or a related discipline is required.</li><li>Additional certifications or courses in branding and marketing would be considered a plus.<br/><br/></li></ul><strong>Experience:<br/><br/></strong>Proven work experience as a Brand Designer or in a similar role at an agency or in-house design team. Should have a strong portfolio showcasing a variety of branding projects and design work.<br/><br/><strong>Graphic Design Skills:<br/><br/></strong>Proficient in industry-standard design software such as Adobe Creative Suite (Photoshop, Illustrator,<br/><br/>InDesign). Should have a strong understanding of design principles, typography, color theory, and layout<br/><br/>techniques. Ability to create visually appealing and cohesive designs that align with brand guidelines.<br/><br/><strong>Digital Skills:<br/><br/></strong>Familiar with digital design, including social media graphics, web design, and other online platforms. Should<br/><br/>have knowledge of user experience (UX) and user interface (UI) design principles.<br/><br/><strong>Product Visualization:<br/><br/></strong>Ability to visualize how a brand's identity translates onto various packaging formats and shapes. Knowledge<br/><br/>of 3D rendering or prototyping tools for presenting and mocking up packaging designs.<br/><br/><strong>Print Production Knowledge:<br/><br/></strong>Familiar with print production processes, color management, and pre-press procedures specific to packaging<br/><br/>design. Experience collaborating with print vendors to ensure the accurate and high-quality execution of<br/><br/>packaging materials<br/><br/><strong>EEO Statement<br/><br/></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.<br/><br/>PepsiCo is an Equal Opportunity Employer: Female / Minority / Disability / Protected Veteran / Sexual Orientation / Gender Identity<br/><br/>If you'd like more information about your EEO rights as an applicant under the law, please download the available EEO is the Law &amp; EEO is the Law Supplement documents. View PepsiCo EEO Policy.<br/><br/>Please view our Pay Transparency Statement", "responsibilities": "<ul><li>Connect with all partners, understanding the synergy of brands + customers + consumers.</li><li>Create immersive, all-new, end-to-end sub-brands, brand extensions, LTOs and collaborations that engage consumers across every platform.</li><li>Purpose-build creative toolkits, establishing clear brand throughlines which can be optimized per platform.</li><li>Support creative direction for all workstreams, through the lens of transformative, immersive experiences.</li><li>Center work in excellence around Design Thinking—from inspiration to vision to concept to narrative to consumer journey.</li><li>Lead cross-functional creative brainstorms, leveraging design thinking to unlock innovative approaches to brand activations.</li><li>Partner with individual brand teams to identify and codify experiential brand language through ownable materials, finishes, colors, lighting, sounds, scents and more.</li><li>Clearly communicate ideas through visualization and effective presentation to cross-functional internal and external stakeholders.</li><li>Own the creative process from brief to execution with emphasis on concept visualization.</li><li>Show vision and skill in defining all design elements, including identity, typography, iconography, illustrations, animations, etc.</li><li>Exhibit peak capability in defining all design materials, including textures, fabrications, and more.</li><li>Develop a reputation for leadership, reliability, and excellence—while bringing out the best in others.</li><li>Balance imagining work with managing work: Dream up world-class executions, then handle project management effectively.</li><li>Extend your reach by connecting with the right freelancers and agency partners.<br/><br/></li></ul>", "qualifications": {"required": "A Bachelor's degree in Graphic Design, Visual Communication, or a related discipline is required.", "preferred": "Additional certifications or courses in branding and marketing would be considered a plus."}, "skills": ["Design Thinking", "Graphic Design", "Adobe Creative Suite", "Photoshop", "Illustrator", "InDesign", "Typography", "Color Theory", "Layout", "Digital Design", "Social Media Graphics", "Web Design", "User Experience (UX)", "User Interface (UI)", "Product Visualization", "3D Rendering", "Prototyping", "Print Production", "Color Management", "Pre-press"], "postedDate": "1 week ago", "benefits": "<ul><li>The expected compensation range for this position is between $74,800 - $125,250 based on a full-time schedule.</li><li> Location, confirmed job-related skills and experience will be considered in setting actual starting salary</li><li> Bonus based on performance and eligibility; target payout is 8% of annual salary paid out annually.</li><li> Paid time off subject to eligibility, including paid parental leave, vacation, sick, and bereavement.</li><li> In addition to salary, PepsiCo offers a comprehensive benefits package to support our employees and their families, subject to elections and eligibility: Medical, Dental, Vision, Disability, Health and Dependent Care Reimbursement Accounts, Employee Assistance Program (EAP), Insurance (Accident, Group Legal, Life), Defined Contribution Retirement Plan.<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998835874"}