{"jobTitle": "Workplace Experience Specialist", "company": {"name": "Hello Sunshine", "industry": "Media Production", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Other", "industry": "Media Production", "description": "Hello Sunshine is excited to welcome a passionate and organized Workplace Experience Specialist to our Los Angeles office. In this role, you’ll play a key part in enriching the employee experience by collaborating with our HR and Operations teams to create a vibrant, supportive, and engaging workplace. You'll manage the day-to-day operations of our office, ensuring it’s not only well-organized but also a safe and enjoyable environment for everyone.\n\nYou’ll work closely with the Sr. Manager of Operations to implement and maintain efficient workplace systems, craft clear and effective internal and external communications, and actively contribute to enhancing staff well-being. From the moment a new employee joins our team and throughout their journey with Hello Sunshine, you’ll be a trusted resource, providing information and support every step of the way. If you're ready to make a meaningful impact and help us create a place where our teams can thrive, we'd love to hear from you.\n\nThis role is based in Los Angeles, California. In office 4 days per week.\n\nWorkplace Culture & Community\nDevelop and implement programs and events that promote company culture and employee engagement.\nAct as a liaison between employees and management to address workplace needs and concerns.\nCreate and send weekly staff newsletter\nFoster a welcoming and inclusive environment for all employees.\n\nFacilities Management\nOversee daily operations of the office environment, ensuring that it is clean, safe, and conducive to work.\nCoordinate with external vendors for maintenance, janitorial, repairs, and office supplies.\nManage facilities related expense from order to reconciliation\nOversee weekly ordering and catering services to support and satisfy our teams\nCommunicate with building management\nMaintain records for vendor management\n\nEmployee Services\nProvide support for onboarding new employees, including workspace setup and orientation.\nManage workplace amenities such as kitchen supplies, wellness programs, and ergonomic equipment.\nCoordinate corporate events, meetings, and team-building activities.\nHandle Jira ticketing requests from employees for facilities needs\n\nHealth & Safety\nEnsure compliance with health and safety regulations in the workplace.\nSupport regular safety audits and training sessions.\n\nSustainability & Innovation\nLead initiatives to reduce the environmental impact of office operations, including waste reduction and energy efficiency.\nIdentify opportunities for innovation in workplace design and operations to enhance employee experience.\n\nRequirements\nBachelor’s degree\n2+ years of experience in workplace management, facilities management, operations or a related field.\nStrong organizational and project management skills.\nExcellent interpersonal and communication skills.\nCustomer-obsessed (our employees) who keeps the focus on the most impactful way to engage and grow the support of our team\nAbility to work independently and manage multiple priorities.\nProficiency with office management software and tools. Prior experience using Airtable, preferred.", "responsibilities": "Manage the day-to-day operations of our office, ensuring it’s not only well-organized but also a safe and enjoyable environment for everyone. Work closely with the Sr. Manager of Operations to implement and maintain efficient workplace systems, craft clear and effective internal and external communications, and actively contribute to enhancing staff well-being. Provide support for onboarding new employees, including workspace setup and orientation. Manage workplace amenities such as kitchen supplies, wellness programs, and ergonomic equipment. Coordinate corporate events, meetings, and team-building activities. Ensure compliance with health and safety regulations in the workplace. Lead initiatives to reduce the environmental impact of office operations, including waste reduction and energy efficiency.", "qualifications": {"required": "Bachelor’s degree, 2+ years of experience in workplace management, facilities management, operations or a related field.", "preferred": "Proficiency with office management software and tools. Prior experience using Airtable, preferred."}, "skills": ["Organizational skills", "Project management", "Interpersonal skills", "Communication skills", "Customer service orientation"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Health Care Plan (Medical, Dental & Vision), Retirement Plan (401k, IRA), Life Insurance (Basic, Voluntary & AD&D), Paid Time Off (Vacation, Sick & Public Holidays), Family Leave (Maternity, Paternity), Short Term & Long Term Disability", "remoteWork": "In office 4 days per week.", "url": "https://www.linkedin.com/jobs/view/3998825113"}