{"jobTitle": "Freight Forwarder - Out of gauge", "company": {"name": "DSV - Global Transport and Logistics", "location": "Torrance, CA", "industry": "Truck Transportation"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "22.50 - 30.50", "currency": "USD"}, "jobFunction": "General Business, Supply Chain, and Other", "industry": "Truck Transportation", "description": "<strong>FRAUD ALERT: Please note that DSV will never request a chat interview or solicit funds from applicants or employees through its interviewing and hiring process. We do not require any form of payment and will not ask for personal financial information, such as credit card or bank account number. Our recruiters have an @dsv.com or @us.dsv.com email address. If you question the legitimacy of any DSV job posting, please reach out to HR@us.dsv.com. <br/><br/></strong><strong>DSV - Global transport and logistics<br/><br/></strong>In 1976, ten independent hauliers joined forces and founded DSV in Denmark. Since then, DSV has evolved to become the world's 3rd largest supplier of global solutions within transport and logistics. Today, we add value to our customers' entire supply chain by transporting, storing, packaging, re-packaging, processing and clearing all types of goods. We work every day from our many offices in more than 80 countries to ensure a steady supply of goods to production lines, outlets, stores and consumers all over the world. Our reach is global yet our presence is local and close to our customers. Read more at www.dsv.com<br/><br/>Location: USA - Torrance, S Western Ave Torrance, CA<br/><br/>Division: Air &amp; Sea US<br/><br/>Job Posting Title: Freight Forwarder - Out of gauge<br/><br/>Time Type: Full Time<br/><br/><strong>Summary<br/><br/></strong>As an Ocean Export Operations professional, you will be responsible for ensuring the smooth and efficient operation of the export process for OOG ocean freight. You will manage and coordinate the logistics of cargo shipments and provide excellent customer service to clients. You will be working with different parties, such as shippers, carriers, and customs agents, to ensure the timely and accurate delivery of goods.<br/><br/><strong>Duties And Responsibilities<br/><br/><br/></strong><ul><li>Organize and manage the export process for OOG ocean freight shipments.</li><li>Liaise with customers, carriers, and customs agents to ensure the timely delivery of goods.</li><li>Provide excellent customer service and ensure that clients are satisfied with the services provided.</li><li>Prepare and submit necessary documentation for exports, overseas customs clearance, and compliance.</li><li>Ensure compliance with regulations and standards set by relevant authorities.</li><li>Coordinate and monitor cargo transportation from pick up to final delivery.</li><li>Manage freight bookings with carriers and negotiate rates.</li><li>Track shipments and update clients on shipment status.</li><li>Resolve any issues or problems that arise during the export process.<br/><br/><br/></li></ul><strong>Educational Background / Work Experience<br/><br/><br/></strong><ul><li>At least 2-3 years of experience in international export operation is required.</li><li>Experience with out-of-gauge cargo is required<br/><br/><br/></li></ul><strong>Skills &amp; Competencies<br/><br/><br/></strong><ul><li>Excellent communication and negotiation skills.</li><li>Strong organizational and time management skills.</li><li>Knowledge of customs regulations and compliance requirements.</li><li>Understanding of logistics and supply chain management.</li><li>Proficiency in using relevant software and tools, such as Microsoft Excel, transportation management systems, and customer relationship management software.<br/><br/><br/></li></ul><strong>Preferred Qualifications<br/><br/><br/></strong><ul><li>Knowledge of international trade regulations and requirements.</li><li>Familiarity with different modes of transportation.<br/><br/><br/></li></ul><strong>Language Skills<br/><br/><br/></strong><ul><li>Fluent in English (oral and written)<br/><br/><br/></li></ul><strong>Computer Literacy<br/><br/><br/></strong><ul><li>Proficiency in Microsoft Office (Word, Excel, Outlook, PowerPoint) is required.</li><li>Knowledge of Cargowise system is preferred<br/><br/><br/></li></ul><strong>At Will Employment<br/><br/></strong>DSV Air &amp; Sea Inc. employees are hired for an undefined period of time as “at will” employees. This means that an employee may be terminated for any reason, or no reason at all, at any time, provided the discharge does not violate any law*. Additionally, each employee has the right to terminate his/her employment at any time. *Except if employed in Montana, where termination requires just cause.<br/><br/>For this position, the expected base pay is: <strong>$22.50</strong> - <strong>$30.50 / Hourly. </strong>Actual base compensation will be determined based on various factors including job-related knowledge, geographical location, skills, experience, and other objective business considerations.<br/><br/>DSV does not accept unsolicited agency resumes. Please do not forward unsolicited resumes to our website, employees, or Human Resources. DSV will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of DSV and will be processed accordingly without fees.<br/><br/>If you have any questions or concerns, please do not hesitate to let me know!<br/><br/>DSV is an equal employment opportunity employer. Candidates are considered for employment without regard to race, creed, color, national origin, age, sex, religion, ancestry, disability, veteran status, marital status, gender identity, sexual orientation, national origin, or any other characteristic protected by applicable federal, state or local law. If you require special assistance or accommodation while seeking employment with DSV, please contact Human Resources at hr@us.dsv.com. If you are interested in learning the status of your application, please note you will be contacted directly by the appropriate human resources contact person if you are selected for further consideration. DSV reserves the right to defer or close a vacancy at any time.<br/><br/><strong>DSV – Global transport and logistics<br/><br/></strong>DSV is a dynamic workplace that fosters inclusivity and diversity. We conduct our business with integrity, respecting different cultures and the dignity and rights of individuals. When you join DSV, you are working for one of the very best performing companies in the transport and logistics industry. You’ll join a talented team of approximately 75,000 employees in over 80 countries, working passionately to deliver great customer experiences and high-quality services. DSV aspires to lead the way towards a more sustainable future for our industry and are committed to trading on nature’s terms.<br/><br/>We promote collaboration and transparency and strive to attract, motivate and retain talented people in a culture of respect. If you are driven, talented and wish to be part of a progressive and versatile organisation, we’ll support you and your need to achieve your potential and forward your career.<br/><br/>Visit dsv.com and follow us on LinkedIn, Facebook and Twitter.", "responsibilities": "As an Ocean Export Operations professional, you will be responsible for ensuring the smooth and efficient operation of the export process for OOG ocean freight. You will manage and coordinate the logistics of cargo shipments and provide excellent customer service to clients. You will be working with different parties, such as shippers, carriers, and customs agents, to ensure the timely and accurate delivery of goods.", "qualifications": {"required": "At least 2-3 years of experience in international export operation is required.\nExperience with out-of-gauge cargo is required", "preferred": "Knowledge of international trade regulations and requirements.\nFamiliarity with different modes of transportation."}, "skills": ["Communication", "Negotiation", "Organizational Skills", "Time Management", "Customs Regulations", "Logistics", "Supply Chain Management", "Microsoft Excel", "Transportation Management Systems", "Customer Relationship Management Software"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998282287"}