{"jobTitle": "Supply Chain Lead", "company": {"name": "EV.Careers", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "26.00 - 33.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "At PEARCE, we've got a career for you.<br/><br/>Join the nation’s leading independent service provider for critical telecommunication and renewable energy infrastructure. With over 2,000 team members nationwide, Pearce delivers comprehensive engineering, maintenance, repair, and repowering solutions, ensuring the seamless operation of our nation’s wireless and wireline telecom, commercial and utility-scale solar and wind projects, EV charging stations, as well as large-scale power generation and energy storage assets.<br/><br/>Your Impact<br/><br/>The Supply Chain and Logistics Lead is responsible for enabling our Field Electric Vehicle Customer Operations organization by directing the fulfillment of spare parts required to deliver our services in the field at the national level. Follows and enforces the process and procedures for our supply chain and logistics customer program network across the United States. Works with all OEM customer partners to capture specific requirements for the program. Responsible for managing several other roles including parts procurement, purchasing, parts planning, vendor-managed inventory, and both local and third-party logistics (3PL) warehouse operation. Responsible for invoicing the costs of the operation, supporting business development efforts to sell warehouse and logistics services, and supporting technicians with returning defective parts to manufacturers.<br/><br/>Core Responsibilities<br/><br/><ul><li>Candidate must live 30 to 40 minutes from Compton, CA. </li><li>Directly discuss the status of inventory, open orders, and returns with each OEM. </li><li>Evaluate the forecasts and determine if parts are needed. </li><li>Review current safety stock levels and determine volume of parts needed. </li><li>Analyze lead times for all parts needed against the work order forecast. </li><li>Daily tracking of parts returns from field service technicians and manage return authorization back to OEMs, if applicable and entitled based on terms between EVgo and OEM. </li><li>Monitor logistics to ensure on-time delivery of parts to field. </li><li>Review work orders in warehouse management system (WMS) for accuracy. </li><li>Notify the Customer operations team to discuss operational issues related to supply chain and logistics. <br/><br/></li></ul>Specific duties may vary or evolve over time based on business and client needs.<br/><br/>Core Experience<br/><br/><ul><li>Bachelor’s degree in supply chain, Logistics, Business, or related field preferred. </li><li>5+ years of experience in a Supply Chain, Logistics lead or supervisor role. </li><li>Experience with inventory and purchasing planning management preferred. </li><li>Proficiency in MS Office applications and WMS/ERP software platforms. </li><li>Strong analytical skills. </li><li>Proficiency in reporting and presentations. </li><li>Excellent problem-solving mindset. <br/><br/></li></ul>Compensation: Pay Range - $26.00-$33.00 hourly/DOE<br/><br/>Pearce offers a family-friendly and innovative culture with opportunities for growth, competitive compensation, comprehensive benefits (medical, dental, vision, life insurance), PTO, Paid Holidays, and a company-matching 401(k) Retirement, Life Insurance. We provide company vehicle, phone, laptop, or tablet (as required for your role) and all necessary tools and safety equipment.<br/><br/>At PEARCE, we are an equal opportunity employer dedicated to cultivating an inclusive environment that empowers employees to excel and make a meaningful impact, providing a dynamic space for field technicians, service specialists, and corporate professionals to flourish and propel their careers forward within our nationwide presence and expansive service offerings.<br/><br/>Learn more about our corporate and telecom division at www.Pearce-Services.com and our renewables division at www.Pearce-Renewables.com.", "responsibilities": "The Supply Chain and Logistics Lead is responsible for enabling our Field Electric Vehicle Customer Operations organization by directing the fulfillment of spare parts required to deliver our services in the field at the national level. Follows and enforces the process and procedures for our supply chain and logistics customer program network across the United States. Works with all OEM customer partners to capture specific requirements for the program. Responsible for managing several other roles including parts procurement, purchasing, parts planning, vendor-managed inventory, and both local and third-party logistics (3PL) warehouse operation. Responsible for invoicing the costs of the operation, supporting business development efforts to sell warehouse and logistics services, and supporting technicians with returning defective parts to manufacturers.", "qualifications": {"required": "Candidate must live 30 to 40 minutes from Compton, CA.", "preferred": "Bachelor’s degree in supply chain, Logistics, Business, or related field preferred. 5+ years of experience in a Supply Chain, Logistics lead or supervisor role. Experience with inventory and purchasing planning management preferred. Proficiency in MS Office applications and WMS/ERP software platforms. Strong analytical skills. Proficiency in reporting and presentations. Excellent problem-solving mindset."}, "skills": ["Supply Chain", "Logistics", "Inventory Management", "Purchasing", "WMS", "ERP", "Analytical Skills", "Reporting", "Presentations", "Problem Solving"], "postedDate": "1 week ago", "benefits": "Pearce offers a family-friendly and innovative culture with opportunities for growth, competitive compensation, comprehensive benefits (medical, dental, vision, life insurance), PTO, Paid Holidays, and a company-matching 401(k) Retirement, Life Insurance. We provide company vehicle, phone, laptop, or tablet (as required for your role) and all necessary tools and safety equipment.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998242444"}