{"jobTitle": "Manager, People & Culture", "company": {"name": "SAG-AFTRA", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Entertainment Providers", "description": "<strong>Overview<br/><br/></strong><strong> Who We Are <br/><br/></strong>SAG-AFTRA is the iconic American labor union that represents approximately 160,000 media professionals. SAG-AFTRA employees support our members and thrive on securing the strongest protections by negotiating the best wages, working conditions, health and pension benefits. We preserve and expand members’ work opportunities, vigorously enforce our contracts and protect our members against unauthorized use of their work.<br/><br/><strong>Responsibilities<br/><br/></strong><strong> What You’ll Do <br/><br/></strong>The Manager, People and Culture is key in driving People &amp; Culture initiatives and ensuring compliance with labor laws and organization policies. This role requires the incumbent to have solid experience in legal compliance, benefit administration, including health, LOA, ADA, and Workers’ Compensation. This role requires a proactive individual with strong interpersonal skills and a deep understanding of People &amp; Culture practices, as well as state-specific labor laws and policies.<br/><br/><strong> (This section provides a general summary of the most significant job duties performed. It does not explain in detail every single duty performed.) <br/><br/></strong><strong>Benefits (Health, LOA, ADA, EAP, 401k)<br/><br/></strong><ul><li> Working closely with the Generalist II, and in conjunction with the health care vendors, update Benefits Guide; coordinate, schedule and administer open enrollment, process new hire enrollment and qualifying events. Primary contact for all employee questions and concerns. </li><li> Working closely with the Generalist II, Business Partner and other key stakeholders, manage LOA, ADA process. This also includes managing work accommodations and modified duty arrangements. <br/><br/></li></ul><strong>Workers' Compensation Claims<br/><br/></strong><ul><li> Working closely with the Generalist II, manage Workers' Compensation claims and coordinate with insurance providers. This will also require partnership with Administration to ensure safe work practices and minimize employee accidents. </li><li> Oversee work accommodations and modified duty arrangements for injured employees. </li><li> Ensure compliance with state and federal regulations regarding workers' compensation. <br/><br/></li></ul><strong> Legal Compliance and Policy Enforcement <br/><br/></strong><ul><li> Ensure compliance with labor laws and organization policies. </li><li> Enforce labor law policies and update them as necessary. </li><li> Stay informed about changes in labor laws and regulations. </li><li> Stay up to date with minimum wage requirements and other wage and hour regulations. </li><li> Ensure organization policies and practices comply with wage and hour laws. <br/><br/></li></ul><strong> Creation of Standard Operating Procedures (SOPs) and Employee Handbook <br/><br/></strong><ul><li> Develop and update SOPs for P&amp;C-related processes. </li><li> Update and maintain the employee handbook, ensure the handbook is compliant with current laws and reflects organization policies. <br/><br/></li></ul><strong> Training and Development <br/><br/></strong><ul><li> Track completion and effectiveness of training programs, including sexual harassment training. </li><li> Work with Business Partners on corrective action meetings ensuring compliance with CBA and company policies and procedures. </li><li> Work with Business Partners and Managers to implement performance improvement plans as a form of coaching. </li><li> Perform other duties as assigned or as the situation dictates. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong> What You’ll Need <br/><br/></strong><strong> We want to make sure you’re successful. To be considered, you must have: <br/><br/></strong><strong> ( </strong><strong> The individual must possess the following knowledge, skills and abilities and be able to explain and demonstrate that he or she can perform the essential functions of this job with or without reasonable accommodation, using some other combination of skills and abilities.) <br/><br/></strong><ul><li> Knowledge of People &amp; Culture best practices and ability to ensure compliance with all federal, state, and local laws and regulations pertaining to human resources practice. </li><li> Able to use sound judgment, discretion and maintain confidentiality. </li><li> Able to organize, prioritize and coordinate multiple tasks under daily deadlines; able to work well under pressure, able to thrive in a highly dynamic work environment; able to develop creative solutions. </li><li> Strong organizational skills with one or more ongoing assignments; very detail oriented. </li><li> High degree of patience and tact, and must be able to cultivate relationships with people from diverse backgrounds, both internally and externally. </li><li> Strong communication skills in English, both oral and written; consultative skills to gain the respect and trust from staff and leadership alike in building impactful solutions. </li><li> Able to use sound judgment, discretion, and maintain confidentiality on compensation matters. </li><li> Strong customer service skills. </li><li> E xceptional listening skills – receptive to constructive feedback. </li><li> Excellent interpersonal and communication skills; ability to handle sensitive information with confidentiality and professionalism; strong problem-solving and conflict resolution skills; strong organizational and time management skills; ability to work independently and collaboratively. <br/><br/></li></ul><strong>Competencies<br/><br/></strong><ul><li> Member Service </li><li> Communication </li><li> Dependability/Accountability </li><li> Job Knowledge </li><li> Adaptability </li><li> Teamwork <br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><strong> Education and/or Experience: <br/><br/></strong><ul><li> Bachelor’s degree in Human Resources, Business Administration, or related field; SHRM-CP, PHR, PHR-CA, or HRM certification is preferred </li><li> Minimum of 5 years of experience in human resources as a generalist with a focus on benefits and compliance; strong knowledge of labor laws (CA), and HR best practices. <br/><br/></li></ul><strong>What You’ll Get<br/><br/></strong><strong> We are a great place to work because we offer: <br/><br/></strong><ul><li> The salary range for this position is $85,345.00 annually along with excellent employee benefits and perks </li><li> Colleagues that are passionate about what we do and how they contribute to our mission </li><li> Balance between work and home life responsibilities </li><li> Affordable and comprehensive medical and dental plans </li><li> Generous pension plan </li><li> Employee discounts and perks</li></ul>", "responsibilities": "The Manager, People and Culture is key in driving People &amp; Culture initiatives and ensuring compliance with labor laws and organization policies. This role requires the incumbent to have solid experience in legal compliance, benefit administration, including health, LOA, ADA, and Workers’ Compensation. This role requires a proactive individual with strong interpersonal skills and a deep understanding of People &amp; Culture practices, as well as state-specific labor laws and policies.<br/><br/><strong> (This section provides a general summary of the most significant job duties performed. It does not explain in detail every single duty performed.) <br/><br/></strong><strong>Benefits (Health, LOA, ADA, EAP, 401k)<br/><br/></strong><ul><li> Working closely with the Generalist II, and in conjunction with the health care vendors, update Benefits Guide; coordinate, schedule and administer open enrollment, process new hire enrollment and qualifying events. Primary contact for all employee questions and concerns. </li><li> Working closely with the Generalist II, Business Partner and other key stakeholders, manage LOA, ADA process. This also includes managing work accommodations and modified duty arrangements. <br/><br/></li></ul><strong>Workers' Compensation Claims<br/><br/></strong><ul><li> Working closely with the Generalist II, manage Workers' Compensation claims and coordinate with insurance providers. This will also require partnership with Administration to ensure safe work practices and minimize employee accidents. </li><li> Oversee work accommodations and modified duty arrangements for injured employees. </li><li> Ensure compliance with state and federal regulations regarding workers' compensation. <br/><br/></li></ul><strong> Legal Compliance and Policy Enforcement <br/><br/></strong><ul><li> Ensure compliance with labor laws and organization policies. </li><li> Enforce labor law policies and update them as necessary. </li><li> Stay informed about changes in labor laws and regulations. </li><li> Stay up to date with minimum wage requirements and other wage and hour regulations. </li><li> Ensure organization policies and practices comply with wage and hour laws. <br/><br/></li></ul><strong> Creation of Standard Operating Procedures (SOPs) and Employee Handbook <br/><br/></strong><ul><li> Develop and update SOPs for P&amp;C-related processes. </li><li> Update and maintain the employee handbook, ensure the handbook is compliant with current laws and reflects organization policies. <br/><br/></li></ul><strong> Training and Development <br/><br/></strong><ul><li> Track completion and effectiveness of training programs, including sexual harassment training. </li><li> Work with Business Partners on corrective action meetings ensuring compliance with CBA and company policies and procedures. </li><li> Work with Business Partners and Managers to implement performance improvement plans as a form of coaching. </li><li> Perform other duties as assigned or as the situation dictates. <br/><br/></li></ul>", "qualifications": {"required": "Knowledge of People &amp; Culture best practices and ability to ensure compliance with all federal, state, and local laws and regulations pertaining to human resources practice. Able to use sound judgment, discretion and maintain confidentiality. Able to organize, prioritize and coordinate multiple tasks under daily deadlines; able to work well under pressure, able to thrive in a highly dynamic work environment; able to develop creative solutions. Strong organizational skills with one or more ongoing assignments; very detail oriented. High degree of patience and tact, and must be able to cultivate relationships with people from diverse backgrounds, both internally and externally. Strong communication skills in English, both oral and written; consultative skills to gain the respect and trust from staff and leadership alike in building impactful solutions. Able to use sound judgment, discretion, and maintain confidentiality on compensation matters. Strong customer service skills. E xceptional listening skills – receptive to constructive feedback. Excellent interpersonal and communication skills; ability to handle sensitive information with confidentiality and professionalism; strong problem-solving and conflict resolution skills; strong organizational and time management skills; ability to work independently and collaboratively. <br/><br/>", "preferred": "Bachelor’s degree in Human Resources, Business Administration, or related field; SHRM-CP, PHR, PHR-CA, or HRM certification is preferred Minimum of 5 years of experience in human resources as a generalist with a focus on benefits and compliance; strong knowledge of labor laws (CA), and HR best practices."}, "skills": ["Member Service", "Communication", "Dependability/Accountability", "Job Knowledge", "Adaptability", "Teamwork"], "postedDate": "1 week ago", "benefits": "The salary range for this position is $85,345.00 annually along with excellent employee benefits and perks Colleagues that are passionate about what we do and how they contribute to our mission Balance between work and home life responsibilities Affordable and comprehensive medical and dental plans Generous pension plan Employee discounts and perks", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998443165"}