{"jobTitle": "Sales Director", "company": {"name": "Bookman Consulting", "industry": "Wholesale", "size": "Not specified", "location": "Santa Fe Springs, CA"}, "location": "Santa Fe Springs, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$150,000.00/yr - $160,000.00/yr", "currency": "USD"}, "jobFunction": "Sales, Distribution, and Business Development", "industry": "Wholesale", "description": "Our client is a well-established and growing CPG distribution company with 40 distribution centers around the U.S. Although they are a large, national B2B manufacturer/distributor with all of the growth opportunities that come with that, their operations are decentralized and function more like a smaller company at the regional level – a best of both worlds' scenario. Our client is currently seeking a Sales Director to improve the effectiveness and efficiency of their sales team covering the company’s largest revenue generating territory from San Diego to Santa Barbara. You will operate out of their Santa Fe Springs location. A successful candidate will have a proven track record of developing a sales team, creating sales goals and prioritizing daily tasks. The ideal candidate will be able to effectively delegate tasks, motivate employees and effectively utilize the resources available to maximize sales performance. Sales Director – Santa Fe Springs: Oversee a staff of sales managers (5) and representatives (50), providing guidance to the sales team Analyze sales data and make recommendations for improving performance Recommend and implement improvements in sales methods and procedures Will report directly to, and work closely with, the General Manager and coordinate with the production and procurement teams in regards to forecasting and demand planning The expectation is that you will spend 60% of your time in the office and the rest in the field with the sales team Excellent communication skills are required CPG Sales experience preferred Base salary range likely between 150-160K + bonus + benefits This is a great role for somebody who enjoys stability with their employer, and wants to directly impact the operations and trajectory of their company!! If interested, please attach a WORD DOC version of your resume in your reply. We look forward to chatting with you soon. Thanks for your time!", "responsibilities": "Oversee a staff of sales managers (5) and representatives (50), providing guidance to the sales team. Analyze sales data and make recommendations for improving performance. Recommend and implement improvements in sales methods and procedures. Will report directly to, and work closely with, the General Manager and coordinate with the production and procurement teams in regards to forecasting and demand planning. The expectation is that you will spend 60% of your time in the office and the rest in the field with the sales team. Excellent communication skills are required. CPG Sales experience preferred.", "qualifications": {"required": "Not specified", "preferred": "CPG Sales experience preferred."}, "skills": ["Sales Management", "Data Analysis", "Sales Strategy", "Team Leadership", "Communication"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3998455381"}