{"jobTitle": "Human Resources Generalist", "company": {"name": "SUGARED + BRONZED", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Retail", "description": "SUGARED + BRONZED revolutionized airbrush tanning with a proprietary solution and revived an all-natural, ancient Egyptian form of hair removal called sugaring. S+B is a one-stop shop to prepare for any vacation, wedding, red carpet event — or to simply feel like your best self. We’re extremely passionate about providing exceptional services in beautiful, upbeat, and welcoming spaces that make your appointment something to look forward to!<br/><br/><strong>Position Overview<br/><br/></strong>This role supports corporate and in store leadership in equitably managing talent, policies, and procedures. This role is crucial in developing HR policies, fostering a positive work environment, resolving conflicts, and supporting company objectives and goals.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Oversight of employee relations across the company while provide coaching and support to managers on performance-related issues</li><li>Conduct HR investigations tactically and judiciously </li><li>Proven ability to develop and implement HR policies and procedures</li><li>Ensuring compliances with labor laws and regulations</li><li>Ensure S+B’s HRIS remains updated and managed </li><li>Administering employee benefits, compensation and responding to unemployment claims</li><li>Manage off boarding process for departing employees</li><li>Preparing to meet HR + Payroll requirements in new markets as S+B expands</li><li>Running and auditing payroll to ensure employees are accurately paid on time<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor’s degree in Human Resources, Business Administration, or related field</li><li>3+ years of proven experience in an HR capacity supporting 350+ hourly employees in multiple states</li><li>Excellent interpersonal and communication skills</li><li>Strong organizational and time management skills</li><li>HR Certification</li><li>Preferred experience with HR software and systems (Rippling HRIS)</li><li>Contract to Full Time<br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li>A fun, collaborative space that embraces change and innovation</li><li>Competitive benefits package including health insurance, dental insurance, vision insurance, 401K with company match, and paid vacation and holidays</li><li>Complimentary Sugaring + Tanning services + Products. Get ready for the glow!</li><li>Opportunities for future role mobility and professional development</li></ul>", "responsibilities": "Oversight of employee relations across the company while provide coaching and support to managers on performance-related issues, Conduct HR investigations tactically and judiciously, Proven ability to develop and implement HR policies and procedures, Ensuring compliances with labor laws and regulations, Ensure S+B’s HRIS remains updated and managed, Administering employee benefits, compensation and responding to unemployment claims, Manage off boarding process for departing employees, Preparing to meet HR + Payroll requirements in new markets as S+B expands, Running and auditing payroll to ensure employees are accurately paid on time", "qualifications": {"required": "Bachelor’s degree in Human Resources, Business Administration, or related field, 3+ years of proven experience in an HR capacity supporting 350+ hourly employees in multiple states, Excellent interpersonal and communication skills, Strong organizational and time management skills, HR Certification", "preferred": "Preferred experience with HR software and systems (Rippling HRIS), Contract to Full Time"}, "skills": ["HR", "HRIS", "Payroll", "Employee Relations", "Benefits Administration", "Labor Law", "Policy Development", "Compliance", "Talent Management", "Performance Management", "Conflict Resolution", "Communication", "Organizational Skills", "Time Management", "HR Certification"], "postedDate": "1 week ago", "benefits": "A fun, collaborative space that embraces change and innovation, Competitive benefits package including health insurance, dental insurance, vision insurance, 401K with company match, and paid vacation and holidays, Complimentary Sugaring + Tanning services + Products. Get ready for the glow!, Opportunities for future role mobility and professional development", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998115225"}