{"jobTitle": "Paid Media / Ads Project Manager (Contract)", "company": {"name": "80Twenty", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Associate", "salary": {"amount": "30.00/hr - 40.00/hr", "currency": "USD"}, "jobFunction": "Marketing, Advertising, and Project Management", "industry": "Travel Arrangements, Advertising Services, and Marketing Services", "description": "Our travel client is seeking a contract to perm Marketing Specialist to join the team, based in Los Angeles. If you are passionate about creating unforgettable experiences, this is the perfect opportunity for you to bring your marketing expertise to a place where superior quality meets a warm, down-to-earth atmosphere.\n<br/>\nAbout the role\nAs a Marketing Specialist, you will work collaboratively with the Regional Marketing Manager\nand broader marketing team to deliver all regional marketing requirements across the\nAmericas. Your role is essential in driving awareness through the communications framework, ensuring it resonates with high-yielding travelers. You would manage media, content marketing, and creative production, keeping a keen eye on the evolving media landscape and employing strong project management skills to ensure initiatives are delivered on brand, on time, and within budget.\n<br/>\nKey Responsibilities\n<ul><li>Support the Regional Marketing Manager with administration and agency management.</li><li>Manage the application of Brand guidelines across various mediums, including print, online, and multi-media, in collaboration with the Marketing team.</li><li>Lead the execution of paid content marketing programs.</li><li>Facilitate creative, content, and brand asset requirements from campaigns, ensuring quality, consistency, and market/channel relevance.</li><li>Implement best practices for creating excellent creative/content and media executions across offline and online channels.</li><li>Develop and communicate with internal and external stakeholders for effective project execution, holding relevant parties accountable.</li><li>Measure campaign and media effectiveness, support reporting, and presentation needs.</li><li>Identify optimization recommendations on digital marketing and content across paid, owned, earned, and shared channels.</li><li>Collaborate with external agencies/suppliers to achieve maximum results and support marketing streams as needed.</li></ul><br/>\nRequirements\n<ul><li>Minimum three years of professional experience in media or account management roles.</li><li>Demonstrated experience working with digital media and detailed media plans —TV, OOH, Video, Native, and Social.</li><li>Experience in content marketing programs—project management, production, media.</li><li>Understanding of media metrics, measurement, and analytics including Brand Lift Studies.</li><li>Project management experience, utilizing tools like Monday.com and Smartsheet, within a team/vendor environment.</li><li>A high-quality standard and delivery mindset; clear communicator, highly organized, with attention to detail.</li></ul><br/>\nDesired, but Not Essential\n<ul><li>Travel industry experience</li><li>Budget and contract management experience.</li></ul><br/>\n(This is a temp to potential perm position, hybrid in office - Los Angeles - Century City area)", "responsibilities": "Support the Regional Marketing Manager with administration and agency management. Manage the application of Brand guidelines across various mediums, including print, online, and multi-media, in collaboration with the Marketing team. Lead the execution of paid content marketing programs. Facilitate creative, content, and brand asset requirements from campaigns, ensuring quality, consistency, and market/channel relevance. Implement best practices for creating excellent creative/content and media executions across offline and online channels. Develop and communicate with internal and external stakeholders for effective project execution, holding relevant parties accountable. Measure campaign and media effectiveness, support reporting, and presentation needs. Identify optimization recommendations on digital marketing and content across paid, owned, earned, and shared channels. Collaborate with external agencies/suppliers to achieve maximum results and support marketing streams as needed.", "qualifications": {"required": "Minimum three years of professional experience in media or account management roles. Demonstrated experience working with digital media and detailed media plans —TV, OOH, Video, Native, and Social. Experience in content marketing programs—project management, production, media. Understanding of media metrics, measurement, and analytics including Brand Lift Studies. Project management experience, utilizing tools like Monday.com and Smartsheet, within a team/vendor environment. A high-quality standard and delivery mindset; clear communicator, highly organized, with attention to detail.", "preferred": "Travel industry experience Budget and contract management experience."}, "skills": ["Media", "Account Management", "Digital Media", "Media Planning", "Content Marketing", "Project Management", "Monday.com", "Smartsheet", "Brand Guidelines", "Communication", "Organization", "Attention to Detail"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998439205"}