{"jobTitle": "CA-Barred Attorney Needed for Short Research Project - ASAP!", "company": {"name": "Adams & Martin Group", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Temporary", "employmentType": "Temporary", "experienceLevel": "Entry level", "jobFunction": "Legal", "industry": "Law Practice and Legal Services", "description": "Adams & Martin Group is working with a well-known company's in house team in their need for a Contract Attorney. This will be a short term project over the week of August 19th.\n\nAttorney will be asked to research and summarize various legal topics for the legal team. Light drafting of correspondence and letters may also be delegated. Work is expected to take 3-5 full days to complete.\n\nThis work will be done remotely, working closely with in-house paralegal and attorney.\n\nTo be eligible, must be barred and in good standing with California bar, as well as having some experience with research tools such as Lexis or Westlaw. Prior experience drafting legal summaries and letters to be used to clients is highly preferred. Must be able to work from home using own equipment (laptop, WiFi).\n\n \n\nTo be considered, please send your resume for consideration. We will move quickly with the right candidate.\n\n<em><span class=\"TextRun SCXW202920741 BCX0\"><span class=\"NormalTextRun SCXW202920741 BCX0\">All qualified applicants will receive consideration for employment without regard to race, color, national origin, age, ancestry, religion, sex, sexual orientation, gender identity, gender expression, marital status, disability, medical condition, genetic information, pregnancy, or military or veteran status. We consider all qualified applicants, including those with criminal histories, in a manner consistent with state and local laws, including the California Fair Chance Act, City of Los Angeles' Fair Chance Initiative for Hiring Ordinance, and Los Angeles County Fair Chance Ordinance. To the extent our customers </span><span class=\"NormalTextRun SCXW202920741 BCX0\">require</span><span class=\"NormalTextRun SCXW202920741 BCX0\"> a background check for certain positions, the Company faces a significant risk to its business operations and business reputation unless a review of criminal history is conducted for those specific job positions.</span></span></em>", "postedDate": "1 week ago", "salary": {"amount": "35.00/hr - 37.00/hr", "currency": "USD"}, "skills": ["Lexis", "Westlaw", "Legal Research", "Legal Drafting", "Legal Correspondence"], "url": "https://www.linkedin.com/jobs/view/3998456258"}