{"jobTitle": "Operations Specialist", "company": {"name": "Mechanics Bank", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$23.00 - $25.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Banking", "description": "<strong>Mechanics Bank </strong>is currently searching for an <strong>Operations Specialist </strong>to join our team. Here at Mechanics Bank, we value connection, partnership, long term relationships and working together in person. This role will be working on-site at our Irvine or Corona locations.<br/><br/>In this role, you will perform a wide variety of operational tasks, from minor to complex processes or functions. You will take accountability for entire process from receipt of work to resolution and closure. Tasks require coordination of information among various operational areas and customers. Assists in the day-to-day coordination of the departmental functions by utilizing work-flow management. Will actively participate in ongoing process improvements and efficiency initiatives within the team. You will utilize multiple system applications.<br/><br/><strong>What you will do:<br/><br/></strong><ul><li>Receive and review incoming work, enter transactions, verify accuracy, prepare, edit, distribute, and/or correct specialized and/or complex documents. Utilize appropriate resources as needed to complete tasks.</li><li>Responsible for direct priority escalations and the handling of inquiries and issues escalated to the department.</li><li>Organize and complete work accurately in accordance with established measures/deadlines and assigned goals.</li><li>Responsible for the accurate completion of assigned data entry to various bank systems for the completion of the job function.</li><li>Provide excellent customer service to internal and external clients.<br/><br/><br/></li></ul><strong>Who you are:<br/><br/></strong><ul><li>High School diploma or equivalent required.</li><li>Minimum 1 year experience in operations at a financial institution.</li><li>Knowledge in bank operations and regulations.</li><li>Knowledge of word processing and spreadsheet software programs required.</li><li>Have high level of accuracy and great attention to detail.</li><li>Strong analytical and problem solving skills.</li><li>Demonstrates excellent customer service skills.</li><li>Ability to cope with pressure resulting from meeting required deadlines, reporting requirements and training responsibilities.</li><li>Exhibit a high degree of professionalism and confidentiality in handling and maintaining access to sensitive information.<br/><br/><br/></li></ul>Pay Range: $23.00 - $25.00 hourly<br/><br/>Final compensation package will be determined by the work experience, education, and/or skill level of the applicant along with internal equity and alignment with geographic market data.<br/><br/><ul><li>Mechanics Bank is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, religion, national origin, age, genetic information, veteran status, or on the basis of disability, gender identity, sexual orientation or other bases prohibited by applicable law.</li><li>Please view Equal Employment Opportunity Posters provided by OFCCP here.</li><li>To learn more about Mechanics Bank’s California privacy and security policies, including your right to a Notice At Collection as a California Resident, please visit https://www.mechanicsbank.com/California-Consumer-Residents</li></ul>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3998803769"}