{"jobTitle": "HR Generalist", "company": {"name": "Waev", "industry": "Automotive", "size": "Not specified", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Human Resources", "industry": "Automotive", "description": "We are seeking a dynamic and bilingual HR Generalist with payroll expertise to join our Human Resources team. The ideal candidate will have a general understanding of HR practices, payroll processing, and fluency in both English and Spanish. This role involves assisting and coordinating various HR functions, including employee relations, recruitment, benefits administration, and ensuring accurate and timely weekly payroll processing.", "responsibilities": "Payroll Administration: Process and manage bi-weekly and weekly payrolls. Ensure accurate data entry for payroll processing, including employee hours, deductions, earnings, and other payroll-related information. Address payroll inquiries and resolve discrepancies promptly. Maintain compliance with federal, state, and local payroll laws and regulations. Employee Relations: Serve as a first point of contact for employee concerns and inquiries. Provide guidance and support on HR policies, procedures, and best practices. Facilitate conflict resolution when applicable. Recruitment and Onboarding: Assist in the recruitment process, including job postings, screening, interviewing, and hiring. Conduct new employee orientations and ensure a smooth onboarding process. Manage and update job descriptions and postings as needed. Oversee the background and drug screenings for all new hires. Benefits Administration: Administer employee benefits programs, including health insurance, retirement plans, and leave policies. Assist employees with benefits enrollment and address any related questions. HR Compliance: Ensure compliance with all applicable employment laws and regulations. Maintain accurate and confidential employee records and HR documentation. Assist in the development and implementation of HR policies and procedures. Bilingual Communication: Translate HR documents and communications between English and Spanish. Provide language support in meetings and training sessions as needed. Assist Spanish-speaking employees with HR-related inquiries and issues.", "qualifications": {"required": "Bachelor's degree in Human Resources, Business Administration, or a related field. Minimum of 2 years of experience in a HR coordinator role, with experience in payroll administration. Fluency in both Spanish and English (written and verbal). Strong knowledge of payroll systems and processes. Excellent interpersonal and communication skills. Proficiency in HRIS (Human Resources Information Systems). Ability to handle confidential information with discretion and professionalism. Strong organizational and time-management skills. Knowledge of federal, state, and local employment laws and regulations.", "preferred": "Experience in a bilingual work environment. Familiarity with labor laws and regulations."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3998901238"}