{"jobTitle": "Fulfillment Operations Team Leader", "company": {"name": "Target", "location": "Ventura, CA"}, "location": "Ventura, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "The pay range per hour is $24.75 - $42.05<br/><br/>Pay is based on several factors which vary based on position. These include labor markets and in some instances may include education, work experience and certifications. In addition to your pay, Target cares about and invests in you as a team member, so that you can take care of yourself and your family. Target offers eligible team members and their dependents comprehensive health benefits and programs, which may include medical, vision, dental, life insurance and more, to help you and your family take care of your whole selves. Other benefits for eligible team members include 401(k), employee discount, short term disability, long term disability, paid sick leave, paid national holidays, and paid vacation. Find competitive benefits from financial and education to well-being and beyond at https://corporate.target.com/careers/benefits.<br/><br/><strong><strong>ALL ABOUT TARGET<br/><br/></strong></strong>As a Fortune 50 company with more than 400,000 team members worldwide, Target is an iconic brand and one of America's leading retailers.<br/><br/>Working at Target means the opportunity to help all families discover the joy of everyday life. Caring for our communities is woven into who we are, and we invest in the places we collectively live, work and play. We prioritize relationships, fuel and develop talent by creating growth opportunities, and succeed as one Target team. At our core, our purpose is ingrained in who we are, what we value, and how we work. It's how we care, grow, and win together.<br/><br/><strong><strong>ALL ABOUT FULFILLMENT<br/><br/></strong></strong>Experts of operations, process and efficiency who enable a consistent experience for our guests by ensuring guests get what they want, when they want it, and how they want it. The fulfillment team picks, preps, packs, sorts, and ships, products safely, efficiently and effectively to deliver convenience and quality for our guests.<br/><br/><strong>At Target, We Believe In Our Leaders Having Meaningful Experiences That Help Them Build And Develop Skills For a Career. The Role Of a Fulfillment Operations Team Leader Can Provide You With The Skills And Experience Of:<br/><br/></strong><ul><li>Knowledge of guest service fundamentals and experience building a guest first culture on your team</li><li>Knowledge of retail business fundamentals including: department sales trends, inventory management, guest shopping patterns, pricing and promotions strategies</li><li>Skills in planning department(s) daily/weekly workload to support business priorities and deliver sales goals</li><li>Skills in process improvements and workload efficiency</li><li>Experience helping build a team of hourly team members<br/><br/></li></ul><strong>As a Fulfillment Operations Team Leader, No Two Days Are Ever The Same, But a Typical Day Will Most Likely Include The Following Responsibilities:<br/><br/></strong><ul><li>Lead and demonstrate a culture of executing all best practices as outlined with team onboarding and learning; help close skill gaps through development, coaching and team interactions</li><li>Demonstrate a service culture that prioritizes the guest service experience. Model, train and coach expectations to deliver the service standard</li><li>Drive fulfillment goals, understand your role in supporting sales growth and how your departments and team contribute to and impact total store profitability, in support of your ETL</li><li>Utilize your workload planning tools to complete all scheduled workload ensuring all orders are fulfilled to meet the delivery and service standards</li><li>Review all fulfillment reporting to identify gaps and develop a plan to resolve</li><li> With direction from your ETL, create intra-day workload optimization plans for your team</li><li>Be an expert of operations, accuracy, process and efficiency</li><li>Enable efficient delivery to our guests by leading pickup and ship from store workload</li><li>Evaluate and recommend candidates for open positions and develop a guest-centric team</li><li>With ETL guidance, establish clear goals around quality, accuracy, and timeliness and hold team members accountable to expectations</li><li>Support your ETL in leading team onboarding and learning</li><li>Lead and coach the team to ensure accuracy and efficiency in all fulfillment processes, with guidance from your ETL</li><li>Close knowledge and skill gaps through training and experiences</li><li>Work a schedule that aligns to guest and business needs (this includes early morning, evening, and weekends)</li><li>Ensure supplies are ordered timely and stocked</li><li>If applicable, as a key carrier, follow all safe and secure training and processes</li><li>Demonstrate a commitment to diversity, equity, and inclusion through continuous development, modeling inclusive behaviors, and proactively managing bias</li><li>Always demonstrate a culture of ethical conduct, safety and compliance; lead team to work in the same way and hold others accountable to this commitment</li><li>Model a safety advocacy culture by understanding how safety impacts your role and that of your team, identifying and correcting hazards, and holding team accountable to working in a safe manner to benefit themselves and others.</li><li>Lead and demonstrate a culture of executing all best practices as outlined with team onboarding and learning; help close skill gaps through development, coaching and team interactions</li><li>Address store needs (emergency, regulatory visits, etc.)</li><li>Support guest services such as back-up cashier, order pick up (OPU) and Drive up (DU) and maintain a compliance culture while executing those duties, such as compliance with federal, state, and local adult beverage laws</li><li>All other duties based on business needs<br/><br/></li></ul><strong><strong>WHAT WE ARE LOOKING FOR<br/><br/></strong></strong><strong>We might be a great match if:<br/><br/></strong><ul><li>Working in a fun and energetic environment makes you excited…. We work efficiently and as a team to deliver for our guests</li><li>Providing service to our guests that makes them say I LOVE TARGET! excites you…. That’s why we love working at Target</li><li>Leading teams who are stocking, setting and selling Target products sounds like your thing… That’s the core of what we do</li><li>You aren’t looking for Monday thru Friday job where you are at a computer all day… We are busy all day (especially on the weekends), making it easy for the guest to feel welcomed, inspired and rewarded<br/><br/></li></ul><strong>The Good News Is That We Have Some Amazing Training That Will Help Teach You Everything You Need To Know To Be a Fulfillment Operations Team Leader. But, There Are a Few Skills You Should Have From The Get-go:<br/><br/></strong><ul><li>High school diploma or equivalent</li><li>Must be at least 18 years of age or older</li><li>Previous retail experience preferred, but not required</li><li>Lead and hold others accountable</li><li>Learn and adapt to current technology needs</li><li>Work independently and as part of a team</li><li>Manage workload and prioritize tasks independently</li><li>Welcoming and helpful attitude</li><li>Effective communication skills<br/><br/></li></ul><strong>We Are An Awesome Place To Work And Care About Our Teams, So We Want To Make Sure We Are Clear On a Few More Basics That We Expect: <br/><br/></strong><ul><li>Access all areas of the building to respond to guest or team member issues</li><li>Interpret instructions, reports and information</li><li>Accurately handle cash register operations as needed</li><li>Climb up and down ladders</li><li>Scan, handle and move merchandise efficiently and safely, including frequently lifting or moving merchandise up to 44 pounds without additional assistance from others, and team lift items 45-100 pounds</li><li>Ability to communicate on multiple frequency devices and operate handheld scanners, and other technology equipment as directed</li><li>Flexible work schedule (e.g., nights, weekends and holidays); reliable and prompt and regular attendance necessary.<br/><br/></li></ul><strong><strong>Americans With Disabilities Act (ADA)<br/><br/></strong></strong>Target will provide reasonable accommodations with the application process upon your request as required to comply with applicable laws. If you have a disability and require assistance in this application process, please visit your nearest Target store or reach out to Guest Services at 1-800-440-0680 for additional information.<br/><br/>Target will consider for employment qualified applicants with criminal histories in a manner consistent with the San Francisco, City of Los Angeles, and County of Los Angeles Fair Chance Ordinances, and CA state law.", "responsibilities": "Lead and demonstrate a culture of executing all best practices as outlined with team onboarding and learning; help close skill gaps through development, coaching and team interactions\nDemonstrate a service culture that prioritizes the guest service experience. Model, train and coach expectations to deliver the service standard\nDrive fulfillment goals, understand your role in supporting sales growth and how your departments and team contribute to and impact total store profitability, in support of your ETL\nUtilize your workload planning tools to complete all scheduled workload ensuring all orders are fulfilled to meet the delivery and service standards\nReview all fulfillment reporting to identify gaps and develop a plan to resolve\n With direction from your ETL, create intra-day workload optimization plans for your team\nBe an expert of operations, accuracy, process and efficiency\nEnable efficient delivery to our guests by leading pickup and ship from store workload\nEvaluate and recommend candidates for open positions and develop a guest-centric team\nWith ETL guidance, establish clear goals around quality, accuracy, and timeliness and hold team members accountable to expectations\nSupport your ETL in leading team onboarding and learning\nLead and coach the team to ensure accuracy and efficiency in all fulfillment processes, with guidance from your ETL\nClose knowledge and skill gaps through training and experiences\nWork a schedule that aligns to guest and business needs (this includes early morning, evening, and weekends)\nEnsure supplies are ordered timely and stocked\nIf applicable, as a key carrier, follow all safe and secure training and processes\nDemonstrate a commitment to diversity, equity, and inclusion through continuous development, modeling inclusive behaviors, and proactively managing bias\nAlways demonstrate a culture of ethical conduct, safety and compliance; lead team to work in the same way and hold others accountable to this commitment\nModel a safety advocacy culture by understanding how safety impacts your role and that of your team, identifying and correcting hazards, and holding team accountable to working in a safe manner to benefit themselves and others.\nLead and demonstrate a culture of executing all best practices as outlined with team onboarding and learning; help close skill gaps through development, coaching and team interactions\nAddress store needs (emergency, regulatory visits, etc.)\nSupport guest services such as back-up cashier, order pick up (OPU) and Drive up (DU) and maintain a compliance culture while executing those duties, such as compliance with federal, state, and local adult beverage laws\nAll other duties based on business needs<br/><br/>", "qualifications": {"required": "High school diploma or equivalent\nMust be at least 18 years of age or older\nPrevious retail experience preferred, but not required\nLead and hold others accountable\nLearn and adapt to current technology needs\nWork independently and as part of a team\nManage workload and prioritize tasks independently\nWelcoming and helpful attitude\nEffective communication skills<br/><br/>", "preferred": "Previous retail experience"}, "skills": ["Guest Service", "Retail", "Inventory Management", "Workload Management", "Team Leadership", "Communication", "Training", "Process Improvement", "Sales", "Customer Service", "Technology", "Safety"], "postedDate": "2 weeks ago", "benefits": "The pay range per hour is $24.75 - $42.05<br/><br/>Pay is based on several factors which vary based on position. These include labor markets and in some instances may include education, work experience and certifications. In addition to your pay, Target cares about and invests in you as a team member, so that you can take care of yourself and your family. Target offers eligible team members and their dependents comprehensive health benefits and programs, which may include medical, vision, dental, life insurance and more, to help you and your family take care of your whole selves. Other benefits for eligible team members include 401(k), employee discount, short term disability, long term disability, paid sick leave, paid national holidays, and paid vacation. Find competitive benefits from financial and education to well-being and beyond at https://corporate.target.com/careers/benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998927117"}