{"jobTitle": "Air Freight Manager", "company": {"name": "JobsInLogistics.com", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Company: **FreightTAS**<br/><br/><br/>**Job Description:**<br/><br/>Air Freight Manager<br/><br/>Location - Los Angeles<br/><br/>Monday to Friday - 8am to 5pm<br/><br/>Salary - $70k to $85k base<br/><br/>Excellent benefits<br/><br/>Cargowise advantageous or similar software<br/><br/>Must have a minimum 3 years of current Air Freight Management experience working at an International Freight Forwarder in Air operations is required to complete the tasks asked for this position.<br/><br/>Candidates must be legally eligible to work in the USA<br/><br/>Our client is a Global Freight Forwarder and if you are a motivated individual with experience in freight management, we invite you to apply for the position of Air Freight Manager and join the team and contribute to the success of our company as we continue to provide efficient and reliable transportation services.<br/><br/><br/>**Responsibilities:**<br/><br/><ul><li>Proven experience in freight management or a related field.</li><li>Manage overall export and import operations.</li><li>Develop, implement and continuously strengthening air freight forwarding operational procedures (import and export).</li><li>Lead negotiation of rates and contracts with air carriers.</li><li>Collaborate with sales functions to execute business plan targets.</li><li>Build and maintain long term relations with clients, airlines and terminals.</li><li>Oversee compliance with TSA, Customs, laws and regulations for importing and exporting.<br/><br/><br/></li></ul>**Experience:**<br/><br/><ul><li>Minimum 3 years of experience in an airfreight management position.</li><li>Strong knowledge of command of documentation, procedures and rules for air cargo transportation.</li><li>Experience with CargoWise is advantageous</li><li>Excellent communication, interpersonal, and organizational skills.</li><li>Dedication to high quality customer service.</li><li>Preferred Chinese speaking is advantageous but not necessary.<br/><br/><br/></li></ul>**Benefits:**<br/><br/><ul><li>401(k) matching</li><li>Dental insurance</li><li>Health insurance</li><li>Life insurance</li><li>Paid time off</li><li>Vision insurance<br/><br/><br/></li></ul>**Schedule:**<br/><br/><ul><li>8 hour shift</li><li>Monday to Friday<br/><br/><br/></li></ul>**Application Question(s):**<br/><br/><ul><li>Please only apply if you have the relevant current experience and can legally work in the USA<br/><br/><br/></li></ul>**Experience:**<br/><br/><ul><ul><li>Logistics: 3 years (Required)</li><li>Freight Forwarding: 3 years (Required)</li><li>Air Freight: 3 years (Required) Sorry, visa / sponsorship not available.</li></ul></ul>", "responsibilities": "Proven experience in freight management or a related field. Manage overall export and import operations. Develop, implement and continuously strengthening air freight forwarding operational procedures (import and export). Lead negotiation of rates and contracts with air carriers. Collaborate with sales functions to execute business plan targets. Build and maintain long term relations with clients, airlines and terminals. Oversee compliance with TSA, Customs, laws and regulations for importing and exporting.", "qualifications": {"required": "Must have a minimum 3 years of current Air Freight Management experience working at an International Freight Forwarder in Air operations is required to complete the tasks asked for this position. Candidates must be legally eligible to work in the USA", "preferred": "Experience with CargoWise is advantageous"}, "skills": ["Freight Management", "Air Freight", "CargoWise", "International Freight Forwarding", "TSA", "Customs", "Export", "Import", "Negotiation", "Sales", "Customer Service"], "postedDate": "1 week ago", "benefits": "401(k) matching, Dental insurance, Health insurance, Life insurance, Paid time off, Vision insurance", "remoteWork": "No", "salary": {"amount": "70,000.00/yr - 85,000.00/yr", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3998679048"}