{"jobTitle": "Senior Architectural Designer", "company": {"name": "Blackstone Talent Group", "location": "San Francisco Bay Area"}, "location": "San Francisco Bay Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00/yr - $130,000.00/yr", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Staffing and Recruiting", "description": "<strong><u>About</u></strong><p>Our client is a recognized leader providing design and project management services for transit, aviation, and civic clients. The firm primarily focuses on projects in California with offices in San Francisco, Oakland, and Los Angeles.</p><p><br/></p><p><strong>Referral Program: Not Interested but know someone!? We offer a $1000 Referral Bonus for anyone you refer that gets the project. </strong></p><p><br/></p><p>Position Details:</p><p>Location: Oakland, CA (Hybrid Remote/2 days onsite/ Tues &amp; Thurs)</p><p>Type: Full time (Permanent)</p><p><br/></p><p><strong><u>The Role</u></strong></p><p>The Senior Job Captain (Architectural Designer III) prepares and leads production of complex design documents for significant aspects of a given project. The individual is responsible for selecting, evaluating, and executing procedures and techniques used on projects. Under the supervision of a Project Architect, the Job Captain will take the project from programming and schematic design to a final set of construction documents and may manage junior designers on the team and guide their professional development within the company.</p><p><br/></p><p><strong>Key Responsibilities</strong></p><p><br/></p><p>· Conceptualize and organize project design ideas based on preliminary concepts, sketches, specification sheets, and other data to produce designs, drawings, schedules, details, and notes</p><p>· Work closely with the project team to organize, assemble, and coordinate drawings into a cohesive set as required; direct the work of junior team members</p><p>· Work with highly collaborative multi-discipline design teams to coordinate with all parties engaged in the project and integrate information into project documents</p><p>· Reviews and checks layout and design drawings to determine if design meets functional and performance specifications; rework and modify plans based on comments from management or client</p><p>· Assist with other duties as necessary (i.e., report preparation, site visits, drawings, code research, etc.)</p><p>· Participates in approvals of material and specifications in alignment with design goals</p><p>· Use computer-assisted design software (CAD and REVIT) to prepare detailed project designs and make necessary corrections; check for quality and documentation completion</p><p>· Participate in regular meetings with the client, contractors, design team and other stakeholders</p><p>· Responsible for filing and maintenance of project documents according to document control standards</p><p>· Attend meetings and conferences as approved</p><p><br/></p><p><strong>Capabilities And Credentials</strong></p><p>· Creativity and the ability to forge design concepts; ability to change design to fit client requirements</p><p>· Solid understanding of architectural materials and products</p><p>· Proficient in operating REVIT, AutoCAD, Bluebeam, Photoshop, Adobe Suite, and Microsoft Office Suite</p><p>· Strong listening, oral and written communication, time management, and organizational skills</p><p>· Attention to detail and is highly organized</p><p>· Excellent reading comprehension skills to understand the content in work-related documents</p><p>· Capable of working collaboratively with team members</p><p>· Ability to multitask and handle multiple projects to meet deadlines</p><p>· Ability to win work through developed relationships, contribute to proposal development and participate in interviews</p><p>· Keep current with the latest regulatory requirements, industry standards, and construction materials and methods</p><p><br/></p><p><strong>Education And Experience</strong></p><p>· Bachelor’s degree in architecture from an accredited institution</p><p>· Must be licensed or pursuing licensure</p><p>· 7+ years of architectural experience</p><p>· Proficiency in REVIT, AutoCAD, Bluebeam, Photoshop, and Microsoft Office suite is required</p><p>· Working knowledge of LEED or accreditation is preferred</p><p>· Also, someone who has experience on larger public projects (transit, aviation, education).</p><p><br/></p><p>Blackstone Talent Group is a wholly owned subsidiary of Blackstone Technology Group, a global IT services and software firm that implements technological solutions across commercial industry verticals and the US Federal Government. Blackstone's global talent augmentation practice was founded in 1998. Blackstone Talent Group has offices in San Francisco, Denver, Houston, Colorado Springs, and Washington, DC. We specialize in providing clients the best talent across a variety of industries and sectors.</p><p></p>", "responsibilities": "The Senior Job Captain (Architectural Designer III) prepares and leads production of complex design documents for significant aspects of a given project. The individual is responsible for selecting, evaluating, and executing procedures and techniques used on projects. Under the supervision of a Project Architect, the Job Captain will take the project from programming and schematic design to a final set of construction documents and may manage junior designers on the team and guide their professional development within the company.", "qualifications": {"required": "· Creativity and the ability to forge design concepts; ability to change design to fit client requirements\n· Solid understanding of architectural materials and products\n· Proficient in operating REVIT, AutoCAD, Bluebeam, Photoshop, Adobe Suite, and Microsoft Office Suite\n· Strong listening, oral and written communication, time management, and organizational skills\n· Attention to detail and is highly organized\n· Excellent reading comprehension skills to understand the content in work-related documents\n· Capable of working collaboratively with team members\n· Ability to multitask and handle multiple projects to meet deadlines\n· Ability to win work through developed relationships, contribute to proposal development and participate in interviews\n· Keep current with the latest regulatory requirements, industry standards, and construction materials and methods", "preferred": "· Working knowledge of LEED or accreditation is preferred\n· Also, someone who has experience on larger public projects (transit, aviation, education)."}, "skills": ["REVIT", "AutoCAD", "Bluebeam", "Photoshop", "Adobe Suite", "Microsoft Office Suite", "LEED"], "postedDate": "1 week ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Paid paternity leave, Paid maternity leave, Commuter benefits", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3998449386"}