{"jobTitle": "Coordinator, Retail Marketing", "company": {"name": "NBCUniversal", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "45,760 - 58,240", "currency": "USD"}, "jobFunction": "Other", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "description": "We create world-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group and have world-renowned theme parks and attractions through Universal Destinations &amp; Experiences. NBCUniversal is a subsidiary of Comcast Corporation.<br/><br/>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever-changing face of the world.<br/><br/><strong>Universal Products &amp; Experiences Overview<br/><br/></strong>Universal Products &amp; Experiences (UP&amp;E) globally drives the expansion and elevation of NBCUniversal’s iconic collection of brands, intellectual properties, characters, and stories based on the company’s extensive portfolio of properties created by Universal Pictures, Illumination, DreamWorks Animation and NBCUniversal Television and Streaming. The division executes this through innovative physical and digital products, engaging retail and product experiences across our expansive global theme park destinations (for both owned and 3rd party IP), location-based venues, e-commerce product platforms, and retailers around the world. Along with global brand strategy and creative, UP&amp;E’s three lines of business include Consumer Products, Games and Digital Platforms, as well as Theme Parks Products &amp; Retail. UP&amp;E is a division of Universal Destinations &amp; Experiences, part of NBCUniversal, a subsidiary of Comcast Corporation. https://www.universalproductsexperiences.com/<br/><br/>Universal Products &amp; Experiences is committed to attracting and retaining a diverse workforce of the highest caliber. We are committed to fostering equitable and inclusive environments that honor the experiences, perspectives, and uniqueness of each colleague.<br/><br/>It is the policy of NBCUniversal and NBCUniversal's affiliated businesses to consider all qualified applicants for employment without regard to race, color, religion, national origin, sex (including pregnancy) sexual orientation, age, disability, veteran status or other characteristics protected by applicable law.<br/><br/><strong>Summary<br/><br/></strong><strong>Job Description<br/><br/></strong>The Coordinator, Retail Marketing will support the planning, execution and optimization of our omnichannel retail marketing efforts. This role is vital in ensuring the seamless coordination of marketing activities and initiatives aimed to sell-in and sell-through franchise products by creating buzz, driving traffic, increasing sales and enhancing customer engagement.<br/><br/>This role supports retail accounts across multiple channels including Mass (Target), Department Store, Gaming/Electronics and our Growth Channel (Specialty, Off Price, Value, Grocery/Drug, Club, Home Improvement, Craft, Books).<br/><br/>This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.<br/><br/>Salary range: $45,760 - $58,240<br/><br/><strong>Qualifications<br/><br/></strong><strong>Direct Responsibilities:<br/><br/></strong><ul><li>Support both Director, Omnichannel Retail Marketing and Associate Manager, Growth Channel Retail Marketing with coordinating various initiatives such as omni-channel retail marketing campaigns (digital, social, in-store, content, influencers, events, retail media, ecommerce, etc…), executive retail meetings, pitch decks, campaign recaps, PR support requests and more.</li><li>Coordination for campaign development:</li><ul><li>Participate in brainstorm sessions.</li><li>Keep a pulse on and share marketing trends tied to toys, fashion, home, beauty, consumables and more… especially in the social and influencer spaces.</li><li>Collaborate with cross-functional teams including Franchise, Category and Business Development counterparts.</li><li>Gather priority product information from applicable teams for marketing use.</li><li>Support the creation of marketing briefs to agencies and creators in Excel and Keynote.</li><li>Support the creation of Keynote slides for campaign overviews with a minimum of basic design skills.</li><li>Setup marketing vendors in NBCU systems.</li><li>Route contracts for review and signature.</li><li>Schedule meetings with marketing agencies.</li></ul><li>Coordination for campaign execution:</li><ul><li>Distribute creative assets for marketing use to external partners with digital asset management tools.</li><li>Check for retail marketing submissions in Media Box and route projects to applicable teams for review.</li><li>Provide feedback on applicable Media Box marketing submissions in partnership with Franchise.</li><li>Gather feedback from Manager and applicable internal teams on creative agency work and share back with appropriate contacts.</li><li>Coordinate logistics of campaigns through project management tools and timelines to ensure teams are updated, on track and accountable for timely launches.</li><li>Track campaign data from various channels/partners like YouTube, Instagram, TikTok and Influencers.</li><li>Support the creation of Keynote slides and/or Excel sheets for campaign recaps that include campaign images/screenshots/recordings, links, tracked data, etc… Work with Manager on analysis.</li><li>Support logistics at marketing events.</li><li>Generate PO’s.</li><li>Process invoices.</li></ul><li>Update team trackers with Manager’s and applicable team’s guidance including marketing calendars, budget/actualized spends, product lists for marketing.</li><li>For executive retail meetings &amp; pitch decks:</li><ul><li>Aggregate cross-functional team slides into master document/keynote and route to applicable teams.</li></ul><li>Conduct ongoing market trend analysis (internal and external) influencing marketing planning.</li><li>Update job knowledge by participating in educational opportunities and reading trade publications.<br/><br/></li></ul><strong>Qualifications/Requirements<br/><br/></strong><ul><li>Understanding of marketing principles and best practices.</li><li>Familiarity with retailers and franchise products.</li><li>Excellent written and verbal communication skills.</li><li>Proficiency in Microsoft Office Suite and Keynote.</li><li>Ability to work independently and as part of a team.</li><li>Strong organizational time-management skills.</li><li>Creative thinking and problem-solving abilities.</li><li>Well versed with social media platforms and digital marketing tactics.<br/><br/></li></ul><strong>Eligibility Requirements<br/><br/></strong><ul><li>Bachelor’s degree in marketing, media, advertising or a related field.</li><li>1-2 years of experience in marketing or a similar role.</li><li>Hybrid work environment.</li><li>May require occasional travel, evening, and weekend work to support marketing events and activities.<br/><br/></li></ul><strong>Additional Requirements<br/><br/></strong><ul><li>Hybrid: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.<br/><br/></li></ul><strong>Desired Characteristics<br/><br/></strong><ul><li>Creative thinker</li><li>Collaborative</li><li>Pro-active and resourceful</li><li>Personable and outgoing</li><li>Attuned to trends</li><li>Continuous learner<br/><br/></li></ul><strong>Additional Information<br/><br/></strong>NBCUniversal's policy is to provide equal employment opportunities to all applicants<br/><br/>and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation,<br/><br/>marital status, pregnancy, veteran status, membership in the uniformed services,<br/><br/>genetic information, or any other basis protected by applicable law.<br/><br/>NBCUniversal will consider for employment qualified applicants with criminal histories,<br/><br/>or arrest or conviction records, in a manner consistent with relevant legal<br/><br/>requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring<br/><br/>Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.<br/><br/>If you are a qualified individual with a disability or a disabled veteran, you have the<br/><br/>right to request a reasonable accommodation if you are unable or limited in your<br/><br/>ability to use or access nbcunicareers.com as a result of your disability. You can<br/><br/>request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.", "responsibilities": "The Coordinator, Retail Marketing will support the planning, execution and optimization of our omnichannel retail marketing efforts. This role is vital in ensuring the seamless coordination of marketing activities and initiatives aimed to sell-in and sell-through franchise products by creating buzz, driving traffic, increasing sales and enhancing customer engagement.<br/><br/>This role supports retail accounts across multiple channels including Mass (Target), Department Store, Gaming/Electronics and our Growth Channel (Specialty, Off Price, Value, Grocery/Drug, Club, Home Improvement, Craft, Books).", "qualifications": {"required": "Understanding of marketing principles and best practices, Familiarity with retailers and franchise products, Excellent written and verbal communication skills, Proficiency in Microsoft Office Suite and Keynote, Ability to work independently and as part of a team, Strong organizational time-management skills, Creative thinking and problem-solving abilities, Well versed with social media platforms and digital marketing tactics", "preferred": "Bachelor’s degree in marketing, media, advertising or a related field, 1-2 years of experience in marketing or a similar role, Hybrid work environment, May require occasional travel, evening, and weekend work to support marketing events and activities"}, "skills": ["Marketing", "Retail", "Social Media", "Digital Marketing", "Microsoft Office", "Keynote", "Communication", "Time Management", "Problem Solving"], "postedDate": "1 week ago", "benefits": "This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998861922"}