{"jobTitle": "Vendor Manager", "company": {"name": "APR Consulting", "location": "Rosemead, CA"}, "location": "Rosemead, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "53.00/hr - 53.00/hr", "currency": "USD"}, "jobFunction": "Information Technology, Project Management, and Supply Chain", "industry": "Hospitals and Health Care, Banking, and Utilities", "description": "An electric utility client is looking for a Vendor Manager with Smartsheet and Octane who will ensure seamless integration and compliance with contract commitments while driving continuous improvement and efficiency in vendor processes.", "responsibilities": "Scope of Project: We are seeking a motivated and detail-oriented Delivery Management Specialist to oversee and manage all aspects of vendor relationships and deliverables. The ideal candidate will ensure seamless integration and compliance with contract commitments while driving continuous improvement and efficiency in vendor processes. This role involves collaboration with internal teams, stakeholders, and vendors to achieve strategic objectives and enhance operational effectiveness. Long-term assignment\nOversight of Vendor Objectives: Manage vendor relationships to ensure alignment with business objectives and commitments.\nProcess Establishment and Improvement: Work closely with vendors to establish robust processes for reporting, governance, and operational efficiencies.\nAgile Best Practices: Provide direction and guidance on agile methodologies (Kanban & Scrum) and best practices to optimize project delivery.\nCompliance Management: Ensure strict adherence to contract commitments and regulatory requirements.\nSupport Development Teams: Facilitate resolution of blockers and impediments to support development team progress.\nAcceptance and Billing: Validate and confirm acceptance of all deliverables prior to invoicing or billing.\nStakeholder Liaison: Act as a liaison between delivery teams, stakeholders, and management to ensure clear communication and alignment of goals.\nDocumentation and Reporting: Ensure comprehensive documentation of processes and collaborate with vendors to develop dashboards and reporting mechanisms.\nSupport for New Contracts: Assist in the development and negotiation of new contracts and statements of work.\nProcess Streamlining: Create and streamline processes for efficient intake and management of new work and projects.\nSupport Integration Efforts: Assist in integrating applications into the company's single sign-on platform and other IT infrastructure as needed\nTeam structure: Reports to Sr. Manager Security & Access Management. Indirect reports will be managed by service provider project managers and program managers.", "qualifications": {"required": "Required Bachelors degree in Business, Management, Engineering or a related field or an equivalent combination of education, training, and experience.\nPreferably utility; however, there can be other large highly regulated industries (banking, healthcare)\nProven experience 5 years or more combined experience in vendor management contract compliance and process improvement within software development\nProficiency in MS Office Suite (Excel, Word, Sharepoint, OneNote), Smartsheet, and experience with project management tools (e.g., JIRA, Trello, Octane).\nStrong understanding of agile methodologies and project management principles\nExcellent verbal and written communication skills with the ability to effectively collaborate across teams and with external partners and managed service providers\nDetail-oriented with strong analytical and problem-solving abilities\nAbility to thrive in a fast-paced environment and manage multiple priorities effectively\n5 years of Scrum master experience\n7 years of IT project management experience (will count scrum master experience towards total) preferably certified PMP\n5+ years in vendor management, contract compliance, and process improvement within software development.\nStrong understanding of agile methodologies and project management principles.", "preferred": "Proficiency in MS Office Suite Smartsheet and experience with project management tools eg. JIRA Trello Octane."}, "skills": ["Smartsheet", "Octane", "MS Office Suite", "Excel", "Word", "Sharepoint", "OneNote", "JIRA", "Trello", "Agile Methodologies", "Project Management", "Communication", "Collaboration", "Problem Solving", "Vendor Management", "Contract Compliance", "Process Improvement", "Software Development", "Scrum Master", "IT Project Management", "PMP"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998460178"}