{"jobTitle": "Assistant Buyer", "company": {"name": "Pinnacle Trading", "location": "Redondo Beach, CA"}, "location": "Redondo Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "50,000.00/yr - 75,000.00/yr", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "description": "\"<strong>Company Description</strong>Pinnacle Trading is an international import/export company.  We distribute famous and luxury brand name products only to distribution channels that do not have access.  Our company is very profitable, and have had exponential growth over the years.  We are located steps from the beach and have a fantastic office environment.  Parent company is a 45+-year-old firm with over 1 billion dollars in annual sales.  Fantastic benefits package.<br/><strong>Role Description</strong>This is a full-time on-site role for an Buyer or Assistant Buyer at Pinnacle Trading in the Village of Redondo Beach, CA. The Assistant Buyer will be responsible for assisting with purchasing decisions, analyzing market trends, preparing offers for the sales team, and maintaining relationships with suppliers.<br/><strong>Qualifications</strong><ul><li>Strong analytical and organizational skills</li><li>Excellent communication and negotiation abilities</li><li>Proficiency in Microsoft Excel and inventory management software.  Pivot tables and V-look ups a plus</li><li>Knowledge of retail math and supply chain logistics</li><li>Ability to work well in a team and handle multiple priorities</li><li>Previous experience in a purchasing or procurement role.  3 years suggested</li><li>Bachelor's degree in Business Administration or related field preferred</li></ul>\"", "postedDate": "1 week ago", "skills": ["Microsoft Excel", "Inventory Management", "Supply Chain", "Retail Math", "Purchasing", "Procurement", "Negotiation", "Communication", "Analytical Skills", "Organizational Skills"], "url": "https://www.linkedin.com/jobs/view/3998811392"}