{"jobTitle": "Sales Coordinator", "company": {"name": "Express Employment Professionals", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Staffing and Recruiting", "description": "Express Employment Professionals of LAX/Hawthorne is seeking a Sales Coordinator for a local manufacturing company. For consideration, please call Express LAX/Hawthorne at or email your resume to jobs.laxca@expresspros.com.<br/><br/>Hours: Full time Monday – Friday 8:00am – 5:00pm <br/><br/>Pay Rate: $19 -$27/hr DOE<br/><br/>Job Description For Sales Coordinator:<br/><br/>Provides internal and external customer service. It requires contact with all members of the Management team, the employees and outside business professionals, vendors, and community leaders.<br/><br/>Administrative Assistant Responsibilities:<br/><br/><ul><li>Answer incoming phone calls and forward to the appropriate person</li><li>Monitor lobby door and front gate and grant access as appropriate</li><li>Assist customers checking in in the lobby and coordinate introduction to the appropriate team members</li><li>Provide general support to visitors while on site</li><li>Keep in touch and foster relationships with clients</li><li>Maintain stock of office, cleaning, and breakroom supplies (includes ordering supplies from approved vendors</li><li>Coordinate service calls for malfunctioning office equipment<br/><br/></li></ul>Project Coordinator Responsibilities:<br/><br/><ul><li>Create project folders for new incoming orders and distribute</li><li>File completed project folders</li><li>Create invoices for completed orders and work with Corporate Accounts Receivable department with any issues requiring clarification</li><li>Receive invoices from vendors and forward invoices to Corporate Accounts Payables department</li><li>Upload packing slips into the system<br/><br/></li></ul>For consideration, please apply online at expresspros.com/laxca or schedule an appointment by calling 310.414.3100.<br/><br/><em>We will consider all qualified applicants for employment, including those with criminal histories, in a manner consistent with state and local laws including the City of Los Angeles Fair Chance Initiative Hiring Ordinance.<br/><br/></em>Company Description<br/><br/>Express Employment Professionals is one of the top staffing companies in the U.S. and Canada. Every day, we help people find jobs and provide workforce solutions to businesses. Express has more than 800 franchise locations that provide a full range of employment solutions that include full-time, temporary, and part-time employment in a wide range of positions, including Professional, Light Industrial, and Office Services.<br/><br/>We will consider all qualified applicants for employment, including those with criminal histories, in a manner consistent with state and local laws including the City of Los Angeles Fair Chance Initiative Hiring Ordinance.<br/><br/>Express Employment Professionals is one of the top staffing companies in the U.S. and Canada. Every day, we help people find jobs and provide workforce solutions to businesses. Express has more than 800 franchise locations that provide a full range of employment solutions that include full-time, temporary, and part-time employment in a wide range of positions, including Professional, Light Industrial, and Office Services. We will consider all qualified applicants for employment, including those with criminal histories, in a manner consistent with state and local laws including the City of Los Angeles Fair Chance Initiative Hiring Ordinance.", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3998785465"}