{"jobTitle": "Workplace Operations Coordinator", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "50,000.00 - 190,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Netflix is seeking a Workplace Operations Coordinator to join our Los Angeles team. As the Workplace Operations Coordinator, you will work closely with our Workplace Operations Manager and Specialists to make Netflix a world-class place to work and contribute to our unique company culture.<br/><br/>Netflix is a fast-paced and demanding company that requires a driven individual who can exercise good judgment, take fast initiative, and provide a high level of customer service to enhance our employee experience.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Provide the highest level of service to employees, vendors, and guests.</li><li>Create and maintain strong relationships with workplace colleagues and cross-functional partners.</li><li>Coordinate with specialists to review and update on-site vendor projects, assist with job walks, and assist with day-to-day workplace activities including general repairs and maintenance, HVAC, utilities, and pest control.</li><li>Oversee Zendesk tickets, update and maintain ASANA</li><li>Submit and send purchase orders to vendors, track invoices, and submissions in Workday.</li><li>Coordinate with Finance to close purchase orders at month-end.</li><li>Verify procurement card transactions for daily orders and assist specialists with their P-card submissions.</li><li>Onboard vendors, ensuring they meet Finance and Certificate of Insurance (COI) requirements.</li><li>Create and track overtime sheets for all technicians.</li><li>Order parts and supplies for projects, log each order into the tracker and submit receipts into Workday.</li><li>Coordinate part deliveries with Logistics to ensure they arrive at specified buildings.</li><li>Maintain and organize files for Fire Life Safety (FLS) agreements and inspection reports.</li><li>Collaborate with the Environmental, Health &amp; Safety team (EHS) and Corporate Security teams to ensure compliance across all sites, ensuring a safe and productive working environment.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>2+ years of experience in Facilities/Workplace Experience.</li><li>Experience with ticketing and/or project tracking systems, such as Zendesk, Maximo, or ASANA, is a plus.</li><li>Friendly and professional demeanor with the ability to build and maintain successful relationships with partners and stakeholders.</li><li>Highly organized and detail-oriented, with excellent communication and problem-solving skills.</li><li>Ability to multi-task and work in a fast-paced environment.</li><li>Self-motivated, proactive, and hands-on, willing to tackle any problem.</li><li>Experience with Google Suite (Gmail, Google Drive, Google Docs, Sheets, Slides, etc.).</li><li>On-site role in Los Angeles, that may require travel between buildings.<br/><br/></li></ul>Generally, our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $50,000 - $190,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "Provide the highest level of service to employees, vendors, and guests.\nCreate and maintain strong relationships with workplace colleagues and cross-functional partners.\nCoordinate with specialists to review and update on-site vendor projects, assist with job walks, and assist with day-to-day workplace activities including general repairs and maintenance, HVAC, utilities, and pest control.\nOversee Zendesk tickets, update and maintain ASANA\nSubmit and send purchase orders to vendors, track invoices, and submissions in Workday.\nCoordinate with Finance to close purchase orders at month-end.\nVerify procurement card transactions for daily orders and assist specialists with their P-card submissions.\nOnboard vendors, ensuring they meet Finance and Certificate of Insurance (COI) requirements.\nCreate and track overtime sheets for all technicians.\nOrder parts and supplies for projects, log each order into the tracker and submit receipts into Workday.\nCoordinate part deliveries with Logistics to ensure they arrive at specified buildings.\nMaintain and organize files for Fire Life Safety (FLS) agreements and inspection reports.\nCollaborate with the Environmental, Health & Safety team (EHS) and Corporate Security teams to ensure compliance across all sites, ensuring a safe and productive working environment.", "qualifications": {"required": "2+ years of experience in Facilities/Workplace Experience.\nExperience with ticketing and/or project tracking systems, such as Zendesk, Maximo, or ASANA, is a plus.\nFriendly and professional demeanor with the ability to build and maintain successful relationships with partners and stakeholders.\nHighly organized and detail-oriented, with excellent communication and problem-solving skills.\nAbility to multi-task and work in a fast-paced environment.\nSelf-motivated, proactive, and hands-on, willing to tackle any problem.\nExperience with Google Suite (Gmail, Google Drive, Google Docs, Sheets, Slides, etc.).\nOn-site role in Los Angeles, that may require travel between buildings."}, "skills": ["Zendesk", "ASANA", "Google Suite", "Facilities", "Workplace Experience", "Customer Service", "Communication", "Problem Solving"], "postedDate": "1 week ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998894558"}