{"jobTitle": "Litigation Paralegal  *Remote After 90 Days*", "company": {"name": "Adams & Martin Group", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00/yr - $95,000.00/yr", "currency": "USD"}, "jobFunction": "Legal", "industry": "Law Practice", "description": "A reputable regional law firm is seeking a Litigation Paralegal to join their LA team. This role is fully onsite (DTLA) for the first 90-100 days and then can transition to fully remote. The ideal candidate will have 3 plus years of experience as a Litigation Paralegal, an ABA accredited Paralegal certificate, and strong experience with discovery, arbitrations, and trials in complex cases. This role is paying $90-95,000 and we are looking to speak to candidates immediately.<br/><em><span class=\"TextRun SCXW202920741 BCX0\"><span class=\"NormalTextRun SCXW202920741 BCX0\">All qualified applicants will receive consideration for employment without regard to race, color, national origin, age, ancestry, religion, sex, sexual orientation, gender identity, gender expression, marital status, disability, medical condition, genetic information, pregnancy, or military or veteran status. We consider all qualified applicants, including those with criminal histories, in a manner consistent with state and local laws, including the California Fair Chance Act, City of Los Angeles' Fair Chance Initiative for Hiring Ordinance, and Los Angeles County Fair Chance Ordinance. To the extent our customers </span><span class=\"NormalTextRun SCXW202920741 BCX0\">require</span><span class=\"NormalTextRun SCXW202920741 BCX0\"> a background check for certain positions, the Company faces a significant risk to its business operations and business reputation unless a review of criminal history is conducted for those specific job positions.</span></span></em>", "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3998809369"}