{"jobTitle": "Leadership Development Learning Designer", "company": {"name": "Meta", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "177,000.00/yr - 245,000.00/yr", "currency": "USD"}, "jobFunction": "Education and Training", "industry": "Technology, Information and Internet", "description": "The Leadership Development Learning Designer role will contribute at both a strategic and hands-on level to shape and optimize Meta’s learning experiences and resources for organizational leaders and people managers to build core leadership skills critical to the success of Meta’s business strategies. With a continuous finger on the pulse of leaders and a dynamic understanding of leader capabilities and expectations, the Learning Designer will oversee the full lifecycle of development experiences for leaders - from needs analysis, to design, impact evaluation, reporting, and cross-functional stakeholder management and socialization. This role will also be responsible for the relationships needed for designing best-in-class leadership development experiences, managing SME relationships, and facilitating programs as necessary. This role will be involved in consulting on new ideas, and work closely with implementation and program partners to craft ways forward and move development experiences through to the maintenance phase.<br/><br/>Leadership Development Learning Designer Responsibilities:<br/><br/><ul><li>Conducts needs analysis, proactively obtaining company-wide business signal, and industry insights to identify priority leadership skill development opportunities.</li><li>Gathers and analyzes quantitative and qualitative data critical to solutions development.</li><li>Partners across Leadership Development to develop program strategy for directors and managers.</li><li>Owns full life-cycle of learning content design and creation, including: setting success metrics, designing course content, identifying, negotiating, and managing vendors, managing stakeholders, developing content to meet stakeholder needs, and partnering across the team to regularly evaluate program health to ensure participants are meeting program outcomes.</li><li>Leads communication by setting tone and key messages of the program, and leads socialization with key stakeholders to ensure cross-functional alignment and buy-in.</li><li>Partners cross-functionally to build effective learning measurement plans, aligning on cadence of maintenance, and acting as core point-of-contact (POC) for reporting insights back to stakeholders.</li><li>Partners with members of the project team to improve efficiency and effectiveness as it relates to learning content, consistently pushing the boundary on how we approach learning, testing new methodologies or modalities to ensure the best learning experiences.</li><li>Act as core POC for leadership audiences, ensuring skills development opportunities are built into broader people initiatives.</li><li>Some facilitation will be required as a part of this function, with responsibility falling to this role for facilitation or training-the-trainer (T3’ing) of facilitators for in-house developed programs.<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>12+ years of experience managing complex internal and external facing projects within a highly matrixed organization through regular communications &amp; meetings</li><li>Experience delivering full life-cycle of learning content design, creation, and facilitation</li><li>Proven facilitation skills</li><li>Experience collaborating, sharing and driving best practices cross-functionally and globally</li><li>Proven problem solving and creative solution development skills</li><li>Effective communication and presentation skills with proven history of success working across functions and teams</li><li>Resourceful, action-orientated with experience to get things done independently and overcome obstacles by developing creative solutions to problems</li><li>Experience working in a fast-paced, scrappy environment, thriving amidst ambiguity while ensuring executional excellence<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Experience building Learning Solutions for people managers and/or organizational leaders</li><li>Proven subject matter expertise in Leadership Skills</li><li>Knowledge of Meta products and operations</li><li>Experience in utilizing a multitude of learning modalities, including but not limited to, virtual instructor-led sessions, eLearn creation, video scripting, and live led sessions<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$177,000/year to $245,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "The Leadership Development Learning Designer role will contribute at both a strategic and hands-on level to shape and optimize Meta’s learning experiences and resources for organizational leaders and people managers to build core leadership skills critical to the success of Meta’s business strategies. With a continuous finger on the pulse of leaders and a dynamic understanding of leader capabilities and expectations, the Learning Designer will oversee the full lifecycle of development experiences for leaders - from needs analysis, to design, impact evaluation, reporting, and cross-functional stakeholder management and socialization. This role will also be responsible for the relationships needed for designing best-in-class leadership development experiences, managing SME relationships, and facilitating programs as necessary. This role will be involved in consulting on new ideas, and work closely with implementation and program partners to craft ways forward and move development experiences through to the maintenance phase.", "qualifications": {"required": "12+ years of experience managing complex internal and external facing projects within a highly matrixed organization through regular communications &amp; meetings\nExperience delivering full life-cycle of learning content design, creation, and facilitation\nProven facilitation skills\nExperience collaborating, sharing and driving best practices cross-functionally and globally\nProven problem solving and creative solution development skills\nEffective communication and presentation skills with proven history of success working across functions and teams\nResourceful, action-orientated with experience to get things done independently and overcome obstacles by developing creative solutions to problems\nExperience working in a fast-paced, scrappy environment, thriving amidst ambiguity while ensuring executional excellence", "preferred": "Experience building Learning Solutions for people managers and/or organizational leaders\nProven subject matter expertise in Leadership Skills\nKnowledge of Meta products and operations\nExperience in utilizing a multitude of learning modalities, including but not limited to, virtual instructor-led sessions, eLearn creation, video scripting, and live led sessions"}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "$177,000/year to $245,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3998548531"}