{"jobTitle": "Vehicle Operations Specialist", "company": {"name": "EV.Careers", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$26.87-$29.86", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "As a Vehicle Operations Specialist \"VOS\", you will be a key contributor to the success of our Delivery & Field Operations organization. Are you looking for a job with some flexibility? Are you detail orientated, keep things clean, love to organize, love working in a values-based culture that encourages diversity? We are looking for diverse backgrounds such as experience in retail, warehousing, and service industries. The VOS works in coordination with several cross-functional teams to facilitate vehicle logistics activities, manage documentation, and provide our customers with an exceptional experience. We’re looking for someone who loves operational excellence, continuous improvement, teamwork, and has the desire to grow.", "responsibilities": "Receive, inspect and process incoming inventory, including completing paperwork. Ensure quality standards through washing vehicles, detailing, and correction activities. Maintain the delivery readiness of vehicles. Conduct quality control process for delivery ready vehicles and manage the communication of defects to service department. Responsible for organizing and maintaining secure key management for vehicle inventory. Maintain inventory lot and ensure that there are safe and usable drive lanes in the lot at all times. Shuttling vehicles to/from secondary locations including customer and fleet vehicles. Maintain adequate inventory of essential supplies. Prepare, inspect, and stage customer trade ins for remarketing to be transported to the auction via carrier. Conduct various weekly, monthly, quarterly audit process. Work cross-functionally with proper communication and collaboratively with other teams onsite and remote. Participates in workshops that improve quality and efficiency with guidance from leads/managers. Proficiency with computers and software including Microsoft Office, and internal business platforms. Complete additional work and tasks as requested by the leadership team.", "qualifications": {"required": "High School Diploma or GED required. Must have a valid driver’s license in the state/province of residence that you will be driving/operating a vehicle (or state that you are commuting daily to/from). No drug or alcohol related driving incidents in the last 3 years; No more than 1 serious moving violation in the last 3 years; No driving related suspensions or revocation of Driver License within a 3-5 year period. Will be subject to continuous Motor Vehicle Record (MVR) monitoring.", "preferred": "1+ years' of experience with operations, logistics, or lot management; previous EV or detailing experience valued. Ability to work a flexible schedule to support customers on nights, weekends and/or holidays. Working knowledge with computers and software including Microsoft Programs (Word, Excel, PowerPoint) with the ability to effectively navigate internal business platforms. Adaptable to a fast-paced and constantly changing environment. Ability to multitask and prioritize tasks based on level of importance and urgency. Ability to work autonomously and consistently with limited direction. Willingness to work in various working conditions including being in an active service center or unpredictable weather conditions. Physical exertion may be required to perform occupational tasks (sitting up to 2 or more hours at a time, standing for up to 8 or more hours a day, walking, bending, kneeling, laying, twisting, carrying, reaching, stretching, pushing, pulling, and lifting up to 50 lbs). Frequent use of hands for purposes of grasping and using tools correctly, entering data, writing communications, or calling customers or internal partners. Strong understanding of written and spoken English."}, "skills": ["Operations", "Logistics", "Inventory Management", "Customer Service", "Microsoft Office"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Rivian provides robust medical/Rx, dental and vision insurance packages for full-time employees, their spouse or domestic partner, and children up to age 26. Coverage is effective on the first day of employment, and Rivian covers most of the premiums.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3998436693"}