{"jobTitle": "Sales Account Executive - Western Region - Remote | WFH", "company": {"name": "Get It Recruit - Transportation", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Human Resources Services", "description": "Do you crave a challenge and the chance to revolutionize how businesses operate?<br/><br/>We're looking for a rockstar Account Executive to join our passionate team and champion a groundbreaking AI-powered enterprise solution. You'll be instrumental in helping companies achieve a truly digitalized future, streamlining planning across all facets of their operations.<br/><br/><strong>Here's a Taste Of What Awaits You<br/><br/></strong>Be a Hero: Help companies become market leaders by introducing them to a game-changing solution that unifies strategic, financial, and supply chain planning.<br/><br/>Shape the Future: Sell a cutting-edge platform that empowers businesses to adapt autonomously and capitalize on growth.<br/><br/>Become an Expert: Dive deep into a cutting-edge AI solution and leverage your knowledge to build trust with high-level executives.<br/><br/>Make an Impact: Drive revenue by identifying new opportunities and developing strategic relationships with key decision-makers.<br/><br/>Thrive in a Dynamic Environment: Enjoy the flexibility of a remote role while collaborating with a talented team.<br/><br/>Do you have the chops to take it on?<br/><br/>You're a proven closer with a track record of exceeding sales goals (think big numbers!).<br/><br/>You have a knack for building rapport with senior executives and getting them on board with innovative solutions.<br/><br/>You're a master communicator with the ability to craft compelling presentations and negotiate like a pro.<br/><br/>You're a self-motivated go-getter with the ability to work independently and think on your feet.<br/><br/>You possess a minimum of 5 years of experience selling complex software solutions within the enterprise space.<br/><br/><strong>Bonus Points If You Have<br/><br/></strong>Experience selling cloud-based solutions and within manufacturing-oriented industries.<br/><br/>A passion for supply chain optimization and the desire to make a real difference.<br/><br/><strong>The Rewards<br/><br/></strong>Competitive salary and commission structure<br/><br/>Stock options to share in the company's success<br/><br/>Comprehensive benefits package<br/><br/>Ready to join the revolution?<br/><br/>Let's chat! Submit your resume and tell us why you're the perfect fit.<br/><br/>Employment Type: Full-Time", "postedDate": "1 week ago", "remoteWork": "Yes", "skills": [], "url": "https://www.linkedin.com/jobs/view/3998574629"}