{"jobTitle": "Sales Associate", "company": {"name": "Thom Browne, Inc.", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "20.00-22.00", "currency": "USD"}, "jobFunction": "Sales, Business Development, and Art/Creative", "industry": "Retail Apparel and Fashion and Retail Luxury Goods and Jewelry", "description": "<u>ABOUT US</u>\nThom Browne is widely recognized for challenging and modernizing today’s uniform: the suit. By questioning traditional proportions, Browne’s designs consistently convey a true American sensibility rooted in quality craftsmanship and precise tailoring. We pride ourselves on our core values of respect and collaboration, challenging ourselves to express creativity and continuously innovate. We attract ambitious individuals who operate in unique ways while upholding exceptional craftsmanship and excellence.\n<br/>\n<u>THE ROLE</u>\n<ul><li>Achieve and exceed regular monthly, seasonal, quarterly and annual sales plans</li><li>Provide best-in-class customer service; building strong client relationships, regularly communicating and providing updates, building a viable, well-organized client network</li><li>Maintain exceptional product knowledge, brand awareness</li><li>Support daily shop presentation, ensuring merchandise is properly filled and Brand Presentation Guide standards are strictly upheld</li><li>Maintain keen awareness of product selections, core/seasonal styles, E-commerce offerings, full-priced merchandise, markdowns best sellers and inventory availability</li><li>Actively maintain Brand expertise in terms of product, brand history, events and projects, key trends, selling points and featured seasonal products</li><li>Identify selling opportunities, communicate customer feedback, process shipment/transfers in a timely manner</li><li>Manage back stock to make sure floor is filled in and stock room is in order; communicate regularly in regards to maintaining stock levels, noting any stock call-outs, selling opportunities based on customer feedback</li></ul>\n<br/>\n<u>THE IDEAL CANDIDATE</u>\n<ul><li>Minimum 1-2 years' experience in luxury retail or luxury customer service environment</li><li>Ability to source prospective clients from existing sphere of influence</li><li>Demonstrated proficiency in the areas of client relationship management, product knowledge, selling techniques and entrepreneurial</li><li>Passionate representative of the Thom Browne world</li><li>Highly organized, self-motivated with strong interpersonal skills</li><li>Confident, professional, comfortable working autonomously; strong communication both written and verbal</li></ul>\n<br/>\n<u>WHAT WE OFFER YOU</u>\n<ul><li>Competitive compensation. Hourly range is between $20.00-$22.00 per hour + commission. Please note that compensation will be offered based on relevant skills and experience</li><li>Comprehensive benefits package</li><li>Thom Browne Classic Uniform</li><li>401(k) company match</li><li>Diverse and inclusive working environment</li></ul>", "responsibilities": "<ul><li>Achieve and exceed regular monthly, seasonal, quarterly and annual sales plans</li><li>Provide best-in-class customer service; building strong client relationships, regularly communicating and providing updates, building a viable, well-organized client network</li><li>Maintain exceptional product knowledge, brand awareness</li><li>Support daily shop presentation, ensuring merchandise is properly filled and Brand Presentation Guide standards are strictly upheld</li><li>Maintain keen awareness of product selections, core/seasonal styles, E-commerce offerings, full-priced merchandise, markdowns best sellers and inventory availability</li><li>Actively maintain Brand expertise in terms of product, brand history, events and projects, key trends, selling points and featured seasonal products</li><li>Identify selling opportunities, communicate customer feedback, process shipment/transfers in a timely manner</li><li>Manage back stock to make sure floor is filled in and stock room is in order; communicate regularly in regards to maintaining stock levels, noting any stock call-outs, selling opportunities based on customer feedback</li></ul>", "qualifications": {"required": "Minimum 1-2 years' experience in luxury retail or luxury customer service environment, Ability to source prospective clients from existing sphere of influence, Demonstrated proficiency in the areas of client relationship management, product knowledge, selling techniques and entrepreneurial, Passionate representative of the Thom Browne world, Highly organized, self-motivated with strong interpersonal skills, Confident, professional, comfortable working autonomously; strong communication both written and verbal", "preferred": ""}, "skills": ["Customer Service", "Sales", "Retail"], "postedDate": "1 week ago", "benefits": "Competitive compensation. Hourly range is between $20.00-$22.00 per hour + commission. Please note that compensation will be offered based on relevant skills and experience, Comprehensive benefits package, Thom Browne Classic Uniform, 401(k) company match, Diverse and inclusive working environment", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998445429"}