{"jobTitle": "Laboratory Assistant", "company": {"name": "CommonSpirit Health", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Not Applicable", "salary": {"amount": "30.31 - 30.31", "currency": "USD"}, "jobFunction": "Science and Health Care Provider", "industry": "Wellness and Fitness Services, Hospitals and Health Care, and Medical Practices", "description": "*Overview*<br/><br/>Founded in 1926 Glendale Memorial Hospital and Health Center is a 334-bed acute care nonprofit community hospital located in Glendale California. The hospital offers a full complement of services including its award winning heart center the colorectal surgery institute a gastrointestinal program and is a Los Angeles County approved primary stroke center. The hospital shares a legacy of humankindness with Dignity Health one of the nation’s five largest health care systems. Visit https://www.dignityhealth.org/socal/locations/glendalememorial for more information.<br/><br/>*Responsibilities*<br/><br/>Under the direction of the Laboratory Medical Director Laboratory Manager and Laboratory Support Service Supervisor this position is assigned the responsibility of various duties which are technical and supportive in nature. These may include the basic duties such as blood specimen collection specimen processing answering telephones computer data input/retrieval and other duties as assigned. In addition to the above the laboratory assistant may be assigned to perform specimen preparatory handling in Microbiology processing of specimens for reference laboratories and inventory/ordering.<br/><br/>*Qualifications*<br/><br/><ul><li> One year full time experience in an acute care facility Laboratory preferred.</li><li> High school diploma or equivalency.</li><li> Knowledge of medical terminology.</li><li> Must be certified/licensed Phlebotomist in the State of California.<br/><br/></li></ul>Position represented by CHEU<br/><br/>*Pay Range*<br/><br/>$30.31 - $30.31 /hour", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3998485097"}