{"jobTitle": "Enterprise Resources Planning Business Analyst", "company": {"name": "Nissin Foods", "location": "Gardena, CA"}, "location": "Gardena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$98,000.00/yr - $104,000.00/yr", "currency": "USD"}, "jobFunction": "Information Technology and Analyst", "industry": "Food and Beverage Manufacturing", "description": "<strong>Job Summary</strong>\n<p><u>The Sr. ERP Business Analyst </u>optimizes operational performance by elevating understanding of ERP Systems and improving ERP procedures and governance. Design and optimize data infrastructure (Hardware/Software) to support more accurate, consistent, and timely operation of the company’s business application systems. <strong><u>Must be local to Los Angeles, CA area. </u></strong></p><p><br/></p><p><strong>Essential Duties and Responsibilities</strong></p><p>The described are considered essential to the job and representative of those that must be met by an employee to successfully perform the essential functions. Qualified individuals must have the ability with or without reasonable accommodation to perform the following functions. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. </p><ul><li>Act as key liaison between business stakeholders and IT leveraging Microsoft Business Central ERP.</li><li>Identify and validate the business needs and requirements by mapping out current-state, and identifying gaps (process, data capture, and /or technology). </li><li>Manage multiple development requests handed to an external consultant.</li><li>Perform/Manage User Acceptance Testing (UAT) and ensure Quality Assurance and Quality Control.</li><li>Recommend solutions to close gaps and implement operational efficiency “quick-wins.” </li><li>Designs optimal data architecture to support the business needs and requirements by initiating new projects, discovery, and mock-up for each stage of ERP process. </li><li>Ability to ask questions about existing processes and ascertain requirements from multiple cross functional stakeholders.</li><li>Ability to manage multiple tasks on a daily basis with shifting priority.</li></ul><p>All other duties as assigned</p><p><br/></p><p><strong>Qualifications and Requirements</strong></p><p><strong>Education/Experience</strong></p><p> </p><ul><li>Bachelor’s Degree in Information Technology, Business Management or equivalent and three (3) years or more of related business experience within retail, brokers or manufacturing industries or equivalent combination of training, education and experience. CPG industry experience is preferred.</li></ul><p><br/></p><p><br/></p><p><strong>Skills/Knowledge/Abilities</strong></p><ul><li>Technical knowledge of Dynamics Navision/Business Central, including backend data structure and development processes</li><li>Knowledge of Manufacturing, Supply Chain, Sales and Finance/Accounting operations, process, procedures and how they work together</li><li>Knowledge of EDI documents: types, mapping &amp; integration</li><li>Ability to research, compile, analyze and interpret data</li><li>Good written, verbal communication and collaborative skills</li><li>Detail oriented</li><li>Proficiency in MS Office products</li></ul><p> </p><p>About Us:</p><p>It started with the inspiration of the creator of instant noodles, founder Momofuku Ando, in 1958. Since we entered the U.S. in 1970, our flagship brands, Cup Noodles, and Top Ramen have maintained a firm foothold in U.S. pop culture. We invite you to join Team Nissin to support this legacy of innovation and to deliver noodle happiness to consumers, employees, partners, and the community in a meaningful and sustainable way. Let’s evolve how people think about instant ramen as you discover opportunities for professional growth while being part of this $4 billion global company built from a simple block of noodles.</p><p><br/></p><p><em>Nissin Foods (USA) Co., Inc. is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, or sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.</em></p><p><br/></p><p><em>As a federal contractor, Nissin Foods participates in the federal government’s E-Verify program, which confirms employment authorization of all newly hired employees through an electronic database maintained by the Social Security Administration and Department of Homeland Security. The E-Verify process may be completed in conjunction with the Form I-9 Employment Eligibility Verification to check the work authorization status of persons who have been offered employment at Nissin Foods. E-Verify is not used as a tool to pre-screen candidates. For up-to-date information on E-Verify, go to www.uscis.gov. </em></p><p><br/></p><p><em>If you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our career center as a result of your disability. To request accommodation, contact Nissin Foods (USA) Co., Inc. Human Resources.</em></p>", "responsibilities": "The described are considered essential to the job and representative of those that must be met by an employee to successfully perform the essential functions. Qualified individuals must have the ability with or without reasonable accommodation to perform the following functions. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. \n<ul><li>Act as key liaison between business stakeholders and IT leveraging Microsoft Business Central ERP.</li><li>Identify and validate the business needs and requirements by mapping out current-state, and identifying gaps (process, data capture, and /or technology). </li><li>Manage multiple development requests handed to an external consultant.</li><li>Perform/Manage User Acceptance Testing (UAT) and ensure Quality Assurance and Quality Control.</li><li>Recommend solutions to close gaps and implement operational efficiency “quick-wins.” </li><li>Designs optimal data architecture to support the business needs and requirements by initiating new projects, discovery, and mock-up for each stage of ERP process. </li><li>Ability to ask questions about existing processes and ascertain requirements from multiple cross functional stakeholders.</li><li>Ability to manage multiple tasks on a daily basis with shifting priority.</li></ul>\nAll other duties as assigned", "qualifications": {"required": "Bachelor’s Degree in Information Technology, Business Management or equivalent and three (3) years or more of related business experience within retail, brokers or manufacturing industries or equivalent combination of training, education and experience. CPG industry experience is preferred.", "preferred": "Technical knowledge of Dynamics Navision/Business Central, including backend data structure and development processes\nKnowledge of Manufacturing, Supply Chain, Sales and Finance/Accounting operations, process, procedures and how they work together\nKnowledge of EDI documents: types, mapping & integration\nAbility to research, compile, analyze and interpret data\nGood written, verbal communication and collaborative skills\nDetail oriented\nProficiency in MS Office products"}, "skills": ["Microsoft Business Central", "ERP", "Dynamics Navision", "Data Analysis", "Data Architecture", "Process Improvement", "Stakeholder Management", "Project Management", "Quality Assurance", "Quality Control", "Communication", "Collaboration", "MS Office"], "postedDate": "1 week ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998442492"}