{"jobTitle": "Sales Operations Manager", "company": {"name": "Plastic Executive Recruiters", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00 - $120,000.00", "currency": "USD"}, "jobFunction": "Sales", "industry": "Plastics Manufacturing", "description": "We are committed to driving growth and excellence across all facets of our organization. We are currently seeking a dynamic and experienced Sales Operations Manager to join our team. This pivotal role will focus on maximizing the effectiveness of our sales team through comprehensive orientation, training programs, support operations, and analysis.\n\nKey Responsibilities:\n\n* Lead the sales onboarding process, ensuring new account managers and support staff are equipped with the necessary resources to succeed.\n* Implement engaging and effective training methods for new team members on our products, processes, and systems.\n* Continuously evaluate the effectiveness of training programs, identifying trends and areas for improvement, and maintaining up-to-date learning resources on platforms like SharePoint.\n* Collaborate closely with sales managers and account managers to monitor sales team progress and address any issues.\n* Oversee pricing accuracy in the AS400 system across various markets.\n* Manage sales workflows related to order processing, contracts administration, and customer rebate programs.\n* Direct a team of analysts to research and analyze data for identifying sales growth opportunities.\n* Handle customer complaints requiring escalated resolution.\n* Act as a liaison between the sales operations team and other departments such as Accounting, Credit, Quality, Production, and Logistics.\n* Engage in professional development and educational opportunities relevant to the role.\n* Provide timely and constructive performance evaluations for direct reports.\n* Undertake other duties as assigned.\n\nQualifications:\n\n* Bachelor's degree in business, marketing, or a related field.\n* 5 to 7 years of experience in sales operations, with a track record of success in management or leadership roles.\n* Comprehensive knowledge of sales technologies.\n* Exceptional ability to design and implement effective training and development programs.\n* Strong analytical skills, with the ability to interpret data to drive strategic decisions.\n* Excellent communication and collaboration abilities, with a talent for working cross-functionally to achieve business objectives.\n* Ability to adapt to changing priorities and manage multiple tasks simultaneously.\n\nJob Type: Full-time\nPay: $80,000.00 - $120,000.00 per year", "responsibilities": "Lead the sales onboarding process, ensuring new account managers and support staff are equipped with the necessary resources to succeed. Implement engaging and effective training methods for new team members on our products, processes, and systems. Continuously evaluate the effectiveness of training programs, identifying trends and areas for improvement, and maintaining up-to-date learning resources on platforms like SharePoint. Collaborate closely with sales managers and account managers to monitor sales team progress and address any issues. Oversee pricing accuracy in the AS400 system across various markets. Manage sales workflows related to order processing, contracts administration, and customer rebate programs. Direct a team of analysts to research and analyze data for identifying sales growth opportunities. Handle customer complaints requiring escalated resolution. Act as a liaison between the sales operations team and other departments such as Accounting, Credit, Quality, Production, and Logistics. Engage in professional development and educational opportunities relevant to the role. Provide timely and constructive performance evaluations for direct reports. Undertake other duties as assigned.", "qualifications": {"required": "Bachelor's degree in business, marketing, or a related field. 5 to 7 years of experience in sales operations, with a track record of success in management or leadership roles. Comprehensive knowledge of sales technologies. Exceptional ability to design and implement effective training and development programs. Strong analytical skills, with the ability to interpret data to drive strategic decisions. Excellent communication and collaboration abilities, with a talent for working cross-functionally to achieve business objectives. Ability to adapt to changing priorities and manage multiple tasks simultaneously."}, "skills": ["Sales Operations", "Training", "Sales Management", "Data Analysis", "Communication", "Collaboration"], "postedDate": "1 week ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999090595"}