{"jobTitle": "Sales Analyst", "company": {"name": "Reyes Beverage Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Food & Beverages", "description": "<strong>Responsibilities<br/><br/></strong><strong>This is a fully onsite position that will cover all of Allied Beverages including Sylmar, Ventura &amp; Santa Maria so ability to travel is required. <br/><br/></strong><strong>Position Summary<br/><br/></strong>The Sales Business Analyst will perform analysis and reporting for the Sales, Operations, and Finance departments. The Business Analyst will be responsible for executing competitor analysis, financial analysis, pricing analysis, profitability analysis, and simulation models pertaining to incentives, go-to-market strategies, and sales efficiency under general or limited direction.<br/><br/><strong>Position Responsibilities May Include, But Not Limited To<br/><br/></strong><ul><li> Collaborate with sales team to assist with sales incentive analysis and associated best practices including Monthly Business Objectives and Incentive Tracking</li><li> Conducts historical sales and retailer reporting and analysis</li><li> Develops, publishes, and maintains monthly and quarterly sales reports and Key Performance Indicators for Reyes Beverage Group business units</li><li> Performs Ad-hoc reporting and analysis for various Sales and Marketing departments</li><li> Collaborates with sales team to assist with sales incentive analysis and associated best practices</li><li> Conducts presentations of analyses and recommendations to leadership as needed</li><li> Identifies sales / operations trends based on data and formulates recommendations to address trends</li><li> Implements recommendations based on analysis to include changes in sales / operations techniques and/or procedures</li><li> Identifies needs for analysis, conducts analysis, and presents findings and recommendations to senior management</li><li> Work with financial representatives from business units to implement recommendations generated from analysis</li><li> Other projects or duties as assigned<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Required Skills and Experience:<br/><br/></strong><ul><li> Bachelor’s degree, preferably in Business, Finance or Accounting</li><li> 3+ years of general administrative experience in Sales, Operations or Finance</li><li> Strong analytical skills and ability to focus on details</li><li> Ability to work independently and in a team environment</li><li> Ability to interact with personnel at all levels of the company</li><li> Must possess strong interpersonal and exceptional problem-solving skills</li><li> Must be able to handle multiple tasks/projects at one time</li><li> Must be able to meet deadlines</li><li> Excellent verbal and written communication skills</li><li> Proficient in Microsoft Office, expert level in Excel</li><li> Ability to apply logical and critical thinking skills to various situations at the same time</li><li> This position must pass a post-offer background and drug test.<br/><br/></li></ul><strong>Preferred Skills And Experience<br/><br/></strong><ul><li> Experience with IBM Cognos and/or SQL</li><li> Syndicated Data Experience<br/><br/></li></ul><strong>Physical Demands And Work Environment<br/><br/></strong>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Due to the nature of our business in regard to such things as delivery schedules, order inputs, selection, and Department of Transportation Hours of Service, overtime, attendance and punctuality are essential job functions. Should an individual in this classification not be able to adhere to this requirement due to a disability, they should contact their Human Resources department to see what, if any, reasonable accommodation may be made.<br/><br/>", "responsibilities": "The Sales Business Analyst will perform analysis and reporting for the Sales, Operations, and Finance departments. The Business Analyst will be responsible for executing competitor analysis, financial analysis, pricing analysis, profitability analysis, and simulation models pertaining to incentives, go-to-market strategies, and sales efficiency under general or limited direction.", "qualifications": {"required": "Bachelor’s degree, preferably in Business, Finance or Accounting, 3+ years of general administrative experience in Sales, Operations or Finance, Strong analytical skills and ability to focus on details, Ability to work independently and in a team environment, Ability to interact with personnel at all levels of the company, Must possess strong interpersonal and exceptional problem-solving skills, Must be able to handle multiple tasks/projects at one time, Must be able to meet deadlines, Excellent verbal and written communication skills, Proficient in Microsoft Office, expert level in Excel, Ability to apply logical and critical thinking skills to various situations at the same time, This position must pass a post-offer background and drug test.", "preferred": "Experience with IBM Cognos and/or SQL, Syndicated Data Experience"}, "skills": ["Sales", "Operations", "Finance", "Analytical Skills", "Problem Solving", "Microsoft Office", "Excel", "IBM Cognos", "SQL", "Syndicated Data"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999774216"}