{"jobTitle": "HR Partner, Amazon International Stores", "company": {"name": "Amazon", "location": "New York, United States"}, "location": "New York, United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Human Resources and Information Technology", "industry": "Software Development", "description": "At Amazon, our HR Partners (HRPs) are known for their knowledge of HR programs, processes and tools. They act as the frontline consultant to people managers in creating a positive employee experience, offering consistent HR advice on people matters. They operate and are seen as subject matter experts, having sound knowledge in company and local programs, processes and policies, offering a strong and compelling point of view around HR related matters, thus building credibility. They are committed to collaboration with multiple HR Business Partners, HR specialists and people managers across various businesses. A key area of focus for the HR Partner is to increase manager capability, enabling them to be more self-sufficient, and driving manager education on important people programs, policies, tools and processes. While doing this, the HRPs are continuously raising the bar on harmonizing practice across businesses and sharing best practices.<br/><br/>Key job responsibilities<br/><br/>Managers collaborate using different communication channels with the HR Partners to support sensitive and often complex employee issues including disciplinary and performance processes. These channels can include 1:1s, multiple stakeholder meetings, as well as scalable learning formats (circles, lunch and learn sessions etc.) to educate Managers on relevant people matters. The HRP will act as an influential partner in helping managers with talent management processes, people development, and employee relations concerns. Thanks to their visibility across businesses and their access to data on managers’ and employees’ requests, HRPs are in a position to spot trends and identify emerging needs and address them with innovative people programs, tools and processes.<br/><br/><ul><li> Employee Relations &amp; Support:</li><li> Channel transactional inquiries to HRS Tier1/Tier2. Respond to non-routine inquiries from employees and managers.</li><li> Process ownership for Employee Relations management, including disciplinary &amp; performance improvement &amp; exit management.</li><li> Consult managers on people matters that require in-depth knowledge of policies, procedures and local legislation.</li><li> Coordinate with the legal department and the ER POC on ER matters, and conduct investigations.</li><li> Performance management:</li><li> Work with people managers end to end on performance management cases. This includes consulting on performance concerns, supporting managers when starting the process and finalizing separation agreements.</li><li> Analyze data and observations across the organization, highlighting trends and recommending/driving solutions, as appropriate</li><li> Talent Management and People Development Consulting:</li><li> Consult Managers on Compensation matters compensation planning, and during off cycle and exception compensation requests, thanks to their deep knowledge of Amazon’s compensation philosophy.</li><li> Coach, train and guide managers during Talent Management processes, particularly in developing toolkit and communications that help managers to be self-sufficient with Talent Reviews.</li><li> Support managers and employees in identifying training opportunities to further develop functional and managerial skills.</li><li> Guide people managers with career conversations, Development Plans/Career Growth Plans and other development initiatives.</li><li> HR General:</li><li> Act as stewards of the employee experience and Amazon “culture keepers”. Act as POC and Program Manager for people tools, processes, programs or projects. Manage implementation and review of those.</li><li> Design and deliver Manager Education Programs (Circles, ‘lunch and learn’, trainings, new leader assimilation etc.) to further drive collective education and manager effectiveness.</li><li> Complete cross functional projects and develop programs that improve the employee experience and increase manager capability.<br/><br/></li></ul>A day in the life<br/><br/>Per the internal transfers guidelines, please reach out to the hiring manager for an informational through the \"Informational Request\" button on the job page.<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> Bachelor’s in Human Resources or related field</li><li> 3-5 years of relevant Human Resources experience<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Master's degree in HR or related field</li><li> Business and HR acumen, including strong problem solving skills, high judgment, critical thinking and analysis.</li><li> Experience driving recommendations and prioritization.</li><li> Experience working in a highly matrixed organization.</li><li> Project management and execution skills.</li><li> Coaching and consulting skills.</li><li> Thrives in a high-pressure environment and able to manage multiple simultaneous priorities.</li><li> Possesses intellectual curiosity; brings insight into the team &amp; business.<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $60,900/year in our lowest geographic market up to $130,200/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2729872", "postedDate": "1 week ago", "salary": {"amount": "60,900.00/year - 130,200.00/year", "currency": "USD"}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3999966254"}