{"jobTitle": "Human Resources Business Partner", "company": {"name": "Tandem/Neal Associates", "location": "East Rancho Dominguez, CA"}, "location": "East Rancho Dominguez, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "90,000.00/yr - $110,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources, Manufacturing, and Training", "industry": "Manufacturing, Chemical Manufacturing, and Paint, Coating, and Adhesive Manufacturing", "description": "Location- Rancho Dominguez\nSalary - 90-110k (based on experience) + 10% bonus\nThis is NOT a Hybrid role\n<br/>\nThe ideal candidate will have experience in all areas related to the human resources field. They should be comfortable onboarding new candidates and collecting necessary background information as well as assisting employees while at work. This candidate should work closely with management in order to provide training for employees and establish ways to increase employee engagement. \n\n<strong>Responsibilities</strong>\n<ul><li>Research and analyze employee trends to understand ways to increase employee engagement and retention</li><li>Maintain in-depth knowledge of legal standards and reduce risks related to daily management of employees</li><li>Assist management in conflict resolution</li><li>Set standards for ethics, values and culture of company</li><li>Onboard new employees and manage immigration documents, taxes and benefits packages</li><li>Travel between 6 small plants - all within driving distance </li></ul><br/>\n<strong>Qualifications</strong>\n<br/>\n<ul><li>Bachelor's degree</li><li>5-10 years of experience in HR or related field</li><li>Strong organization, communication and conflict resolution skills</li><li>Demonstrated ability to onboard new employees and manage HR tasks</li><li>Proficient in Microsoft Office suite</li><li>Prior background with CA employment laws</li></ul>", "responsibilities": "Research and analyze employee trends to understand ways to increase employee engagement and retention, Maintain in-depth knowledge of legal standards and reduce risks related to daily management of employees, Assist management in conflict resolution, Set standards for ethics, values and culture of company, Onboard new employees and manage immigration documents, taxes and benefits packages, Travel between 6 small plants - all within driving distance", "qualifications": {"required": "Bachelor's degree, 5-10 years of experience in HR or related field, Strong organization, communication and conflict resolution skills, Demonstrated ability to onboard new employees and manage HR tasks, Proficient in Microsoft Office suite, Prior background with CA employment laws"}, "skills": ["HR", "Employee Engagement", "Conflict Resolution", "Onboarding", "Microsoft Office"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999934258"}