{"jobTitle": "General Manager Logistics", "company": {"name": "Accurate Personnel LLC", "location": "Redlands, CA"}, "location": "Redlands, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management", "industry": "Food and Beverage Services", "description": "<strong>Logistics General Manager</strong><br/><br/>Join our dynamic team as a Logistics General Manager, where you'll lead a top-tier logistics operation, drive innovation, and shape the future of our distribution centers. If you're a strategic thinker with a passion for excellence and a knack for building high-performing teams, this is the opportunity for you to make a significant impact in a fast-paced, growing industry.<br/><br/><strong>Job Purpose:</strong><br/>Responsible for managing all logistics operations for the respective distribution centers (DCs), including the implementation and control of procedures and processes.<br/><br/>Essential Duties and Responsibilities:<ul><li>Develop and implement processes and procedures to improve service strategy and cost control for entire operations.</li><li>Coordinate with other operational resources to develop the strategic and tactical direction for all locations, establish management processes and metrics for performance, and be accountable for the financial performance of the logistics business.</li><li>Build a high-performing team, develop service offerings, and lead and motivate staff.</li><li>Conduct strong negotiations with carriers, customers, and maintain margin integrity.</li><li>Provide support, leadership, and direction to assigned locations to ensure delivery of annual business plans.</li><li>Develop and execute business plan strategies for operations.</li><li>Develop and manage KPIs for logistics.</li><li>Perform special projects and other duties as assigned by the Senior Group General Manager and other senior management.</li><li>Ensure compliance with company policies, Standard Operating Procedures, and OSHA safety rules.</li><li>Perform additional duties as assigned.</li></ul><br/><br/>Required Skills/Abilities:<ul><li>Strong leadership abilities in the logistics field.</li><li>Ability to build trust and confidence with management and supervision.</li><li>Strategic thinking and leadership skills.</li><li>Excellent written and verbal communication skills.</li><li>Ability to work effectively in a fast-paced, changing environment; multi-tasking is essential.</li><li>Strong organizational skills and ability to work as a cross-functional team member.</li><li>Analytical skills with the ability to multi-task.</li><li>Proficiency with Microsoft Office applications, including Planner, PowerPoint, Word, Excel, Outlook, and Visio.</li><li>Sense of urgency in delivering consistent service to customers.</li><li>Entrepreneurial mindset and team player.</li><li>Willingness to travel.</li><li>Ability to communicate with employees at all levels.</li><li>Proficiency with TMW system and high-level computer skills.</li></ul><br/><br/>Education and Experience:<ul><li>5+ years of progressive responsibility in managing logistics.</li><li>Experience in management and development.</li><li>Transportation experience required.</li><li>BA Preferred or equivalent years of experience.</li><li>Familiarity with Truckmate Transportation Brokerage system, PC Miler, Qualcomm GPS, Road Net TMS, Load Boards, and Freight Calculator.</li></ul><br/><br/>Physical Requirements:<ul><li>Ability to lift up to 50 pounds.</li><li>Ability to work standing or sitting for extended periods.</li><li>Ability to traverse and access all areas of a warehouse environment.</li><li>Ability to work in a distribution center environment with varying temperatures.</li></ul><br/><br/><strong><em>ABOUT ACCURATE PERSONNEL </em></strong><br/><em>Do you need your next job fast? Accurate Personnel is here to help! As an industry-leading full-service staffing agency, we have all the tools you need to start earning that next paycheck soon. Send us your application and our team will instantly get to work on finding you the right placement to fit your needs. Accurate Personnel has been a provider of temporary job services and direct hire search for 45 years. Our expertise has allowed us to grow from a regional Chicagoland office into a nationwide search firm that services over 500 clients while never losing sight of personalized service. Let Accurate work for you. Apply with us today! </em><br/>—--<br/><em>Accurate Personnel provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.</em>", "responsibilities": "Develop and implement processes and procedures to improve service strategy and cost control for entire operations. Coordinate with other operational resources to develop the strategic and tactical direction for all locations, establish management processes and metrics for performance, and be accountable for the financial performance of the logistics business. Build a high-performing team, develop service offerings, and lead and motivate staff. Conduct strong negotiations with carriers, customers, and maintain margin integrity. Provide support, leadership, and direction to assigned locations to ensure delivery of annual business plans. Develop and execute business plan strategies for operations. Develop and manage KPIs for logistics. Perform special projects and other duties as assigned by the Senior Group General Manager and other senior management. Ensure compliance with company policies, Standard Operating Procedures, and OSHA safety rules. Perform additional duties as assigned.", "qualifications": {"required": "Strong leadership abilities in the logistics field. Ability to build trust and confidence with management and supervision. Strategic thinking and leadership skills. Excellent written and verbal communication skills. Ability to work effectively in a fast-paced, changing environment; multi-tasking is essential. Strong organizational skills and ability to work as a cross-functional team member. Analytical skills with the ability to multi-task. Proficiency with Microsoft Office applications, including Planner, PowerPoint, Word, Excel, Outlook, and Visio. Sense of urgency in delivering consistent service to customers. Entrepreneurial mindset and team player. Willingness to travel. Ability to communicate with employees at all levels. Proficiency with TMW system and high-level computer skills.", "preferred": "5+ years of progressive responsibility in managing logistics. Experience in management and development. Transportation experience required. BA Preferred or equivalent years of experience. Familiarity with Truckmate Transportation Brokerage system, PC Miler, Qualcomm GPS, Road Net TMS, Load Boards, and Freight Calculator."}, "skills": ["Logistics", "Leadership", "Strategic Thinking", "Communication", "Teamwork", "Microsoft Office", "TMW System", "Transportation", "Management", "Negotiation", "Problem Solving", "Analytical Skills", "Customer Service", "Time Management", "Organization", "Multitasking", "Entrepreneurial"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999770079"}