{"jobTitle": "Engineering Manager", "company": {"name": "Adecco", "industry": "Defense and Space Manufacturing", "size": "Not specified", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$170,000.00 - $220,000.00", "currency": "USD"}, "jobFunction": "Engineering and Management", "industry": "Defense and Space Manufacturing", "description": "The manager will lead a cross-functional engineering team of systems, electrical, mechanical, and software engineers to develop industry leading automated measurement systems. The manager will work closely with business units to understand market needs and the operations team to produce and deliver solutions to our customers. The manager will ensure efficient engineering execution across many projects to meet project financial, technical, and schedule goals.", "responsibilities": "Collaborate with engineering functional management for resource assignments to fulfill engineering requirements for project execution; Manage a multi-disciplined team of engineers to design, test and deliver electro-mechanical test systems; Implement and maintain engineering design processes to minimize program risks; Ensure effective communication between organizational groups; Provide technical guidance for component and system level designs; Coordinate with operations and manufacturing group for product build and test; Contribute to technical design efforts and reviews; Track and report technical milestone and budget metrics; Review and approve test plans, test procedures and factory test results.", "qualifications": {"required": "Bachelors Degree in Electrical Engineering (BSEE) -req'd; 10+ years of relevant working experience within the Defense and Space Industry; Leadership or management experience; Firm knowledge of electro-mechanical components and systems; Solid engineering process and methods experience; Applied engineering design experience; Experience with assembly and system level design; Experience in a factory or manufacturing environment; Excellent written and oral communication skills.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Medical insurance; Vision insurance; Dental insurance; 401(k); Pension plan; Paid maternity leave; Paid paternity leave; Disability insurance", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3999633631"}