{"jobTitle": "Executive Assistant - Mars Veterinary Health", "company": {"name": "Banfield Pet Hospital", "industry": "Veterinary Services", "location": "Fountain Valley, CA"}, "location": "Fountain Valley, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Veterinary Services", "description": "This is a remote position supporting Executives based in PST and EST*As part of the Mars Petcare family of businesses, Mars Veterinary Health is a global network of veterinary practices made possible by 75,000 Associates who care for millions of pets across nearly 3,000 clinics in more than 20 countries each year. We are committed to leveraging our reach to make a long-term positive impact on people, pets, and the planet and know our Purpose – A BETTER WORLD FOR PETS – starts with the people who care for them. We strive to offer unparalleled veterinary care for pets by first and foremost enabling and empowering our Associates to do what they love, whether in primary, specialty, and emergency care or management and leadership.Role PurposeAs an Executive Assistant at MVH, you will provide high-level administrative support to the Senior Leadership Team for MVH, North America. This role requires a highly organized, detail-oriented individual who excels in a fast-paced environment. The Executive Assistant will be responsible for managing schedules, coordinating meetings, handling correspondence, and ensuring the smooth operation of executive activitiesEssential Responsibilities And TasksLive and exemplify the Five Principles of Mars, Inc. within self and team.Manage and maintain the calendars of the Senior Leadership Team, including scheduling meetings, appointments, and travel arrangements.Prepare and organize documents for meetings, presentations, and reports.Handle confidential and sensitive information with the utmost discretion.Coordinate and facilitate communication between the Senior Leadership Team and internal/external stakeholders.Assist in the preparation and submission of expense reports, budgets, and other financial documents.Organize and manage logistics for executive meetings, including agenda preparation and minute taking.Provide administrative support for special projects and initiatives as required.Ensure the efficient operation of the executive office by maintaining supplies and handling office-related tasks.Other job duties as assigned.Special Working ConditionsAbility to work at a computer for long periods of time. Project timelines and work volume/deadlines may often require more than 40 hours per week to complete essential duties of this job.Must have mental processes for reasoning, remembering, mathematics and language ability (reading, writing, and speaking the English language) to perform the duties proficiently.Ability to carry out instructions furnished in written, oral, or diagram form and to solve problems involving several variables.Ability to stand, walk, stoop, kneel, crouch, and climb as well as manipulate (lift, carry, move) up to 50 pounds.Requires good hand-eye coordination, arm-hand-finger dexterity with the ability to grasp, and visual acuity to use a keyboard and operate necessary equipment.The noise level in the work environment is normally moderate.Environment where pets are present.Experience, Education And/or TrainingBachelor’s degree in business administration, Communications, or a related field preferred.Proven experience as an Executive Assistant or in a similar role supporting senior executives.Exceptional organizational and time management skills.Strong attention to detail and accuracy.Excellent communication skills, both written and verbal.Ability to work collaboratively with executives and their team members.Proficiency in using office software, including Microsoft Office Suite (Word, Excel, PowerPoint, Outlook).Familiarity with executive support processes and best practices.Understanding of corporate governance and organizational structure.Experience in managing complex calendars and scheduling.Proficient in preparing and editing documents, presentations, and reports.Strong understanding of office management and administrative procedures.Health care background (veterinary or human healthcare, pharmaceutical, etc.) is preferred.Hourly pay: $28.69 - 43.04What We Offer – The Good StuffCompetitive salary with paid time off & holidays so you can spend time with the people you love.Medical, dental, and vision insurance for you and your loved ones.Fertility and family-building assistance.Paid Parental leave.Practice Paid Basic Life Insurance.Practice Paid Short- and Long-Term Disability.Competitive referral program – join our team, bring your friends, and get paid.Automatic enrollment 401(k) Savings Plan after 60 days of employment with generous company match.Commuter Benefits.Legal Plan.Health Savings Account & Flexible Spending Account.Mental health support and resources.Paid Volunteering.Optimum Wellness Plans® for up to three pets.Continuing Education allowance & MED hours for eligible positions.Student Debt Relief (for full-time DVMs).A Variety of discounts including Mars, PetSmart, Royal Canin, fitness, cellular and so much more.WE ARE A DRUG-FREE, SMOKE-FREE, EQUAL OPPORTUNITY EMPLOYER.Mars Veterinary Health (MVH)® strongly supports and values the uniqueness of all individuals and promotes a work environment where diversity is embraced. MVH is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, genetic information, status as a protected veteran, or status as a qualified individual with disability. MVH complies with all applicable federal, state and local laws governing nondiscrimination in employment in every MVH location.", "responsibilities": "Live and exemplify the Five Principles of Mars, Inc. within self and team.Manage and maintain the calendars of the Senior Leadership Team, including scheduling meetings, appointments, and travel arrangements.Prepare and organize documents for meetings, presentations, and reports.Handle confidential and sensitive information with the utmost discretion.Coordinate and facilitate communication between the Senior Leadership Team and internal/external stakeholders.Assist in the preparation and submission of expense reports, budgets, and other financial documents.Organize and manage logistics for executive meetings, including agenda preparation and minute taking.Provide administrative support for special projects and initiatives as required.Ensure the efficient operation of the executive office by maintaining supplies and handling office-related tasks.Other job duties as assigned.", "qualifications": {"required": "Proven experience as an Executive Assistant or in a similar role supporting senior executives.Exceptional organizational and time management skills.Strong attention to detail and accuracy.Excellent communication skills, both written and verbal.Ability to work collaboratively with executives and their team members.Proficiency in using office software, including Microsoft Office Suite (Word, Excel, PowerPoint, Outlook).Familiarity with executive support processes and best practices.Understanding of corporate governance and organizational structure.Experience in managing complex calendars and scheduling.Proficient in preparing and editing documents, presentations, and reports.Strong understanding of office management and administrative procedures.", "preferred": "Bachelor’s degree in business administration, Communications, or a related field preferred.Health care background (veterinary or human healthcare, pharmaceutical, etc.) is preferred."}, "skills": ["Microsoft Office Suite", "Executive Support", "Calendar Management", "Communication", "Organization", "Time Management", "Detail Oriented", "Collaboration", "Office Management", "Administrative Procedures", "Corporate Governance", "Scheduling", "Document Preparation", "Report Writing", "Health Care"], "postedDate": "1 week ago", "benefits": "Competitive salary with paid time off & holidays so you can spend time with the people you love.Medical, dental, and vision insurance for you and your loved ones.Fertility and family-building assistance.Paid Parental leave.Practice Paid Basic Life Insurance.Practice Paid Short- and Long-Term Disability.Competitive referral program – join our team, bring your friends, and get paid.Automatic enrollment 401(k) Savings Plan after 60 days of employment with generous company match.Commuter Benefits.Legal Plan.Health Savings Account & Flexible Spending Account.Mental health support and resources.Paid Volunteering.Optimum Wellness Plans® for up to three pets.Continuing Education allowance & MED hours for eligible positions.Student Debt Relief (for full-time DVMs).A Variety of discounts including Mars, PetSmart, Royal Canin, fitness, cellular and so much more.", "remoteWork": "Yes", "salary": {"amount": "28.69 - 43.04", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3999373982"}