{"jobTitle": "Paralegal", "company": {"name": "Robert Half", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Legal", "industry": "Staffing and Recruiting", "description": "One Los Angeles's of Top plaintiff litigation class action firms has partnered with Robert Half Legal in their search a fully remote contract Discovery Response Paralegal.<br/><br/>This is an opportunity to work with one of the best plaintiff firms in Los Angeles. You can be instrumental in getting victims the settlements they deserve!<br/><br/><strong>Paralegal Duties<br/><br/></strong><ul><li>Respond to 2 to 3 sets of discovery daily (highly templated)</li><li>Must have discovery experience</li><li>Preference for those with plaintiff experience</li><li>2+ years experience answering high volume of discovery</li><li>Must have CA experience<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Duration: 2-3 months can go longer</li><li>40 hours weekly</li><li>Device will be provided<br/><br/><br/></li></ul>If you are confident in your discovery experience, I cannot wait to hear from you!<br/><br/>For immediate consideration please submit all resumes to <strong>Ariel.Dufault[at]roberthalf[dotcom]<br/><br/></strong>Robert Half is the world’s first and largest specialized talent solutions firm that connects highly qualified job seekers to opportunities at great companies. We offer contract, temporary and permanent placement solutions for finance and accounting, technology, marketing and creative, legal, and administrative and customer support roles.<br/><br/>Robert Half works to put you in the best position to succeed. We provide access to top jobs, competitive compensation and benefits, and free online training. Stay on top of every opportunity - whenever you choose - even on the go.<br/><br/>All applicants applying for U.S. job openings must be legally authorized to work in the United States. Benefits are available to contract/temporary professionals, including medical, vision, dental, and life and disability insurance. Hired contract/temporary professionals are also eligible to enroll in our company 401(k) plan. Visit<br/><br/>© 2024 Robert Half. Robert Half is not a law firm and does not provide legal representation. Robert Half project lawyers do not constitute a law firm among themselves. An Equal Opportunity Employer. M/F/Disability/Veterans. By clicking “Apply Now,” you’re agreeing to", "responsibilities": "Paralegal Duties<br/><br/>", "qualifications": {"required": "Must have discovery experience", "preferred": "Preference for those with plaintiff experience"}, "skills": ["Discovery", "Plaintiff", "CA Experience"], "postedDate": "1 week ago", "salary": {"amount": "30.00/hr - 40.00/hr", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3999098252"}