{"jobTitle": "Labor Relations Consultant - Remote in California", "company": {"name": "UnitedHealth Group", "location": "Los Angeles, CA", "industry": "Hospitals and Health Care"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Hospitals and Health Care", "description": "UnitedHealth Group is a health care and well-being company that’s dedicated to improving the health outcomes of millions around the world. We are comprised of two distinct and complementary businesses, UnitedHealthcare and Optum, working to build a better health system for all. Here, your contributions matter as they will help transform health care for years to come. Make an impact with a diverse team that shares your passion for helping others. Join us to start Caring. Connecting. Growing together. <br/><br/>The Labor Relations Consultant will be a strategic business partner tasked with identifying complex issues regarding employee sentiment. This job assists in implementing overall enterprise labor strategy, working directly with the Sr. Director, Labor Relations in addressing and resolving labor and employee relations matters. The Employee Relations Consultant - Labor Relations will also function as an escalation point to provide counsel regarding employee issues.<br/><br/>If you are located in the state of California, you will have the flexibility to work remotely* as you take on some tough challenges.<br/><br/>Primary Responsibilities<br/><br/><ul><li>Work in partnership with the VP of Labor Relations, Employee Relations Associate Directors, Employee Relations Case Managers, Employee Relations Leadership, Total Absence Management (TAM), and the People Team to create and maintain a positive employee relations culture</li><li>Provides labor relations advice and counsel through participation in defined processes with People Team, Operations Management, and other departments as needed</li><li>Assist the VP, Labor Relations in identifying process improvements for the labor relations functions, contributing to innovative solutions, and make recommendations regarding policies and procedures</li><li>Identify and tailor best practices to ensure effective implementation of agreed-upon strategies while also managing any issues that arise during implementation</li><li>Facilitate management training both remote and on-location throughout the United States</li><li>Leverage existing data and analytics resources to proactively identify, assess, and guide priorities and interventions to strengthen the employee relations environment and foster an optimal employee experience</li><li>Travel up to 50%<br/><br/></li></ul>You’ll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in.<br/><br/>Required Qualifications<br/><br/><ul><li>4+ years of Labor Relations/HR/Employee Relations or a JD and passion for labor relations</li><li>Knowledge of state and federal employment law including specific knowledge in NLRA, FLSA, EEO </li><li>Proven effective consultation, influencing, organizational and communication skills<br/><br/></li></ul>Preferred Qualifications<br/><br/><ul><li>Experience in healthcare</li><li>Proven solid analytical and decision-making skills</li><li>Proven ability to multi-task and manage multiple priorities to meet deadlines and commitments</li><li>Proven ability to work independently while working within guidelines and established protocols </li><li>Proven ability to work in a large organization with a fast-paced environment</li><li>Proven ability to be innovative when work streaming, while still remaining within UHG established framework</li><li>Proven self-motivated and prepared to work and succeed on their own merits</li><li>All employees working remotely will be required to adhere to UnitedHealth Group’s Telecommuter Policy<br/><br/></li></ul>California Residents Only:  The salary range for this role is $88,000 to $173,200 annually. Pay is based on several factors including but not limited to local labor markets, education, work experience, certifications, etc. UnitedHealth Group complies with all minimum wage laws as applicable. In addition to your salary, UnitedHealth Group offers benefits such as, a comprehensive benefits package, incentive and recognition programs, equity stock purchase and 401k contribution (all benefits are subject to eligibility requirements). No matter where or when you begin a career with UnitedHealth Group, you’ll find a far-reaching choice of benefits and incentives.<br/><br/><em>At UnitedHealth Group, our mission is to help people live healthier lives and make the health system work better for everyone. We believe everyone-of every race, gender, sexuality, age, location and income-deserves the opportunity to live their healthiest life. Today, however, there are still far too many barriers to good health which are disproportionately experienced by people of color, historically marginalized groups and those with lower incomes. We are committed to mitigating our impact on the environment and enabling and delivering equitable care that addresses health disparities and improves health outcomes - an enterprise priority reflected in our mission.<br/><br/></em><em>Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.<br/><br/></em><em>UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.</em>", "responsibilities": "The Labor Relations Consultant will be a strategic business partner tasked with identifying complex issues regarding employee sentiment. This job assists in implementing overall enterprise labor strategy, working directly with the Sr. Director, Labor Relations in addressing and resolving labor and employee relations matters. The Employee Relations Consultant - Labor Relations will also function as an escalation point to provide counsel regarding employee issues.<br/><br/>If you are located in the state of California, you will have the flexibility to work remotely* as you take on some tough challenges.<br/><br/>Primary Responsibilities<br/><br/><ul><li>Work in partnership with the VP of Labor Relations, Employee Relations Associate Directors, Employee Relations Case Managers, Employee Relations Leadership, Total Absence Management (TAM), and the People Team to create and maintain a positive employee relations culture</li><li>Provides labor relations advice and counsel through participation in defined processes with People Team, Operations Management, and other departments as needed</li><li>Assist the VP, Labor Relations in identifying process improvements for the labor relations functions, contributing to innovative solutions, and make recommendations regarding policies and procedures</li><li>Identify and tailor best practices to ensure effective implementation of agreed-upon strategies while also managing any issues that arise during implementation</li><li>Facilitate management training both remote and on-location throughout the United States</li><li>Leverage existing data and analytics resources to proactively identify, assess, and guide priorities and interventions to strengthen the employee relations environment and foster an optimal employee experience</li><li>Travel up to 50%<br/><br/></li></ul>", "qualifications": {"required": "4+ years of Labor Relations/HR/Employee Relations or a JD and passion for labor relations\nKnowledge of state and federal employment law including specific knowledge in NLRA, FLSA, EEO \nProven effective consultation, influencing, organizational and communication skills<br/><br/>", "preferred": "Experience in healthcare\nProven solid analytical and decision-making skills\nProven ability to multi-task and manage multiple priorities to meet deadlines and commitments\nProven ability to work independently while working within guidelines and established protocols \nProven ability to work in a large organization with a fast-paced environment\nProven ability to be innovative when work streaming, while still remaining within UHG established framework\nProven self-motivated and prepared to work and succeed on their own merits\nAll employees working remotely will be required to adhere to UnitedHealth Group’s Telecommuter Policy<br/><br/>"}, "skills": ["Labor Relations", "HR", "Employee Relations", "JD", "NLRA", "FLSA", "EEO", "Consultation", "Influencing", "Organizational Skills", "Communication Skills", "Healthcare", "Analytical Skills", "Decision-Making Skills", "Multi-tasking", "Deadline Management", "Independent Work", "Large Organization Experience", "Fast-Paced Environment", "Innovation", "Self-Motivation"], "postedDate": "1 week ago", "benefits": "In addition to your salary, UnitedHealth Group offers benefits such as, a comprehensive benefits package, incentive and recognition programs, equity stock purchase and 401k contribution (all benefits are subject to eligibility requirements). No matter where or when you begin a career with UnitedHealth Group, you’ll find a far-reaching choice of benefits and incentives.", "remoteWork": "Yes", "salary": {"amount": "88,000 to $173,200", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3999996136"}