{"jobTitle": "Product Manager II, Enterprise Tools", "company": {"name": "ZipRecruiter", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "140,000.00/yr - 175,000.00/yr", "currency": "USD"}, "jobFunction": "Product Management and Marketing", "industry": "Software Development", "description": "We offer a hybrid work environment. Most US-based positions can also be performed remotely (any exceptions will be noted in the Minimum Qualifications below.)<br/><br/><strong>Our Mission:<br/><br/></strong>To actively connect people to their next great opportunity.<br/><br/><strong>Who We Are: <br/><br/></strong>ZipRecruiter is a leading online employment marketplace. Powered by AI-driven smart matching technology, the company actively connects millions of all-sized businesses and job seekers through innovative mobile, web, and email services, as well as through partnerships with the best job boards on the web. ZipRecruiter has the #1 rated job search app on iOS &amp; Android.<br/><br/><strong>Summary:<br/><br/></strong>As the Product Manager, Enterprise Customer Success Tools, you will be responsible for the development, optimization, and launch of data visualization and data products aimed at modeling, optimizing, tracking, and reporting against our customers’ (employers’) performance marketing campaigns, as well as providing market insights to our customers and customer-facing teams. Your work will directly improve our Enterprise sales, customer onboarding, experience, and retention.<br/><br/><strong>Key Focuses:<br/><br/></strong><ul><li>Work with engineering, design, and analytics teams to plan, build, and launch high quality product experiences that improve our Enterprise customer experience</li><li>Gather feedback from internal stakeholders (such as sales and customer success) and users to inform product decisions and strategy</li><li>Process, review, and interpret large bodies of qualitative and quantitative data to uncover new product and market insights</li><li>Write specs, manage project execution, and define product roll-out strategy and communications</li><li>Communicate product roadmap, learnings, advocate for new features, and write documentation for technical and non-technical audiences through the use of compelling data storytelling<br/><br/></li></ul><strong>Minimum Qualifications:<br/><br/></strong><ul><li>3+ years product management experience or relevant experience in engineering, UX design, or data science</li><li>Ability to write basic SQL queries</li><li>A business-level understanding of technical concepts such as APIs, relational databases, data formats (ex. CSV, XML, JSON, etc.)</li><li>Data-driven decision-making skills, with the ability to analyze and interpret data to extract meaningful insights<br/><br/></li></ul><strong>Preferred Qualifications:<br/><br/></strong><ul><li>Expertise in SQL with the ability to independently write database queries</li><li>Background in data modeling or data products</li><li>Familiarity with machine learning products or predictive analytics</li><li>Knowledge of ad tech products</li><li>Expertise in building Enterprise products</li><li>Experience in developing sales or customer success tooling<br/><br/></li></ul>The US base salary range for this full-time position is $140,000 - $175,000. Our salary ranges are determined by role, level, and location, and the range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location, role-related knowledge and skills, depth of experience, relevant education or training, and additional role-related considerations.<br/><br/>Depending on the position offered, equity, bonuses, commission, or other forms of compensation may also be provided as part of a total compensation package, in addition to a full range of medical, financial, and other benefits.<br/><br/>ZipRecruiter is proud to be an equal opportunity employer and provides equal employment opportunities (EEO) to all employees and applicants without regard to race, color, religion, sex, national origin, age, disability, veteran status, sexual orientation, gender identity or genetics.<br/><br/><strong>Privacy Notice: </strong>For information about ZipRecruiter's collection and processing of job applicant personal data for this job, please see our Privacy Notice at: https://www.ziprecruiter.com/careers/job-applicant-privacy-notice<br/><br/>", "responsibilities": "As the Product Manager, Enterprise Customer Success Tools, you will be responsible for the development, optimization, and launch of data visualization and data products aimed at modeling, optimizing, tracking, and reporting against our customers’ (employers’) performance marketing campaigns, as well as providing market insights to our customers and customer-facing teams. Your work will directly improve our Enterprise sales, customer onboarding, experience, and retention.", "qualifications": {"required": "3+ years product management experience or relevant experience in engineering, UX design, or data science, Ability to write basic SQL queries, A business-level understanding of technical concepts such as APIs, relational databases, data formats (ex. CSV, XML, JSON, etc.), Data-driven decision-making skills, with the ability to analyze and interpret data to extract meaningful insights", "preferred": "Expertise in SQL with the ability to independently write database queries, Background in data modeling or data products, Familiarity with machine learning products or predictive analytics, Knowledge of ad tech products, Expertise in building Enterprise products, Experience in developing sales or customer success tooling"}, "skills": ["SQL", "APIs", "Relational Databases", "Data Formats", "Data-driven Decision-making", "Product Management", "Engineering", "UX Design", "Data Science"], "postedDate": "1 week ago", "benefits": "Depending on the position offered, equity, bonuses, commission, or other forms of compensation may also be provided as part of a total compensation package, in addition to a full range of medical, financial, and other benefits.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3999382440"}