{"jobTitle": "Executive Assistant", "company": {"name": "UnitedMasters", "location": "Brooklyn, NY"}, "location": "Brooklyn, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "85,000 - 115,000", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Musicians", "description": "Who We Are<br/><br/>UnitedMasters is building a marketplace that connects artists, brands and fans - empowering artists to earn and grow. UnitedMasters has taken the bold step of building a music distribution service that, radically, puts artists first - disrupting the legacy music business by letting up-and-coming artists distribute their music directly to fans through streaming services while maintaining ownership of their master recording rights and up to 100% of royalties. Through the combination of UnitedMasters’ music distribution platform and its deep ties to brands, UnitedMasters enables independent artists and change-makers to grow and earn unlike any other platform.<br/><br/>The UnitedMasters team is made up of musicians, marketers, engineers, and storytellers with backgrounds from YouTube, SoundCloud, Pandora, Facebook, Uber, Dropbox, Complex, VICE, and more. We work hand in hand with the award-winning creative teams that forge those innovative partnerships at Translation (our in-house creative advertising agency).<br/><br/>We are looking for an organized and proactive Executive Assistant to provide support to our Chief People Officer and Chief Financial Officer at UnitedMasters! The ideal candidate will be adept at managing complex schedules, coordinating travel arrangements, handling expenses, and assisting with ad hoc projects. Your ability to anticipate needs, multitask, and maintain a high level of confidentiality will be critical to your success in this role.<br/><br/><em>Please note that this role is a Hybrid role based in our Brooklyn, NY office: three days in office and two days remote.<br/><br/></em><strong>What You'll Do<br/><br/></strong><ul><li>Directly manage the daily schedule of the executives to reflect business priorities and to ensure the highest value use of their time</li><li>Ensure the executives' schedules are confirmed 24 hours in advance and keep appointments and meetings running on time (making adjustments when necessary)</li><li>Increase the bandwidth of the executives by anticipating needs and taking ownership of planning, executing, and delegating activities, creating an extra layer of accountability</li><li>Support productive meetings and efficient decision making by drafting or obtaining meeting agendas, pre-reads and/or meeting materials/presentations from key stakeholders</li><li>Take and distribute clear and comprehensive notes in all meetings; proactively delegate and schedule follow ups from meetings and direction from the executive</li><li>Manage sensitive matters with a high level of confidentiality and discretion especially decisions directly impacting company operations </li><li>Anticipate the executives needs and proactively bring together appropriate people and resources to support the executive in addressing issues</li><li>Ensure that various administrative tasks are done in an effective and efficient manner, including drafting correspondence, and maintaining executive files as needed</li><li>Manage executive travel arrangements and proactively plan trips with various internal functions</li><li>Process and maintain expenses<br/><br/></li></ul><strong>Knowledge, Skills And Abilities<br/><br/></strong><ul><li>Strong organizational skills and ability to prioritize work to successfully balance several work streams at a time</li><li>Ability to pay meticulous attention to detail and possess a deeply pro-active, hands-on mentality</li><li>The ability to adapt and pivot to changing requests and thrive in a fast-paced environment</li><li>Possess deep appreciation and sensitivity towards people, culture, and values</li><li>Ability to execute on priorities with a strong sense of urgency, ownership and accountability</li><li>Ability to handle confidential and sensitive information with tact, diplomacy, and discretion</li><li>Personable, smart, passionate, and optimistic. <br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>3+ years of experience as an executive assistant supporting multiple executives</li><li>Experience managing projects and/or programs <br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Bachelor’s degree or equivalent years of experience </li><li>Experience supporting C-Suite executives <br/><br/></li></ul><strong>About UnitedMasters, Inc.<br/><br/></strong>UnitedMasters Inc. represents the creative solutions company, Translation, and the leading software and services platform for independent creators, UnitedMasters. UnitedMasters enables ownership, exposure, and new paths for financial return for independent creators, while Translation helps brands leverage the power of contemporary culture to achieve transformational growth. Combined, UnitedMasters, Inc. is the world’s leading marketplace for cultural capital, connecting independent artists and brands to realize a future in which all creators own their future. Backed by Alphabet, Andreessen Horowitz, and Apple, UnitedMasters, Inc. is reimagining how brands and artists come together to tell their stories, build profitable growth, and push culture forward.<br/><br/><strong>Salary Hiring Range:</strong> $85,000 - $115,000<br/><br/><em>Our salary ranges are based on paying competitively for our size and industry, and are one part of many compensation, benefits and other reward opportunities we provide (e.g. bonus, stock options, 401(k) match, etc.)<br/><br/></em><em>Individual pay rate decisions are based on a number of factors, including qualifications for the role, experience level, skillset, and balancing internal equity relative to peers at the company. We expect the majority of the candidates who are offered roles at our company to fall healthily throughout the range based on these factors. <br/><br/></em><em>The range above is for the expectations as laid out in the job description, however we are often open to a wide variety of profiles, and recognize that the person we hire may be less experienced (or more senior) than this job description as posted. If that ends up being the case, the updated salary range will be communicated with you as a candidate.<br/><br/></em><em>The salary range above is for the NY/CA. As a company, we have a location based strategy, which means the salary range could be lower or higher than this if the role is hired in another location.<br/><br/></em>", "responsibilities": "<ul><li>Directly manage the daily schedule of the executives to reflect business priorities and to ensure the highest value use of their time</li><li>Ensure the executives' schedules are confirmed 24 hours in advance and keep appointments and meetings running on time (making adjustments when necessary)</li><li>Increase the bandwidth of the executives by anticipating needs and taking ownership of planning, executing, and delegating activities, creating an extra layer of accountability</li><li>Support productive meetings and efficient decision making by drafting or obtaining meeting agendas, pre-reads and/or meeting materials/presentations from key stakeholders</li><li>Take and distribute clear and comprehensive notes in all meetings; proactively delegate and schedule follow ups from meetings and direction from the executive</li><li>Manage sensitive matters with a high level of confidentiality and discretion especially decisions directly impacting company operations </li><li>Anticipate the executives needs and proactively bring together appropriate people and resources to support the executive in addressing issues</li><li>Ensure that various administrative tasks are done in an effective and efficient manner, including drafting correspondence, and maintaining executive files as needed</li><li>Manage executive travel arrangements and proactively plan trips with various internal functions</li><li>Process and maintain expenses<br/><br/></li></ul>", "qualifications": {"required": "3+ years of experience as an executive assistant supporting multiple executives, Experience managing projects and/or programs", "preferred": "Bachelor’s degree or equivalent years of experience , Experience supporting C-Suite executives"}, "skills": [], "postedDate": "1 week ago", "benefits": "Our salary ranges are based on paying competitively for our size and industry, and are one part of many compensation, benefits and other reward opportunities we provide (e.g. bonus, stock options, 401(k) match, etc.)", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3999853795"}