{"jobTitle": "Account Executive, Ad Sales, Amazon Ads", "company": {"name": "Amazon", "industry": "Software Development", "size": "Large", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$55,800.00/yr - $119,300.00/yr", "currency": "USD"}, "jobFunction": "Sales, Advertising, and Business Development", "industry": "Software Development", "description": "Amazon Advertising operates at the intersection of eCommerce and advertising, offering a rich array of digital display advertising solutions with the goal of helping our customers find and discover anything they want to buy. We help brands reach Amazon customers through strategic, highly targeted self-service advertising products. If you’re interested in joining a rapidly growing team working to build a unique, world-class advertising group with a relentless focus on the customer, you’ve come to the right place. This is an opportunity to sell world class personalization technologies and drive sales across multiple platforms to new and existing small-to-medium brand and performance advertisers. There are also opportunities to grow and retain revenue from existing advertisers. If you have a consultative selling style and are able to tactfully guide customers to their goals by optimizing for the long-term, apply today!", "responsibilities": "Use your influencing and relationship-building skills to prospect, penetrate and develop executive-level relationships with clients, uncovering the business needs of Amazon's clients. Retain and grow revenue from existing advertisers. Drive deals to closure in a new business environment. You influence how decisions are made by leading with data, and are focused on understanding how Amazon's products and tools can help build relevant advertising solutions for our customers. Deliver the highest level of sales and customer service to our clients. Utilize sales CRM to measure progress against pertinent sales activities and opportunities. Understand and learn about the e-commerce industry and competitive environment, including competitor product offerings. Collaborate cross-functionally to create and execute advertising plans for different types of businesses.", "qualifications": {"required": "1+ years of sales experience, 2+ years of selling advertising or advertising-like services experience, Experience with online productivity tools such as Office 365, Salesforce or similar software", "preferred": "Experience working cross-functionally and with a wide range of employees with different skill sets, Experience in the advertising, media or agency landscape, and proven track record of reaching and exceeding sales revenue goals via new and existing business."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "This position is eligible for variable pay via a sales compensation plan. These plans pay according to achievement level against sales targets and/or business objectives. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3999964375"}