{"jobTitle": "Executive Assistant (Legal Intake)", "company": {"name": "Omega Law Group Injury & Accident Attorneys", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "20.00/hr - 30.00/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Law Practice", "description": "**Please note that we kindly request no calls to our office regarding questions about job openings. For any inquiries, please email us at **careers@omegalaw.com**.**\n\nOmega Law Group is a prestigious personal injury law firm located in the heart of Beverly Hills. We are committed to championing the rights of individuals who have suffered due to negligence or wrongful acts. Our dedicated team is known for delivering exceptional service and winning results for our clients. Through innovation, compassion, and expertise, we have gained a reputation as one of the leading law firms in personal injury. To learn more, please visit our website: www.omegalaw.com.\n\n**<u>Position Overview:</u>**\n\nJoin our team as an Executive Assistant to play a role in providing support to our Intake department staff and attorney and conduct intake interviews as needed. This position requires a proactive individual who can efficiently manage multiple tasks in a fast-paced environment while maintaining strong attention to details and professionalism.\n\n**<u>Responsibilities:</u>**\n\n* Provide support to the intake personal injury attorney and team\n* Conduct intake interviews with potential clients via phone, or in-person meetings\n* Prepare and review information and documents, correspondence and reports\n* Coordinate and schedule client consultations, ensuring all necessary information is gathered and documented\n* Assist in the preparation and organization of case files, ensuring all documentation is accurate and up-to-date\n* Liaise with clients and other parties involved in the intake process, maintaining clear and timely communication\n* Perform other related duties as assigned\n\n*This role is located at our Beverly Hills office and requires physical presence on-site.\n\n*Schedule: The initial training period will be within regular hours; however, the ability to work non-standard hours, including evenings and rotational weekends are necessary afterwards.\n\n**<u>Qualifications:</u>**\n\n* Proven experience as an executive assistant or similar role\n* Experience with the client intake process in the legal industry or similar environments, preferably\n* Experience in sales with the ability to communicate persuasively and effectively\n* Excellent communication skills, both written and verbal, with a professional demeanor\n* Detail-oriented with a high level of accuracy in data entry, reporting and documentation\n* Team player with the ability to collaborate effectively with colleagues and clients\n* Proficiency in Microsoft Office Suite\n\nWe are an equal opportunity employer and offer competitive compensation and benefits, and opportunities for growth.", "responsibilities": "Provide support to the intake personal injury attorney and team, Conduct intake interviews with potential clients via phone, or in-person meetings, Prepare and review information and documents, correspondence and reports, Coordinate and schedule client consultations, ensuring all necessary information is gathered and documented, Assist in the preparation and organization of case files, ensuring all documentation is accurate and up-to-date, Liaise with clients and other parties involved in the intake process, maintaining clear and timely communication, Perform other related duties as assigned", "qualifications": {"required": "Proven experience as an executive assistant or similar role, Experience with the client intake process in the legal industry or similar environments, preferably, Experience in sales with the ability to communicate persuasively and effectively, Excellent communication skills, both written and verbal, with a professional demeanor, Detail-oriented with a high level of accuracy in data entry, reporting and documentation, Team player with the ability to collaborate effectively with colleagues and clients, Proficiency in Microsoft Office Suite"}, "skills": ["Microsoft Office Suite"], "postedDate": "1 week ago", "benefits": "We are an equal opportunity employer and offer competitive compensation and benefits, and opportunities for growth.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999707751"}