{"jobTitle": "Accounts Receivable Clerk $500 sign on bonus", "company": {"name": "Noble House Hotels & Resorts", "location": "Redondo Beach, CA"}, "location": "Redondo Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "21.00", "currency": "USD"}, "jobFunction": "Accounting/Auditing and Finance", "industry": "Hospitality", "description": "Job Type<br/><br/>Full-time<br/><br/><strong>Description<br/><br/></strong><strong>Your team and working environment:<br/><br/></strong>Nestled in our private Redondo Beach peninsula, our hotel is your haven. The Portofino Hotel offers a delightful array of amenities and activities in our prime South Bay location just a stone’s throw from the communities of Redondo Beach, Hermosa Beach, and Manhattan Beach. With 161 rooms, multiple F&amp;B outlets, banquets, guest activities and a 181-slip marina, your days are filled with diverse operations. Unique Hotels attract Unique People. If you are about being your best self, doing the right thing, bringing your natural smile and having fun, then we hope you become a member of our Portofino Family.<br/><br/>We are looking for an experienced Accounts Receivable Clerk to join our team! As an Accounts Receivable Clerk, you will be responsible for providing financial, administrative and clerical services and ensuring accuracy and efficiency of operations. You will process and monitor incoming payments and secure revenue by verifying and posting receipts.<br/><br/>What will I be doing?<br/><br/>As an Accounting Clerk, you would be responsible for responding to guest inquiries, resolving guest billing disputes, performing month-end duties and preparing daily receivables in the hotel's continuing effort to deliver outstanding guest service and financial profitability. Specifically, you would be responsible for performing the following tasks to the highest standards:<br/><br/><ul><li> Monitor accounts and incoming payments</li><li> Perform verifying, classifying, computing, posting and recording accounts receivable data</li><li> Verify discrepancies</li><li> Respond to and resolve clients’ billing issues ad questions</li><li> Prepare and manage bills, invoices and bank deposits</li><li> Reconcile the accounts receivable ledger</li><li> Make sure that all payments are properly posted</li><li> Assist in preparing financial statements</li><li> Assist in preparing detailing accounts receivable status<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li> 1 year or more of experience as an Accounts Receivable Clerk or similar role</li><li> Very good understanding of basic accounting principles</li><li> Ability to calculate, post and manage accounting figures in a timely manner</li><li> Proficient data entry skills along with a knack for numbers</li><li> 1 year or more of experience with operating spreadsheets</li><li> 1 year or more of experience with accounting software</li><li> Proficiency in English and in MS Office</li><li> Critical thinker and problem-solving skills</li><li> Team player</li><li> Good time-management skills</li><li> Great interpersonal and communication skills<br/><br/></li></ul>Noble House Hotels &amp; Resorts are proud to encourage and support an environment where everyone can be a successful team member (come as they are) as their true authentic self. We are an equal opportunity workplace and employer that does not discriminate based on race, color, disability, gender/sex, sexual orientation, religion, national origin, age, veteran status, or any other protected status. We are committed to building a team (rooted in family) and a workplace where we are all able to be successful based solely on our individual qualifications, experience, abilities and job performance<br/><br/>Salary Description<br/><br/>$21.00", "responsibilities": "<ul><li> Monitor accounts and incoming payments</li><li> Perform verifying, classifying, computing, posting and recording accounts receivable data</li><li> Verify discrepancies</li><li> Respond to and resolve clients’ billing issues ad questions</li><li> Prepare and manage bills, invoices and bank deposits</li><li> Reconcile the accounts receivable ledger</li><li> Make sure that all payments are properly posted</li><li> Assist in preparing financial statements</li><li> Assist in preparing detailing accounts receivable status<br/><br/></li></ul>", "qualifications": {"required": "1 year or more of experience as an Accounts Receivable Clerk or similar role, Very good understanding of basic accounting principles, Ability to calculate, post and manage accounting figures in a timely manner, Proficient data entry skills along with a knack for numbers, 1 year or more of experience with operating spreadsheets, 1 year or more of experience with accounting software, Proficiency in English and in MS Office, Critical thinker and problem-solving skills, Team player, Good time-management skills, Great interpersonal and communication skills<br/><br/>"}, "skills": ["Accounts Receivable", "Accounting", "Spreadsheets", "Accounting Software", "MS Office"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999875944"}