{"jobTitle": "Career Executive Assistant to CEO of a Retail Gas Operating Co.", "company": {"name": "Pocketbook Agency", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$95,000 - $125,000", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Oil and Gas and Retail", "description": "We are seeking a highly organized and experienced Career Executive Assistant to support the CEO of a fast-growing company in the retail gas industry space in Long Beach, CA. As an Executive Assistant, you will play a crucial role in supporting the CEO in day-to-day operations. The ideal candidate will have 5-10+ years of prior experience providing 1:1 support to high-net-worth individuals or CEOs, managing high-volume calendars, and coordinating various personal tasks. Must be highly professional, have a high level of discretion/confidentiality, have the ability to prioritize multiple tasks, and have a \"can do\" attitude at all times.  \n\nTypical duties are (but not limited to): \n· Oversee all daily administrative operations for the CEO.\n· Effectively manage various key functions of the CEO's office, including handling phone calls, managing incoming and outgoing mail, maintaining correspondence, taking notes during meetings, and organizing records.\n· Coordinate and arrange travel schedules and reservations as required for both business and personal travel.\n· Manage and organize calendar, scheduling both professional and personal appointments, and ensuring timely and efficient coordination of meetings.\n· Take responsibility for planning and executing events as needed.\n· Carefully review and handle incoming mail, taking appropriate action and preparing outgoing mail.\n· Establish and maintain a system for reviewing and categorizing incoming materials such as publications and periodicals.\n· Skillfully prioritize and handle multiple projects concurrently, ensuring prompt resolution of issues.\n· Maintain accurate records and track expenses efficiently.\n• Prepare reports and presentations.\n• Coordinate/liaise with other household staff as needed.\n\nRequirements:\n• College degree preferred but not required\n• Strong organizational and time management skills\n• Proven experience supporting high-level executives\n• Excellent communication and interpersonal skills\n• Ability to maintain confidentiality and handle sensitive information\n• Business savvy and ability to adapt to a fast-paced environment\n• Familiarity with managing complex calendars and scheduling\n• Flexible and adaptable approach to work\n\nSalary: $95,000 - $125,000/yearly + benefits + 401k match + bonus eligibility \n\nLocation: Long Beach, CA. This is a hybrid role with requirements to report to the office 2-3 days a week.\n\nLooking to hire immediately!", "responsibilities": "Oversee all daily administrative operations for the CEO. Effectively manage various key functions of the CEO's office, including handling phone calls, managing incoming and outgoing mail, maintaining correspondence, taking notes during meetings, and organizing records. Coordinate and arrange travel schedules and reservations as required for both business and personal travel. Manage and organize calendar, scheduling both professional and personal appointments, and ensuring timely and efficient coordination of meetings. Take responsibility for planning and executing events as needed. Carefully review and handle incoming mail, taking appropriate action and preparing outgoing mail. Establish and maintain a system for reviewing and categorizing incoming materials such as publications and periodicals. Skillfully prioritize and handle multiple projects concurrently, ensuring prompt resolution of issues. Maintain accurate records and track expenses efficiently. Prepare reports and presentations. Coordinate/liaise with other household staff as needed.", "qualifications": {"required": "Strong organizational and time management skills, Proven experience supporting high-level executives, Excellent communication and interpersonal skills, Ability to maintain confidentiality and handle sensitive information, Business savvy and ability to adapt to a fast-paced environment, Familiarity with managing complex calendars and scheduling, Flexible and adaptable approach to work", "preferred": "College degree"}, "skills": ["Organization", "Time Management", "Communication", "Interpersonal Skills", "Confidentiality", "Business Savvy", "Calendar Management", "Scheduling"], "postedDate": "1 week ago", "benefits": "benefits + 401k match + bonus eligibility", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3999393122"}