{"jobTitle": "Supervisor, Transport", "company": {"name": "BlueTriton Brands", "location": "Ontario, CA"}, "location": "Ontario, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "74,910 - 86,000-per year", "currency": "USD"}, "jobFunction": "Distribution and Supply Chain", "industry": "Manufacturing and Food and Beverage Services", "description": "BlueTriton is a leading provider of spring and purified water products - the name behind your favorite bottled water brands. We are proud to offer an extensive portfolio of highly recognizable, responsibly sourced, and sustainably packaged spring water in addition to other quality products and services. Get ready to quench your thirst with exciting possibilities when you join BlueTriton for a fiercely good career doing work that matters.<br/><br/>Whether your career interest is rooted in Finance, HR, Marketing, Sales, IT, Sustainability or our Legal/Regulatory/Government team, professional roles at BlueTriton within our Corporate Teams could very well be the place for you to uncap your potential! Be prepared to join a team that is deeply committed, boldly innovative, and fiercely good for our consumers and customers, for our people, and for our communities.<br/><br/>Job Description<br/><br/>We currently have an opening for a Transport Resource at our Ontario, CA location. The Transport Resource is a key member responsible for building and maintaining carrier relationships and ensuring the achievement of performance targets.<br/><br/>Key Responsibilities:<br/><br/><ul><li>Work closely with Uber to resolve any carrier, customer, and CSR-related issues, assisting with all related transportation matters.</li><li>Manage core carrier group to ensure all carriers maintain a 98% service level, adherence to dock schedule, 95% Check Calls Compliance, and rates are within standard.</li><li>Be accountable for actual freight cost vs budget and carrier routing compliance.</li><li>Perform monthly carrier meetings and drive carrier KPI improvements.</li><li>Analyze and report on transport metrics, including On Time, Payload, Check Calls, On Time Pickup, and Tender Acceptance.</li><li>Oversee carrier compliance with BlueTriton Brands and federal and state standards.</li><li>Facilitate the execution of changes and activities needed to support BlueTriton Brands Continuous Excellence (BCE) and the pursuit of TPM.</li><li>Develop new processes within the transportation department and communicate and train employees as needed.</li><li>Participate in customer visits and assist with customer communications.</li><li>Partner with Planning, Warehouses, Manufacturing, Uber, and Customer Service to ensure customer orders and needs are met according to plan.</li><li>Lead, coach, and develop Uber and Transport employees for future and current business needs.</li><li>Complete, update, and run various reports to monitor metrics and opportunities, including SAP and TMS.</li><li>Run daily, weekly, and monthly KPI reports.<br/><br/></li></ul>Qualifications<br/><br/>Key qualifications include:<br/><br/><ul><li>Bachelor's degree or 3-5 years’ experience required.</li><li>Strong leadership skills.</li><li>Knowledge of safety processes and guidelines related to transportation (DOT).</li><li>Strong computer skills, including proficiency in Excel, Word, PowerPoint, and experienced analysis capabilities.</li><li>Strong negotiating and influencing skills with the ability to reach win-win solutions with internal and external partners.<br/><br/></li></ul>Pay Transparency disclaimer:<br/><br/>Base Salary Range: $74,910 - 86,000-per year.<br/><br/>This role is also eligible for a yearly bonus of 10%.<br/><br/>Salary Range Disclaimer:<br/><br/>The salary range provided for this position is an approximation based on market research, internal compensation data and the candidate’s qualifications and experience. Final salary offers are determined through a comprehensive evaluation of candidate qualifications and may vary depending on factors such as skills, experience, and geographic location of the position. Other components of the compensation package, including benefits and bonuses, will also be considered. We are committed to fair and equitable compensation practices, and we encourage open dialogue about compensation during the interview process.<br/><br/><ul><li>Effective written and verbal communication skills with a strong ability to build relationships.</li><li>Demonstrated success in project management, problem solving, continuous improvement, and achieving metrics.</li><li>Excellent follow-up skills with a customer-focused approach.</li><li>Strong work ethic with the ability to travel up to 25% regionally and nationally for vendor, customer, and internal meetings.<br/><br/></li></ul>BlueTriton Brands, Inc. (“BlueTriton”) is a water and beverage company in North America that produces and distributes a portfolio of brands of spring water, purified water, and other beverages, which include Poland Spring®, Deer Park®, Ozarka®, Ice Mountain®, Zephyrhills®, Arrowhead®, Origin™, Saratoga®, AC+ION®, Pure Life®, B’EAU®, and Splash Refresher™. BlueTriton also owns and operates ReadyRefresh®, a water and beverage delivery service for homes and offices.<br/><br/>Headquartered in Stamford, Connecticut, BlueTriton is a privately held company with operations and distribution primarily in the United States and Canada, employing more than 7,000 employees. BlueTriton manages water resources for long-term sustainability and helps protect more than 20,000 acres of watershed area owned by the company from harm and destruction. The company sources from 56 springs and has 30 production facilities across North America, with some verified to the Alliance for Water Stewardship Standard. BlueTriton is a Water Champion with The Water Council and has committed to be verified under their WAVE program.<br/><br/>BlueTriton Brands is proud to be an Equal Opportunity and Affirmative Action employer, seeking to create a welcoming and diverse environment. We do not discriminate based on race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state, and local law. BlueTriton Brands is committed to providing reasonable accommodation for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please contact us at BlueTritonHR@bluetriton.com", "responsibilities": "The Transport Resource is a key member responsible for building and maintaining carrier relationships and ensuring the achievement of performance targets.<br/><br/>Key Responsibilities:<br/><br/><ul><li>Work closely with Uber to resolve any carrier, customer, and CSR-related issues, assisting with all related transportation matters.</li><li>Manage core carrier group to ensure all carriers maintain a 98% service level, adherence to dock schedule, 95% Check Calls Compliance, and rates are within standard.</li><li>Be accountable for actual freight cost vs budget and carrier routing compliance.</li><li>Perform monthly carrier meetings and drive carrier KPI improvements.</li><li>Analyze and report on transport metrics, including On Time, Payload, Check Calls, On Time Pickup, and Tender Acceptance.</li><li>Oversee carrier compliance with BlueTriton Brands and federal and state standards.</li><li>Facilitate the execution of changes and activities needed to support BlueTriton Brands Continuous Excellence (BCE) and the pursuit of TPM.</li><li>Develop new processes within the transportation department and communicate and train employees as needed.</li><li>Participate in customer visits and assist with customer communications.</li><li>Partner with Planning, Warehouses, Manufacturing, Uber, and Customer Service to ensure customer orders and needs are met according to plan.</li><li>Lead, coach, and develop Uber and Transport employees for future and current business needs.</li><li>Complete, update, and run various reports to monitor metrics and opportunities, including SAP and TMS.</li><li>Run daily, weekly, and monthly KPI reports.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or 3-5 years’ experience required.<br/>Strong leadership skills.<br/>Knowledge of safety processes and guidelines related to transportation (DOT).<br/>Strong computer skills, including proficiency in Excel, Word, PowerPoint, and experienced analysis capabilities.<br/>Strong negotiating and influencing skills with the ability to reach win-win solutions with internal and external partners.<br/><br/>Effective written and verbal communication skills with a strong ability to build relationships.<br/>Demonstrated success in project management, problem solving, continuous improvement, and achieving metrics.<br/>Excellent follow-up skills with a customer-focused approach.<br/>Strong work ethic with the ability to travel up to 25% regionally and nationally for vendor, customer, and internal meetings.<br/><br/>", "preferred": ""}, "skills": ["Leadership", "Transportation", "DOT", "Excel", "Word", "PowerPoint", "Negotiation", "Communication", "Project Management", "Problem Solving", "Continuous Improvement"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "This role is also eligible for a yearly bonus of 10%.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999001073"}