{"jobTitle": "Project Manager, Creative Services (Marketing)", "company": {"name": "Bentley Mills", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "75,200.00 - 94,000.00", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Textile Manufacturing", "description": "The Project Manager, Creative Services is responsible for supporting / executing projects within the marketing services department. This individual will stay attuned with all creative marketing initiatives and assist in the flow of cross functional communications from marketing campaign conception to design, facilitating asset flow from approvals to production. The primary objective of the project manager is to streamline requests and aim to increase the efficiency and accuracy of creative services team output.  ROLES AND RESPONSIBILITIES Support the day-to-day management of the Creative Services Department Develop and maintain the documentation and facilitation of all projects within the department Analyze project requests and document project priorities Gather specifications for all creative projects including detailed project briefs, and timelines  Communicate deliverable expectations, timing, and status to applicable stakeholders  Partner with marketing team to identify and communicate priority projects  Partner with creative team management to monitor / manage work queues  Maintain clear communication to all stakeholders and team members during all projects  Cultivate team collaboration among creative and development teams  Maintain up-to-date knowledge of project management methodologies, best practices, and processes  Maintain familiarity with creative and print projects, timelines, and processes  TECHNICAL COMPETENCIES (Knowledge, Skills & Abilities)  Highly Proficient in Microsoft Applications and Adobe suite (Acrobat is sufficient) Proficient in ASANA and all programs related to project management tools Proficient in CANTO and all programs related to content management platforms Proficiency in copy editing Ability to utilize data analysis and metrics to drive decision making and continuous improvement  Exceptional time management skills. Ability to manage multiple projects simultaneously Ability to lead a team(s) in a project-based environment  Ability to work effectively and collaboratively with cross-functional teams and stakeholders  Strong organization, attention to detail and follow-up skills  Strong written and verbal communication skills as well as presentation skills. Minimum 1 years’ experience leading cross functional process improvement initiatives and implementing process changes across an organization  PMI or similar a plus  This position reports to the VP of Product and Marketing for Bentley Mills, Inc.  The Director of Sustainability will be responsible for managing their expenses, complying with safety rules, environmental regulations and all other Company Policies and Procedures Starting pay range: $75,200.00 - 94,000.00 Bentley Mills is an Equal Opportunity/Affirmative Action Employer. Bentley provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. *The “base salary range” provided above is a good faith estimate of what we expect to pay for this position. The range provided is required by CA, CO, CT, MD, NJ, NV, NY, OH, RI, WA State Law. Bentley Mills reserves the right to pay outside of the given range based on a variety of factors including but not limited to: candidate skills and experience, complexity of the job, budgetary factors, and local/geography. Bentley Mills conducts regular reviews of compensation ranges and therefore reserves the right to alter this range at any given time.", "responsibilities": "The Project Manager, Creative Services is responsible for supporting / executing projects within the marketing services department. This individual will stay attuned with all creative marketing initiatives and assist in the flow of cross functional communications from marketing campaign conception to design, facilitating asset flow from approvals to production. The primary objective of the project manager is to streamline requests and aim to increase the efficiency and accuracy of creative services team output.  Support the day-to-day management of the Creative Services Department Develop and maintain the documentation and facilitation of all projects within the department Analyze project requests and document project priorities Gather specifications for all creative projects including detailed project briefs, and timelines  Communicate deliverable expectations, timing, and status to applicable stakeholders  Partner with marketing team to identify and communicate priority projects  Partner with creative team management to monitor / manage work queues  Maintain clear communication to all stakeholders and team members during all projects  Cultivate team collaboration among creative and development teams  Maintain up-to-date knowledge of project management methodologies, best practices, and processes  Maintain familiarity with creative and print projects, timelines, and processes ", "qualifications": {"required": "Highly Proficient in Microsoft Applications and Adobe suite (Acrobat is sufficient) Proficient in ASANA and all programs related to project management tools Proficient in CANTO and all programs related to content management platforms Proficiency in copy editing Ability to utilize data analysis and metrics to drive decision making and continuous improvement  Exceptional time management skills. Ability to manage multiple projects simultaneously Ability to lead a team(s) in a project-based environment  Ability to work effectively and collaboratively with cross-functional teams and stakeholders  Strong organization, attention to detail and follow-up skills  Strong written and verbal communication skills as well as presentation skills. Minimum 1 years’ experience leading cross functional process improvement initiatives and implementing process changes across an organization  PMI or similar a plus"}, "skills": ["Microsoft Applications", "Adobe Suite", "ASANA", "CANTO", "Data Analysis", "Time Management", "Team Leadership", "Cross-Functional Collaboration", "Organization", "Attention to Detail", "Communication", "Presentation Skills", "Process Improvement"], "postedDate": "1 week ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999382616"}