{"jobTitle": "Ocean Import Specialist", "company": {"name": "Savino Del Bene", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Administrative", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Savino Del Bene is a Global Freight Forwarding Company headquartered in Florence, Italy. With more than 295 offices and 5,500 employees globally, Savino Del Bene is one of the leading logistics company that offers import, export, customs brokerage services and warehousing third party solutions servicing several Vertical Markets. We are currently looking for an Ocean Import Specialist to join our team. We are looking for a motivated and passionate candidate to become part of our high paced, professional Ocean Import Team.", "responsibilities": "Receive, review, and process import documentation for accounts. Ensure documentation is accurately processed, distributed and released to carrier, customers and agents in a timely manner. Obtain and create quotes for shipments and source best method of transportation. Work with Brokerage or CFS to coordinate and monitor the release of goods from the carrier, Customs, or other governmental agency examinations that may be required. Communicate with overseas agents to ensure proper pre-alerts and documentation. Continue to explore different options to reduce cost, and increase revenues. Track and trace shipment and provide updates to clients and sales. Uphold a strong and professional relationship with airlines, transportation agencies and sales. Demonstrate an emphasis on customer satisfaction per company policy. Maintain shipment files and ensure billing is completed within a timely fashion. Assist as backup for alternate accounts. Perform other duties as assigned. Must be able to perform essential job functions with or without reasonable accommodations", "qualifications": {"required": "Excellent verbal, written and listening communication skills Commitment to teamwork with all other functional areas Strong work ethic Ability to operate in a fast paced environment Excellent problem solving and organizational skills Proficient in Microsoft Office (Word, Excel, Power Point) Internet and windows Ability to handle multiple responsibilities Must possess excellent customer service skills with the ability to grasp extensive knowledge while dealing with a variety of people. Must have strong organizational and time management skills. Ability to read, analyze and interpret verbal and written requests and directions. Must have the ability to compose letters, memos, emails and other written documentation clearly and concisely. Be able to present one’s self in a highly cooperative and professional manner when meeting both internal and external customers and vendors face to face. Ability to organize and manage multiple priorities."}, "skills": ["Microsoft Office", "Customer Service", "Communication", "Teamwork", "Problem Solving", "Organization"], "postedDate": "1 week ago", "benefits": "Salary based on experience 401k with match Full medical benefits Vacation, Sick and PTO time offered Great work environment", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999784739"}