{"jobTitle": "Logistics Analyst", "company": {"name": "Resource Informatics Group, Inc", "industry": "IT Services and IT Consulting", "size": "Not specified", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Other", "industry": "IT Services and IT Consulting", "description": "Role - Logistics Analyst\nLocation - 40 Parker, Irvine, California, United States of America, 92618\nDuration- Long Term\nWednesdays and Fridays on-site at 40 Parker, Irvine, CA\nTop Skills/Responsibilities:\nSAP Material Management experience- at least 2 years\nInventory/Replenishment planning with supply chain knowledge\nadvanced excel for analysis and using tableau for reporting (using, building is a plus)\nSAP and order management are key\nSQL and Python are a plus\n3+ years using MS Excel, Jira and Atlassian Products\nExperience in Supply Chain or Manufacturing Product Lifecycle Management departments\nExperience working with engineering leads to establish acceptance criteria for development work and user acceptance testing efforts\nBe comfortable with database queries to measure performance KPIs and evaluate experiments\nExperience with ReactJS, GraphQL and web development is a plus\nExperience with Figma, Lucid and any other design tool is a plus\nResponsibilities:\nExecute the Channel Planning and Analytics strategic plan which will support better service levels with less inventory and optimized safety stocks.\nOwn master data and inventory parameters for Service Center materials to support stocking to meet the demand forecast, provide excellent fill rates, reduce down-time, and deliver cost efficient supply chain models.\nDevelop, launch, and continuously improve the part inventory stocking models and strategies, part order replenishment generation logic, and distribution planning to meet our global SLAs.\nEvaluate and analyze system outputs to ensure correct materials are being ordered, replenished, and available to support global service requirements.\nFocus on automation and controls to quickly identify errors to eliminate supply chain noise by modifying, removing, or adding orders to meet demand.\nCoordinate and execute transactional movements of materials to optimize and reduce logistics costs, meet Service Level Agreements, and reduce global inventory costs.\nDeliver on service level expectations, part allocation strategy, part availability, inventory refresh cycles, part consumption, and field performance.", "responsibilities": "Execute the Channel Planning and Analytics strategic plan which will support better service levels with less inventory and optimized safety stocks. Own master data and inventory parameters for Service Center materials to support stocking to meet the demand forecast, provide excellent fill rates, reduce down-time, and deliver cost efficient supply chain models. Develop, launch, and continuously improve the part inventory stocking models and strategies, part order replenishment generation logic, and distribution planning to meet our global SLAs. Evaluate and analyze system outputs to ensure correct materials are being ordered, replenished, and available to support global service requirements. Focus on automation and controls to quickly identify errors to eliminate supply chain noise by modifying, removing, or adding orders to meet demand. Coordinate and execute transactional movements of materials to optimize and reduce logistics costs, meet Service Level Agreements, and reduce global inventory costs. Deliver on service level expectations, part allocation strategy, part availability, inventory refresh cycles, part consumption, and field performance.", "qualifications": {"required": "SAP Material Management experience- at least 2 years, Inventory/Replenishment planning with supply chain knowledge, advanced excel for analysis and using tableau for reporting, SAP and order management are key, SQL and Python are a plus, 3+ years using MS Excel, Jira and Atlassian Products", "preferred": "Experience in Supply Chain or Manufacturing Product Lifecycle Management departments, Experience working with engineering leads to establish acceptance criteria for development work and user acceptance testing efforts, Be comfortable with database queries to measure performance KPIs and evaluate experiments, Experience with ReactJS, GraphQL and web development is a plus, Experience with Figma, Lucid and any other design tool is a plus"}, "skills": ["SAP Material Management", "Inventory Planning", "Replenishment Planning", "Advanced Excel", "Tableau", "SQL", "Python", "MS Excel", "Jira", "Atlassian Products", "ReactJS", "GraphQL", "Figma", "Lucid"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3999084887"}