{"jobTitle": "Office Clerk", "company": {"name": "Draft Note Design", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$19.50 - $31.00", "currency": "USD"}, "jobFunction": "Administrative and Customer Service", "industry": "Office Administration", "description": "<strong>Draft Note Design</strong> is seeking a diligent and organized Office Clerk to join our team. The Office Clerk will be responsible for a variety of administrative tasks to support the smooth operation of the office. This role requires strong organizational skills, attention to detail, and the ability to handle multiple tasks efficiently.<br/><br/><strong>Pay<br/><br/></strong>$19.50 - $31.00 per hour<br/><br/><strong>Job<br/><br/></strong>Full time<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Perform general office duties such as filing, photocopying, scanning, and faxing documents.</li><li>Maintain and update company records and databases.</li><li>Handle incoming and outgoing mail and packages.</li><li>Answer and direct phone calls to appropriate staff members.</li><li>Greet and assist visitors in a professional and friendly manner.</li><li>Manage office supplies and inventory, ensuring necessary items are stocked.</li><li>Assist with scheduling and coordinating meetings and appointments.</li><li>Prepare and distribute correspondence, reports, and other documents as needed.</li><li>Support other administrative tasks and projects as required.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>High school diploma or equivalent.</li><li>Previous experience in an office environment is preferred.</li><li>Proficient in Microsoft Office Suite (Word, Excel, Outlook).</li><li>Strong organizational and multitasking abilities.</li><li>Excellent verbal and written communication skills.</li><li>Attention to detail and accuracy in data entry and record-keeping.</li><li>Ability to work independently and as part of a team.</li><li>Professional appearance and demeanor.</li><li>Benefits</li><li>Competitive weekly salary, commensurate with experience and qualifications.</li><li>Comprehensive benefits package including health insurance, dental coverage, and retirement plans.</li><li>Paid time off and holidays.</li><li>Opportunities for professional development and growth within the company..</li></ul>", "responsibilities": "Perform general office duties such as filing, photocopying, scanning, and faxing documents. Maintain and update company records and databases. Handle incoming and outgoing mail and packages. Answer and direct phone calls to appropriate staff members. Greet and assist visitors in a professional and friendly manner. Manage office supplies and inventory, ensuring necessary items are stocked. Assist with scheduling and coordinating meetings and appointments. Prepare and distribute correspondence, reports, and other documents as needed. Support other administrative tasks and projects as required.", "qualifications": {"required": "High school diploma or equivalent. Previous experience in an office environment is preferred. Proficient in Microsoft Office Suite (Word, Excel, Outlook). Strong organizational and multitasking abilities. Excellent verbal and written communication skills. Attention to detail and accuracy in data entry and record-keeping. Ability to work independently and as part of a team. Professional appearance and demeanor.", "preferred": ""}, "skills": ["Microsoft Office", "Organization", "Multitasking", "Communication", "Customer Service"], "postedDate": "1 week ago", "benefits": "Competitive weekly salary, commensurate with experience and qualifications. Comprehensive benefits package including health insurance, dental coverage, and retirement plans. Paid time off and holidays. Opportunities for professional development and growth within the company.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999666424"}