{"jobTitle": "Entry Level Social Media Assistant", "company": {"name": "Draft Note Design", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$21.00 - $30.00", "currency": "USD"}, "jobFunction": "Marketing, Other, and Public Relations", "industry": "Public Relations and Communications Services", "description": "<strong>About Draft Note Design<br/><br/></strong>At Draft Note Design, we are more than just an architecture firm; we are visionaries, artists, and dream-weavers. With a passion for creating spaces that transcend the ordinary, we believe that every structure should tell a unique story. Our team of innovative architects and designers collaborates tirelessly to transform your dreams into breathtaking realities.<br/><br/><strong>Job Description<br/><br/></strong>We are seeking a dynamic and passionate individual to join our team as an Entry Level Social Media Assistant. In this role, you will be responsible for assisting with the management and execution of our social media strategies. You will have the exciting opportunity to help create engaging content, interact with our online community, and contribute to our overall brand presence on various social media platforms.<br/><br/><strong>Pay<br/><br/></strong>$21.00 - $30.00 per hour<br/><br/><strong>Job<br/><br/></strong>Full time<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Assist in the creation and scheduling of social media posts across multiple platforms (e.g., Facebook, Instagram, Twitter)</li><li>Monitor social media channels for comments, messages, and mentions, and respond to inquiries in a timely manner</li><li>Conduct regular research to stay updated on industry trends and best practices in social media marketing</li><li>Assist in the development and implementation of social media campaigns to increase brand awareness and reach</li><li>Collaborate with the marketing team to plan and execute promotional events and contests on social media platforms</li><li>Track and analyze social media metrics to evaluate the success of campaigns and strategies</li><li>Stay up-to-date with emerging social media platforms and trends to explore new opportunities for brand promotion<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's degree in marketing, communications, or a related field</li><li>Proficiency in social media platforms and tools (e.g., Facebook Business Manager, Hootsuite, Buffer)</li><li>Excellent written and verbal communication skills</li><li>Strong organizational and time management skills</li><li>Ability to work independently and collaboratively in a fast-paced environment</li><li>Basic understanding of graphic design principles and Adobe Creative Suite is a plus</li><li>Knowledge of SEO and content marketing strategies is a plus<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Competitive weekly salary, commensurate with experience and qualifications.</li><li>Comprehensive benefits package including health insurance, dental coverage, and retirement plans.</li><li>Paid time off and holidays.</li><li>Opportunities for professional development and growth within the company.</li></ul>", "responsibilities": "Assist in the creation and scheduling of social media posts across multiple platforms (e.g., Facebook, Instagram, Twitter), Monitor social media channels for comments, messages, and mentions, and respond to inquiries in a timely manner, Conduct regular research to stay updated on industry trends and best practices in social media marketing, Assist in the development and implementation of social media campaigns to increase brand awareness and reach, Collaborate with the marketing team to plan and execute promotional events and contests on social media platforms, Track and analyze social media metrics to evaluate the success of campaigns and strategies, Stay up-to-date with emerging social media platforms and trends to explore new opportunities for brand promotion", "qualifications": {"required": "Bachelor's degree in marketing, communications, or a related field, Proficiency in social media platforms and tools (e.g., Facebook Business Manager, Hootsuite, Buffer), Excellent written and verbal communication skills, Strong organizational and time management skills, Ability to work independently and collaboratively in a fast-paced environment, Basic understanding of graphic design principles and Adobe Creative Suite is a plus, Knowledge of SEO and content marketing strategies is a plus", "preferred": ""}, "skills": ["Facebook", "Instagram", "Twitter", "Social Media Marketing", "Marketing", "Communications", "Graphic Design", "Adobe Creative Suite", "SEO", "Content Marketing"], "postedDate": "6 days ago", "benefits": "Competitive weekly salary, commensurate with experience and qualifications., Comprehensive benefits package including health insurance, dental coverage, and retirement plans., Paid time off and holidays., Opportunities for professional development and growth within the company.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3999669027"}