{"jobTitle": "General Manager", "company": {"name": "Ascend Dental Alliance", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "70K-80K", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "Genesis Aesthetics &amp; Implants: General Manager<br/><br/>Working with us means being part of a dynamic work environment where each one of our employees has the opportunity to make a difference. We love what we do and it shows.<br/><br/>We have an environment where employees enjoy coming to work. We work hard, but at the end of the day, we feel a sense of satisfaction that we have helped to improve patients' lives.<br/><br/><strong>Responsibilities:</strong> <br/><br/><ul><li>Participates in formulating and administering company policies, directing and coordinating all divisional department activities to develop and implement long-range goals and objectives to meet business and profitability growth objectives.</li><li>Reviews analyses of activities, costs, operations and forecast data to determine department or division progress toward stated goals and objectives.</li><li>Confers with manager to review achievements and discuss required changes in goals or objectives resulting from current status and conditions.</li><li>Develops, reviews, updates and implements business strategic planning, including sales, financial performance and new product development.</li><li>Oversees key projects, processes and performance reports, data and analysis.</li><li>Reviews operations and plans to meet requirements for sales planning.</li><li>Reviews and approves preparation of accounting analysis for budgetary planning and implementation, production efficiency, financial reporting, budgetary planning and submittal for capital expenditures.</li><li>Manage full revenue performance of the center, including managing performance of all staff</li><ul><li>Review and manage key performance indicators including sales, collections, healthcare financing, close rate, collection ratio, percentage to target, and pipeline metrics</li></ul><li>Develop and manage the partnership between the Company and the Doctor through the consistent communication of core purpose and beliefs and collaborate with leadership to resolve issues in conflict with them. Foster strong relationships with our Doctor Partner to ensure alignment to strategic objectives throughout the center.</li><li>Manage the annual operating planning process in accordance with Company financial guidelines to ensure the attainment of the company's strategic objectives. </li><li>Regularly review and interpret the financial performance of the practice to ensure plan achievement and profitability targets.</li><li>With support from the Supply Chain Department implement best practices, purchasing guidelines and protocols which effectively leverage the collective buying power of the network.</li><li>Manage and report the practice assets through effective inventory control, supply chain, procurement and AR management to ensure effective inventory utilization and practice efficiency.</li><li>Collaborate with the Clinical Affairs Department to support clinical training programs and mentoring for clinical staff to ensure the clinical staff meets the technical requirements of their positions.</li><li>In collaboration with Human Resources, manage directly and through others, the performance management and development of staff to ensure the retention, employee development, succession planning, career-pathing and performance of employees.</li><li>Performs other similar tasks as necessary to ensure that the practice meets its metrics in support of strategic and profitability objectives.</li><li>Operate with the utmost standards of confidentiality in all facets of patient information, employee and HR matters, and intellectual property as well as revenue and profitability.</li><li>Manage the Center's P&amp;L as it relates to controllable supplies, expenses and Center labor; work with the physicians to explain financial results of the Center, discrepancies to targets and influence additional cost management measures.</li><li>Work with Front Office team to enforce, oversee and administer policy in the following areas:</li><ul><li>Clinical set up and adherence</li><li>Center employee management</li><li>Procurement spend management</li><li>Capital equipment repair approval</li><li>Patient finance oversight</li><li>Compliance oversight</li></ul><li>Serve as point of contact for the corporate support office and collaborate with the different support departments (i.e. Accounting, HR, Marketing, Compliance) to ensure the center is fully utilizing the support available to it to run an effective and profitable operation</li><li>Monitor and manage consult flow for consistency, efficiency of doctor/staff time</li><li>Monitor and manage surgical schedule to maximize surgeons time</li><li>Work with corporate Compliance Department to ensure training, HIPPA compliance, &amp; documentation requirements are met, licenses are up to date and appropriate approvals are obtained</li><li>In collaboration with the Recruiting Department, hire, direct and manage center level staff</li><li>In collaboration with Human Resources, implement employee performance management programs. Participate in corporate succession planning activities, write and deliver employee reviews, keep close tabs on employee morale and create a positive working environment.</li><li>Other Duties as assigned<br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>A bachelor's degree with a business concentration or MBA, preferred.</li><li>Must have 5-7 years of successful experience in an operations and sales leadership role</li><li>Must have at least two years of experience in a senior leadership role, working with C-level executives</li><li>Dental industry operations &amp;/or practice management experience STRONGLY PREFERRED</li><li>Must demonstrate outstanding leadership, communication and interpersonal skills</li><li>Experience managing in a multi-entity, multi-state environment is highly desirable. </li><li>Must possess expertise in operations management, strategies and methodologies, strategic planning and execution, and employee motivation techniques</li><li>Strong oral and written communication skills, excellent analytical, planning, and process development skills, strong business judgment, and high level of initiative are all required</li><li>Demonstrated ability to articulate logical and persuasive arguments across an organization is required</li><li>Demonstrated ability to respond effectively to multiple conflicting priorities, continuously prioritize deliverables and to respond to unexpected changes is required<br/><br/></li></ul><strong>Salary range:</strong> 70K-80K annually, based on level of experience<br/><br/><em>We are an equal opportunity employer</em>", "responsibilities": "Participates in formulating and administering company policies, directing and coordinating all divisional department activities to develop and implement long-range goals and objectives to meet business and profitability growth objectives. Reviews analyses of activities, costs, operations and forecast data to determine department or division progress toward stated goals and objectives. Confers with manager to review achievements and discuss required changes in goals or objectives resulting from current status and conditions. Develops, reviews, updates and implements business strategic planning, including sales, financial performance and new product development. Oversees key projects, processes and performance reports, data and analysis. Reviews operations and plans to meet requirements for sales planning. Reviews and approves preparation of accounting analysis for budgetary planning and implementation, production efficiency, financial reporting, budgetary planning and submittal for capital expenditures. Manage full revenue performance of the center, including managing performance of all staff Review and manage key performance indicators including sales, collections, healthcare financing, close rate, collection ratio, percentage to target, and pipeline metrics Develop and manage the partnership between the Company and the Doctor through the consistent communication of core purpose and beliefs and collaborate with leadership to resolve issues in conflict with them. Foster strong relationships with our Doctor Partner to ensure alignment to strategic objectives throughout the center. Manage the annual operating planning process in accordance with Company financial guidelines to ensure the attainment of the company's strategic objectives.  Regularly review and interpret the financial performance of the practice to ensure plan achievement and profitability targets. With support from the Supply Chain Department implement best practices, purchasing guidelines and protocols which effectively leverage the collective buying power of the network. Manage and report the practice assets through effective inventory control, supply chain, procurement and AR management to ensure effective inventory utilization and practice efficiency. Collaborate with the Clinical Affairs Department to support clinical training programs and mentoring for clinical staff to ensure the clinical staff meets the technical requirements of their positions. In collaboration with Human Resources, manage directly and through others, the performance management and development of staff to ensure the retention, employee development, succession planning, career-pathing and performance of employees. Performs other similar tasks as necessary to ensure that the practice meets its metrics in support of strategic and profitability objectives. Operate with the utmost standards of confidentiality in all facets of patient information, employee and HR matters, and intellectual property as well as revenue and profitability. Manage the Center's P&amp;L as it relates to controllable supplies, expenses and Center labor; work with the physicians to explain financial results of the Center, discrepancies to targets and influence additional cost management measures. Work with Front Office team to enforce, oversee and administer policy in the following areas: Clinical set up and adherence Center employee management Procurement spend management Capital equipment repair approval Patient finance oversight Compliance oversight Serve as point of contact for the corporate support office and collaborate with the different support departments (i.e. Accounting, HR, Marketing, Compliance) to ensure the center is fully utilizing the support available to it to run an effective and profitable operation Monitor and manage consult flow for consistency, efficiency of doctor/staff time Monitor and manage surgical schedule to maximize surgeons time Work with corporate Compliance Department to ensure training, HIPPA compliance, &amp; documentation requirements are met, licenses are up to date and appropriate approvals are obtained In collaboration with the Recruiting Department, hire, direct and manage center level staff In collaboration with Human Resources, implement employee performance management programs. Participate in corporate succession planning activities, write and deliver employee reviews, keep close tabs on employee morale and create a positive working environment. Other Duties as assigned", "qualifications": {"required": "Must have 5-7 years of successful experience in an operations and sales leadership role Must have at least two years of experience in a senior leadership role, working with C-level executives Dental industry operations &amp;/or practice management experience STRONGLY PREFERRED Must demonstrate outstanding leadership, communication and interpersonal skills Experience managing in a multi-entity, multi-state environment is highly desirable.  Must possess expertise in operations management, strategies and methodologies, strategic planning and execution, and employee motivation techniques Strong oral and written communication skills, excellent analytical, planning, and process development skills, strong business judgment, and high level of initiative are all required Demonstrated ability to articulate logical and persuasive arguments across an organization is required Demonstrated ability to respond effectively to multiple conflicting priorities, continuously prioritize deliverables and to respond to unexpected changes is required", "preferred": "A bachelor's degree with a business concentration or MBA"}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999544872"}