{"jobTitle": "Logistics Coordinator", "company": {"name": "Arlon Graphics", "industry": "Plastics Manufacturing", "location": "Placentia, CA"}, "location": "Placentia, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$31.00 - $35.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Plastics Manufacturing", "description": "Arlon Graphics, LLC is a cast vinyl manufacturing company in the business of creating innovative material for visual expression. Founded in 1958, Arlon Graphics manufactures and markets high-quality pressure-sensitive materials for the fleet, architectural, digital imaging, and signage markets. Through more than 180 distribution partners across the globe, a growing number of strategically-positioned sales offices and warehouses, and customer-centric operations, Arlon is recognized as a global leader in graphic films. Join the Arlon Graphics conversation and follow us at <em>@arlongraphics</em> on Facebook, Instagram, Twitter, and LinkedIn. For more information, visit arlon.com.  Why work here? Global, modern, growing company, in business since the 1950’s Vacation, Sick and Holiday Pay Health Insurance (Medical, Dental, &amp; Vision) 401(k) Retirement Plan with company match Company Sponsored Life Insurance Career Development Support Employee Discounts Summary/Objective:  The primary function of the position will be to ensure that products move in a timely and efficient manner from the supplier to the end user for both inbound and outbound domestic and international shipments. The individual will ensure that the delivery and supply chain processes for the products are operating smoothly, cost-effectively and safely. Analyze product delivery or supply chain processes to identify or recommend changes. The person will manage route activity including invoicing, electronic bills, shipment tracing and tracking. In addition, the individual will be required to perform freight analysis in conjunction with our 3PL provider to determine the most cost-effective way to complete shipments.  This individual will be responsible for our direct and indirect duty drawback program. Roles Responsibilities: Facilitate the shipping of products from one destination to another for all warehouses Arrange transportation and orchestrate deliveries to meet customer demand with little to no delay Receive and coordinate delivery for our buyout products from vendors Takes steps to avoid quality control issues for all shipments Manage activities throughout the order fulfilment and transportation cycle to make sure established deadlines are met Continually reviews freight costs and transportation rates with our 3PL partner to keep costs down Streamline and automate current shipping and transportation processes Maintain databases of logistics information for ocean and small parcel shipments Establish performance measurement KPIs for logistics and transportation Establish and facilitate duty draw back program for Arlon for direct and indirect materials Manage invoicing for Domestic, Ocean and small parcel Establish and streamline processes for international shipments Identify and resolve daily service and scheduling issues; inform and escalate service issues to management as appropriate Maintain timely and professional communication with customer contacts on issues impacting service and overall performance Effectively communicate with customer on a regular and timely basis regarding issues impacting the customer and/or their service expectations. Work with 3PL/Warehouse for any damage or lost in transit material. Manage and submit claims as needed Maintain and track claims with carriers/providers, communicate with accounting on credits Work with buyers on hot inbound deliveries that require tracking and communication May be required to quote, book and issue documents for air freight shipments as required Monthly tracking and report freight accrual for all divisions within Arlon Work with Logistics Analyst on SD reports monthly Minimum Required Education, Skills and Experience: Bachelor degree in business administration, logistics, or related field Two (2)+ years of recent related experience Working knowledge of legal regulations Working knowledge of domestic and international freight Proficiency in Incoterm and usage of terminology. Proficiency in Microsoft Office and logistics software experience Strong communication skills in the English language (verbal, written, written, presentation, inter-personal); ability to communicate effectively, both verbally and written, with all levels of the organization and external suppliers and customers Flexibility and availability to work as required by business needs (including, but not limited to, after regular business hours, during holidays, across multiple time zones). Is personally guided by, espouses, communicates, and works with, and through, values of Integrity, Excellence, Inspirational, Teamwork and Accountability (Arlon’s Core Values). Demonstrates strong commitment to organizational goals and acts in the best interest of the company. Additional Education, Skills and Experience (a plus): Understanding of ISO system Working knowledge of Duty Draw back SAP experience Pay Transparency The current pay rate for this position is between $31.00 - $35.00 per hour. Rate of pay will depend on factors such as market conditions and location, job-related knowledge and skills, education, training and experience. If hired, employment will be at will. The Company reserves the right to modify pay, as well as any other discretionary payment or compensation program, at any time. EOE EEO Statement Arlon is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sex, national origin, disability, protected veteran status, or any other protected status in accordance with all applicable laws.", "responsibilities": "The primary function of the position will be to ensure that products move in a timely and efficient manner from the supplier to the end user for both inbound and outbound domestic and international shipments. The individual will ensure that the delivery and supply chain processes for the products are operating smoothly, cost-effectively and safely. Analyze product delivery or supply chain processes to identify or recommend changes. The person will manage route activity including invoicing, electronic bills, shipment tracing and tracking. In addition, the individual will be required to perform freight analysis in conjunction with our 3PL provider to determine the most cost-effective way to complete shipments.  This individual will be responsible for our direct and indirect duty drawback program. Facilitate the shipping of products from one destination to another for all warehouses Arrange transportation and orchestrate deliveries to meet customer demand with little to no delay Receive and coordinate delivery for our buyout products from vendors Takes steps to avoid quality control issues for all shipments Manage activities throughout the order fulfilment and transportation cycle to make sure established deadlines are met Continually reviews freight costs and transportation rates with our 3PL partner to keep costs down Streamline and automate current shipping and transportation processes Maintain databases of logistics information for ocean and small parcel shipments Establish performance measurement KPIs for logistics and transportation Establish and facilitate duty draw back program for Arlon for direct and indirect materials Manage invoicing for Domestic, Ocean and small parcel Establish and streamline processes for international shipments Identify and resolve daily service and scheduling issues; inform and escalate service issues to management as appropriate Maintain timely and professional communication with customer contacts on issues impacting service and overall performance Effectively communicate with customer on a regular and timely basis regarding issues impacting the customer and/or their service expectations. Work with 3PL/Warehouse for any damage or lost in transit material. Manage and submit claims as needed Maintain and track claims with carriers/providers, communicate with accounting on credits Work with buyers on hot inbound deliveries that require tracking and communication May be required to quote, book and issue documents for air freight shipments as required Monthly tracking and report freight accrual for all divisions within Arlon Work with Logistics Analyst on SD reports monthly", "qualifications": {"required": "Bachelor degree in business administration, logistics, or related field Two (2)+ years of recent related experience Working knowledge of legal regulations Working knowledge of domestic and international freight Proficiency in Incoterm and usage of terminology. Proficiency in Microsoft Office and logistics software experience Strong communication skills in the English language (verbal, written, written, presentation, inter-personal); ability to communicate effectively, both verbally and written, with all levels of the organization and external suppliers and customers Flexibility and availability to work as required by business needs (including, but not limited to, after regular business hours, during holidays, across multiple time zones). Is personally guided by, espouses, communicates, and works with, and through, values of Integrity, Excellence, Inspirational, Teamwork and Accountability (Arlon’s Core Values). Demonstrates strong commitment to organizational goals and acts in the best interest of the company.", "preferred": "Understanding of ISO system Working knowledge of Duty Draw back SAP experience"}, "skills": ["Logistics", "Transportation", "Supply Chain", "Freight", "International Shipping", "Domestic Shipping", "Incoterms", "Microsoft Office", "Logistics Software", "ISO", "Duty Drawback", "SAP"], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "Vacation, Sick and Holiday Pay Health Insurance (Medical, Dental, &amp; Vision) 401(k) Retirement Plan with company match Company Sponsored Life Insurance Career Development Support Employee Discounts", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999398448"}