{"jobTitle": "Revenue Enablement Analyst, Commercial Data & Capabilities, Neuromod", "company": {"name": "Boston Scientific", "industry": "Medical Equipment Manufacturing", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,700.00/yr - $191,300.00/yr", "currency": "USD"}, "jobFunction": "Business Development and Health Care Provider", "industry": "Medical Equipment Manufacturing", "description": "<strong>Additional Location(s):</strong> US-CA-Valencia; US-MA-Marlborough; US-MN-Maple Grove<br/><br/><strong>Diversity - Innovation - Caring - Global Collaboration - Winning Spirit - High Performance<br/><br/></strong>At Boston Scientific, we’ll give you the opportunity to harness all that’s within you by working in teams of diverse and high-performing employees, tackling some of the most important health industry challenges. With access to the latest tools, information and training, we’ll help you in advancing your skills and career. Here, you’ll be supported in progressing – whatever your ambitions.<br/><br/>About the role: <br/><br/>Are you a motivated self-starter with a strong work ethic and a passion for driving revenue growth? We are looking for a dynamic and proactive individual to join our team as a Revenue Enablement Analyst within our Neuromodulation division. In this role, you will play a crucial part in driving revenue by creating data and reporting capabilities and leveraging CRM and digital enablement platforms. This is an excellent opportunity for someone who thrives in a fast-paced environment and is eager to make a significant impact on the business.<br/><br/><strong>Your Responsibilities Will Include<br/><br/></strong><ul><li> Business Acumen: Collaborate with stakeholders to identify and understand business needs for data, translate them into use cases, and prioritize a plan based on strategic goals and value. Define key metrics and KPIs to measure performance and health of the business. </li><li> Data and Process Acumen: Help Streamline data flows to create a single source of truth for data. Bring knowledge of the business, process flow and context to data, while understanding the technical aspects of all source systems of data (internal and external). Troubleshoot data flow discrepancies/accuracy and help problem solve data opportunities. </li><li> Technology and Reporting Innovation: Harness existing reporting tools, visualization tools and other technology to craft intuitive analytical reports and insights for field personnel and leadership. Lead the development and implementation of innovative reporting tools and technologies to enhance operational efficiency across the division. </li><li> Salesforce Innovation Leadership: Act as a product owner supporting the development of new Salesforce.com (SFDC) functionalities. Assist with the rollout of new features, ensuring smooth adoption and optimal utilization. </li><li> Digital Capabilities &amp; Automation: Leverage digital tools and platforms to automate and streamline processes. Implement and manage sales enablement technologies to improve sales efficiency and productivity. Help shape Enterprise systems strategy and integrate new digital/AI tools into the existing technology stack. </li><li> Process Improvement: Identify and implement process improvements to optimize process to create efficiencies both for Field sales and commercial back-office functions. Work with cross-functional teams to align processes and ensure consistency across the organization. Develop and document standard operating procedures (SOPs), Data definitions and process maps where applicable </li><li> Project Management and Communication: Exhibit outstanding project management capabilities, ensuring projects are delivered on time and within scope. Communicate effectively with a variety of stakeholders, providing clear and concise updates on status, risks and timelines. Laise with IT partners on key projects to ensure quality product is delivered on time and designed as expected. </li><li> Operational Excellence: Display Sense of urgency in responding to requests by providing timely, accurate, and efficient support for our team and stakeholders. Demonstrate a high level of responsiveness and dedication to the collective success of the team. <br/><br/><br/></li></ul>What we are looking for in you: <br/><br/><strong>Required Qualifications<br/><br/></strong><ul><li> Bachelor’s degree in Business, Finance, Marketing, Data Analytics, or a related field. </li><li> 5+ years of experience in Revenue operations, Sales Ops, sales enablement, or a related function. </li><li> Minimum of 3 years working experience as a data analyst or similar role with experience in data tools like SQL, python, or VBA programing and modelling tools like SAS, Tableau Prep pr Alteryx. </li><li> 2+ year of experience in analytical visualization tools like Tableau, Qlikview or other </li><li> At Least 1-2 years of experience with building and rolling out Salesforce or similar CRM Capabilities </li><li> Expert level experience back-office application skills, including Excel, MS Access etc. </li><li> Excellent interpersonal skills and strong writing and verbal communication skills to work with individuals at all levels of the organization.  </li><li> Desire to work in a high paced collaborative, teamwork-oriented environment.  </li><li> Ability to travel up to 20% domestically. <br/><br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Commercial back-office experience working in Medical Device or Life Sciences industry. </li><li> Knowledge of Boston Scientific commercial systems and process is strong plus. </li><li> 1-2 years of experience with enterprise systems like SAP, Anaplan, Model N, Conga etc. </li><li> Experience in applying statistical modelling and predictive analytics to solve business problems. </li><li> Proven expert level analytical and problem-solving experience.  </li><li> Prior experience in processes mapping and documentation </li><li> Prior experience in implementing AI use cases and other commercial digital platforms. </li><li> Proven experience influencing change. <br/><br/><br/></li></ul>This position is hybrid with preferred location of Valencia CA. Salary range is between $100,700 - $191,300<br/><br/><strong>Requisition ID: </strong>588505<br/><br/>As a leader in medical science for more than 40 years, we are committed to solving the challenges that matter most – united by a deep caring for human life. Our mission to advance science for life is about transforming lives through innovative medical solutions that improve patient lives, create value for our customers, and support our employees and the communities in which we operate. Now more than ever, we have a responsibility to apply those values to everything we do – as a global business and as a global corporate citizen.<br/><br/>So, choosing a career with Boston Scientific (NYSE: BSX) isn’t just business, it’s personal. And if you’re a natural problem-solver with the imagination, determination, and spirit to make a meaningful difference to people worldwide, we encourage you to apply and look forward to connecting with you!<br/><br/>At Boston Scientific, we recognize that nurturing a diverse and inclusive workplace helps us be more innovative and it is important in our work of advancing science for life and improving patient health. That is why we stand for inclusion, equality, and opportunity for all. By embracing the richness of our unique backgrounds and perspectives, we create a better, more rewarding place for our employees to work and reflect the patients, customers, and communities we serve. Boston Scientific is proud to be an equal opportunity and affirmative action employer.<br/><br/>Boston Scientific maintains a prohibited substance free workplace. Pursuant to Va. Code<br/><br/><ul><li>2.2-4312 (2000), Boston Scientific is providing notification that the unlawful manufacture, sale, distribution, dispensation, possession, or use of a controlled substance or marijuana is prohibited in the workplace and that violations will result in disciplinary action up to and including termination.<br/><br/><br/></li></ul>Please be advised that certain US based positions, including without limitation field sales and service positions that call on hospitals and/or health care centers, require acceptable proof of COVID-19 vaccination status. Candidates will be notified during the interview and selection process if the role(s) for which they have applied require proof of vaccination as a condition of employment. Boston Scientific continues to evaluate its policies and protocols regarding the COVID-19 vaccine and will comply with all applicable state and federal law and healthcare credentialing requirements. As employees of the Company, you will be expected to meet the ongoing requirements for your roles, including any new requirements, should the Company’s policies or protocols change with regard to COVID-19 vaccination.", "responsibilities": "Your Responsibilities Will Include<br/><br/>\n<ul><li> Business Acumen: Collaborate with stakeholders to identify and understand business needs for data, translate them into use cases, and prioritize a plan based on strategic goals and value. Define key metrics and KPIs to measure performance and health of the business. </li><li> Data and Process Acumen: Help Streamline data flows to create a single source of truth for data. Bring knowledge of the business, process flow and context to data, while understanding the technical aspects of all source systems of data (internal and external). Troubleshoot data flow discrepancies/accuracy and help problem solve data opportunities. </li><li> Technology and Reporting Innovation: Harness existing reporting tools, visualization tools and other technology to craft intuitive analytical reports and insights for field personnel and leadership. Lead the development and implementation of innovative reporting tools and technologies to enhance operational efficiency across the division. </li><li> Salesforce Innovation Leadership: Act as a product owner supporting the development of new Salesforce.com (SFDC) functionalities. Assist with the rollout of new features, ensuring smooth adoption and optimal utilization. </li><li> Digital Capabilities &amp; Automation: Leverage digital tools and platforms to automate and streamline processes. Implement and manage sales enablement technologies to improve sales efficiency and productivity. Help shape Enterprise systems strategy and integrate new digital/AI tools into the existing technology stack. </li><li> Process Improvement: Identify and implement process improvements to optimize process to create efficiencies both for Field sales and commercial back-office functions. Work with cross-functional teams to align processes and ensure consistency across the organization. Develop and document standard operating procedures (SOPs), Data definitions and process maps where applicable </li><li> Project Management and Communication: Exhibit outstanding project management capabilities, ensuring projects are delivered on time and within scope. Communicate effectively with a variety of stakeholders, providing clear and concise updates on status, risks and timelines. Laise with IT partners on key projects to ensure quality product is delivered on time and designed as expected. </li><li> Operational Excellence: Display Sense of urgency in responding to requests by providing timely, accurate, and efficient support for our team and stakeholders. Demonstrate a high level of responsiveness and dedication to the collective success of the team. <br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s degree in Business, Finance, Marketing, Data Analytics, or a related field. \n5+ years of experience in Revenue operations, Sales Ops, sales enablement, or a related function. \nMinimum of 3 years working experience as a data analyst or similar role with experience in data tools like SQL, python, or VBA programing and modelling tools like SAS, Tableau Prep pr Alteryx. \n2+ year of experience in analytical visualization tools like Tableau, Qlikview or other \nAt Least 1-2 years of experience with building and rolling out Salesforce or similar CRM Capabilities \nExpert level experience back-office application skills, including Excel, MS Access etc. \nExcellent interpersonal skills and strong writing and verbal communication skills to work with individuals at all levels of the organization.  \nDesire to work in a high paced collaborative, teamwork-oriented environment.  \nAbility to travel up to 20% domestically. <br/><br/><br/>", "preferred": "Commercial back-office experience working in Medical Device or Life Sciences industry. \nKnowledge of Boston Scientific commercial systems and process is strong plus. \n1-2 years of experience with enterprise systems like SAP, Anaplan, Model N, Conga etc. \nExperience in applying statistical modelling and predictive analytics to solve business problems. \nProven expert level analytical and problem-solving experience.  \nPrior experience in processes mapping and documentation \nPrior experience in implementing AI use cases and other commercial digital platforms. \nProven experience influencing change. <br/><br/><br/>"}, "skills": ["Salesforce", "SQL", "Python", "VBA", "SAS", "Tableau", "Qlikview", "Excel", "MS Access", "SAP", "Anaplan", "Model N", "Conga"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999332529"}