{"jobTitle": "Junior Project Manager", "company": {"name": "MEDL", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management and Information Technology", "industry": "Technology, Information and Internet", "description": "Our Project Managers work directly with cross-functional internal and external teams to oversee and execute all development aspects of product releases including tracking production, assets and risk identification/mitigation. In this position, you will design, implement, debug, optimize and maintain software including ownership of complete systems and sub-systems. You will create and execute both short-term and long-term strategic development plans for assigned product lines.<br/><br/>This position requires an individual with a keen sense of detail that thrives on collaboration and communication with team members.<br/><br/><strong>What you'll be doing:<br/><br/></strong><ul><li>Coordinate with internal and external stakeholders on product requirements, goals, scope of work and development cycle. </li><li>Determine resources necessary for successful completion of assigned projects. </li><li>Ensure that project goals, objectives, milestones, and deliverables are achieved</li><li>Facilitate consistent and effective communication between developers, account manager and executives. </li><li>Develop trusting business relationships with clients. </li><li>Presenting wireframes, graphics, schedules and estimated costs. </li><li>Counsel clients on mobile and web application best practices. </li><li>Review, analyze and approve development milestones and documentation. </li><li>Exercise strong judgement in analyzing, appraising, evaluating and solving problems of procedural, organizational and/or administrative nature</li><li>Deliver expected results on time, within intended scope and quality, and on budget. </li><li>Consistent ability to manage multiple responsibilities and projects while maintaining objectives. <br/><br/></li></ul><strong>What you already have:<br/><br/></strong><ul><li>Experience with software development processes, project management principles, trends and methodologies, and performance management. </li><li>Experience with Scrum and Jira - extra points if you're a Scrum Master</li><li>Experience developing client relationships; ideally with a mix of entrepreneurial and corporate clients. </li><li>Experience managing teams of varying sizes and delivering products on time, within intended scope, quality and budget. </li><li>Excellent experience in writing detailed product descriptions and specification</li><li>B.S. or equivalent experience<br/><br/></li></ul><strong>What we bring:<br/><br/></strong><ul><li>Medical, Dental and Vision care benefits</li><li>Life Insurance</li><li>401(K)</li><li>Gym allowance</li><li>Flexible schedule and work/life balance</li><li>Vacation and PTO<br/><br/></li></ul><strong>Company Description<br/><br/></strong>MEDL Mobile has helped architect, design, and develop hundreds of mobile apps and technologies alongside a storied list of innovative companies and people. Our apps have reached as high as number one on the app stores. Our technology has been deployed in automobiles, surgical suites, restaurants, financial institutions, Hollywood studios, art studios and on tens of millions of mobile phones around the world.<br/><br/>What makes a MEDL head?<br/><br/>Creative. Resourceful. Skilled. Practical. Dreamer. Doer.<br/><br/>We are incredibly proud of the team of people we've brought together. We like each other. We like our clients. And we love the work that we are privileged to do on a daily basis. We look to hire adults who are capable of taking on an assignment and delivering a result. But we also know that the best solutions come from people with a childlike fascination of technology and what it's capable of doing.<br/><br/>MEDL Mobile has helped architect, design, and develop hundreds of mobile apps and technologies alongside a storied list of innovative companies and people. Our apps have reached as high as number one on the app stores. Our technology has been deployed in automobiles, surgical suites, restaurants, financial institutions, Hollywood studios, art studios and on tens of millions of mobile phones around the world. What makes a MEDL head? Creative. Resourceful. Skilled. Practical. Dreamer. Doer. We are incredibly proud of the team of people we've brought together. We like each other. We like our clients. And we love the work that we are privileged to do on a daily basis. We look to hire adults who are capable of taking on an assignment and delivering a result. But we also know that the best solutions come from people with a childlike fascination of technology and what it's capable of doing.", "responsibilities": "Our Project Managers work directly with cross-functional internal and external teams to oversee and execute all development aspects of product releases including tracking production, assets and risk identification/mitigation. In this position, you will design, implement, debug, optimize and maintain software including ownership of complete systems and sub-systems. You will create and execute both short-term and long-term strategic development plans for assigned product lines.<br/><br/>This position requires an individual with a keen sense of detail that thrives on collaboration and communication with team members.<br/><br/><strong>What you'll be doing:<br/><br/></strong><ul><li>Coordinate with internal and external stakeholders on product requirements, goals, scope of work and development cycle. </li><li>Determine resources necessary for successful completion of assigned projects. </li><li>Ensure that project goals, objectives, milestones, and deliverables are achieved</li><li>Facilitate consistent and effective communication between developers, account manager and executives. </li><li>Develop trusting business relationships with clients. </li><li>Presenting wireframes, graphics, schedules and estimated costs. </li><li>Counsel clients on mobile and web application best practices. </li><li>Review, analyze and approve development milestones and documentation. </li><li>Exercise strong judgement in analyzing, appraising, evaluating and solving problems of procedural, organizational and/or administrative nature</li><li>Deliver expected results on time, within intended scope and quality, and on budget. </li><li>Consistent ability to manage multiple responsibilities and projects while maintaining objectives. <br/><br/></li></ul>", "qualifications": {"required": "Experience with software development processes, project management principles, trends and methodologies, and performance management. Experience with Scrum and Jira - extra points if you're a Scrum Master Experience developing client relationships; ideally with a mix of entrepreneurial and corporate clients. Experience managing teams of varying sizes and delivering products on time, within intended scope, quality and budget. Excellent experience in writing detailed product descriptions and specification B.S. or equivalent experience", "preferred": ""}, "skills": ["Scrum", "Jira", "Project Management", "Software Development", "Client Relationship Management", "Team Management"], "postedDate": "1 week ago", "benefits": "Medical, Dental and Vision care benefits Life Insurance 401(K) Gym allowance Flexible schedule and work/life balance Vacation and PTO", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3999065904"}