{"jobTitle": "Senior Sales Operations Associate", "company": {"name": "Snap Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "107,000.00/yr - 189,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "Snap Inc is a technology company. We believe the camera presents the greatest opportunity to improve the way people live and communicate. Snap contributes to human progress by empowering people to express themselves, live in the moment, learn about the world, and have fun together. The Company’s three core products are Snapchat, a visual messaging app that enhances your relationships with friends, family, and the world; Lens Studio, an augmented reality platform that powers AR across Snapchat and other services; and its AR glasses, Spectacles.<br/><br/>We’re searching for a dynamic Senior Sales Operations Associate to join Team Snap! As a crucial member of our Intelligence &amp; Data Architecture team within Sales Ops, you'll be at the heart of building powerful datasets and dashboards that drive insights and strategies, enhancing our sales processes and performance. You’ll be a critical collaborator with our sellers, sales leaders, and cross-functional partners across Sales Ops, Product Marketing, Finance, and Data Science. The mission? Ensure everyone has the data and insights they need right at their fingertips, and trust they can come to you for support when further analysis is required. In a nutshell, you’ll be an expert in all things data for our revenue organization.<br/><br/>What You'll Do:<br/><br/><ul><li>Design intuitive and impactful dashboards for our sellers, managers, and leadership team to ensure they can make effective, data driven decisions. </li><li>Build and maintain robust data pipelines that feed our sales data warehouse, ensuring seamless data flow and accessibility. </li><li>Work hand-in-hand with our Sales Strategy team to support key initiatives with sharp, actionable insights. </li><li>Evangelize the use of our self-serve datasets through engagement and training with our cross functional stakeholders. </li><li>Monitor the support channel for data warehouse users to help them onboard, resolve data discrepancies, and refine their insights. <br/><br/></li></ul>Knowledge, Skills &amp; Abilities:<br/><br/><ul><li>Advanced knowledge of SQL is a must, experience building data pipelines in Apache Airflow (or similar tool) is a plus. </li><li>Designing and maintaining a data warehouse with a large set of users and stakeholder teams</li><li>Strong skills in data visualization and storytelling to translate complex data into clear, compelling narratives. </li><li>Proficiency with CRM systems like Salesforce. </li><li>Ability to approach problems with a structured, analytical mindset. </li><li>Ability to work independently, juggle multiple projects, and see them through to completion with strong ownership and attention to detail in a fast-paced environment. <br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>4+ years of experience in Business Intelligence/Analytics, Data Engineering, Sales Operations, or a related field, or equivalent experience. </li><li>BA/BS in a quantitative field such as Mathematics, Economics, Finance, Business, or equivalent work experience. <br/><br/></li></ul>If you have a disability or special need that requires accommodation, please don’t be shy and provide us some information.<br/><br/>\"Default Together\" Policy at Snap: At Snap Inc. we believe that being together in person helps us build our culture faster, reinforce our values, and serve our community, customers and partners better through dynamic collaboration. To reflect this, we practice a “default together” approach and expect our team members to work in an office 4+ days per week.<br/><br/>At Snap, we believe that having a team of diverse backgrounds and voices working together will enable us to create innovative products that improve the way people live and communicate. Snap is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification, in accordance with applicable federal, state, and local laws. EOE, including disability/vets.<br/><br/>Our Benefits: Snap Inc. is its own community, so we’ve got your back! We do our best to make sure you and your loved ones have everything you need to be happy and healthy, on your own terms. Our benefits are built around your needs and include paid parental leave, comprehensive medical coverage, emotional and mental health support programs, and compensation packages that let you share in Snap’s long-term success!<br/><br/><strong>Compensation<br/><br/></strong>In the United States, work locations are assigned a pay zone which determines the salary range for the position. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. The starting pay may be negotiable within the salary range for the position. These pay zones may be modified in the future.<br/><br/>Zone A (CA, WA, NYC):<br/><br/>The base salary range for this position is $126,000-$189,000 annually.<br/><br/>Zone B:<br/><br/>The base salary range for this position is $120,000-$179,000 annually.<br/><br/>Zone C:<br/><br/>The base salary range for this position is $107,000-$161,000 annually.<br/><br/>This position is eligible for equity in the form of RSUs.", "responsibilities": "Design intuitive and impactful dashboards for our sellers, managers, and leadership team to ensure they can make effective, data driven decisions. \nBuild and maintain robust data pipelines that feed our sales data warehouse, ensuring seamless data flow and accessibility. \nWork hand-in-hand with our Sales Strategy team to support key initiatives with sharp, actionable insights. \nEvangelize the use of our self-serve datasets through engagement and training with our cross functional stakeholders. \nMonitor the support channel for data warehouse users to help them onboard, resolve data discrepancies, and refine their insights.", "qualifications": {"required": "4+ years of experience in Business Intelligence/Analytics, Data Engineering, Sales Operations, or a related field, or equivalent experience. \nBA/BS in a quantitative field such as Mathematics, Economics, Finance, Business, or equivalent work experience.", "preferred": "Advanced knowledge of SQL is a must, experience building data pipelines in Apache Airflow (or similar tool) is a plus. \nDesigning and maintaining a data warehouse with a large set of users and stakeholder teams\nStrong skills in data visualization and storytelling to translate complex data into clear, compelling narratives. \nProficiency with CRM systems like Salesforce. \nAbility to approach problems with a structured, analytical mindset. \nAbility to work independently, juggle multiple projects, and see them through to completion with strong ownership and attention to detail in a fast-paced environment."}, "skills": ["SQL", "Apache Airflow", "Data Visualization", "Storytelling", "Salesforce"], "postedDate": "1 week ago", "benefits": "Snap Inc. is its own community, so we’ve got your back! We do our best to make sure you and your loved ones have everything you need to be happy and healthy, on your own terms. Our benefits are built around your needs and include paid parental leave, comprehensive medical coverage, emotional and mental health support programs, and compensation packages that let you share in Snap’s long-term success!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999544738"}