{"jobTitle": "Executive Assistant", "company": {"name": "Confidential", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Art/Creative and Project Management", "industry": "Architecture and Planning, Design Services, and Community Development and Urban Planning", "description": "<u>Executive Assistant to Partners of Prestigious Architecture Firm </u>\nLocation: Playa Del Rey\n$85,000-$90,000 + paid OT + bonus + excellent benefits\n<br/>\nOur client, a prestigious architecture firm located on the Westside, is seeking an exceptional, polished, and driven Executive Assistant to support the founder and partner of this organization. The Executive Assistant will be skilled at booking travel arrangements, client communication, and coordinating the Partners’ calendars. This is an amazing opportunity for a candidate with strong communication, writing, and scheduling skills.\n<br/>\n**Responsibilities include:**\n<ul>\n<li>All travel arrangements and scheduling with partner while traveling as well as project team</li>\n<li>Personal vacation arrangements for the partners</li>\n<li>Maintain and updating calendars (in Outlook, Mobile device/iPhone and pocket calendar)</li>\n<li>Meet with executive assistants to update calendars and review architectural and other project status</li>\n<li>Schedule appointments (professional and personal)</li>\n<li>Discuss with staff to arrange meetings</li>\n<li>Interact with client’s correspondence with clients</li>\n<li>Need to have knowledge of all projects, clients, past projects, archives travel and hotel arrangements for visiting clients</li>\n<li>Meeting coordination and set-up</li>\n<li>Organization and maintaining all filing</li>\n<li>Available to answer phone/emails over the weekend</li>\n</ul>\n<br/>\n**Experience and Skills:**\n<ul>\n<li>Prior experience in a personal/executive assistant role</li>\n<li>Must have strong communication and written skills</li>\n<li>Seeking someone who is skilled in scheduling</li>\n<li>Bachelor’s degree required</li>\n</ul>\n<br/>\n<em><strong>You can use WorkGrades to collect and manage your references for free and share them with us or anyone else you choose by visiting workgrades.com/home/candidate. Candidates with references are always preferred by our clients. Now is the most important time to stand out from the crowd. We suggest that you ensure you have updated your LinkedIn profile and that you start collecting your references early.</strong></em>\n<br/>\n<em>We will consider employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring.</em>", "responsibilities": "All travel arrangements and scheduling with partner while traveling as well as project team, Personal vacation arrangements for the partners, Maintain and updating calendars (in Outlook, Mobile device/iPhone and pocket calendar), Meet with executive assistants to update calendars and review architectural and other project status, Schedule appointments (professional and personal), Discuss with staff to arrange meetings, Interact with client’s correspondence with clients, Need to have knowledge of all projects, clients, past projects, archives travel and hotel arrangements for visiting clients, Meeting coordination and set-up, Organization and maintaining all filing, Available to answer phone/emails over the weekend", "qualifications": {"required": "Prior experience in a personal/executive assistant role, Must have strong communication and written skills, Seeking someone who is skilled in scheduling, Bachelor’s degree required", "preferred": ""}, "skills": ["Communication", "Scheduling"], "postedDate": "1 week ago", "benefits": "paid OT + bonus + excellent benefits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999368055"}