{"jobTitle": "Marketing Coordinator", "company": {"name": "Draft Note Design", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$20.50 - $31.50", "currency": "USD"}, "jobFunction": "Marketing and Other", "industry": "Marketing Services", "description": "<strong>About Draft Note Design<br/><br/></strong>At Draft Note Design, we are more than just an architecture firm; we are visionaries, artists, and dream-weavers. With a passion for creating spaces that transcend the ordinary, we believe that every structure should tell a unique story. Our team of innovative architects and designers collaborates tirelessly to transform your dreams into breathtaking realities.<br/><br/><strong>Job Description<br/><br/></strong><strong>Draft Note</strong> is seeking a creative and highly organized Marketing Coordinator to join our team. The Marketing Coordinator will be responsible for developing and implementing marketing strategies, coordinating marketing activities, and supporting the overall marketing efforts of the company. This role requires excellent communication skills, attention to detail, and the ability to manage multiple projects simultaneously.<br/><br/><strong>Pay<br/><br/></strong>$20.50 - $31.50 per hour<br/><br/><strong>Job<br/><br/></strong>Full time<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Develop and implement marketing plans and campaigns to achieve business objectives.</li><li>Coordinate and manage marketing projects, ensuring they are completed on time and within budget.</li><li>Create and edit marketing materials, including brochures, newsletters, and social media content.</li><li>Conduct market research to identify trends and opportunities.</li><li>Monitor and report on the effectiveness of marketing campaigns and initiatives.</li><li>Collaborate with internal teams and external partners to execute marketing activities.</li><li>Manage the company’s social media presence and online reputation.</li><li>Plan and coordinate events, including trade shows, conferences, and promotional events.</li><li>Assist with the creation of marketing presentations and proposals.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor’s degree in Marketing, Business, Communications, or a related field.</li><li>Proven experience as a Marketing Coordinator or in a similar role.</li><li>Strong written and verbal communication skills.</li><li>Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint) and marketing software.</li><li>Experience with social media platforms and digital marketing tools.</li><li>Excellent organizational and multitasking abilities.</li><li>Creative thinking and problem-solving skills.</li><li>Ability to work collaboratively in a team environment.<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Competitive weekly salary, commensurate with experience and qualifications.</li><li>Comprehensive benefits package including health insurance, dental coverage, and retirement plans.</li><li>Paid time off and holidays.</li><li>Opportunities for professional development and growth within the company.</li></ul>", "postedDate": "6 days ago", "skills": ["Marketing", "Social Media", "Digital Marketing", "Microsoft Office", "Communication", "Project Management", "Market Research", "Event Planning", "Creative Thinking", "Problem Solving", "Teamwork"], "url": "https://www.linkedin.com/jobs/view/3999663764"}