{"jobTitle": "Operations/Project Management - Business Systems Analyst III", "company": {"name": "Global Pharma Tek", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology and Manufacturing", "industry": "IT Services and IT Consulting, Manufacturing, and Food and Beverage Manufacturing", "description": "About the Company: Global Pharmatek was established in 2011 as a conglomerate offering a wide range of services to the pharmaceutical industry. Our areas of expertise include Workforce, Trading and Distribution of Pharmaceutical Raw materials, and Drug Development. We pride ourselves on providing comprehensive support throughout the drug development process, encompassing services such as Clinical Research, Contract Research, Contract Development and Manufacturing, and serving as a reliable sourcing partner for Pharma materials. Additionally, we assist companies of all sizes with their hiring needs.<br/>About the Role: Client is seeking a highly skilled and experienced Business Systems Analyst (BSA) Consultant to support our manufacturing operations. The ideal candidate will have a strong background in Manufacturing Operations, including Engineering, Quality Assurance, Manufacturing Operations, and Environmental Health & Safety (EHS). The BSA Consultant will play a critical role in the discovery, requirements gathering, and analysis phases of our projects, working closely with business leaders to identify opportunities for improvement and implement effective solutions. Additionally, the BSA will be responsible for ongoing project communications, developing quality plans, use cases, coordinating User Acceptance Testing (UAT) and sign-off, and handling deployment communications.<br/>Responsibilities: Discovery and Requirements Gathering: Lead the discovery process to understand business needs, objectives, and pain points across Engineering, Quality Assurance, Manufacturing Operations, and EHS departments.Solution Implementation: Develop and recommend solutions to optimize manufacturing operations, enhance quality assurance, and ensure compliance with EHS standards.Ongoing Project Communications: Facilitate ongoing communications between business partners and development teams to ensure alignment and transparency throughout the project lifecycle.Quality Plans and Use Cases: Develop comprehensive quality plans and use cases to guide project development and ensure that solutions meet business requirements.UAT Coordination: Coordinate User Acceptance Testing (UAT) activities, including planning, execution, and obtaining sign-off from stakeholders.Deployment Communications: Manage communications related to the deployment of new systems and enhancements, ensuring all stakeholders are informed and prepared for changes.Data Analysis: Conduct data analysis and generate reports to support decision-making processes and continuous improvement initiatives.Industry Best Practices: Stay updated on industry trends and best practices in manufacturing operations, engineering, quality assurance, and EHS.Project Participation: Participate in project planning, execution, and monitoring to ensure timely and successful project delivery.<br/>Qualifications: Bachelor’s degree in Industrial Engineering, Systems Engineering, Process Improvement, or a related field. Advanced degree preferred.Minimum of 3+ years of experience as a Business Systems Analyst in a Manufacturing environment. Senior the better. Should be plug and play. I am assuming 4C/4D.Strong understanding of manufacturing operations, engineering principles, quality assurance processes, and EHS standards.Proven experience in process analysis, improvement, and optimization.Proficient in data analysis, with the ability to interpret and present data effectively.Excellent problem-solving skills and attention to detail.Experience with ERP systems, manufacturing software, and other relevant business applications.Knowledge of Lean Manufacturing, Six Sigma, or other process improvement methodologies is a plus.", "responsibilities": "Lead the discovery process to understand business needs, objectives, and pain points across Engineering, Quality Assurance, Manufacturing Operations, and EHS departments.Develop and recommend solutions to optimize manufacturing operations, enhance quality assurance, and ensure compliance with EHS standards.Facilitate ongoing communications between business partners and development teams to ensure alignment and transparency throughout the project lifecycle.Develop comprehensive quality plans and use cases to guide project development and ensure that solutions meet business requirements.Coordinate User Acceptance Testing (UAT) activities, including planning, execution, and obtaining sign-off from stakeholders.Manage communications related to the deployment of new systems and enhancements, ensuring all stakeholders are informed and prepared for changes.Conduct data analysis and generate reports to support decision-making processes and continuous improvement initiatives.Stay updated on industry trends and best practices in manufacturing operations, engineering, quality assurance, and EHS.Participate in project planning, execution, and monitoring to ensure timely and successful project delivery.", "qualifications": {"required": "Bachelor’s degree in Industrial Engineering, Systems Engineering, Process Improvement, or a related field. Advanced degree preferred.Minimum of 3+ years of experience as a Business Systems Analyst in a Manufacturing environment. Senior the better. Should be plug and play. I am assuming 4C/4D.Strong understanding of manufacturing operations, engineering principles, quality assurance processes, and EHS standards.Proven experience in process analysis, improvement, and optimization.Proficient in data analysis, with the ability to interpret and present data effectively.Excellent problem-solving skills and attention to detail.Experience with ERP systems, manufacturing software, and other relevant business applications.", "preferred": "Knowledge of Lean Manufacturing, Six Sigma, or other process improvement methodologies is a plus."}, "skills": ["Manufacturing Operations", "Engineering", "Quality Assurance", "EHS", "Process Analysis", "Process Improvement", "Data Analysis", "ERP Systems", "Manufacturing Software", "Lean Manufacturing", "Six Sigma"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999827497"}