{"jobTitle": "Entry Level Sales", "company": {"name": "Spieldenner Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Spieldenner Financial Group is seeking independent, motivated, career-minded individuals to join our Mortgage Protection team. Our team members help American families protect their largest asset: the ability to make an income.<br/><br/>Our proven system includes extraordinary mentorship, training, and support that allows our agents to have a competitive edge in the industry.<br/><br/>Job Duties:<br/><br/><ul><li>Setting Appointments: 6-8 hours per week: reaching out to potential clients that have previously requested coverage with our company and scheduling a time to meet with them to discuss their mortgage protection coverage</li><li>Research: 4-5 hours per week: digging into the information the client provided in order to customize options to meet their financial need in the case of a death or disability</li><li>Meeting with Families: 2 days per week: meeting with clients either virtually or in-person (the choice is yours) to present their options, discuss the details of the coverage, and help them apply for coverage</li><li>Administrative: 2 hours per week: following up with insurance carriers to facilitate client applications through underwriting<br/><br/></li></ul>Qualifications:<br/><br/>We are looking for coachable, challenge-seeking, self-disciplined individuals with a growth mindset: Skill set isn’t everything for this position.<br/><br/>Availability:<br/><br/>Work-life balance is the foundation on which this company was founded. This work from home role is designed to give you a healthy balance of the two. We have immediate openings for the following roles:<br/><br/><ul><li>Spare time: This is a commitment of working 4-8 hours a week that can generate between $500 to $2,000 per month.*</li><li>Part-time: This is a commitment of working 8-25 hours a week that can generate between $2,000 to $5,000 per month.*</li><li>Full-Time: This is a true commitment and requires 25-50 hours per week that can generate between $10,000 to $20,000 per month.*<br/><br/></li></ul>About Us:<br/><br/>Spieldenner Group is a part of the fastest-growing insurance organization in the country.<br/><br/>Among the INC 5000s fastest-growing private companies.<br/><br/>Voted Top Company Culture by Entrepreneur Magazine<br/><br/>If this sounds like a place you could plant your flag, we invite you to apply!<br/><br/><ul><li>Equal opportunity, not equal outcome<br/><br/></li></ul>No agent’s success, earnings, or production results should be viewed as typical, average, or expected. Not all agents achieve the same or similar results, and no particular results are guaranteed. Your level of success will be determined by several factors, including the amount of work you put in, your ability to successfully follow and implement our training and sales system, and the insurance needs of the customers in the geographic areas in which you choose to work.<br/><br/>Powered by JazzHR<br/><br/>4bBI3VhZvD", "postedDate": "1 week ago", "salary": {"amount": "10,000.00/yr - 20,000.00/yr", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3999426179"}