{"jobTitle": "Legal Counsel, Labor & Employment", "company": {"name": "Red Bull", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "152,000 to $168,000", "currency": "USD"}, "jobFunction": "Legal", "industry": "Food and Beverage Services", "description": "Red Bull North America is looking for an attorney to advise on Labor & Employment matters. This attorney will report to the Sr. Legal Counsel, Labor & Employment and support a broad scope of employment-related activities. You will identify and analyze legal issues, drafting key documents, presenting clear recommendations, and assuring legal compliance.<br/><br/><strong>All the responsibilities we'll trust you with:<br/><br/></strong><strong>Labor & Employment Law<br/><br/></strong>Provide advice on the full range of labor and employment law issues, including hiring, leave and accommodation, discipline, terminations, compliance, and compensation and benefits. Review and provide guidance on drafting and development of employment and HR-related policies and procedures. Provide advice and counsel regarding potentially high exposure terminations and investigations, employment litigation, administrative claims, and government audits. Draft and present trainings on labor and employment issues. Negotiate, draft, and interpret agreements that involve labor and employment issues.<br/><br/><strong>Internal Resource<br/><br/></strong>Research and provide early assessment of facts and law to communicate associated risks to internal clients and colleagues in the Legal Department. You will support Red Bull internal compliance efforts. Provide first level support on labor and employment questions from department lawyers. Maintain regular communication and report on significant employment law updates with internal clients.<br/><br/><strong>Your areas of knowledge and expertise that matter most for this role:<br/><br/></strong><ul><li>Juris Doctor Degree from an accredited law school</li><li>2 years of relevant experience at a top-tier law firm, in-house at a comparable company, or some combination thereof</li><li>Current member in good standing, or registered in-house counsel, with the California bar</li><li>Experience providing advice and counsel on labor and employment law topics</li><li>Experience with employment litigation</li></ul><li></li><li><br/><br/></li>The base salary range for this position is $152,000 to $168,000 + cash incentives Actual salary offer may vary based on work experience. The base pay range is subject to change and may be modified in the future.<br/><br/>Our current Benefits include:<br/><br/>Comprehensive Medical, Dental and Vision Plans, 401k Match, Family Leave, PTO & Paid Holiday Schedule, Pet, Legal, and Life Insurance, Tuition Reimbursement (Benefits listed may vary depending on the nature of your employment and/or work location)<br/><br/>Red Bull North America, Inc. is an Equal Opportunity Employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, veteran status, age, or any other classification protected by Federal, state, or local law. We will consider for employment all qualified Applicants, including those with Criminal Histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.", "postedDate": "1 week ago", "benefits": "Comprehensive Medical, Dental and Vision Plans, 401k Match, Family Leave, PTO & Paid Holiday Schedule, Pet, Legal, and Life Insurance, Tuition Reimbursement (Benefits listed may vary depending on the nature of your employment and/or work location)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999964470"}