{"jobTitle": "Executive Assistant - Remote", "company": {"name": "Get.It Recruit - Administrative", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Human Resources Services", "description": "Are you an organizational wizard with a knack for multitasking? We're on the lookout for a proactive and self-driven Executive Assistant to provide stellar administrative support to our leadership team from the comfort of your home. This role is ideal for someone who excels in a fast-paced setting and boasts top-notch communication and organizational skills.<br/><br/><strong>What You Will Do<br/><br/></strong>Manage Calendars: Keep the executives' schedules streamlined and up-to-date, ensuring all meetings and appointments are scheduled with precision.<br/><br/>Travel Coordination: Take charge of all travel logistics, including flights, accommodations, ground transportation, and comprehensive travel itineraries to ensure seamless journeys.<br/><br/>Document Preparation: Craft, edit, and manage correspondence, presentations, and reports, prioritizing accuracy and a professional touch.<br/><br/>Meeting Facilitation: Attend key meetings, capture detailed notes, and track action items to ensure follow-through.<br/><br/>Project Support: Aid in project oversight by tracking deadlines, monitoring developments, and communicating updates effectively.<br/><br/>Confidentiality: Handle sensitive information with the highest degree of integrity and confidentiality.<br/><br/>Communication Hub: Serve as the primary contact for internal and external stakeholders, managing communications with promptness and professionalism.<br/><br/><strong>Who You Are<br/><br/></strong>Experienced: You have a solid background as an Executive Assistant, Virtual Assistant, or in a similar role.<br/><br/>Multitasker: Excellent time management abilities with a proven track record of effectively juggling multiple tasks.<br/><br/>Detail-Oriented: Your attention to detail is unmatched, and your organizational skills are top-notch.<br/><br/>Tech-Savvy: Proficient with Microsoft Office Suite, Google Suite, and familiar with various project management tools.<br/><br/>Communicator: You possess outstanding verbal and written communication skills.<br/><br/>Independent: Capable of working independently in a remote setting with minimal supervision.<br/><br/>Professional: You maintain a high level of professionalism and integrity at all times.<br/><br/>If you're a detail-oriented and efficient professional eager for a remote role where you can make a significant impact supporting dynamic leadership, we encourage you to apply to become an integral part of our team.<br/><br/>Employment Type: Full-Time", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3999365001"}