{"jobTitle": "Territory Account Executive", "company": {"name": "DoorDash", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "44.10—$64.90", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "About The Team<br/><br/>The Outside Sales team has been the face of DoorDash to our merchant partners since our founding in 2013. Stationed locally, this team creates deep partnerships with the most coveted local and regional restaurants in any given geography. Our Outside Sales team is the revenue driving arm of DoorDash and ensures the growth of our SMB partnerships which help strengthen operations, accelerate consumer growth, and improve our bottom line.<br/><br/>About The Role<br/><br/>As a Regional Merchant Lead (Outside Sales Representative), you'll join a team of experienced sales professionals who have excelled in the art of leading deliberate sales processes. You'll be focused on new restaurant acquisition with a transactional deal cycle and bringing on the best local and regional restaurants onto the DoorDash platform. In this role you will prospect, meet with, and close partnerships with these restaurants – selling new products and services to them while also uncovering their pain points. You’ll report into our sales leadership, you'll have direct access to all you'll need to grow your career to the next level. This is a hybrid role with some time traveling in the region meeting with merchants and some time remote. In addition, this role will require the ability to travel as needed for in-person collaboration through trainings, offsites, team-building events, and other business related necessity.<br/><br/>You're Excited About This Opportunity Because You Will…<br/><br/>\n<ul><li>Have a passion for SMB businesses and the restaurant industry</li><li>Sell restaurant owners on the value of partnering with DoorDash and negotiate revenue share agreements</li><li>Excel in a transactional deal cycle and closing new business within days</li><li>Use creative strategies in sales processes and prospect outreach</li><li>Share on-the-ground insights with sales leadership and operations team</li><li>Mentor teammates on how to be the best version of themselves after establishing yourself in the role</li><li>Travel into different markets and meet with restaurant owners (hybrid role with up to 50% travel)<br/><br/></li></ul>We're Excited About You Because…<br/><br/>\n<ul><li>You have 2+ years of experience in a closing sales role</li><li>You excel in a transactional deal cycle</li><li>You have experience exceeding goals</li><li>You have experience selling multi-product solutions</li><li>You approach challenges from the fundamentals</li><li>You express creative sales tactics to engage with prospects</li><li>You have experience using a CRM (Salesforce) and Google Apps<br/><br/></li></ul>We use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on June 20, 2024.<br/><br/>Please see the independent bias audit report covering our use of Covey here.<br/><br/>Compensation<br/><br/>Actual compensation within the pay range listed below will be decided based on factors including, but not limited to, skills, prior relevant experience, and specific work location. Base salary is localized according to employee work location.<br/><br/>In addition to base salary, the compensation for this role includes opportunities for equity grants and sales commission. The estimated pay range for this position represents total on-target earnings (including base salary and on-target incentive pay). Talk to your recruiter for more information.<br/><br/>DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefit and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match and a mental health program, among others.<br/><br/>To learn more about our benefits, visit our careers page here.<br/><br/>The base pay for this position ranges from our lowest geographical market up to our highest geographical market within California, Colorado, District of Columbia, Hawaii, New Jersey, New York and Washington.<br/><br/>$44.10—$64.90 USD<br/><br/>About DoorDash<br/><br/>At DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users—from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods.<br/><br/>DoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees’ happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.<br/><br/>Our Commitment to Diversity and Inclusion<br/><br/>We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.<br/><br/>Statement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on “protected categories,” we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce – people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.<br/><br/>If you need any accommodations, please inform your recruiting contact upon initial connection.", "responsibilities": "Have a passion for SMB businesses and the restaurant industry\nSell restaurant owners on the value of partnering with DoorDash and negotiate revenue share agreements\nExcel in a transactional deal cycle and closing new business within days\nUse creative strategies in sales processes and prospect outreach\nShare on-the-ground insights with sales leadership and operations team\nMentor teammates on how to be the best version of themselves after establishing yourself in the role\nTravel into different markets and meet with restaurant owners (hybrid role with up to 50% travel)", "qualifications": {"required": "You have 2+ years of experience in a closing sales role\nYou excel in a transactional deal cycle\nYou have experience exceeding goals\nYou have experience selling multi-product solutions\nYou approach challenges from the fundamentals\nYou express creative sales tactics to engage with prospects\nYou have experience using a CRM (Salesforce) and Google Apps", "preferred": ""}, "skills": ["Sales", "CRM", "Google Apps", "Restaurant Industry", "SMB", "Negotiation", "Deal Cycle", "Prospecting", "Outreach", "Sales Leadership", "Mentoring", "Travel"], "postedDate": "1 week ago", "benefits": "DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefit and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match and a mental health program, among others.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3999827069"}