{"jobTitle": "Supply Chain Analyst", "company": {"name": "Shimano North America Holding, Inc.", "industry": "Sporting Goods Manufacturing", "size": "Not specified", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Manufacturing", "industry": "Sporting Goods Manufacturing", "description": "Bike Division\n\nShimano North America Holding, Inc. is a global company offering the world's sporting community top labels and brands, including Shimano, G. Loomis, Power Pro, and Lazer Sports.\n\nWe are seeking a Supply Chain Analyst to join our Irvine, CA team! At Shimano, we welcome your talent, innovation, and enthusiasm.\n\nWe offer an exceptional array of employee benefits and incentives and are proud to support our employees' health and happiness. We offer paid time off, medical, dental, vision, employer-matching 401k, wellness incentives, a fully equipped on-site gym, rideshare, and much more.\n\nJob Summary\n\nThe Supply Chain Analyst is responsible for developing a consensus market-driven demand and inventory plan based on input from sales, product, and marketing teams supporting the company's financial objectives. Review and update demand forecasts, production, and inventory plans frequently (every two-four weeks) to ensure product availability, serviceability, and inventory health targets are met. Reports to the division Senior Supply Chain Manager responsible for managing inventory for specific product ranges across multiple distribution centers/warehouses.", "responsibilities": "Utilize historical demand data to develop demand plans for review with the cross-functional management team as part of the SOP process and submit POs to the factory. Development of supply plan through execution of SOP plan with Demand Planning team in Supply Chain. Creation of an inventory management plan based on safety stock strategies to meet inventory serviceability and health targets. Ongoing measurement and reporting of forecast accuracy and inventory serviceability/availability. Develop a detailed understanding of purchasing process from the company's worldwide manufacturing locations. Creating and reporting on a 12-month rolling production forecast based on a demand plan. Identifying and reporting inventory risks and opportunities that require sales, product, and/or marketing attention and action plans to address. Manage appropriate inventory levels across multiple distribution locations through purchases and inter-company inventory transfers. Ongoing process improvement and development to improve planning efficiencies across multi-functional teams. Timely management of item master information for product categories assigned, including item creation and maintenance. Visit with external sales force and retail customer base as required.", "qualifications": {"required": "Equivalent work experience can be considered in lieu of education. Three years' experience in inventory planning or purchasing in a consumer packaged goods environment. Experience in or knowledge of bicycle retail environment and/or bicycle enthusiast is a big plus. Strong analytical and communication skills are required. Ability to work independently and within a team framework in a flat organization is imperative. MS Office skills required. Strong Excel skills preferred. JD Edwards or other ERP software knowledge is a plus. Demantra or other similar planning software is also a plus.", "preferred": "Bachelor's degree in Business, Statistics, Mathematics, Supply Chain, Finance, or related field preferred."}, "skills": ["Analytical skills", "Communication skills", "MS Office", "Excel", "ERP software knowledge", "Planning software knowledge"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Paid time off, medical, dental, vision, employer-matching 401k, wellness incentives, a fully equipped on-site gym, rideshare, and much more.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3999936130"}