{"jobTitle": "Social Media Coordinator", "company": {"name": "Edit Media Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Marketing Services", "description": "The Edit is a female-founded creative social media agency that builds lifestyle, beauty, celebrity & fashion brands and personalities into trending and relevant household names. Our roster includes: Disney, Poosh, Florence by Millie Bobby Brown, Riverdale star Madelaine Petsch, Auberge Resorts and more.\n\nRole Description\nThis is a full-time hybrid role as a Social Media Coordinator at Edit Media Group in Los Angeles, CA. The role involves overseeing the social media strategies, content development, and community engagement for several health / wellness clients on our roster.\n\nResponsibilities \n\n* Assist in developing, implementing, and managing our social media strategy.\n* Create, curate, and schedule engaging content for various social media platforms, including Facebook, Instagram, Twitter, LinkedIn, TikTok, and Pinterest.\n* Monitor and respond to comments, messages, and mentions in a timely and professional manner.\n* Analyze social media metrics and create reports to track performance, growth, and engagement.\n* Stay up-to-date with the latest social media trends, tools, and best practices.\n* Collaborate with the marketing team to ensure brand consistency and align social media efforts with overall marketing goals.\n* Assist in planning and executing social media campaigns and contests.\n* Support in managing social media advertising campaigns.\n* Participate in brainstorming sessions and contribute creative ideas for content and campaigns.", "postedDate": "6 days ago", "skills": ["Social Media", "Content Creation", "Community Management", "Social Media Marketing", "Social Media Strategy", "Social Media Analytics", "Marketing", "Content Curation", "Social Media Advertising", "Social Media Engagement"], "url": "https://www.linkedin.com/jobs/view/3999633176"}