{"jobTitle": "Payroll and Accounting Clerk", "company": {"name": "HRx Services LLC", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "30/hour"}, "jobFunction": "Accounting/Auditing and Finance", "industry": "Human Resources Services", "description": "<strong>Join APL as a Payroll and Accounting Clerk to support our finance team, handle payroll, and ensure precise financial records for smooth business operations!<br/><br/></strong>Athletic Propulsion Labs (APL), founded in 2009, is globally recognized as the world leader in Men’s and Women’s luxury performance footwear. Rooted in technology and innovation, APL has been at the forefront of performance footwear since the introduction of the Concept 1 basketball shoe featuring groundbreaking Load N’ Launch® technology, designed to instantly increase vertical leap. As a result, the Concept 1 became the first shoe banned by the NBA for performance enhancement reasons. Beginning in June 2014, APL pioneered the “luxury performance” segment of the athletic footwear market in connection with the launch of its running and training shoe collections for men and women. Today, the combination of APL’s world-class patented technologies and its unique, innovative design. symbolizing the intersection of luxury and performance, has enabled APL to be carried in the finest luxury retailers in the world including at the APL Flagship Experiences in Los Angeles and New York. Visit our website to learn more: https://www.athleticpropulsionlabs.com/<strong> Compensation: $30/hour</strong><strong> What Will You Do: </strong>The Payroll and Book-keeper associate at APL is responsible for assistant Finance manager in all assigned accounting function, include, accounts payable, accounts receivable, payroll processing, insurance enrollments/termination, and insurance reconciliation.<br/><br/><strong>Essential Duties And Major Responsibilities<br/><br/></strong>Accounting and Finance Duties<br/><br/><ul><li>Assist Finance Manager with accounting duties. </li><li>Assist with accounts payable - this includes receiving and entering invoices and making timely payments. </li><li>Entering credit card transactions. </li><li>Assist in account receivable functions including invoicing, deposits, collections. </li><li>Confirms cash and credit cards deposits are made into bank. </li><li>Researching any discrepancies in accounting. </li><li>Conduct reconciliation of all accounts on an as needed basis. </li><li>Assist with maintaining and balancing the general ledger in an accurate, complete, and up-to-date manner. <br/><br/></li></ul>Compliance, Payroll, and Insurance Duties<br/><br/><ul><li>Enroll and terminate all employees in benefits, process new hire paperwork and work with carriers and insurance broker to ensure compliance with benefits and offboarding requirements. </li><li>Notify insurance broker of new hires, terminations, and notify COBRA vendor of new hires/terminations.</li><li>Onboard employees in payroll system. </li><li>Process payroll weekly and bi-monthly. </li><li>Understanding of employee/employer law for California and New York. </li><li>Interpret and apply HR policies, rules, and regulations to all work in order to ensure compliance with applicable standards. </li><li>Assist with other duties as assigned. <br/><br/></li></ul>Administrative and Support Duties<br/><br/><ul><li>Provides support for the owners of the company. </li><li>Creates and maintain filing system for all invoices, bills, and company documents. </li><li>Completes other tasks to run small businesses efficiently. </li><li>Follows company processes.<br/><br/></li></ul><strong>Education And Experience Needed To Be Successful<br/><br/></strong><ul><li>High school diploma or equivalent is required. </li><li>Associates degree in accounting is preferred. </li><li>2+ years of experience in general accounting to include accounts payable, accounts receivable, inventory and account reconciliation is required. </li><li>Direct experience with QuickBooks Desktop &amp; Payroll processor, Gusto, preferred.<br/><br/></li></ul><strong>Specialized Skills<br/><br/></strong><ul><li>Intermediate knowledge of spreadsheets and formulas to record financial data. </li><li>Intermediate knowledge of MS Excel and basic MS Office. </li><li>Demonstrated numeracy and basic mathematical skills as they routinely work with numbers. While communicating numeric data and sharing reports with accountants or other business stakeholders </li><li>Use of critical thinking to solve problems and overcome challenges, to interpret the meaning of records, identify trends, and patterns and irregularities in accounting transactions. </li><li>Strong attention to detail for handling company’s financial data. </li><li>Must have proficient skills with QuickBooks, accounting GAAP principles, and general office skills. </li><li>Must have experience in payroll and compliance. </li><li>Can work independently.</li><li>Must be able to multitask and complete jobs in a timely manner. <br/><br/></li></ul>Powered by JazzHR", "responsibilities": "The Payroll and Book-keeper associate at APL is responsible for assistant Finance manager in all assigned accounting function, include, accounts payable, accounts receivable, payroll processing, insurance enrollments/termination, and insurance reconciliation.", "qualifications": {"required": "High school diploma or equivalent is required. \nAssociates degree in accounting is preferred. \n2+ years of experience in general accounting to include accounts payable, accounts receivable, inventory and account reconciliation is required. \nDirect experience with QuickBooks Desktop & Payroll processor, Gusto, preferred.", "preferred": "Associates degree in accounting"}, "skills": ["QuickBooks", "Payroll", "Accounting", "Accounts Payable", "Accounts Receivable", "Excel", "MS Office", "Compliance", "Insurance", "General Ledger", "HR", "Benefits", "Filing", "QuickBooks Desktop", "Gusto"], "postedDate": "1 week ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3999028904"}