{"jobTitle": "Customer Care Agent", "company": {"name": "Dermalogica", "location": "Carson, CA"}, "location": "Carson, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Personal Care Product Manufacturing", "description": "<strong>Who We Are<br/><br/></strong>Dermalogica stands tall as a beacon in the professional skincare realm, winning the trust of skin therapists across the globe. As a shining gem in the crown of the Unilever Prestige family, our commitment isn't just to nurture skin, but also to redefine industry standards with revolutionary skincare innovations. With a commitment to innovation, sustainability, and excellence, Dermalogica has been at the forefront of the skincare industry for over three decades. Bolstered by our International Dermal Institute – the apex of post-graduate skin and body therapy training – we are on an exhilarating journey of expansion. And you could be a part of this adventure!<br/><br/><strong>What You'll Do<br/><br/></strong>Are you a customer service enthusiast ready to kick-start your career with a globally recognized brand? Dermalogica, a leader in the beauty industry, is seeking motivated individuals to join our dynamic Customer Care team. As a <strong>Customer Care Agent</strong>, you'll play a pivotal role in providing exceptional service to our valued customers. If you're passionate about delivering superior customer experiences and thrive in a fast-paced, team-oriented environment, we want to hear from you!<br/><br/><strong>Key Responsibilities:<br/><br/></strong><ul><li>Efficiently handle a high volume of incoming and outgoing calls, emails, and faxes, addressing customer inquiries, order status, product information, and corrections.</li><li>Drive sales by promoting new and reformulated products, sharing enticing promotions, and providing comprehensive product knowledge to customers.</li><li>Collaborate with cross-functional teams, including sales, education, and finance, to ensure seamless communication and problem-solving for customers.</li><li>Maintain accurate order information, confirming requested items, quantities, and pricing, while effectively communicating inventory availability and expected ship dates.</li><li>Demonstrate a commitment to continuous learning, actively contributing ideas and suggestions to improve processes and enhance the customer experience.</li><li>Provide light administrative support, including filing, as needed.<br/><br/></li></ul><strong>What You'll Bring<br/><br/></strong><strong>Key Qualifications:<br/><br/></strong><ul><li>Bilingual proficiency preferred</li><li>High school diploma required, along with at least one year of customer service experience (preferably in the beauty industry) or one year of experience working with Dermalogica</li><li>Excellent written and verbal communication skills</li><li>Strong computer skills, including proficiency in MS Office Suite (Word, Excel, Outlook)</li><li>Minimum typing speed of 35 wpm with high attention to detail</li><li>Self-motivated team player who embraces continuous learning and growth opportunities<br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li>Competitive Compensation</li><li>Medical, Dental, Vision Insurance</li><li>Paid Time Off</li><li>Monthly Product Allowances</li><li>401(k) plus company matchin</li><li>Fitness Reimbursement</li><li>Tuition Reimbursement</li><li>Life/Accident/Disability insurance</li><li>Wellness programs</li><li>Paid family leave</li><li>Domestic partner benefits</li><li>Education/training programs</li><li>Thrive in a hybrid work environment (3 days in office)<br/><br/></li></ul>The expected base hourly rate for this position is $22.00. The exact base hourly rate is determined by various factors including experience, skills, education, geographic location, and budget. This role is eligible for participation in our company bonus plan, rewarding personal performance and company results.<br/><br/><strong>Why Join Us?<br/><br/></strong><ul><li>A Legacy of Success: Dermalogica is the preferred choice of Skin Therapists worldwide, renowned for our exceptional skincare line and industry-leading postgraduate education. We have a record of achievement and are committed to building upon our brand's legacy.</li><li>Entrepreneurial Spirit and Innovation: At Dermalogica, we foster an entrepreneurial spirit and encourage our employees to bring their best ideas to the table. You'll have the opportunity to make a difference and contribute to our success by implementing innovative solutions that reach skincare professionals and consumers.</li><li>Backed by Unilever: In 2015, Dermalogica became part of the Unilever family, one of the world's largest and most successful consumer goods companies. While operating as an independent business, we now have access to cutting-edge capabilities and resources, empowering us to win in our markets.<br/><br/></li></ul>Join our team today and be part of a company that prioritizes its employees' well-being and success! Rest assured, all applications will be thoughtfully reviewed, and our HR team will contact you if your skills align with the position.<br/><br/><em>Dermalogica LLC, a Unilever Prestige company, embraces diversity, equity, and inclusion. We are committed to the equal treatment of all current and prospective employees regardless of age, disability, sex, sexual orientation, pregnancy and maternity, race or ethnicity, religion or belief, gender identity, or marriage and civil partnership. We aspire to have a diverse workforce because, in our view, diversity enables better business outcomes. We also believe that a more inclusive workplace, where people of different backgrounds work together, ensures better outcomes for all staff. From application to interview, we place inclusion at the heart of all we do. In particular, we strongly encourage suitably qualified applicants from a wide range of backgrounds to apply and join Dermalogica.</em>", "responsibilities": "Efficiently handle a high volume of incoming and outgoing calls, emails, and faxes, addressing customer inquiries, order status, product information, and corrections.Drive sales by promoting new and reformulated products, sharing enticing promotions, and providing comprehensive product knowledge to customers.Collaborate with cross-functional teams, including sales, education, and finance, to ensure seamless communication and problem-solving for customers.Maintain accurate order information, confirming requested items, quantities, and pricing, while effectively communicating inventory availability and expected ship dates.Demonstrate a commitment to continuous learning, actively contributing ideas and suggestions to improve processes and enhance the customer experience.Provide light administrative support, including filing, as needed.", "qualifications": {"required": "Bilingual proficiency preferredHigh school diploma required, along with at least one year of customer service experience (preferably in the beauty industry) or one year of experience working with DermalogicaExcellent written and verbal communication skillsStrong computer skills, including proficiency in MS Office Suite (Word, Excel, Outlook)Minimum typing speed of 35 wpm with high attention to detailSelf-motivated team player who embraces continuous learning and growth opportunities", "preferred": ""}, "skills": ["Customer Service", "Sales", "Communication", "Product Knowledge", "Microsoft Office", "Teamwork"], "postedDate": "1 week ago", "benefits": "Competitive CompensationMedical, Dental, Vision InsurancePaid Time OffMonthly Product Allowances401(k) plus company matchinFitness ReimbursementTuition ReimbursementLife/Accident/Disability insuranceWellness programsPaid family leaveDomestic partner benefitsEducation/training programsThrive in a hybrid work environment (3 days in office)", "remoteWork": "No", "salary": {"amount": "22.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3999531035"}