{"jobTitle": "Key Account Manager- Hair", "company": {"name": "Henkel", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00 - $115,000.00", "currency": "USD"}, "jobFunction": "Sales and Sales", "industry": "Chemical Manufacturing and Manufacturing", "description": "At Henkel, you can build on a strong legacy and leading positions in both industrial and consumer businesses to reimagine and improve life every day. If you love challenging the status quo, join our community of over 47.000 pioneers around the globe. Our teams at Henkel Consumer Brands continuously drive the evolution in dynamic categories: Laundry & Home Care and Hair. With our trusted brands, including Persil and Schwarzkopf, our cutting-edge technologies and our disruptive solutions, you will have countless opportunities to explore new paths and develop your skills. Grow within our future-led businesses, our diverse and vibrant culture and find a place where you simply belong. All to leave your mark for more sustainable growth.<br/><br/><strong>Dare to make an impact?<br/><br/></strong>Your Role <br/><br/><ul><li>Work with the Key Account Management team to develop channel-specific sales plans that meet or exceed growth targets. </li><li>Partner with Brand, Marketing, & Field Sales teams to ensure marketing & innovation plans meet the needs of the consumer and will lead to a successful sell-in and sell-through. </li><li>Accurately communicate all new item setup information to customer contacts. </li><li>Forecast customer needs for new items and promotional items </li><li>Analyze Sales Data and Promotional activity to ensure profitability and identify trends </li><li>Ensure in-store merchandising planning and execution improves brand shopability and new product launch success. </li><li>Manage budgets to achieve P&L objectives, including discounts, merchandising, advertising, sampling, and sales related events. </li><li>Execute key customer meetings, including slide preparation and presentation of key objectives. </li><li>Build strong relationships and manage customer expectations <br/><br/></li></ul><strong>Your Skills<br/><br/></strong><ul><li>Bachelor’s Degree preferred </li><li>3-5 years' experience in Sales or Marketing within the Professional beauty or personal care industry; hair care category a plus </li><li>Excellent oral, written and presentation skills </li><li>25% travel between customer meetings or sales events </li><li>Proficient use of Word, Excel, PowerPoint. Ability to analyze data, combined with in-market understanding, and develop and communicate results, ideas and strategies. </li><li>Manage personal travel schedule and T&E budget <br/><br/></li></ul>The salary for this role is $90,000.00 - $115,000.00. This is the range that we in good faith anticipate relying on when setting wages for this position. We may ultimately pay more or less than the posted range and this range. This salary range may also be modified in the future.<br/><br/>Henkel does not accept unsolicited resumes from search firms or employment agencies. Unsolicited referrals and resumes are considered Henkel property and therefore, Henkel will not pay a fee for any placement resulting from the receipt of an unsolicited referral. At Henkel's request only, preferred vendors may be invited to refer talent for specific open positions. In these cases, a fully-executed agreement with Henkel must be in place and current.<br/><br/>At Henkel, we come from a broad range of backgrounds, perspectives, and life experiences. We believe the uniqueness of all our employees is the power in us. Become part of the team and bring your uniqueness to us! We welcome all applications across different races, colors, religions, sexes, national origins, disabilities, veteran statuses, ages, sexual orientations, gender identities and expressions, and other legally protected characteristics.", "responsibilities": "Work with the Key Account Management team to develop channel-specific sales plans that meet or exceed growth targets. Partner with Brand, Marketing, & Field Sales teams to ensure marketing & innovation plans meet the needs of the consumer and will lead to a successful sell-in and sell-through. Accurately communicate all new item setup information to customer contacts. Forecast customer needs for new items and promotional items Analyze Sales Data and Promotional activity to ensure profitability and identify trends Ensure in-store merchandising planning and execution improves brand shopability and new product launch success. Manage budgets to achieve P&L objectives, including discounts, merchandising, advertising, sampling, and sales related events. Execute key customer meetings, including slide preparation and presentation of key objectives. Build strong relationships and manage customer expectations", "qualifications": {"required": "Bachelor’s Degree preferred 3-5 years' experience in Sales or Marketing within the Professional beauty or personal care industry; hair care category a plus Excellent oral, written and presentation skills 25% travel between customer meetings or sales events Proficient use of Word, Excel, PowerPoint. Ability to analyze data, combined with in-market understanding, and develop and communicate results, ideas and strategies. Manage personal travel schedule and T&E budget", "preferred": ""}, "skills": ["Sales", "Marketing", "Professional Beauty", "Personal Care", "Hair Care", "Word", "Excel", "PowerPoint", "Data Analysis", "Communication", "Presentation Skills", "Travel"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999931953"}