{"jobTitle": "Purchasing Assistant", "company": {"name": "Suna Solutions", "location": "Cypress, CA"}, "location": "Cypress, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "24.00–25.00", "currency": "USD"}, "jobFunction": "Supply Chain", "industry": "Manufacturing", "description": "<strong>Job Title: </strong>Purchasing Assistant\n<p><strong>Pay Rate: </strong>$24.00–$25.00/hr on W2</p><p><strong>Duration: </strong>9 months assignment</p><p><strong>Location: </strong>Cypress, CA 90630</p><p><br/></p><p><strong>Note: </strong>For this role \"Purchasing Assistant\", you need to be pass a <strong>purchase order test</strong> at your interview. The test will include reviewing purchase orders for perception, observation and attention to detail.</p><p><br/></p><p><strong>POSITION SUMMARY:</strong></p><p>This position is responsible for HQ purchasing activities described below to support all branches of EED.</p><ul><li>Create and distribute purchase orders for all branches and HQ Operations per the established PO issuance workflow.</li><li>Monitor inventory to avoid stock outs and replenish as necessary by soliciting quotes and issuing inventory POs.</li><li>Resolve issues with POR Requestors for PORs submitted without proper back up.</li><li>Resolve issues with vendors for order delays, back orders, material defects, delivery shortage, invoice discrepancy or any other issues that may arise.</li><li>Utilize and maintain order trackers with major local supply vendors for efficient communication of order status/changes.</li><li>Coordinate and work closely with warehouse staff and ACO logistics for delivery confirmations.</li><li>Perform other administrative and purchasing duties as assigned.</li></ul><p><br/></p><p><strong>EQUAL EMPLOYMENT OPPORTUNITY STATEMENT:</strong></p><p>Suna Solutions provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state, or local laws.</p><p>This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.</p><p>Applicants, with criminal histories, are considered in a manner that is consistent with local, state, and federal laws.</p><p><br/></p><p><strong>REQUESTING AN ACCOMODATION</strong></p><p>Suna Solutions is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are hired by Suna Solutions and require accommodation to perform the essential functions of your role, you will be asked to participate in our reasonable accommodation process. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired.</p><p>If you would like to be considered for employment opportunities with Suna Solutions and have accommodation needs for a disability or religious observance, please call us at 1 (888) 223-4788, send us an email or speak with your recruiter.</p><p><br/></p><p><strong>PAY TRANSPARENCY POLICY STATEMENT</strong></p><p>Compensation for roles at Suna Solutions varies depending on a wide array of factors including but not limited to the specific client, office or remote location, role, skill set and level of experience. As required by local law, Suna Solutions provides a reasonable pay scale to include the hourly or salary range that Suna Solutions reasonably expects to pay for roles that may be hired in California, Colorado, New York City or Washington.</p><p></p>", "responsibilities": "This position is responsible for HQ purchasing activities described below to support all branches of EED.\n<ul><li>Create and distribute purchase orders for all branches and HQ Operations per the established PO issuance workflow.</li><li>Monitor inventory to avoid stock outs and replenish as necessary by soliciting quotes and issuing inventory POs.</li><li>Resolve issues with POR Requestors for PORs submitted without proper back up.</li><li>Resolve issues with vendors for order delays, back orders, material defects, delivery shortage, invoice discrepancy or any other issues that may arise.</li><li>Utilize and maintain order trackers with major local supply vendors for efficient communication of order status/changes.</li><li>Coordinate and work closely with warehouse staff and ACO logistics for delivery confirmations.</li><li>Perform other administrative and purchasing duties as assigned.</li></ul>", "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999938001"}