{"jobTitle": "Sales Supervisor, Women's - Beverly Hills", "company": {"name": "Christian Dior Couture", "industry": "Retail Luxury Goods and Jewelry", "size": "51-200 employees", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$26.00/hr - $30.00/hr", "currency": "USD"}, "jobFunction": "Training, Management, and Customer Service", "industry": "Retail Luxury Goods and Jewelry", "description": "Position\n\nJOB TITLE: Sales Supervisor\n\nJob Purpose\nWorking with the Boutique Manager and or Assistant Manager/Department Manager, the Sales Supervisor is responsible for assisting with the day-to-day management of the boutique and the achievement of sales goals for specific product categories. The Sales Supervisor ensures the highest level of customer service in line with Christian Dior expectations:\n\nMeet sales targets and minimize stock losses\nDemonstrate excellent product and range knowledge\nParticipate to staffing, scheduling, merchandising and inventory\nSupervise, coach and motive the team members\n\nJob responsibilities\n\nTasks and responsibilities\n\nCommercial Performance And Team Management\nIncrease sales and measure sales performance and conversion rates daily.\nProvide and inspire outstanding service to our customers.\nAssist in assigning and monitoring sales goals of Sales Associates\nResponsible for clientele development\nParticipate in the preparation of merchandise displays and presentations, exercising independent judgment and discretion in applying merchandising concepts and guidelines.\nTrain, coach, develop, and lead sales associates in selling skills\nConduct and/or participate in regular store meetings to discuss performance, sales training, product knowledge, merchandising, and to convey other necessary information to management staff and associates.\nFacilitate proper communication between management and associates.\n\nClientele Service And Management\nParticipate in the coordination of sales promotion activities, which include seasonal sales, trunk shows, contests, including proper use of in-store signs advertising sales and promotions.\nTrain the team on optimizing Capture Rate and After Sale do develop personal customer database\n\nProduct And Stock Management\nGather merchandise for transfers, damages, and returns-to-vendor (RTV’s).\nOversee and participate in department inventories.\nMonitor proper pricing of merchandise\nMinimize stock losses\n\nProcess Management\nOversee compliance of associates with established Company policies and standards, such as safekeeping of Company funds and property, personnel practices, merchandise handling, security, sales and record-keeping procedures.\nHelp solve problems that affect the department’s service, efficiency, and productivity.\nLock and secure the store, and oversee compliance with all security procedures.\nAny other tasks as assigned from time to time.\n\nProfile\n\nSkills and competencies\n\nAbility To\nDevelop and train associates, build relationships, utilize skills of associates most appropriately\nProvide outstanding customer service\nEffectively manage sales staff toward achievement of sales and clientele objectives\nManage boutique operations effectively including attendance, merchandising, and housekeeping standards\nMerchandize effectively\nMaintain a fair, consistent set of standards as they apply to work force\nAdjust priorities and manage time wisely in a fast-paced environment\nCommunicate in a clear, concise, understandable manner, and listen attentively to others, understand material, and provide instructions to associates\nOperate all equipment necessary to perform the job, including POS systems, PC, phone systems, cash register, sensor-tag remover, and all other office equipment.\n\nRequirements\n\nAt least 4+ years of retail experience required, preferably with at least 1 year of management, in a luxury product setting.\nSense of initiative and commercial creativity with fashion sensitivity\nStrong knowledge of the luxury industry with fashion sensitivity consistent with the brand.\nDemonstration of own initiative\nAbility to maintain presence on selling floor for long periods as needed.\nStrong interpersonal, communication, organization and follow-through skills", "responsibilities": "Meet sales targets and minimize stock losses. Demonstrate excellent product and range knowledge. Participate to staffing, scheduling, merchandising and inventory. Supervise, coach and motive the team members.", "qualifications": {"required": "At least 4+ years of retail experience required, preferably with at least 1 year of management, in a luxury product setting.", "preferred": "Strong knowledge of the luxury industry with fashion sensitivity consistent with the brand."}, "skills": ["Sales Management", "Customer Service", "Team Leadership", "Retail Operations", "Merchandising"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Comprehensive benefit plans such as medical, dental, vision, Flexible Spending Accounts, and short and long-term disability. Employee discount program, various paid time off, volunteer time off, holidays, mental health and wellbeing support, family friendly benefits, reproductive health care, child and elder care services, commuter benefits, 401k plans with an employer contributions matching plan, employee referral program, and more.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999498036"}