{"jobTitle": "Business Systems Analyst", "company": {"name": "Apex - Spacecraft Manufacturing", "industry": "Defense and Space Manufacturing", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$130,000 - $160,000", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Defense and Space Manufacturing", "description": "Spacecraft represent the most pressing unmet need across the entire aerospace industry. As more launch vehicles come online and the cost to orbit decreases, more companies launching payloads to space continue to emerge. For the first time in history, this influx of payload companies combined with reduced launch costs has resulted in a massive increase in need for commercial spacecraft platforms, known as satellite buses. These buses hold the payloads of our customers and are flown on launch vehicles. Apex manufactures these satellite buses as scale using a combination of software, vertical integration, and hardware that is designed for manufacturing. Our spacecraft enable the future of society: ranging from earth observation to communications and more. We’d love for you to join us on our mission of providing humankind access to the galaxy beyond our planet. As a Business Systems Analyst you will have the opportunity to architect and manage the Apex “Operating System” platform from the ground up. Reporting to the Head of Operations, you will interact with all departments of the company including supply chain, production, engineering, finance, legal, and sales. You’ll build the dashboard from which we drive efficiencies, track our financials, manage our purchasing, and more. As Apex grows to hundreds of employees, your solutions ensure process doesn’t slow us down.", "responsibilities": "Performs system configurations in Palantir Foundry; Identifies and implements solutions to business needs in a customer service, consultative methodology; Supports day to day operations, maintenance, and functionality of the Palantir Foundry system including security setup and update management; Conducts data integrations to new data sources deemed valuable to Apex; Responds to and resolves intermediate questions; Documents processes with business teams; Plans project tasks for specific process areas; Recommends remediation of solution conditions.", "qualifications": {"required": "All applicants must be a U.S. Person; Bachelor's degree in fields related to data science, computer science, engineering, mathematics, or equivalent practical experience; 5+ years of Business Systems Analysis experience required; 2+ Years of Python/PySpark or SQL experience required; Experience implementing an end-to-end ERP solution system; Ability to profile and analyze data, derive insights from data as well as experience working with many disparate data sets required; Ability to effectively communicate, both verbally and in writing, at all levels including customers, vendors, peers, business stakeholders and management required; Capable of learning new systems and creating/implementing new system functionality; 1+ years of Production/Manufacturing industry experience preferred.", "preferred": "Not specified"}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Apex believes in creating a work environment that you look forward to embracing every day. Our employees love working at Apex, and we want you to love it too. We offer the following benefits: Shared upside: receive equity in Apex, letting you benefit from the work you create; Best-in-class healthcare, dental, vision, and life insurance plans. The primary's premium is 99%+ covered; Enjoy our comprehensive PTO package, fostering employee well-being; Competitive 401(k) plan and matching; Paternity/maternity leave; Daily lunch, unlimited snacks, and regular office BBQs!; Your dream desk setup, tools, and whatever else you need to be your most productive self; A world class office located in Culver City, filled with amazing coworkers and social gatherings for you and your family.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3999976808"}