{"jobTitle": "Litigation Legal Assistant", "company": {"name": "Munck Wilson Mandala LLP", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Legal", "industry": "Law Practice", "description": "Munck Wilson Mandala is currently seeking a litigation legal assistant for its growing Los Angeles office located in the heart of Century City to effectively support as many as four busy attorneys in a highly collaborative working environment. The ideal candidate will possess a minimum of 5 years of litigation legal assistant or secretarial experience with significant exposure to complex commercial, intellectual property, real estate and/or labor and employment litigation in a mid to large-sized law firm.  Duties include but are not limited to preparing, finalizing and filing documents (i.e., declarations, power of attorneys, assignments, transmittals, extensions of time, information disclosure statements, etc.); preparing and finalizing client correspondence; maintaining attorney docket; handling legal assistant and administrative tasks including document preparation, time entry, expense reimbursement, telephone contact, travel arrangements and calendar maintenance; and handling administrative confidential/sensitive firm and/or client information and providing excellent client service.  Qualified candidates must be proficient in MS Word, Excel, Outlook, iManage, styles, brief formatting; federal and state e-filing, trial preparation, Table of Contents, and Table of Authorities. Candidates should possess excellent written and oral communication, proofreading, and organizational skills. Candidates should also be detail-oriented, be able to multitask and prioritize the workload independently, have great follow up and follow through skills, and be comfortable working in a high-volume, high-energy environment. The position is on-site five days a week. Availability for some overtime is required as needed.  The anticipated pay range is approximately $75k to $95k per year. Compensation will vary depending on years of experience, skills, and location. Please submit resumes to Christina Brewer, Administrative & HR Manager, at cbrewer@munckwilson.com.  Munck Wilson Mandala is an Equal Opportunity Employer. Munck Wilson Mandala will consider for employment qualified applicants with criminal histories in a manner consistent with the City of Los Angeles Fair Chance Initiative for Hiring Ordinance (FCIHO) and other applicable laws. Please click here to review the Ordinance and other notices.", "postedDate": "1 week ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Pension plan", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999524876"}