{"jobTitle": "Shipping Receiving Specialist", "company": {"name": "REI", "industry": "Retail", "size": "Not specified", "location": "Marina del Rey, CA"}, "location": "Marina del Rey, CA", "jobType": "Not specified", "employmentType": "Temporary", "experienceLevel": "Not Applicable", "salary": {"amount": "$20.86 - $23.20 per hour", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "REI Co-op is united around discovering, building and celebrating better ways of working in this world, all so that folks can find and pursue a love of the outdoors. When you work for the co-op, you do your best work with the support to live your best life. And you play a part in shaping the future of the outdoors, for people and our planet. Our team seeks a Shipping and Receiving Specialist to scan and sort incoming and outgoing shipments. Your role keeps the business running smoothly. You’ll collaborate and communicate with team members inside and outside of REI. You’re a master mover of merchandise who plans and improves logistics. As a Shipping and Receiving Specialist, you'll help keep the warehouse clean, organized, and team ready. Ready to discover better with us?", "responsibilities": "How you will be successful: Receive store inventory, transfers, vendor and internal shipments. Process customer and product quality returns. Direct the flow of replenishment products to the sales floor or backstock. Perform recurring cycle counts and audits of targeted inventory. Assist customers with questions about products, memberships, and services. Follow REI loss prevention and safety procedures. Ability to work a flexible schedule based on business needs. Additional duties as assigned.", "qualifications": {"required": "Not specified", "preferred": "Previous warehouse, retail, or shipping/receiving experience (preferred). Able to transfer up to 35 pounds, as needed. Open to feedback and other viewpoints in the spirit of supporting the business. Uses business understanding, innovative thinking, and sound judgment to solve problems. Makes solid recommendations by combining information from various sources. Produces quality work by setting effective goals and establishing priorities. Organizes and uses resources to meet deadlines, keeps others in the loop about plans and progress. Engages and influences others to accomplish worthwhile organizational goals."}, "skills": ["Not specified"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "REI offers all regular employees a generous employee discount, access to health benefits, a retirement savings plan and accrued time off.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3999929679"}