{"jobTitle": "Sr. Manager, Repair Operations", "company": {"name": "Panasonic Avionics Corporation", "location": "Lake Forest, CA", "industry": "Aviation and Aerospace Component Manufacturing"}, "location": "Lake Forest, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "120,300 -$216,600", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing", "description": "<strong>Overview<br/><br/></strong>Sr. Manager, Repair Operations<br/><br/><strong>Responsibilities<br/><br/></strong>Ever wonder who brings the entertainment to your flights? Panasonic Avionics Corporation is #1 in the industry for delivering inflight products such as movies, games, WiFi, and now Bluetooth headphone connectivity!<br/><br/>How exciting would it be to be a part of the innovation that goes into creating technology that delights millions of people in an industry that’s here to stay! With our company’s history spanning over 40 years, you will have stability, career growth opportunities, and will work with the brightest minds in the industry. And we are committed to a diverse and inclusive culture that will help our organization thrive! We seek diversity in many areas such as background, culture, gender, ways of thinking, skills and more.<br/><br/>If you want to learn more about us visit us at www.panasonic.aero. And for a full listing of open job opportunities go to www.panasonic.aero/join-us/.<br/><br/><strong>The Position<br/><br/></strong>Oversee all Repair operations, administration and logistic functions within an assigned location(s). Responsible for the overall Repair Services Operations which includes setting strategic operational plans, reporting financial and operational monthly performance metrics and ensuring compliance with all laws and regulations.<br/><br/><strong>Job Description<br/><br/></strong>Repair Operations<br/><br/><ul><li>Manage all Repair Shop activities in accordance with multiple agency regulations.</li><li>Maintains good customer relationship with airline customers based in the region.</li><li>Develop performance requirements among team to consistently work toward enhancing PAC’s reputation among customers and suppliers.</li><li>Ensure compliance of customer contractual commitments.</li><li>Ensure the Repair Shop have the appropriate resources to perform at the standards and practices specified in the company Maintenance Operation Exposition (MOE).</li><li>Responsible for ensuring MOE is up to date and reflects services provided.</li><li>Oversee “third party” Vendor organizations to ensure service agreements are being met.</li><li>Ensure Repair shop facilities are compliant with all relevant Health and safety requirements.</li><li>Work with all regulatory agencies and their representatives to ensure local<br/><br/></li></ul>Compliance<br/><br/><ul><li>Ensures any Audit findings are resolved with agreed timeframe<br/><br/></li></ul>Leadership<br/><br/><ul><li>Manage, guide, and mentor the performance of Shop Managers and Supervisors.</li><li>Hire, train, supervise, and appraise direct reports.</li><li>Lead managers and supervisors to implement department objectives.</li><li>Organize and implement department objectives.</li><li>Manage the budget and expenses assigned to the repair shop.<br/><br/></li></ul>The salary or hourly wage range of $120,300 -$216,600 is just one component of Panasonic’s total package. The final offer amount may vary based on factors including but not limited to individual’s knowledge, skills, experience, and location. In addition, this role may be eligible for discretionary bonuses and incentives. The minimum hourly wage for this role will be the greater of the posted range, or minimum wage for the location where the employee will be working, subject to local minimum wage requirements.<br/><br/><strong>Knowledge/Skill Requirements<br/><br/></strong>What We’re Looking For:<br/><br/><ul><li>Advanced level knowledge of Microsoft Word, Excel, PowerPoint and Outlook.</li><li>Excellent written and verbal communication skills including ability to present to executive decision makers.</li><li>Ability to understanding and oversee service deliveries to PAC customers within the assigned area, meeting contractual commitments in an efficient and cost effective manner.</li><li>Solid understanding of financial controls and budgets</li><li>Provide input to strategic decisions that affect the functional area(s) of responsibility</li><li>Ability to coach managers and develop high-performing teams.</li><li>Establishes operational objectives and work plans, and delegates assignments to subordinate managers.</li><li>Involved in developing, modifying and executing company policies that affect immediate operations and may also have company-wide effect.</li><li>Works on issues where analysis of situations or data requires an in-depth knowledge of organizational objectives.</li><li>Excellent Working knowledge of global civil aviation regulations and requirements.</li><li>In-depth knowledge of Airworthiness regulations<br/><br/></li></ul><strong>Education/Experience Requirements<br/><br/></strong><ul><li> BS degree or 12 years of related work experience in aviation.</li><li> 8+ years’ experience in an aviation organization, minimum of 3 years of managerial experience.<br/><br/></li></ul><strong>Other Requirements<br/><br/></strong><ul><li> May require travel, up to 50% of the time to domestic and/or international locations.</li><li> Pass extensive security and background checks.<br/><br/></li></ul><strong>Our Principles<br/><br/></strong>Contribution to Society | Fairness &amp; Honesty | Cooperation &amp; Team Spirit | Untiring Effort for Improvement | Courtesy &amp; Humility | Adaptability | Gratitude<br/><br/><strong>What We Offer<br/><br/></strong><ul><li> At Panasonic Avionics Corporation we realize the most important aspects in leading our industry are the bright minds behind everything we do. We are proud to offer our employees a highly competitive, comprehensive and flexible benefits program.</li><li> Paid time off: Exempt Salaried employees receive flexible paid time off. This means that there is no fixed number, range, or limit to the amount of Personal and Vacation Days that may be taken for exempt employees. Non-exempt hourly employees accrue 14 vacation days per year + 7 sick days + 3 personal days. Accrual rate increases with tenure. All employees receive 11 company paid holidays per year. We also close our offices at the corporate level in the U.S. between Christmas and New Year. For operational positions that are expected to work on holidays, we provide additional compensation for hours worked.</li><li> Health Insurance: Medical insurance offerings from Aetna and Kaiser (CA &amp;HI). Options for Employee Only, Employee + Spouse/Domestic Partner, Employee + Children, or Family. Dental PPO and DMO options &amp; Vision insurance through EyeMed or VSP.</li><li> 401K with 50% match on up to 8% contribution, full vested from day 1.</li><li> Washington residents only are eligible for: Washington’s Family and Medical Leave program and Washington’s Paid Sick Leave program.</li><li> Other offerings include: Wellness Program, Counseling services, FSA &amp; HSA, Life Insurance for employee, spouse and child, AD&amp;D Insurance, Long-term and Short-term disability, Critical Illness Insurance, Accident Insurance, Legal Assistance, Pet Insurance, Identity Theft Protection, Dependent Care FLSA, Education Assistance, Commuter Program, Employee Purchase Program, Service Award Program.<br/><br/></li></ul>All applicants are subject to Company policies, third party customer and worksite requirements, and government requirements, regarding vaccination and/or testing for COVID-19. Where permitted by applicable law, applicants may be required to be fully vaccinated with an authorized COVID-19 vaccine as a condition of employment, unless they are eligible for and obtain an exemption based on a reasonable accommodation because of a disability or a sincerely held religious belief, practice, or observance. While the Company strongly encourages COVID-19 vaccinations, it may require vaccination and/or testing for positions in which third party customer, worksite, or government requirements apply, in accordance with applicable law. At those locations where requirements apply, exemptions will be considered based on applicable law.<br/><br/>Panasonic is proud to be an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, national origin, disability status, protected veteran status, and any other characteristic protected by law or company policy. All qualified individuals are required to perform the essential functions of the job with or without reasonable accommodation. Pre-employment drug testing is required for safety sensitive positions or as may otherwise be required by contract or law. Due to the high volume of responses, we will only be able to respond to candidates of interest. All candidates must have valid authorization to work in the U.S. Thank you for your interest in Panasonic Avionics Corporate.<br/><br/><strong>Salary Range<br/><br/></strong>120,300 -$216,600 REQ-146302", "responsibilities": "Oversee all Repair operations, administration and logistic functions within an assigned location(s). Responsible for the overall Repair Services Operations which includes setting strategic operational plans, reporting financial and operational monthly performance metrics and ensuring compliance with all laws and regulations.<br/><br/>Repair Operations<br/><br/><ul><li>Manage all Repair Shop activities in accordance with multiple agency regulations.</li><li>Maintains good customer relationship with airline customers based in the region.</li><li>Develop performance requirements among team to consistently work toward enhancing PAC’s reputation among customers and suppliers.</li><li>Ensure compliance of customer contractual commitments.</li><li>Ensure the Repair Shop have the appropriate resources to perform at the standards and practices specified in the company Maintenance Operation Exposition (MOE).</li><li>Responsible for ensuring MOE is up to date and reflects services provided.</li><li>Oversee “third party” Vendor organizations to ensure service agreements are being met.</li><li>Ensure Repair shop facilities are compliant with all relevant Health and safety requirements.</li><li>Work with all regulatory agencies and their representatives to ensure local<br/><br/></li></ul>Compliance<br/><br/><ul><li>Ensures any Audit findings are resolved with agreed timeframe<br/><br/></li></ul>Leadership<br/><br/><ul><li>Manage, guide, and mentor the performance of Shop Managers and Supervisors.</li><li>Hire, train, supervise, and appraise direct reports.</li><li>Lead managers and supervisors to implement department objectives.</li><li>Organize and implement department objectives.</li><li>Manage the budget and expenses assigned to the repair shop.<br/><br/></li></ul>", "qualifications": {"required": "Advanced level knowledge of Microsoft Word, Excel, PowerPoint and Outlook. Excellent written and verbal communication skills including ability to present to executive decision makers. Ability to understanding and oversee service deliveries to PAC customers within the assigned area, meeting contractual commitments in an efficient and cost effective manner. Solid understanding of financial controls and budgets Provide input to strategic decisions that affect the functional area(s) of responsibility Ability to coach managers and develop high-performing teams. Establishes operational objectives and work plans, and delegates assignments to subordinate managers. Involved in developing, modifying and executing company policies that affect immediate operations and may also have company-wide effect. Works on issues where analysis of situations or data requires an in-depth knowledge of organizational objectives. Excellent Working knowledge of global civil aviation regulations and requirements. In-depth knowledge of Airworthiness regulations", "preferred": "BS degree or 12 years of related work experience in aviation. 8+ years’ experience in an aviation organization, minimum of 3 years of managerial experience."}, "skills": ["Microsoft Word", "Excel", "PowerPoint", "Outlook", "Communication", "Financial Controls", "Budgeting", "Coaching", "Team Development", "Global Civil Aviation Regulations", "Airworthiness Regulations"], "postedDate": "1 week ago", "benefits": "At Panasonic Avionics Corporation we realize the most important aspects in leading our industry are the bright minds behind everything we do. We are proud to offer our employees a highly competitive, comprehensive and flexible benefits program.<br/><br/>Paid time off: Exempt Salaried employees receive flexible paid time off. This means that there is no fixed number, range, or limit to the amount of Personal and Vacation Days that may be taken for exempt employees. Non-exempt hourly employees accrue 14 vacation days per year + 7 sick days + 3 personal days. Accrual rate increases with tenure. All employees receive 11 company paid holidays per year. We also close our offices at the corporate level in the U.S. between Christmas and New Year. For operational positions that are expected to work on holidays, we provide additional compensation for hours worked.<br/><br/>Health Insurance: Medical insurance offerings from Aetna and Kaiser (CA &amp;HI). Options for Employee Only, Employee + Spouse/Domestic Partner, Employee + Children, or Family. Dental PPO and DMO options &amp; Vision insurance through EyeMed or VSP.<br/><br/>401K with 50% match on up to 8% contribution, full vested from day 1.<br/><br/>Washington residents only are eligible for: Washington’s Family and Medical Leave program and Washington’s Paid Sick Leave program.<br/><br/>Other offerings include: Wellness Program, Counseling services, FSA &amp; HSA, Life Insurance for employee, spouse and child, AD&amp;D Insurance, Long-term and Short-term disability, Critical Illness Insurance, Accident Insurance, Legal Assistance, Pet Insurance, Identity Theft Protection, Dependent Care FLSA, Education Assistance, Commuter Program, Employee Purchase Program, Service Award Program.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3999015504"}