{"jobTitle": "Investment Banking/Financial Modeling | Analyst | Los Angeles, California", "company": {"name": "Goldman Sachs", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$110,000 - $125,000", "currency": "USD"}, "jobFunction": "Finance and Sales", "industry": "Financial Services", "description": "<strong>Job Description<br/><br/></strong><strong>MORE ABOUT THIS SKILLSET<br/><br/></strong>Solving critical financial and strategic challenges. Macroeconomic forecasting and individual stock analysis. Developing tools and insights to shape client and firm investment strategies.<br/><br/>In addition to being passionate about the financial services industry, markets and research process, individuals across these teams possess strong financial modeling skills, excellent written and verbal communication, are strategic and analytical thinkers, and hold a high level of Excel proficiency.<br/><br/><em>If you apply to this skillset, you will be considered for multiple roles across the firm that require this skillset. Please note division and function examples below are representative of opportunities common for this skill-set. The list is not exhaustive, and availability of open roles is determined based on business need. Specific roles will be confirmed through the interview process. <br/><br/></em><strong>BUSINESS AND JOB FUNCTION<br/><br/></strong><strong>Global Banking &amp; Markets - Investment Banking </strong>works on some of the most complex financial challenges and transactions in the market today. Whether advising on a merger, providing financial solutions for an acquisition, or structuring an initial public offering, we handle projects that help clients at major milestones. We work with corporations, pension funds, financial sponsors, and governments and are team of strong analytical thinkers, who have a passion for producing out-of-the-box ideas<br/><br/><ul><li>Industry Group Coverage Banking works in developed and emerging markets worldwide to deliver banking services for a wide range of industries. Our team approach to client service enables our bankers to play an important role in building relationships and executing transactions. Classic investment bankers have expertise advising clients across industries, regions and products. Teams are organized by industry group, including Consumer Retail Group, Financial Institutions Group, Financial and Strategic Investors Group, Healthcare, Industrials, Natural Resources, Real Estate, and Technology, Media and Telecom, as well as by region, country and company size as part of the Cross Markets Group.</li><li>Financing Group Coverage Banking sits within a dynamic, market-driven environment, our teams work closely with corporate clients, pension funds, financial sponsors and governments to structure and execute some of the largest and most complex financing and risk management solutions across the full product spectrum, including equity, debt and derivatives. To achieve this goal, the Financing Group comprises all Goldman Sachs’ capital markets departments, and operates on close cooperation with other areas of Investment Banking and other divisions within the firm, including Fixed Income, Currency and Commodities and Equities. Teams are organized by product group including Leveraged Finance, Equity Capital Markets, Investment Grade, Structured Finance, Corporate Derivatives, Public Sector &amp; Infrastructure and Emerging Markets.<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>Bachelor’s degree</li><li>0-3 years of prior work experience in a relevant field. </li><li>Proficient to advanced skills with MS Office (Excel, PowerPoint, Word, Outlook)</li><li>Highly organized with exceptional attention to detail and follow-through</li><li>Strong ability to manage multiple projects with competing deadlines</li><li>Team player with positive attitude and strong work ethic</li><li>Strong communication skills (written and verbal)</li><li>Ability to work in a fast-paced environment </li><li>Ability to adapt quickly to a variety of industries and businesses</li><li>Ability to self-direct, analyze and evaluate and form independent judgments</li><li>Ability to effectively interact and build relationships with senior management and global stakeholders </li><li>Commercially savvy with ability to exercise discretion with respect to highly confidential/sensitive information</li><li>Integrity, ethical standards and sound judgment<br/><br/></li></ul><strong>Salary Range<br/><br/></strong>The expected base salary for this Los Angeles, California, United States-based position is $110,000 - $125,000. In addition, you may be eligible for a discretionary bonus if you are an active employee as of fiscal year-end.<br/><br/><strong>About Goldman Sachs<br/><br/></strong>At Goldman Sachs, we commit our people, capital and ideas to help our clients, shareholders and the communities we serve to grow. Founded in 1869, we are a leading global investment banking, securities and investment management firm. Headquartered in New York, we maintain offices around the world.<br/><br/>We believe who you are makes you better at what you do. We're committed to fostering and advancing diversity and inclusion in our own workplace and beyond by ensuring every individual within our firm has a number of opportunities to grow professionally and personally, from our training and development opportunities and firmwide networks to benefits, wellness and personal finance offerings and mindfulness programs. Learn more about our culture, benefits, and people at GS.com/careers.<br/><br/>We’re committed to finding reasonable accommodations for candidates with special needs or disabilities during our recruiting process. Learn more: https://www.goldmansachs.com/careers/footer/disability-statement.html<br/><br/>© The Goldman Sachs Group, Inc., 2024. All rights reserved.<br/><br/>Goldman Sachs is an equal employment/affirmative action employer Female/Minority/Disability/Veteran/Sexual Orientation/Gender Identity", "postedDate": "1 week ago", "skills": ["Excel", "PowerPoint", "Word", "Outlook", "Communication", "Teamwork", "Work Ethic", "Problem Solving", "Analysis", "Judgment", "Relationship Building", "Discretion"], "url": "https://www.linkedin.com/jobs/view/3999892999"}