{"jobTitle": "Director of Specification Sales - Southern CA", "company": {"name": "ESP PROSEARCH", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Sales", "industry": "Appliances, Electrical, and Electronics Manufacturing", "description": "We’ve been engaged to identify an exceptional leader who will spearhead sales strategies and illuminate the path to market leadership. We’ve been entrusted to identify a strategic, collaborative leader with vision who will not just meet but exceed expectations in driving growth and success.<br/><br/>The chosen candidate will take on the full-time challenge of leading business planning, account management, and sales operations. Focusing primarily on dominating the West Coast Territories in the initial two years, and moving this success east from there. This role is for those who are ready to shine brightly.<br/><br/>You are a visionary with a remarkable track record of success in business planning and budgeting. Your expertise in account management and sales is unmatched, and your knowledge of the architectural industry, especially in lighting solutions, will be your guiding force.<br/><br/><strong>ESP PROSEARCH: <br/><br/></strong>We are Executive Recruiters with a proprietary search methodology dedicated to bringing people together in the Lighting, Controls, IoT, EV Charging, and Cleantech Industries.<br/><br/>We are most successful placing EVP, VP, Director, Manager and Key Individual Contributors within the Sales, Product Management, Business Development and Engineering disciplines with Industry Titans to Leading Edge Start Ups.<br/><br/>Visit www.ESPprosearch.com for additional opportunities. Connect on LinkedIn and follow our Company Page to remain current on our latest opportunities.<br/><br/>Contact:<br/><br/>Eric S. Pollack<br/><br/>ESP PROSEARCH, LLC<br/><br/>786 573 9273<br/><br/>eric@ESPprosearch.com<br/><br/>ESPprosearch.com<br/><br/>Connect with me!<br/><br/>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3999976947"}