{"jobTitle": "Supply Chain Manager", "company": {"name": "Sensorex, Inc.", "location": "Garden Grove, CA", "industry": "Measuring and Control Instrument Manufacturing and Manufacturing"}, "location": "Garden Grove, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00/yr - $110,000.00/yr", "currency": "USD"}, "jobFunction": "Purchasing, Supply Chain, and Manufacturing", "industry": "Measuring and Control Instrument Manufacturing and Manufacturing", "description": "Sensorex SummaryAt Sensorex, we believe that even the most complex water analysis should be fast and simple to perform. Sensorex specializes in the design and manufacture of pH and ORP electrodes, conductivity and TDS sensors, and other electrochemical and optical measurement technologies. We’ve introduced some leading edge technologies since our initial launch in 1972, and today, we remain focused on the continual advancement of water quality monitoring products.<br/>Trusted by over 250 market leaders in water treatment applications, Sensorex offers industry leading application support and rapid prototyping. With our strong legacy of supporting OEMs through custom offerings, as well as domestic and international distribution partners, we deliver a seamless buying experience and fast delivery. In addition to our factory and headquarters in Garden Grove, California, United States, Sensorex also has manufacturing capability in Czech Republic in support of our European customers. We offer localized support with sales and customer service representatives based in Germany, Czech Republic, and India.<br/>Sensorex is a subsidiary of Halma plc (“Group”) under the Environmental & Analysis Sector. Halma plc is listed on the London Stock Exchange whose purpose is to grow a safer, cleaner, healthier future for everyone every day! Halma plc has a current market capitalization of approximately £7 billion. The group has nearly 50 businesses operating through three sectors (Medical, Environmental & Analysis, and Safety) in more than 20 countries and major operations in Europe, North and South America and Asia, supplying customers in 160 countries and employing more than 6,600 people worldwide.<br/>Job SummarySensorex is looking for an experienced Supply Chain Manager to manage the company’s supply and planning of products and services. The individual will analyze our current buying systems and create the best methods for day-to-day purchasing operations. The individual will be responsible for overseeing our purchasing and planning department, establishing goals for the team based on corporate inventory needs and sales projections for the coming year and setting career objectives for each member of the purchasing and planning team.<br/>Supervisory Responsibilities:Establish and implement purchasing policies, procedures, and best practices.Monitor ongoing compliance with purchasing policies and procedures.Monitor and reduce purchase variances to meet profit objectives.Produce regular reports on purchase commitments, costs, and delivery performance.Oversee the operations and daily activities of the purchasing department.Manage, develop, and motivate purchasing team and planning teamDirect continuous improvement of purchasing processes and planning processes in line with changing organizational needs and market conditions.Develop and monitor KPI’s for suppliers and customers – OTD, Cost Savings, Cost of Inventory / Stock Turns, Supplier Defect Rate.Support vendor qualification and approval process.Monitor and take part in Advanced scheduling process.Monitor capacity utilization and appropriate resource allocation.Monitor daily planning and fulfillment of shipments.Monitor development on demand side by customers and create simulation of needs for operators, material and components in production.Monitor and optimize flow of orders and goods between plants in Garden Grove and Czech Republic<br/>Key Responsibilities:Develop procurement strategy and tactics by collaborating with other departments.Direct procurement policies to ensure all items are purchased and delivered within budget and time constraints.Seek cost saving initiatives that would reduce materials costs by 5% each year.Manage vendor and supplier selection process based on price, quality, support, capacity, and reliability.Develop and maintain strategic relationships with key suppliers and vendors.Establish and update an approved vendor/supplier database.Develop, negotiate and administer purchasing agreements and contracts with suppliers in support of organizational requirements. Negotiate advantageous terms.Measure and manage the vendor and supplier cost, quality, and delivery performance.Participate in the development of specifications for equipment, products, or substitute materials.Fully utilize GP MRP system to plan purchases, planning of production and track performance.Introduce performance improvement measures for suppliers, vendors and planning.Facilitate timely placement of purchase orders.Review purchase orders for proper authorization and compliance with organizational policy and proceduresDevelop and monitor team KPIs in alignment with given targets.Create and maintain tools for long-term simulation of materials and components needs.Measure and maintain OTD by our customers.Maintain and improve Advanced schedule process.Create and maintain tools for simulation of capacity development and appropriate resource allocation (operators).Decrease level of inventory in both plants by increasing higher inventory turnover.Create and maintain long-term simulation of needs of materials and components on the basis of Sales forecasts.Set and maintain appropriate level of service for A, B, C customers.Improve and optimize source utilization between plants in Garden Grove and Czech Republic.<br/>Required Skills/Abilities: Excellent verbal and written communication skillsExcellent organizational skills and attention to detailExcellent time management skills with a proven ability to meet deadlinesStrong analytical and problem-solving skillsStrong supervisory and leadership skillsAbility to function well in a high-paced environmentProficient with Microsoft Office applications, specifically advanced user in Excel is a mustFinancial acumen<br/>Education and Experience:College degree in business, materials management, supply chain or related field5+ years’ experience in purchasing, procurement, materials and components planning2+ years’ supervisory experienceWorking knowledge of all laws and regulations relating to procurement and contractsKnowledge of purchasing and supply chain systems, LEAN principles of planning and MRP/ERP systems often requiredKnowledge of project specific execution will be an added advantage<br/>Compensation:Base salary and annual bonus DOE.Competitive benefits package includes medical, dental, life, disability and 401(K).Not the right fit? Let us know you're interested in a future opportunity by clicking Introduce Yourself in the top-right corner of the page or create an account to set up email alerts as new job postings become available that meet your interest! The ideal candidate is responsible for developing and implementing a supply strategy that delivers the lowest total cost, reduces inventory, and maximizes customer satisfaction through world class service.", "responsibilities": "Establish and implement purchasing policies, procedures, and best practices.Monitor ongoing compliance with purchasing policies and procedures.Monitor and reduce purchase variances to meet profit objectives.Produce regular reports on purchase commitments, costs, and delivery performance.Oversee the operations and daily activities of the purchasing department.Manage, develop, and motivate purchasing team and planning teamDirect continuous improvement of purchasing processes and planning processes in line with changing organizational needs and market conditions.Develop and monitor KPI’s for suppliers and customers – OTD, Cost Savings, Cost of Inventory / Stock Turns, Supplier Defect Rate.Support vendor qualification and approval process.Monitor and take part in Advanced scheduling process.Monitor capacity utilization and appropriate resource allocation.Monitor daily planning and fulfillment of shipments.Monitor development on demand side by customers and create simulation of needs for operators, material and components in production.Monitor and optimize flow of orders and goods between plants in Garden Grove and Czech RepublicDevelop procurement strategy and tactics by collaborating with other departments.Direct procurement policies to ensure all items are purchased and delivered within budget and time constraints.Seek cost saving initiatives that would reduce materials costs by 5% each year.Manage vendor and supplier selection process based on price, quality, support, capacity, and reliability.Develop and maintain strategic relationships with key suppliers and vendors.Establish and update an approved vendor/supplier database.Develop, negotiate and administer purchasing agreements and contracts with suppliers in support of organizational requirements. Negotiate advantageous terms.Measure and manage the vendor and supplier cost, quality, and delivery performance.Participate in the development of specifications for equipment, products, or substitute materials.Fully utilize GP MRP system to plan purchases, planning of production and track performance.Introduce performance improvement measures for suppliers, vendors and planning.Facilitate timely placement of purchase orders.Review purchase orders for proper authorization and compliance with organizational policy and proceduresDevelop and monitor team KPIs in alignment with given targets.Create and maintain tools for long-term simulation of materials and components needs.Measure and maintain OTD by our customers.Maintain and improve Advanced schedule process.Create and maintain tools for simulation of capacity development and appropriate resource allocation (operators).Decrease level of inventory in both plants by increasing higher inventory turnover.Create and maintain long-term simulation of needs of materials and components on the basis of Sales forecasts.Set and maintain appropriate level of service for A, B, C customers.Improve and optimize source utilization between plants in Garden Grove and Czech Republic.", "qualifications": {"required": "Excellent verbal and written communication skillsExcellent organizational skills and attention to detailExcellent time management skills with a proven ability to meet deadlinesStrong analytical and problem-solving skillsStrong supervisory and leadership skillsAbility to function well in a high-paced environmentProficient with Microsoft Office applications, specifically advanced user in Excel is a mustFinancial acumenCollege degree in business, materials management, supply chain or related field5+ years’ experience in purchasing, procurement, materials and components planning2+ years’ supervisory experienceWorking knowledge of all laws and regulations relating to procurement and contractsKnowledge of purchasing and supply chain systems, LEAN principles of planning and MRP/ERP systems often requiredKnowledge of project specific execution will be an added advantage", "preferred": ""}, "skills": ["Communication", "Organizational Skills", "Time Management", "Analytical Skills", "Problem Solving", "Supervisory Skills", "Leadership Skills", "Microsoft Office", "Excel", "Financial Acumen", "Purchasing", "Procurement", "Materials Management", "Supply Chain", "MRP/ERP Systems", "LEAN Principles"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Base salary and annual bonus DOE.Competitive benefits package includes medical, dental, life, disability and 401(K).", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999098158"}