{"jobTitle": "Executive Sales Representative, Pharmaceutical Sales, Southern Cal", "company": {"name": "Planet Green Search, LLC", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$125,000.00/yr - $160,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Staffing and Recruiting", "description": "Executive Sales Representative, Pharmaceutical Sales<br/><br/><strong>Job Title: Executive Sales Representative - Drive Innovation in Gastrointestinal and Bariatric Care!<br/><br/></strong><strong>Location:</strong> Remote, Southern CA<br/><br/><strong>Salary:</strong> $125,000 - $160,000 Base DOE. Quarterly Bonus, Car Package, Full Benes.<br/><br/>TOP Reps making over $150,000 per quarter in bonuses.<br/><br/><strong>Join Us in Shaping the Future of Gastrointestinal and Bariatric Healthcare!<br/><br/></strong>Our Client is a trailblazing Small, specialty pharmaceutical company on a mission to revolutionize the treatment of gastrointestinal and bariatric disorders. As a dynamic and rapidly growing organization founded by seasoned entrepreneurs with over 90 years of combined experience, we’re dedicated to bringing groundbreaking therapies to those who need them most. If you’re a driven sales professional with a passion for healthcare and an eye for results, this is your opportunity to shine!<br/><br/><strong>Why This Role Is Exciting<br/><br/></strong>Our flagship drug is making waves by being prescribed in conjunction with cutting-edge GLP-1 treatments like Ozempic, Wegovy. This role places you at the forefront of a transformative approach in gastrointestinal and bariatric care, offering patients a comprehensive solution that enhances the effectiveness of these well-known treatments. Imagine the impact you’ll make by championing a product that complements and amplifies the benefits of such innovative therapies.<br/><br/><strong>What We Offer<br/><br/></strong><ul><li>Impactful Work: Play a crucial role in advancing treatments for unmet medical needs and improving patient lives in both gastrointestinal and bariatric healthcare.</li><li>Growth Potential: Be part of a company that’s on the cutting edge of pharmaceutical development with ample opportunities for career advancement.</li><li>Innovative Environment: Work in a fast-paced, values-driven culture where your ideas are valued and growth is encouraged.</li><li>Competitive Compensation: Enjoy a robust salary package complemented by performance-based incentives to reward your achievements.<br/><br/></li></ul><strong>Role Overview<br/><br/></strong>As an Executive Sales Representative, you’ll be at the forefront of driving sales and expanding our market presence. You’ll engage with key healthcare providers and specialty pharmacies to build and maintain valuable relationships, utilizing your expertise to influence prescribing habits and boost sales in both gastrointestinal and bariatric care.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Achieve Excellence: Meet and exceed ambitious sales targets through strategic planning and execution.</li><li>Data-Driven Strategies: Analyze territory data and past customer interactions to optimize your call plan and maximize effectiveness.</li><li>Influence &amp; Educate: Leverage your product knowledge to drive prescribing behaviors and educate healthcare providers (HCPs) on the benefits of our drug in conjunction with leading treatments like Ozempic and Wegovy.</li><li>Strategic Business Planning: Develop and implement a business plan that leverages key resources and optimizes the impact of in-office interactions.</li><li>Administrative Excellence: Manage all administrative responsibilities efficiently and complete required Sales Training with excellence.</li><li>Regulatory Compliance: Conduct all business activities in strict accordance with regulations and company policies, upholding the highest ethical standards.<br/><br/></li></ul><strong>What We’re Looking For<br/><br/></strong><ul><li>Educational Background: Bachelor’s degree from a four-year college or university.</li><li>Sales Experience: A proven track record with 8+ years of pharmaceutical or medical sales experience is highly preferred. Specialist sales experience in Gastroenterology and Bariatric clinics is a plus.</li><li>Industry Relationships: Established connections with Gastroenterology/Hepatology practices/HCPs and experience with specialty pharmacy networks are advantageous.</li><li>Strategic Insight: Strong understanding of the payer landscape and experience in managing care criteria and product launch strategies.</li><li>Communication Skills: Excellent verbal and written communication abilities, strong interpersonal skills, and superior organizational skills.</li><li>Entrepreneurial Spirit: Self-motivated and thrives in an entrepreneurial, fast-paced sales environment.<br/><br/></li></ul>Executive Sales Representative, Pharmaceutical Sales", "responsibilities": "Achieve Excellence: Meet and exceed ambitious sales targets through strategic planning and execution.\nData-Driven Strategies: Analyze territory data and past customer interactions to optimize your call plan and maximize effectiveness.\nInfluence &amp; Educate: Leverage your product knowledge to drive prescribing behaviors and educate healthcare providers (HCPs) on the benefits of our drug in conjunction with leading treatments like Ozempic and Wegovy.\nStrategic Business Planning: Develop and implement a business plan that leverages key resources and optimizes the impact of in-office interactions.\nAdministrative Excellence: Manage all administrative responsibilities efficiently and complete required Sales Training with excellence.\nRegulatory Compliance: Conduct all business activities in strict accordance with regulations and company policies, upholding the highest ethical standards.", "qualifications": {"required": "Educational Background: Bachelor’s degree from a four-year college or university.\nSales Experience: A proven track record with 8+ years of pharmaceutical or medical sales experience is highly preferred. Specialist sales experience in Gastroenterology and Bariatric clinics is a plus.\nIndustry Relationships: Established connections with Gastroenterology/Hepatology practices/HCPs and experience with specialty pharmacy networks are advantageous.\nStrategic Insight: Strong understanding of the payer landscape and experience in managing care criteria and product launch strategies.\nCommunication Skills: Excellent verbal and written communication abilities, strong interpersonal skills, and superior organizational skills.\nEntrepreneurial Spirit: Self-motivated and thrives in an entrepreneurial, fast-paced sales environment.", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3999497526"}