{"jobTitle": "Sales Coordinator-Beauty Brand-Glendale, CA", "company": {"name": "24 Seven Talent", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Staffing and Recruiting", "description": "Job title: Sales Coordinator-Beauty Brand-Glendale, CA<br/><br/>Contract type:<br/><br/>Location: Los Angeles<br/><br/>Discipline:<br/><br/>Remote: No<br/><br/>Reference: 475484<br/><br/>Contact name: Arinne Averbach<br/><br/><strong>Job Description<br/><br/></strong>Our client, a growing beauty brand, is looking for a Sales Coordinator to join their team!<br/><br/>As the Sales Coordinator you will play a vital role in supporting the Account Sales Manager and ensuring the smooth operation of customer account needs, sales activities, and administrative processes.<br/><br/>Location-Glendale, CA<br/><br/>Salary-Up to $65K DOE<br/><br/><strong>What You Will Do:<br/><br/><br/></strong><ul><li> Assist the Account Sales Manager or Key Account Manager in managing and servicing customer accounts by coordinating communication, resolving inquiries, and addressing client needs in a timely and professional manner.</li><li> Collaborate closely with the sales team to ensure effective order processing, order tracking, and on-time delivery to clients. Manage and maintain accurate sales records and client data.</li><li> Build and maintain positive relationships with clients, acting as a point of contact for routine requests, order updates, and general information. Ensure clients receive exceptional service.</li><li> Coordinate the needs of the client with internal teams to ensure clients’ request and execution are timely and complete.</li><li> Process and coordinate orders from clients, including order entry, order confirmation, and order status updates. Address any issues or discrepancies that may arise during the order fulfillment process.</li><li> Develop a strong understanding of our cosmetic products, ingredients, and offerings to effectively respond to client queries and provide information as needed.</li><li> Assist in preparing sales reports and forecasts, helping track<br/><br/><br/></li></ul>performance against sales targets and objectives. Utilize CRM systems to manage customer interactions and sales data.<br/><br/><br/><ul><li> Provide general administrative assistance to the sales team, including managing schedules, preparing documents, and coordinating meetings.</li><li> Gather and report on market trends, competitor activities, and customer preferences to assist the sales team in adjusting strategies and identifying opportunities.</li><li> Represent the company at trade shows, industry events, and product launches to showcase our cosmetics and engage with potential clients.</li><li> Maintain open communication with clients through phone, email, and other communication channels, ensuring they are well-informed and satisfied.<br/><br/><br/></li></ul><strong>Who You Are:<br/><br/><br/></strong><ul><li> Minimum 2 years of experience in a sales support or customer service role, with prior experience in Account Management, cosmetics/beauty/skincare.</li><li> Bachelor's degree in business, marketing, or a related field (or equivalent experience).</li><li> Excellent communication and interpersonal skills for interacting with clients and internal teams.</li><li> Ability to address challenges and find solutions in a fast-paced environment.</li><li> Motivated &amp; proactive with a customer-centric mindset.</li><li> Experience working with interdepartmental teams &amp; managing multiple projects at once.</li><li> Proficiency in Microsoft Office, with an emphasis on Excel &amp; PowerPoint.</li><li> Customer-focused and proactive mindset</li><li> Familiar with CRM &amp; ERP Software</li><li> Strong verbal and written communication</li><li> Analytical with a results-oriented mindset.</li><li> Proficient in administrative tasks and other assignments as needed.</li></ul>", "postedDate": "1 week ago", "skills": ["Sales", "Customer Service", "Account Management", "Cosmetics", "Beauty", "Skincare", "Microsoft Office", "Excel", "PowerPoint", "CRM", "ERP Software", "Communication", "Interpersonal Skills", "Problem Solving", "Proactive", "Customer-Centric", "Analytical", "Results-Oriented", "Administrative Tasks"], "url": "https://www.linkedin.com/jobs/view/3999612915"}