{"jobTitle": "LMS Administrator", "company": {"name": "Gradient Learning", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "103,000.00/yr - 113,000.00/yr", "currency": "USD"}, "jobFunction": "Education and Training", "industry": "Technology, Information and Internet", "description": "<strong>Who We Are<br/><br/></strong><strong>Gradient Learning</strong> is a nonprofit organization guided by the vision that educators should be empowered to meet the needs of all of their students. Gradient Learning is <em>rebuilding education together</em> with communities, schools, and educators. We are committed to meeting the holistic needs of every child while fostering success for all. We lead Gradient Learning and Along products.<br/><br/>The <strong>Gradient Learning Program</strong> offers schools a whole-student system to help schools realize their vision for whole-student growth. Our whole student system is a curated and integrated suite of research-based tools and resources, including rigorous curricula, teacher and leader resources and trainings, whole student assessments and data displays, as well as ongoing, customized coaching for school leadership teams. The program is utilized by hundreds of schools across the U.S. to fuel their whole student work.<br/><br/><strong>Along</strong> is a free, interactive video journal that helps teachers guide their students to reflect and grow all year long--whether they're back in the classroom or learning remotely. Along brings skill-building resources and efficient communication into a dedicated space where every student feels seen and heard.<br/><br/>At Gradient Learning, our work is guided by a set of core values as well as our belief in the possibility of change, appreciation for the power of partnership, and commitment to diversity and inclusion.<br/><br/><strong>LMS Administrator<br/><br/></strong><strong>Note:</strong> Internally we will reference the role as <strong>Technical Lead of Learning Platform</strong> to align with our internal structures.<br/><br/><strong>Position Overview<br/><br/></strong>The Gradient Learning Program offers schools a whole-student system to help schools realize their vision for whole-student growth. The whole student system is a curated and integrated suite of research-based tools and resources, including rigorous curricula, teacher and leader resources and trainings, whole student assessments, and data displays, housed on a customized learning platform (powered by the Canvas learning management platform). This suite of tools and resources is supplemented by ongoing, customized coaching for school leadership teams.<br/><br/>To support this whole student system, we seek an LMS Administrator to lead the technical implementation, configuration, delivery, and ongoing evolution of our Customized Learning Platform (powered by Canvas). Specifically, the LMS Administrator will:<br/><br/><strong>Lead the technical administration of the learning platform<br/><br/></strong><ul><li>Deeply understand the role that the Platform serves within the Gradient Learning program strategy</li><li>Deeply understand Gradient Learning's Learning Platform technical instance, including infrastructure and integrations and our unique use of the Canvas LMS</li><li>Configure and manage settings, user accounts, roles, and permissions.</li><li>Coordinate closely with our Information Systems and Security Team and external vendors for system updates, integrations, and maintenance.</li><li>Setup optimized ways to use Canvas APIs</li><li>Be responsible for all 3rd party integrations, deployments, updates, and troubleshooting</li><li>Work closely with the Information Systems and Security Team with a focus on information security</li><li>As needed, support internal and/or external training and technical resources.<br/><br/></li></ul><strong>Continuously improve the learning platform by monitoring impact and user experience<br/><br/></strong><ul><li>Work with the Director of Platform to refine, and support the Annual Platform Roadmap that includes product updates and refinements aligned to overall program needs, school data/feedback, and innovations in the Canvas product and third-party integrations </li><li>Stay updated on the latest LMS trends, tools, and best practices.</li><li>Evaluate and implement new features and integrations to enhance the platform experience</li><li>Monitor and adjust based on data such as platform usage, course completion, and resource needs. </li><li>Provide insights and recommendations for improving LMS usage and user experience. <br/><br/></li></ul><strong>Be trained to provide backup support to the Information Systems and Security Team </strong>in rare instances.<br/><br/>The LMS Administrator will report to the Director of Learning Platform. Click here to learn more about this role and the hiring process at Gradient Learning.<br/><br/><strong>T</strong><strong>he Ideal Candidate<br/><br/></strong>We are looking for a candidate with strong technology expertise in the Canvas Learning Management System as well as general IT infrastructure and user support. We envision this candidate could be someone who started as a technology generalist working for a school district who grew and developed deep technical expertise and skills managing the district's Canvas and Clever or other LMS and/or SIS systems.<br/><br/>Regardless of the specific pathway, we are looking for candidates with:<br/><br/><ul><li>Deep technical understanding of learning management systems, ideally Canvas LMS </li><li>Experience with Learning Tools Interoperability (LTI) integrations</li><li>Experience with data visualization tools, such as Tableau, preferred</li><li>Knowledge of e-learning, remote learning, and/or instructional technology tools is preferred.</li><li>Exceptional project management skills, including the ability to coordinate and work across multiple teams and organizations to deliver results </li><li>Thrives in a diverse and inclusive environment</li><li>Accountable to shared goals and outcomes</li><li>Effective communication skills </li><li>Commitment to providing and receiving constructive feedback to support continuous improvement</li><li>Deep comfort with change and ambiguity, learning and continuous improvement, and approaching the work with humility <br/><br/></li></ul><strong>Location<br/><br/></strong>Our work is national in scope, and our team is virtual. The location for this role is flexible within the US.<br/><br/><strong>Qualifications<br/><br/></strong><ul><li>Commitment to uphold Gradient Learning values.</li><li><strong>Bachelor's</strong> degree in a related field (preferred). </li><li>Excellent at using technology, learning new technologies, and transferring that learning to others.</li><li>4+ years, of previous experience managing and executing the technical administration of learning management systems, especially Canvas (required).</li><li>Experience working in the K-12 space (i.e., in schools, educational nonprofits, and educational technology companies) is strongly preferred </li><li><strong>Technical Administration Proficiency</strong> in Google Platforms, i.e., Google Drive, Google Sheets, Google Docs, and Google Slides. </li><li>A clear health and background check.</li><li>An ability to travel 10%. <br/><br/></li></ul><strong>What We Expect From You<br/><br/></strong>Regardless of role, we ask all of our team members to commit to the following.<br/><br/><ul><li>You maintain high expectations for all students and believe all students can find success in school, college, and life.</li><li>You thrive while collaborating and are excited to work with your colleagues. You find positivity in shared successes. </li><li>You're deeply dedicated to social justice and feel motivated by the challenge and impact of working in a heterogeneous community and closing the achievement gap.</li><li>You share our vision of reimagining what schools should be and are excited to make an impact on the public education landscape. </li><li>You are data-driven and collect, evaluate, and utilize data in meaningful ways.</li><li>You are positive and resilient in the face of big challenges.</li><li>You take initiative and ownership in driving your work to meet personal and team goals. </li><li>You possess strong relationship skills and motivate, inspire, develop, and communicate with diverse groups of teachers, Leaders, staff members, and community members.</li><li>You apply honest, actionable, and timely feedback that results in improved performance.</li><li>You have a strategic mindset when it comes to executing Professional Development initiatives. </li><li>You are empathetic and culturally competent. You're open to having hard conversations.</li><li>You thrive in innovative environments and are comfortable with the ambiguity that can come with a dynamic and progressive workplace.</li><li>You're committed to continuous improvement, see feedback as a positive, and have a growth mindset.<br/><br/></li></ul><strong>What You Can Expect From Us:<br/><br/></strong>Gradient Learning offers full-time employees competitive salaries and benefits. The beginning range for this role is $103,000-$113,000 with candidates typically starting at the beginning portion of the range, this enables the employees growth in the range over time. The actual placement of the range depends on the candidate's qualifications, internal equity considerations, and the budget earmarked for this role. Candidates living in the following areas will receive a cost of labor increase of:<br/><br/><ul><li>SF Bay Area: +10%</li><li>New York Metro Area: +5% <br/><br/></li></ul>Gradient Learning values transparency and internal equity in our compensation system and decisions. To support these goals we share and adhere to defined scales for each job class and do not negotiate salaries.<br/><br/>To learn more about our benefits, visit our careers website at <strong>www.gradientlearning.org/careers/<br/><br/></strong><strong>Application Deadline: Friday, August 23rd<br/><br/></strong><strong>We strive</strong> <strong>to</strong> <strong>recruit</strong> <strong>a</strong> <strong>diverse</strong> <strong>team.</strong> Gradient Learning is an equal opportunity employer and does not discriminate against any employee or applicant on the basis of race, color, ethnicity, national origin, religion, gender, gender identity and/or expression, sexual orientation, disability, age, marital status, military status, pregnancy, parenthood, citizenship status, creed, or any other characteristic protected by federal, state or local law. We will provide reasonable accommodations for qualified individuals with disabilities.<strong> BIPOC, LGBTQIA+, and other candidates from non-dominant backgrounds are encouraged to apply.</strong>", "responsibilities": "The Gradient Learning Program offers schools a whole-student system to help schools realize their vision for whole-student growth. The whole student system is a curated and integrated suite of research-based tools and resources, including rigorous curricula, teacher and leader resources and trainings, whole student assessments, and data displays, housed on a customized learning platform (powered by the Canvas learning management platform). This suite of tools and resources is supplemented by ongoing, customized coaching for school leadership teams.<br/><br/>To support this whole student system, we seek an LMS Administrator to lead the technical implementation, configuration, delivery, and ongoing evolution of our Customized Learning Platform (powered by Canvas). Specifically, the LMS Administrator will:<br/><br/><strong>Lead the technical administration of the learning platform<br/><br/></strong><ul><li>Deeply understand the role that the Platform serves within the Gradient Learning program strategy</li><li>Deeply understand Gradient Learning's Learning Platform technical instance, including infrastructure and integrations and our unique use of the Canvas LMS</li><li>Configure and manage settings, user accounts, roles, and permissions.</li><li>Coordinate closely with our Information Systems and Security Team and external vendors for system updates, integrations, and maintenance.</li><li>Setup optimized ways to use Canvas APIs</li><li>Be responsible for all 3rd party integrations, deployments, updates, and troubleshooting</li><li>Work closely with the Information Systems and Security Team with a focus on information security</li><li>As needed, support internal and/or external training and technical resources.<br/><br/></li></ul><strong>Continuously improve the learning platform by monitoring impact and user experience<br/><br/></strong><ul><li>Work with the Director of Platform to refine, and support the Annual Platform Roadmap that includes product updates and refinements aligned to overall program needs, school data/feedback, and innovations in the Canvas product and third-party integrations </li><li>Stay updated on the latest LMS trends, tools, and best practices.</li><li>Evaluate and implement new features and integrations to enhance the platform experience</li><li>Monitor and adjust based on data such as platform usage, course completion, and resource needs. </li><li>Provide insights and recommendations for improving LMS usage and user experience. <br/><br/></li></ul><strong>Be trained to provide backup support to the Information Systems and Security Team </strong>in rare instances.", "qualifications": {"required": "Commitment to uphold Gradient Learning values., 4+ years, of previous experience managing and executing the technical administration of learning management systems, especially Canvas (required)., Experience working in the K-12 space (i.e., in schools, educational nonprofits, and educational technology companies) is strongly preferred , Technical Administration Proficiency in Google Platforms, i.e., Google Drive, Google Sheets, Google Docs, and Google Slides., A clear health and background check., An ability to travel 10%.", "preferred": "Bachelor's degree in a related field (preferred)., Excellent at using technology, learning new technologies, and transferring that learning to others."}, "skills": ["Canvas LMS", "Learning Tools Interoperability (LTI)", "Tableau", "e-learning", "remote learning", "instructional technology", "project management", "Google Drive", "Google Sheets", "Google Docs", "Google Slides"], "postedDate": "1 week ago", "benefits": "Gradient Learning offers full-time employees competitive salaries and benefits. The beginning range for this role is $103,000-$113,000 with candidates typically starting at the beginning portion of the range, this enables the employees growth in the range over time. The actual placement of the range depends on the candidate's qualifications, internal equity considerations, and the budget earmarked for this role. Candidates living in the following areas will receive a cost of labor increase of:<br/><br/><ul><li>SF Bay Area: +10%</li><li>New York Metro Area: +5% <br/><br/></li></ul>Gradient Learning values transparency and internal equity in our compensation system and decisions. To support these goals we share and adhere to defined scales for each job class and do not negotiate salaries.<br/><br/>To learn more about our benefits, visit our careers website at <strong>www.gradientlearning.org/careers/</strong>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3999775613"}