{"jobTitle": "Associate Manager, Strategic Partnerships", "company": {"name": "DoorDash", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Software Development", "description": "About The Team<br/><br/>Strategic Partnerships sits within the Enterprise Sales Team and is responsible for the strategic vision, acquisition, management and growth of DoorDash’s partnerships with the world’s largest restaurant groups. Given the scale and complexity of our key partners, this team is a critical piece of DoorDash’s growth and success in every market in which we operate.<br/><br/>About The Role<br/><br/>As an Associate Manager, you will lead the day-to-day relationship, manage projects, execute operational plans, and own client working team relationships with some of our largest restaurant clients. In this role, you will develop and own a big part of the operational and profitability plan for one or more of our top partners and work closely with cross-functional partners across marketing, ops, ads, legal, analytics, and product to drive our business forward.<br/><br/>You’re Excited About This Opportunity Because You Will…<br/><br/>\n<ul><li>Oversee the health of the operations for the partners, optimize cost and profitability, while continuing to improve the customer experience</li><li>Work cross-functionally and serve as a working team lead with our partners, DoorDash management, operations, product, and support teams</li><li>Lead the analytics and process tied to growth, operational improvements, and refunds management</li><li>Be instrumental in executing the off premise strategy for one or more of our largest partners</li><li>Be the point of contact for all client requirements and issues on multiple workstreams</li><li>Analyze data and use insights to build business case and drive adoption of our recommendations</li><li>Lead meetings and business reviews with clients and internal leadership<br/><br/></li></ul>We’re Excited About You Because…<br/><br/>\n<ul><li>You have 5+ years of experience in management or operations consulting, business strategy / analytics, business operations, or other analytically-intensive and client facing roles</li><li>You have proven success working in cross-functional teams to build creative solutions</li><li>You like rolling up your sleeves as much as you like the big picture</li><li>You have strong project management, organization, and presentation skills</li><li>You are a problem solver at core, with a strong bias for action</li><li>You’re comfortable with a fast pace and several moving parts</li><li>You have a bachelor’s degree and a strong understanding of business</li><li>You are proficient with excel and creating impactful presentations; intermediate SQL proficiency is required but can be acquired on the job<br/><br/></li></ul>We use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on June 20, 2024.<br/><br/>Please see the independent bias audit report covering our use of Covey here.<br/><br/>Compensation<br/><br/>Actual compensation within the pay range listed below will be decided based on factors including, but not limited to, skills, prior relevant experience, and specific work location. Base salary is localized according to employee work location.<br/><br/>In addition to base salary, the compensation for this role includes opportunities for equity grants and sales commission. The estimated pay range for this position represents total on-target earnings (including base salary and on-target incentive pay). Talk to your recruiter for more information.<br/><br/>DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefit and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match and a mental health program, among others.<br/><br/>To learn more about our benefits, visit our careers page here.<br/><br/>The base pay for this position ranges from our lowest geographical market up to our highest geographical market within California, Colorado, District of Columbia, Hawaii, New Jersey, New York and Washington.<br/><br/>$132,600—$195,000 USD<br/><br/>About DoorDash<br/><br/>At DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users—from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods.<br/><br/>DoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees’ happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.<br/><br/>Our Commitment to Diversity and Inclusion<br/><br/>We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.<br/><br/>Statement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on “protected categories,” we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce – people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.<br/><br/>If you need any accommodations, please inform your recruiting contact upon initial connection.", "responsibilities": "As an Associate Manager, you will lead the day-to-day relationship, manage projects, execute operational plans, and own client working team relationships with some of our largest restaurant clients. In this role, you will develop and own a big part of the operational and profitability plan for one or more of our top partners and work closely with cross-functional partners across marketing, ops, ads, legal, analytics, and product to drive our business forward.", "qualifications": {"required": "You have 5+ years of experience in management or operations consulting, business strategy / analytics, business operations, or other analytically-intensive and client facing roles\nYou have proven success working in cross-functional teams to build creative solutions\nYou like rolling up your sleeves as much as you like the big picture\nYou have strong project management, organization, and presentation skills\nYou are a problem solver at core, with a strong bias for action\nYou’re comfortable with a fast pace and several moving parts\nYou have a bachelor’s degree and a strong understanding of business\nYou are proficient with excel and creating impactful presentations; intermediate SQL proficiency is required but can be acquired on the job"}, "skills": ["Management Consulting", "Business Strategy", "Business Analytics", "Business Operations", "Project Management", "Presentation Skills", "Problem Solving", "Excel", "SQL"], "postedDate": "1 week ago", "benefits": "DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefit and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match and a mental health program, among others.", "salary": {"amount": "132,600—195,000", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999005312"}