{"jobTitle": "Global Experiences Manager", "company": {"name": "Meta", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "122,000.00/yr - 176,000.00/yr", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Technology, Information and Internet", "description": "We're seeking an experienced experiential marketer to join our Global Experiential + Industry Marketing team, focusing on developing and executing immersive physical and digital brand experiences across global tent poles (CES, MWC, Cannes, Davos, Meta Connect and more). As a Global Experiences Manager, you'll contribute to conceptualizing and activating strategies supporting Meta's priorities and product launches.<br/><br/>Global Experiences Manager Responsibilities:<br/><br/><ul><li>Develop and execute experiential marketing strategies for global events and activations</li><li>Collaborate with cross-functional teams to integrate content, insights, and partnerships</li><li>Design and produce innovative digital and in-person experiences showcasing Meta's products and services</li><li>Partner with production agencies, creative agencies and internal teams to bring strategic concepts to life</li><li>Contribute to 360-degree marketing strategies aligning with Meta's goals</li><li>Work with Decision Science team to define and report measurement metrics</li><li>Administrative task ownership across budgets, contracts, internal reviews</li><li>Complex problem solving and the ability to align XFN teams against goals and objectives<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>8+ years of marketing experience, with a focus on experiential marketing</li><li>5+ years of project management experience, with budget management skills</li><li>Experience in developing and producing innovative hybrid, multi-channel experiences</li><li>Experience managing agency, partner, and vendor relationships</li><li>Knowledge of advertising, technology, marketing, and media landscapes</li><li>Experience working across various levels of the organization while building collaboration</li><li>Direct experience managing B2B and B2C experiential programs<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Experience in the tech, advertising, marketing technology, or media industry</li><li>Experience in brand marketing and experiential marketing</li><li>Executive Leadership presence and comfortability interfacing with all levels across communications and presentations<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$122,000/year to $176,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "Develop and execute experiential marketing strategies for global events and activations\nCollaborate with cross-functional teams to integrate content, insights, and partnerships\nDesign and produce innovative digital and in-person experiences showcasing Meta's products and services\nPartner with production agencies, creative agencies and internal teams to bring strategic concepts to life\nContribute to 360-degree marketing strategies aligning with Meta's goals\nWork with Decision Science team to define and report measurement metrics\nAdministrative task ownership across budgets, contracts, internal reviews\nComplex problem solving and the ability to align XFN teams against goals and objectives", "qualifications": {"required": "8+ years of marketing experience, with a focus on experiential marketing\n5+ years of project management experience, with budget management skills\nExperience in developing and producing innovative hybrid, multi-channel experiences\nExperience managing agency, partner, and vendor relationships\nKnowledge of advertising, technology, marketing, and media landscapes\nExperience working across various levels of the organization while building collaboration\nDirect experience managing B2B and B2C experiential programs", "preferred": "Experience in the tech, advertising, marketing technology, or media industry\nExperience in brand marketing and experiential marketing\nExecutive Leadership presence and comfortability interfacing with all levels across communications and presentations"}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "$122,000/year to $176,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3999504266"}