{"jobTitle": "HR Assistant", "company": {"name": "Ultimate Staffing", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "21.00/hr - 23.00/hr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Human Resources Services", "description": "A dynamic and growing company committed to fostering a positive and productive workplace. We are seeking a detail-oriented and proactive HR Assistant to support our HR department in day-to-day operations. This role is essential in ensuring our HR processes run smoothly and efficiently.\n\nPosition Overview:\n\nThe HR Assistant will provide administrative support to the HR team, assisting with various HR functions including recruitment, onboarding, employee records management, and compliance. The ideal candidate will have strong organizational skills, a keen eye for detail, and a passion for working with people.\n\nKey Responsibilities:\n\nAssist with day-to-day HR operations, including maintaining employee records, preparing HR documents, and handling HR inquiries.\nRecruitment Assistance: Support the recruitment process by posting job ads, scheduling interviews, and communicating with candidates.\nOnboarding: Assist in onboarding new employees, ensuring they have all necessary resources and information for a successful start.\nMaintain and update employee records in the HR database, ensuring accuracy and confidentiality.\nHelp ensure the company's HR practices are compliant with federal and state labor laws.\nAssist with organizing employee events, training sessions, and other HR-related activities.\nGeneral Support: Provide general administrative support to the HR team and assist with special projects as needed.\n\nQualifications:\n\nExperience: 1-2 years of experience in an administrative or HR role is preferred.\nEducation: An associate degree in Human Resources, Business Administration, or a related field is preferred.\nSkills: Strong organizational and time management skills, excellent communication abilities, and proficiency in MS Office Suite (Word, Excel, Outlook).\nAttributes: Detail-oriented, discreet, and able to handle sensitive information with confidentiality.\n\nWhat We Offer:\n\nCompetitive compensation and benefits package.\nA supportive and collaborative work environment.\nOpportunities for growth and development within the company.\n\nPayrate- $21-23hr\n\n_All qualified applicants will receive consideration for employment without regard to race, color, national origin, age, ancestry, religion, sex, sexual orientation, gender identity, gender expression, marital status, disability, medical condition, genetic information, pregnancy, or military or veteran status. We consider all qualified applicants, including those with criminal histories, in a manner consistent with state and local laws, including the California Fair Chance Act, City of Los Angeles' Fair Chance Initiative for Hiring Ordinance, and Los Angeles County Fair Chance Ordinance. To the extent our customers require a background check for certain positions, the Company faces a significant risk to its business operations and business reputation unless a review of criminal history is conducted for those specific job positions._", "responsibilities": "Assist with day-to-day HR operations, including maintaining employee records, preparing HR documents, and handling HR inquiries.<br/>Recruitment Assistance: Support the recruitment process by posting job ads, scheduling interviews, and communicating with candidates.<br/>Onboarding: Assist in onboarding new employees, ensuring they have all necessary resources and information for a successful start.<br/>Maintain and update employee records in the HR database, ensuring accuracy and confidentiality.<br/>Help ensure the company's HR practices are compliant with federal and state labor laws.<br/>Assist with organizing employee events, training sessions, and other HR-related activities.<br/>General Support: Provide general administrative support to the HR team and assist with special projects as needed.", "qualifications": {"required": "Experience: 1-2 years of experience in an administrative or HR role is preferred.<br/>Education: An associate degree in Human Resources, Business Administration, or a related field is preferred.<br/>Skills: Strong organizational and time management skills, excellent communication abilities, and proficiency in MS Office Suite (Word, Excel, Outlook).<br/>Attributes: Detail-oriented, discreet, and able to handle sensitive information with confidentiality.", "preferred": ""}, "skills": ["HR", "Recruitment", "Onboarding", "Employee Records", "Compliance", "Organizational Skills", "Attention to Detail", "Communication", "MS Office Suite", "Word", "Excel", "Outlook"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Competitive compensation and benefits package.<br/>A supportive and collaborative work environment.<br/>Opportunities for growth and development within the company.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999372059"}