{"jobTitle": "SVP, Global TV Distribution Controller", "company": {"name": "NBCUniversal", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "230,000.00 - 300,000.00", "currency": "USD"}, "jobFunction": "Accounting/Auditing", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "description": "We create world-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world-renowned theme parks and attractions through Universal Destinations & Experiences. NBCUniversal is a subsidiary of Comcast Corporation.<br/><br/>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced, and heard. Together, we’ll continue to create and deliver content that reflects the current and ever-changing face of the world.<br/><br/><strong>About Us<br/><br/></strong>NBCUniversal Global TV Distribution is responsible for the licensing and distribution of NBCUniversal product to all forms of television and new media platforms in the U.S., Canada and in over 200 territories internationally. NBCUniversal’s content portfolio includes a vast and diverse library of more than 6,500 feature films and 170,000 television episodes, including current and classic titles, non-scripted programming, kids, sports, news, long-form and short-form programming from Universal Pictures, Focus Features, Universal Television, UCP, Universal International Studios, Sky Studios, NBC Late Night properties, DreamWorks Animation, Telemundo, and more, as well as locally produced content from around the world. Global TV Distribution is a division of Comcast NBCUniversal.<br/><br/><strong>Job Description<br/><br/></strong>The Global Television Distribution Controller will serve as an integral business partner in the operational accounting aspects of NBCUniversal’s Global Television Distribution business. The role reports to the Senior Vice President, Studio Group Controller and has dotted lines to the Global Television Distribution CFO as a key advisor to finance leadership on all accounting matters. This role is responsible for overseeing all operational accounting processes, monthly and quarterly close, reporting and the assessment and validation of internal control activities for the division. This individual will act as a conduit for corporate accounting initiatives and aid in the development of global processes and standardization of policies. The role is a key point of contact between the business units and corporate controllership. Lastly this role will be integral in Global Television Distribution’s implementation of new revenue and billing technology as well as ensure engagement and appropriate resourcing for the division’s role in NBCUniversal’s implementation of SAP S/4.<br/><br/><strong>Qualifications<br/><br/></strong><strong>Key Responsibilities: <br/><br/></strong><ul><li>Provide strong leadership to the Global Television Distribution accounting organization to ensure the integrity of financial statements, adherence to US GAAP and timely closing of the books.</li><li>Assess control environment through review of control activities; identify and concentrate on improvement opportunities in key, high risk areas.</li><li>Act as dedicated accounting resource and advisor to business unit CFO.</li><li>Collaborate on corporate global initiatives and process change across the portfolio.</li><li>Drive a culture of continuous improvement throughout Global Television Distribution and work with fellow Controllers to determine and implement best practices across the broader organization.</li><li>Support business unit accounting teams with internal and external auditor engagements and assist with addressing audit findings.</li><li>Lead, mentor, and develop the accounting team, including establishing goals, objectives, and performance metrics for the accounting team and fostering a collaborative working environment with other departments and stakeholders.</li><li>Functional leadership of major technology initiatives including a revenue and billing system and SAP S/4.<br/><br/></li></ul><em>The responsibilities associated with this position are not limited to the above descriptions and may be modified at any time by the Department or NBCUniversal.<br/><br/></em><strong>Basic Requirements<br/><br/></strong><ul><li>Bachelor’s degree in Accounting and a minimum of 20 years of relevant accounting/controller senior management experience with a track record of managing high-performing teams</li><li>CPA required<br/><br/></li></ul><strong>Desired Characteristics<br/><br/></strong><ul><li>SAP experience preferred</li><li>Big 4 Accounting firm experience a plus</li><li>Direct experience working in a complex, large scale accounting and finance environment</li><li>Demonstrated background and knowledge of US GAAP and SOX</li><li>Strong communicator able to build consensus and drive results through collaboration, influence, and persuasion</li><li>Proven business partner with the ability to lead change and counsel effectively across business divisions</li><li>Relevant media industry experience preferred<br/><br/></li></ul><strong>Additional Information<br/><br/></strong><strong>Additional Requirements<br/><br/></strong><ul><li>Interested candidate must submit a resume/CV through www.nbcunicareers.com to be considered.</li><li>Must be willing to work in Universal City, California.</li><li>Must have unrestricted work authorization to work in the United States.<br/><br/></li></ul><strong><em>This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.<br/><br/></em></strong><strong><em>This position is eligible for company-sponsored benefits, including medical, dental, and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the </em></strong><strong><em>Benefits page</em></strong><strong><em> of the Careers website. </em></strong><strong><em>Salary range $</em></strong><strong><em>230,000-$300,000 (bonus and long-term incentive eligible). <br/><br/></em></strong>NBCUniversal's policy is to provide equal employment opportunities to all applicants<br/><br/>and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation,<br/><br/>marital status, pregnancy, veteran status, membership in the uniformed services,<br/><br/>genetic information, or any other basis protected by applicable law.<br/><br/>NBCUniversal will consider for employment qualified applicants with criminal histories,<br/><br/>or arrest or conviction records, in a manner consistent with relevant legal<br/><br/>requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring<br/><br/>Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.<br/><br/>If you are a qualified individual with a disability or a disabled veteran, you have the<br/><br/>right to request a reasonable accommodation if you are unable or limited in your<br/><br/>ability to use or access nbcunicareers.com as a result of your disability. You can<br/><br/>request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.", "responsibilities": "The Global Television Distribution Controller will serve as an integral business partner in the operational accounting aspects of NBCUniversal’s Global Television Distribution business. The role reports to the Senior Vice President, Studio Group Controller and has dotted lines to the Global Television Distribution CFO as a key advisor to finance leadership on all accounting matters. This role is responsible for overseeing all operational accounting processes, monthly and quarterly close, reporting and the assessment and validation of internal control activities for the division. This individual will act as a conduit for corporate accounting initiatives and aid in the development of global processes and standardization of policies. The role is a key point of contact between the business units and corporate controllership. Lastly this role will be integral in Global Television Distribution’s implementation of new revenue and billing technology as well as ensure engagement and appropriate resourcing for the division’s role in NBCUniversal’s implementation of SAP S/4.", "qualifications": {"required": "Bachelor’s degree in Accounting and a minimum of 20 years of relevant accounting/controller senior management experience with a track record of managing high-performing teams\nCPA required", "preferred": "SAP experience preferred\nBig 4 Accounting firm experience a plus\nDirect experience working in a complex, large scale accounting and finance environment\nDemonstrated background and knowledge of US GAAP and SOX\nStrong communicator able to build consensus and drive results through collaboration, influence, and persuasion\nProven business partner with the ability to lead change and counsel effectively across business divisions\nRelevant media industry experience preferred"}, "skills": ["US GAAP", "SOX", "SAP", "Accounting", "Finance", "Leadership", "Management", "Communication", "Collaboration", "Influence", "Persuasion", "Business Partnering", "Change Management", "Media Industry"], "postedDate": "1 week ago", "benefits": "This position is eligible for company-sponsored benefits, including medical, dental, and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3999005974"}