{"jobTitle": "Supervisor", "company": {"name": "TTEC", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Management", "industry": "Outsourcing and Offshoring Consulting and Telecommunications", "description": "At TTEC, we’re all about the Human Experience. Elevated. As a Service Delivery Supervisor you’ll be a part of creating and delivering amazing customer experiences while you also #ExperienceTTEC, an award-winning employment experience and company culture.\n\n**What You’ll Be Doing**\n\nDo you have a passion for leading, mentoring and coaching? Looking for an opportunity to learn more about the industry and gain direct management experience? In this role, you’ll support and motivate your team to make sure they’re on track to meet goals. You’ll work to answer associate’s questions, issues, and customer escalation while ensuring quality customer experience on every call as you’re the first line manager for your team.\n\nYou’ll report to the Service Delivery Manager. We’re looking for a leader to Act as one, as you will encourage and motivate you team to resolve issues, accomplish goals and influence their career mobility.\n\n**Compensation**\n\nThe anticipated range is $26.04 hourly.\n\n**During a Typical Day, You’ll **\n\n* Coach associates to ensure achievement of company and client goals while addressing employee related issues and coordinating training on new or revised information relating to services, products or processes of projects\n* Bring your time management and organizational skills to manage multiple, complex, on‐going tasks and projects while monitoring absence and attendance of your team\n* Motivate and develop your team with your open, honest manner and high level of integrity in providing feedback and acknowledging a job well done \n\n**What You Bring To The Role**\n\n* Associate degree, technical school or equivalent work experience\n* Continuously promote a performance-driven culture and always work towards reaching for amazing\n* Engage and support your team in making sure they have the proper tools and systems to accomplish day-to-day tasks\n* Consistently mentor and inspire others\n* 6 months customer service experience and a customer focused mindset\n* Computer savvy \n\n**What You Can Expect**\n\n* Knowledgeable, encouraging, supporting and present leadership\n* Diverse and community minded organization\n* Career-growth and lots of learning opportunities for aspiring minds\n* And yes... all the competitive compensation, performance bonus opportunities, benefits you'd expect and maybe a few that would pleasantly surprise you \n\n**About TTEC**\n\nOur business is about making customers happy. That’s all we do. Since 1982, we’ve helped companies build engaged, pleased, profitable customer experiences powered by our combination of humanity and technology. On behalf of many of the world’s leading iconic and disruptive brands, we talk, message, text, and video chat with millions of customers every day. These exceptional customer experiences start with you.\n\nTTEC is proud to be an equal opportunity employer. TTEC embraces and is committed to building a diverse and inclusive workforce that respects and empowers the culture and perspectives within our global teams. We strive to reflect the communities we serve by not only delivering amazing service and technology, but also humanity. We make it a point to make sure all our employees feel valued and comfortable being their authentic selves at work. As a global company, we know diversity is our strength. It enables us to view projects and ideas from different vantage points and allows every individual to bring value to the table in their own unique way.\n\n**Primary Location**\n\nUS-CA-Irvine", "postedDate": "1 week ago", "skills": ["Customer Service", "Leadership", "Coaching", "Mentoring", "Time Management", "Organizational Skills", "Performance Management", "Teamwork", "Communication", "Integrity", "Computer Skills"], "url": "https://www.linkedin.com/jobs/view/3999385318"}