{"jobTitle": "Virtual Customer Support Associate (Part Time)-Hyderabad, India", "company": {"name": "Amazon", "location": "Indiana, United States"}, "location": "Indiana, United States", "jobType": "Seasonal (Contractual)", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Information Technology and Customer Service", "industry": "Software Development", "description": "Our mission at Amazon is to be Earth’s most customer-centric company, and our award-winning Customer Service team is a key part of achieving that goal. Doing our best for our customers is where we get our energy, and that’s why you’ll find we approach things differently here. You won’t be asked to read from a script or learn dialogue by heart. Instead we’ll provide you with the training you need to problem solve for our customers. You’ll bring your unique personality to every customer conversation and deliver the exceptional support experience our customers love.<br/><br/><strong>What will you do as a Customer Service Associate?<br/><br/></strong>As an Amazon Customer Service Associate, you have a very clear purpose: to prevent issues, solve queries, and delight our customers. You’ll be the first point of contact for our customers by answering their requests through phone, chat and/or email – this includes everything from order and product questions to payment matters and website guidance. Our Customer Service Associates use a variety of tools to navigate, research, and review solutions, and communicate effectively with customers<br/><br/>What strengths will you bring?<br/><br/><ul><li> Hard-working, articulate, and detail-oriented</li><li> Friendly and customer-focused in every situation</li><li> Ability to learn quickly and embrace change</li><li> Comfortable multi-tasking in a high-energy environment.<br/><br/></li></ul><strong>What benefits will you receive?<br/><br/></strong><strong>Benefits<br/><br/></strong>One of the great things about joining Amazon’s Customer Service team is that you don’t need past experience in customer service. You’ll receive training and be provided with a complete equipment package when you join. Additionally, we offer a number of benefits, including:<br/><br/><ul><li>Medical insurance</li><li>Pension plan</li><li>Internet allowance</li><li>Lifestyle benefits and retail discounts through our Amazon Extras program</li><li>Expert training and ongoing opportunities to learn more and develop your skills<br/><br/></li></ul><strong>If this role sounds like it’s for you, then click on the link below to start the application process!<br/><br/></strong>You’ll need to allow 3 hours to complete the full application, including assessments which will evaluate your suitability for the role. You will have the option to save your application during the process and return to it if necessary. We recommend using a laptop/desktop computer in order to get the best experience.<br/><br/>If successful, we will contact you about next steps!<br/><br/><em>Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build.<br/><br/></em><em>Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice to know more about how we collect, use and transfer the personal data of our candidates.<br/><br/></em><strong>Basic Qualifications<br/><br/></strong><strong>What qualifications do we need from you?<br/><br/></strong><ul><li>Minimum age: 18 years old</li><li>Have the right to work in India</li><li>Strong communication skills in English (both written and oral fluency)</li><li>The availability to work varying shifts from Monday to Sunday within the operating hours</li><li>Willingness and ability to work in rotating shifts (i.e. early, late, overnight, weekend, and overtime as required)</li><li>You'll need a quiet, distraction free work space (dedicated office space with a desk and chair)</li><li>From a technical perspective, a minimum broadband connection of 100MB download speed and 20MP upload speed- upload speed using a hard-wire ethernet internet connection (no WIFI).<br/><br/></li></ul><em> I, hereby consent to the recording of your video and audio during interview stages and during the term of your employment at Amazon (as applicable) for the purposes of proctoring the assessment and validating your identity. You further agree that Amazon, Amazon's authorized personnel or third parties authorized by Amazon may capture and store a screenshot of your face which will be used for the purpose of Amazon's internal records purpose and continued identity verification. Further, you may also be required to show a government issued ID (except Aadhaar card) having your photo to Amazon, Amazon's authorized personnel or third parties authorized by Amazon during your interview stages and on your first day of joining Amazon as an employee. You consent that a screenshot of the government ID may be captured by Amazon or Amazon's authorized personnel, or third parties authorized by Amazon for Amazon's internal records purpose and validation of your identity.<br/><br/><br/></em><strong>Company</strong> - Amazon Dev Center India - Hyderabad<br/><br/>Job ID: ASF240115193", "postedDate": "1 week ago", "skills": ["Customer Service", "Communication", "English", "Problem Solving", "Multitasking", "Training", "Benefits", "Medical Insurance", "Pension Plan", "Internet Allowance", "Retail Discounts", "Technical Skills", "Broadband Connection", "Download Speed", "Upload Speed", "Ethernet Connection", "Video Recording", "Audio Recording", "Identity Verification", "Government Issued ID", "Screenshot", "Internal Records", "Validation", "Company", "Job ID"], "benefits": "One of the great things about joining Amazon’s Customer Service team is that you don’t need past experience in customer service. You’ll receive training and be provided with a complete equipment package when you join. Additionally, we offer a number of benefits, including:<br/><br/><ul><li>Medical insurance</li><li>Pension plan</li><li>Internet allowance</li><li>Lifestyle benefits and retail discounts through our Amazon Extras program</li><li>Expert training and ongoing opportunities to learn more and develop your skills<br/><br/></li></ul>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3999540900"}