{"jobTitle": "Business Process Technology Analyst", "company": {"name": "City of Santa Monica", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Other", "industry": "Government Administration", "description": "<strong>Job Summary<br/><br/></strong>Serves as a strategic partner responsible for understanding and meeting business requirements. Analyzes business processes and workflows, and improves efficiency through automation and streamlined operations. Serves as a liaison to various City departments, providing consulting on reactive, proactive, and enhancement support services with primary focus on customer satisfaction.<br/><br/><strong>Representative Duties<br/><br/></strong>Provides technical support and acts as a technology liaison and subject matter expert in support of business specific systems.<br/><br/>Collects, analyzes, and documents business requirements for process and customer experience improvements. Defines end-to-end use cases and user stories. Conducts research on emerging information technology products and services to support business needs.<br/><br/>Participates in development of technology roadmaps based on business.<br/><br/>Establishes and manages relationships and agreements with external service providers.<br/><br/>Designs, implements, tests, and supports business software systems and applications.<br/><br/>Configures, maintains and updates applicable hardware and software systems, as needed.<br/><br/>Monitors activities that support all system setups, configurations, upgrades, and modifications for business software applications per established standards.<br/><br/>Implements process and system change activities in adherence to all Department policies and procedures focusing on enhancing system security, reliability, and availability.<br/><br/>Monitors, measures and provides feedback on process and system performance. Identifies meaningful KPIs to drive performance improvements and validate services are meeting service level agreements.<br/><br/>Documents process workflows, system support materials, knowledge articles, and support self-service capabilities through the Service Portal.<br/><br/>Assists with providing individual or group training on business software applications, policies, and procedures, including development of training and procedural guides for end users.<br/><br/>Communicates and coordinates during major incidents impacting departments. Adheres to major incident management process and escalation requirements and post-mortem incident reviews and root cause problem identification.<br/><br/>Responds to periodic after-hours calls and emails to address critical systems outages both in-person and via phone.<br/><br/>Performs related duties as assigned.<br/><br/><strong>Requirements<br/><br/></strong><strong>Knowledge of:<br/><br/></strong>Business Processes and customer experience facilitation techniques including: Lean IT, Voice of the Customer, and Journey Mapping.<br/><br/>ITIL and the entire IT Service Delivery lifecycle.<br/><br/>Project and program management principles and best practices.<br/><br/>Software delivery life-cycle methodologies including Agile, SCRUM, and Kanban.<br/><br/>Software system configuration, maintenance, administration, analysis, and problem resolution best practices.<br/><br/>ERP, BPM, CRM, and BI tools.<br/><br/>SOAP, WSDL, XML, and other key protocols.<br/><br/>Database access tools including SQL.<br/><br/><strong>Ability To<br/><br/></strong>Prepare complex reports using Crystal Reports and Microsoft SQL.<br/><br/>Install and maintain software systems.<br/><br/>Become proficient in new software applications.<br/><br/>Document technical information and user procedures.<br/><br/>Provide training and instruction on various computer applications.<br/><br/>Negotiate contracts and monitor the work of project consultants.<br/><br/>Develop Request for Proposals, Request for Information, and Request for Quotes.<br/><br/>Develop and author staff reports.<br/><br/>Conduct research and make recommendations on technology.<br/><br/>Establish and maintain effective and cooperative working relationships with City employees and the general public.<br/><br/>Communicate effectively both orally and in writing.<br/><br/>Provide effective customer service.<br/><br/><strong>Skill In<br/><br/></strong>Project management and implementation of information systems.<br/><br/>Computer hardware and software configuration, maintenance, and problem resolution.<br/><br/><strong>Education, Training And Experience<br/><br/></strong>Graduation from an accredited college or university with a Bachelor's degree in Computer Science, Management Information Systems or a closely related field .<br/><br/>Four years of recent, paid work experience implementing and maintaining software-based business application systems and automating business processes. Experience coordinating, training or providing general supervision to others is desirable. Experience in the administration of systems serving public agencies or the general public is desirable.<br/><br/><strong>Licenses And Certificates<br/><br/></strong>ITIL Foundations Certification is desirable.<br/><br/>PMP Certification or equivalent project management training is desirable.<br/><br/>Possession of a valid Class C driver license or the ability to utilize an alternative method of transportation when needed to carry out job-related essential functions.<br/><br/><strong>Supplemental Information<br/><br/></strong><strong>How To Apply<br/><br/></strong>Applicants must submit a completed on-line City Application along with any required supplemental application materials with the Human Resources Department by the filing deadline. If you do not submit your on-line application by the filing deadline, you will not be considered for this position. Please note, applications may be rejected if incomplete. Resumes, CVs and cover letters are not reviewed as part of the application screening process.<br/><br/>If you would like for your education to be considered, you must attach a copy of your college level transcripts or diploma to your online application. Applicants who indicate receipt of college level coursework or degree from a foreign institution must provide United States credential equivalency verification along with a copy of your college diploma/transcripts. All materials must be received in the Human Resources Department no later than the filing deadline. Failure to do so may result in your application being evaluated without the education being considered.<br/><br/><strong>Selection Process<br/><br/></strong>All applicants must submit clear, concise and complete information regarding your work history and qualifications for the position. All applications will be reviewed and only those applicants determined to be most qualified on the basis of experience, training and education, as submitted, will be invited to participate further in the selection process.<br/><br/>Testing may consist of a combination of any of the following and is subject to change as needs dictate:<br/><br/>Training and Experience Evaluation - 100%<br/><br/>Oral Interview<br/><br/>Note: Applicants must have completed an initial probationary period by the filing date and have permanent status with the City of Santa Monica.<br/><br/>If three or more qualified City employees apply and pass the examination, a promotional list will be established in addition to an open-competitive list. If fewer than three qualified City employees pass the examination, the appointing authority, in accordance with the City's civil service rules and regulations, can decline to use a promotional list, in which case a promotional list will not be established for this position.<br/><br/>Note: Internal staff who submit transfer applications must notify the analyst in charge of the recruitment, via email, upon submission of their transfer application.<br/><br/><strong>Background Investigation<br/><br/></strong>Candidates who have successfully completed all prior phases of the selection process will be subject to a thorough background investigation.<br/><br/><strong> Inclusion &amp; Diversity Statement <br/><br/></strong>The City of Santa Monica is a progressive, inclusive and culturally rich community. As leaders in public service, we strive to be an employer of choice by attracting and retaining a highly talented workforce where people of diverse races, religions, cultures and lifestyles thrive. Our goal is to create a welcoming and inclusive environment where our staff are empowered to perform at their highest level and where their differences make a positive impact.<br/><br/>The City is an equal opportunity employer and strives to build balanced teams from all walks of life without regard to race, color, ethnicity, religion, national origin, age, sex, sexual orientation, gender identity, marital status, ancestry, disability, genetic information, veteran status, or any other status protected under federal, state and/or local law. We aim to create a workplace that celebrates and embraces the diversity of our employees. Join us!<br/><br/>Special assistance with the application and examination process is available, upon request, for persons with disabilities. Call (310) 458-8246, TDD (310) 458-8696 (Hearing Impaired Only).<br/><br/>Please note the request for reasonable accommodations must be made to Human Resources at least three work days prior to the examination.<br/><br/>The City's liberal fringe benefits for full-time employment include sick leave, holiday and vacation pay, the Public Employees Retirement System, medical, dental and vision insurance, credit union, deferred compensation, tuition reimbursement, Dependent Care Assistance Plan and Marine Park Childcare Center.<br/><br/>Closing Date/Time: 9/5/2024 5:30 PM Pacific", "postedDate": "1 week ago", "skills": ["ITIL", "Lean IT", "Voice of the Customer", "Journey Mapping", "Project Management", "Program Management", "Agile", "SCRUM", "Kanban", "Software System Configuration", "Software System Maintenance", "Software System Administration", "Software System Analysis", "Software System Problem Resolution", "ERP", "BPM", "CRM", "BI", "SOAP", "WSDL", "XML", "SQL", "Crystal Reports", "Microsoft SQL", "Computer Hardware", "Software Configuration", "Software Maintenance", "Software Problem Resolution", "Training", "Instruction", "Negotiation", "Contract Management", "Project Consultant Management", "Request for Proposals", "Request for Information", "Request for Quotes", "Staff Report Writing", "Research", "Technology Recommendation", "Customer Service", "Communication", "Oral Communication", "Written Communication"], "url": "https://www.linkedin.com/jobs/view/3999524757"}