{"jobTitle": "Engineering Manager", "company": {"name": "HID", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Security and Investigations", "description": "<strong>An Amazing Career Opportunity for a QA Engineering Manager!<br/><br/></strong><strong>Location: Long Beach California<br/><br/></strong><strong>Job ID: 31614<br/><br/></strong>We are hiring a Quality Assurance Manager to lead a team on the testing of embedded devices for the security industry.<br/><br/>The qualified candidate should have an excellent background in Quality Assurance practices to help drive the team at improving the current processes and implement more automated testing.<br/><br/>As the manager , you will need to become a subject matter expert in multiple areas of the product. Additionally, you will mentor other QA members and provide training/coaching to the team.<br/><br/>The ideal candidate will have previous management experience in a team environment, along with a degree in computer science and 7 years of software quality assurance experience<br/><br/>You must be able to communicate clearly, demonstrate an investigative nature and be able to assess a situation or a set of conditions and determine a course of action quickly and effectively.<br/><br/>If this sounds like you keep on reading!<br/><br/><strong>Who are we?<br/><br/></strong>HID PACS, located in multiple development locations, is recognized as the global leader in the design, manufacture and supply of access control security technology. HID Global, the provider of trusted identities to the world's people, places and things. A leader in the commercial security industry, this established company designs and manufactures embedded controllers.<br/><br/><strong>As our QA Engineering Manager</strong><strong>, you’ll support HID’s success by:<br/><br/></strong><ul><li> Strong background in quality assurance methodologies </li><li> Manage a team of quality assurance engineers </li><li> Onboard and mentor new QA engineers </li><li> Maintain current quality standards to meet customer expectations. </li><li> Review and develop test plans </li><li> Drive automated testing </li><li> Track metrics around performance and quality. <br/><br/></li></ul><strong>What we will love about your background:<br/><br/></strong><ul><li> Experience testing web user interfaces and web services </li><li> Experience with automated testing and automation tools </li><li> Experience testing embedded products as well as software applications </li><li> Test lab and test bed development and maintenance </li><li> Experience with Selenium </li><li> Experience with Product Lifecyle Management (PLM) Software like Oracle Agile is a benefit </li><li> Experience with git or a similar source control tool </li><li> Experience with Jenkins <br/><br/></li></ul><strong>Your Experience and Education include:<br/><br/></strong><ul><li> Bachelors degree preferred </li><li> Knowledge of QA tools, processes, and strategies </li><li> Ability to work on complex tasks with minimal technical guidance </li><li> Familiar with working in an agile environment </li><li> Experience with Scaled Agile Framework (SAFe) </li><li> Experience with networking and network related tools </li><li> Experience with Physical Access Control Systems is a tremendous benefit. </li><li> Programming and/or scripting experience desired. <br/><br/></li></ul><strong>Why apply?<br/><br/></strong><ul><li> Empowerment: You’ll work as part of a global team in a flexible work environment, learning and enhancing your expertise. We welcome an opportunity to meet you and learn about your unique talents, skills, and experiences. You don’t need to check all the boxes. If you have most of the skills and experience, we want you to apply. </li><li> Innovation: You embrace challenges and want to drive change. We are open to ideas, including flexible work arrangements, job sharing or part-time job seekers. </li><li> Integrity: You are results-orientated, reliable, and straightforward and value being treated accordingly. We want all our employees to be themselves, to feel appreciated and accepted. <br/><br/></li></ul><strong>We make it easier for people to get where they want to go!<br/><br/></strong>On an average day, think of how many times you tap, twist, tag, push or swipe to get access, find information, connect with others or track something. HID technology is behind billions of interactions, in more than 100 countries. We help you create a verified, trusted identity that can get you where you need to go – without having to think about it.<br/><br/>When you join our HID team, you’ll also be part of the ASSA ABLOY Group, the global leader in access solutions. You’ll have 61,000 colleagues in more than 70 different countries. We empower our people to build their career around their aspirations and our ambitions – supporting them with regular feedback, training, and development opportunities. Our colleagues think broadly about where they can make the most impact, and we encourage them to grow their role locally, regionally, or even internationally. As we welcome new people on board, it’s important to us to have diverse, inclusive teams, and we value different perspectives and experiences.<br/><br/>", "responsibilities": "<ul><li> Strong background in quality assurance methodologies </li><li> Manage a team of quality assurance engineers </li><li> Onboard and mentor new QA engineers </li><li> Maintain current quality standards to meet customer expectations. </li><li> Review and develop test plans </li><li> Drive automated testing </li><li> Track metrics around performance and quality. <br/><br/></li></ul>", "qualifications": {"required": "Strong background in quality assurance methodologies", "preferred": "Experience testing web user interfaces and web services, Experience with automated testing and automation tools, Experience testing embedded products as well as software applications, Test lab and test bed development and maintenance, Experience with Selenium, Experience with Product Lifecyle Management (PLM) Software like Oracle Agile is a benefit, Experience with git or a similar source control tool, Experience with Jenkins"}, "skills": ["Quality Assurance", "Automated Testing", "Selenium", "Product Lifecycle Management", "Git", "Jenkins", "Agile", "SAFe", "Networking"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999097107"}