{"jobTitle": "Business Development Manager", "company": {"name": "Pearpop", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00 - $120,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Technology, Information and Internet, Advertising Services, and Marketing Services", "description": "<strong>About Pearpop</strong><p>Pearpop, the leading Creator Marketing Platform, is revolutionizing the way creators and brands collaborate. With a community of over 200,000 creators and counting, Pearpop is dedicated to helping creators earn a living doing what they love, while providing brands with instant and direct access to relevant, authentic, and brand-safe creators across all major social media platforms. In 2022, Pearpop was recognized as \"Best Influencer Marketing Platform\" by DIGIDAY and named to FAST COMPANY's \"Most Innovative Companies\" List in Social Media.</p><p><br/></p><p><strong>Working at Pearpop</strong></p><p>We're bringing together a smart and passionate team of creative builders to join us as we are a growth stage, high-performance startup. In addition to competitive salaries, we have all the good stuff – equity, generous health and dental insurance, 401(k), and unlimited PTO. This is an in-person role based in our headquarters in Los Angeles; fully-stocked with snacks, beverages, cold brew, and all the good stuff!</p><p><br/></p><p><strong>Key Responsibilities:</strong></p><p>The ideal candidate will be an entrepreneurially-minded, growth-oriented leader with experience driving tangible business growth for a company in the social media and/or creator economy space. In this role, you will conduct strategic outbound outreach, lead successful sales calls with prospective clients, generate winning proposals, and collaborate with our Brand Solutions and Creator Management teams to drive meaningful growth.</p><p><br/></p><p>We seek a self-starting contributor who can think big but loves to get their hands dirty and do the work. This role reports to the Head of Business Development.</p><p><br/></p><ul><li><strong>Strategic Outreach: </strong></li><li>Conduct proactive outreach to relevant verticals and target companies to identify and convert business development opportunities.</li><li>Develop and execute strategic plans for outbound engagement to drive growth.</li><li><strong>Sales Leadership:</strong></li><li>Lead successful sales calls with prospective clients to understand their needs and articulate the value proposition.</li><li>Effectively communicate product features and benefits during client interactions.</li><li>Conduct product demos to showcase capabilities and address client inquiries.</li><li><strong>Proposal Generation:</strong></li><li>Create compelling and winning proposals that align with client requirements and business objectives in creator marketing.</li><li>Collaborate with internal teams to ensure proposals are comprehensive and address client needs.</li><li><strong>Cross-Functional Collaboration:</strong></li><li>Work closely with the Brand Solutions and Creator Management teams to align business development efforts with overall company strategies.</li><li>Foster strong collaboration to enhance the effectiveness of client solutions.</li><li><strong>Client Relationship Management:</strong></li><li>Oversee the development and maintenance of new client relationships.</li><li>Manage the execution of client accounts, ensuring the successful implementation of campaigns and creator marketing programs.</li><li>Nurture client relationships, aiming to turn pilot programs into long-term partnerships.</li><li><strong>Account Growth and Development:</strong></li><li>Drive the growth and development of new client accounts, identifying opportunities for expansion and upselling.</li><li>Work to understand client goals and objectives, aligning company services to meet those needs.</li><li>Develop and implement strategies to maximize client satisfaction and retention.</li><li><strong>Performance Analysis:</strong></li><li>Monitor and analyze key performance indicators to assess the success of business development initiatives.</li><li>Identify areas for improvement and implement adjustments to enhance overall performance.</li><li><strong>Market Research:</strong></li><li>Stay informed about industry trends, market developments, and competitor activities.</li><li>Utilize market insights to inform business development strategies and maintain a competitive edge.</li></ul><p><br/></p><p><br/></p><p><strong>What You Bring to the Table</strong></p><ul><li>Bachelor's degree or equivalent experience</li><li>Proven track record as a Business Development leader or in a sales-related role, with a minimum of 4+ years of experience in the social and/or creator marketing industry</li><li>Enthusiasm for and understanding of creators, brands, their culture and helping them succeed</li><li>Demonstrated success in managing and growing key accounts, driving revenue, and meeting or exceeding targets</li><li>Active understanding of the influencer landscape and continuously educated on the latest industry trends and innovations within social media</li><li>In-depth knowledge of all major social platforms (Instagram, Facebook, Pinterest, TikTok, Twitter, YouTube)</li><li>A self-starter who enjoys collaboration and is open to feedback, comfortable working independently as well as influencing cross-functional teams</li><li>Analytical mindset, capable of using data-driven insights to make strategic decisions.</li><li>Proven ability to work autonomously with a proactive mindset, easily adapting to quickly changing priorities</li><li>Strong organizational skills with the ability to multitask, detail-oriented and thrives in a fast-paced environment, and a clear communicator</li><li>Passionate, ambitious, resourceful, adaptable, and humble entrepreneurial spirit</li></ul><p><br/></p><p><strong>Compensation</strong></p><p>$90,000 - $120,000</p><p><br/></p><p><br/></p><p><em>Pearpop is an equal opportunity employer. We are committed to creating an inclusive and welcoming environment. All employment is decided on the basis of qualifications, merit, and business need. Pearpop celebrates and embraces diversity.</em></p>", "responsibilities": "The ideal candidate will be an entrepreneurially-minded, growth-oriented leader with experience driving tangible business growth for a company in the social media and/or creator economy space. In this role, you will conduct strategic outbound outreach, lead successful sales calls with prospective clients, generate winning proposals, and collaborate with our Brand Solutions and Creator Management teams to drive meaningful growth.", "qualifications": {"required": "Proven track record as a Business Development leader or in a sales-related role, with a minimum of 4+ years of experience in the social and/or creator marketing industry, Enthusiasm for and understanding of creators, brands, their culture and helping them succeed, Demonstrated success in managing and growing key accounts, driving revenue, and meeting or exceeding targets, Active understanding of the influencer landscape and continuously educated on the latest industry trends and innovations within social media, In-depth knowledge of all major social platforms (Instagram, Facebook, Pinterest, TikTok, Twitter, YouTube), A self-starter who enjoys collaboration and is open to feedback, comfortable working independently as well as influencing cross-functional teams, Analytical mindset, capable of using data-driven insights to make strategic decisions., Proven ability to work autonomously with a proactive mindset, easily adapting to quickly changing priorities, Strong organizational skills with the ability to multitask, detail-oriented and thrives in a fast-paced environment, and a clear communicator, Passionate, ambitious, resourceful, adaptable, and humble entrepreneurial spirit", "preferred": "Bachelor's degree or equivalent experience"}, "skills": ["Business Development", "Sales", "Social Media", "Creator Marketing", "Influencer Marketing", "Client Relationship Management", "Account Management", "Strategic Planning", "Outbound Outreach", "Sales Calls", "Proposal Writing", "Cross-Functional Collaboration", "Performance Analysis", "Market Research"], "postedDate": "1 week ago", "benefits": "equity, generous health and dental insurance, 401(k), and unlimited PTO", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999010741"}