{"jobTitle": "Game Production Coordinator", "company": {"name": "IDR, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "description": "IDR is seeking a Game Production Coordinator to join one of our top clients in the Los Angeles, CA area for a hybrid role! If you are looking for an opportunity to join a large organization and work within an ever-growing team-oriented culture, please apply today!<br/><br/><strong>Position Overview/Responsibilities For The Game Production Coordinator<br/><br/></strong><ul><li>Oversee various communication channels with both internal teams and external parties.</li><li>Oversee workflows by identifying risks, managing trade-offs, and removing obstacles.</li><li>Evaluate the team's current status and identify ways to adjust tools, communication, and processes to ensure successful and sustainable delivery.</li><li>Promote teamwork, collaboration, and commitment across multiple groups</li><li>Promote clear and reliable operations, proactive planning, and effective risk management.</li><li>Keep and distribute project information to the appropriate stakeholders.</li><li>Consistently update, organize, and manage internal documentation to ensure it remains accurate, consistent, and accessible for Producers.</li><li>Assist in enhancing team rituals, including pre- and post-meeting communications and action items.</li><li>Plan and structure meetings to facilitate discovery, collaboration, and socialization around cross-discipline needs.</li><li>Prioritize and handle various competing requests to ensure tasks are completed accurately and on time.</li><li>Work with and assist Producers to achieve project goals and ensure smooth workflow efficiency.<br/><br/></li></ul><strong>Required Skills For The Game Production Coordinator<br/><br/></strong><ul><li>1+ years of experience as a production coordinator, assistant producer or project manager Experience working in gaming, software, or related fields</li><li>Experience working with executive teams and partners</li><li>Experience developing productive working relationships with team members, colleagues, and all customers</li><li>Excellent communication skills and attention to detail<br/><br/></li></ul>What’s in it for you?<br/><br/><ul><li>Competitive compensation package</li><li>Full Benefits; Medical, Vision, Dental, and more!</li><li>Opportunity to get in with an industry leading organization</li><li>Close-knit and team-oriented culture<br/><br/></li></ul>Why IDR?<br/><br/><ul><li>25+ Years of Proven Industry Experience in 4 major markets</li><li>Employee Stock Ownership Program</li><li>Dedicated Engagement Manager who is committed to you and your success</li><li>Medical, Dental, Vision, and Life Insurance</li><li>ClearlyRated’s Best of Staffing® Client and Talent Award winner 11 years in a row</li></ul>", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "IT Services and IT Consulting", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3999961473"}