{"jobTitle": "Event Technical Supervisor, Audio Visual - Le Meridien Delfina, Santa Monica", "company": {"name": "Encore", "industry": "Events Services", "size": "Not specified", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$25.00-$29.00", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Events Services", "description": "The approximate hourly range is based on skills & experience $25.00-$29.00 per hour. Position Overview The Technical Supervisor leads floor operations with a focus on customer service, staff leadership and development. The Technical Supervisor directly leads the technical team to ensure operational efficiencies and customer satisfaction. This role may also participate in location administrative duties in support of onsite operations and for career development. This position reports to the DET, DOO, or Operations Manager.", "responsibilities": "Equipment Operation: Responsible for accurate and timely setup, operation, and breakdown of intermediate audiovisual equipment as listed in the technical qualifications section. Troubleshoot technical issues and resolve problems quickly as they arise. Complies with all Company security and safety measures. Ensures equipment is secure from theft and/or damage when in use. Customer Service: Provides excellent service and strives to exceed the expectations and needs of internal and external customers. Maintains a positive relationship with all clients through effective communication. Meets with guests on site to ensure that their needs are met, and the equipment setup is working properly. Monitors events and checks in on customers throughout the day. Understands and fosters the hotel/client relationship. Training/Staff Development: Assists in training technicians on all floor activities and on hotel and Encore service expectations. Serves as a mentor for new hires. Models and reinforces a positive working environment centered around company values. Operations Management: Organizes the daily floor activities to ensure the timely set up, refresh and removal of equipment. Performs daily floor management including directing the workflow of technicians and assisting management with labor needs and scheduling. Ensures the equipment sheets are updated and properly completed. Works with team to establish coordinated communications for the management of events. Attends venue meetings as needed (example = banquet event orders or pre-event conferences). Equipment Maintenance: Performs preventative maintenance on equipment to keep it presentable and in good working condition. Leads the team in proper security, storage, transportation, and maintenance of equipment. Participates in physical inventory count processes as requested.", "qualifications": {"required": "3-5 years of audio-visual experience is required. Internal applicants must be Technical 1-Star Certified before applying. External applicants will validate and achieve their Technical 1-Star Certification within 60 days of start date. Knowledge of technical theory. Advanced problem-solving skills. Experience leading workflow and team members. A valid driver’s license is required for team members in positions that may operate Company vehicles. Additional DOT requirement may need to be met if applicable. Must be able to lift 50 lbs.", "preferred": "Bachelor’s degree is preferred. 3-5 years of customer service or hospitality experience is preferred."}, "skills": ["Customer Service", "Technical Skills", "Leadership", "Problem Solving", "Communication"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3999658178"}