{"jobTitle": "Senior Sales Manager (Hospitality/STR)", "company": {"name": "Kasa", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "<em><strong>[This role is required to be fully on-site and does not offer a remote or hybrid working environment] <br/><br/></strong></em><strong>The Role<br/><br/></strong>Kasa is looking to add a highly motivated individual to join our Sales Team to oversee a one-of-a-kind property in <strong>STILE Downtown Los Angeles</strong>.<br/><br/>Kasa offers flexible accommodations for guests in dozens of markets nationwide. We partner with multifamily and hospitality property owners to offer various unit types in our portfolio, including short-term rental apartments, apartels, and traditional hotel rooms across price and luxury tiers. The Senior Sales Manager role will be laser-focused on reaching out to corporate clients who will use Kasa as their preferred accommodations at our Downtown Los Angeles Property.<br/><br/>The Senior Sales Manager will report to the General Manager and work closely with the Distributions, Yield Management, Reservations, Partner Success, and Special Properties teams. This position is based in Los Angeles, CA. You will be responsible for the development &amp; execution of a sales strategy for Kasa's newest property in DTLA, targeting Corporate/Business Transient market segments. An exciting part of this is being instrumental in changing the way corporate and group travelers view the flexible accommodations space.<br/><br/>Your background should demonstrate a commitment to excellence in building strong relationships with corporate accounts, developing, executing, and meeting sales objectives.<br/><br/><strong>About the Team<br/><br/></strong>The Sales and Marketing team is dedicated to growing revenue at Kasa through all channels, as well as growing Kasa as a distinguished accommodations brand. Our mission is to build a distinctive brand that has direct relationships with guests.<br/><br/><strong>Day in the Life of a Kasa Senior Sales Manager<br/><br/></strong>Like any role at a fast-paced start-up, there is no 'typical day', but your primary responsibility will be to drive top-line and ancillary revenue streams by filling need periods for your property with Corporate/Business Transient Segment. To achieve your goals, you'll be expected to do the following:<br/><br/><ul><li>Develop Account &amp; Industry focused Action Plans</li><li>Implement a sales management process to identify and prioritize key customers and prospects</li><li>Develop and sustain long-term relationships with customers</li><li>Have a keen insight into regional conferences, meetings, and events to secure room share for Kasa properties</li><li>Partner with our Revenue Management team to ensure our group rates are competitive</li><li>Produce detailed group resumes and liaise with our property managers to ensure that group needs are met while onsite<br/><br/></li></ul>You will also get to participate in company-wide meetings where we discuss the business, interact with leaders from other departments, and share our ideas to help grow Kasa. Our culture is based on a remote work environment where we take pride in getting to know each other and what drives us.<br/><br/>In one year, you will succeed at Kasa by having:<br/><br/><ul><li>Built a strong portfolio of corporate partners who deliver and achieve budgeted revenue for the Corporate/Business Transient Segment</li><li>Established a structured sales process bringing repeatable business</li><li>Become a respected leader and thought partner by the Kasa leadership team and other departments you interact with<br/><br/></li></ul><strong>Experience<br/><br/></strong><ul><li>4+ years of sales experience in the hospitality space, with a focus on corporate and extended stay segments</li><li>Broad and comprehensive knowledge of group and business travel segments and key contacts in Downtown Los Angeles, including extended-stay business</li><li>Proven ability to negotiate and close deals with accounts of all sizes and from all industries</li><li>You are a data-driven and influential leader with vision and can easily communicate with cross-functional stakeholders alike</li><li>You have a strong EQ and are able to generate deep empathy with guests and operating team members that enables you to truly listen and implement product feedback</li><li>Travel is part of your DNA and you have a passion for the real estate, tech, and hospitality industry<br/><br/></li></ul>Plus if...<br/><br/><ul><li>You have previously worked in the Los Angeles market in hotel sales</li><li>You have working knowledge and understanding of hotel revenue management<br/><br/></li></ul><strong>Want to learn more about the Kasa experience? Save 15% on kasa.com<br/><br/></strong><strong>Benefits<br/><br/></strong><ul><li>✈ Kasa Travel Credit: We love to travel! Kasa employees get an allowance of free stays with us in any of our locations, plus a discount on any night for friends and family. </li><li>📈 Generous Stock Option Plan: At Kasa, our compensation philosophy is to offer a total compensation package that over-indexes on equity to encourage our team to think like owners (by being owners) and benefit from the growth in value that our collective hard work creates. </li><li>🙌 Flexible PTO: Full-time exempt Kasa employees are encouraged to take time off as they need and see fit, ensuring that it's not disruptive to their work. </li><li>📱 Cell phone reimbursement: We reimburse a portion of your monthly cell phone bill to say thanks for using your personal phone during the work day. </li><li>📈 401(k) plan: As you invest in yourself and your future, Kasa invests in you too. </li><li>💰 The Pay: The starting base pay range for this role is between $72,000 and $75,000 and is set based on multiple considerations including business needs, market demands, talent availability, experience, and unique skills and attributes. The base pay range is subject to change and may be modified in the future. This role may also be eligible for equity, bonus, perks, benefits, and Kasa Travel Credits. </li><li>🩺 Health Coverage: We've invested in comprehensive health insurance options to help when you need it most, including a company-sponsored plan with fertility coverage. </li><li>⭐ Other Perks: Qualifying full-time roles are eligible for a wi-fi stipend, home office stipend, and more!<br/><br/></li></ul>Who We Are<br/><br/>Kasa is a Real Estate Technology company that is building a global accommodations brand unlike any other. We partner with owners of multifamily, single-family, and boutique hospitality properties, transforming underutilized real estate into stylishly furnished, professionally managed units that cater to business and leisure travelers alike. We took the best that hotels and short-term rentals had to offer and created a new class of hospitality that is well-priced, trustworthy, and offers a large selection of great locations!<br/><br/>Behind the scenes, we build technology that combines with our innovative operations to grow a globally scalable offering that delivers high-quality stays. Our guests enjoy seamless check-ins, spacious apartments, and attractive amenities, helping them feel right at home. If anything comes up, our remote guest experience team is available 24/7, ensuring our hospitality is always felt, though rarely seen.<br/><br/>Kasa is an Equal Opportunity Employer. We do not discriminate on the basis of race, religion, color, sex, gender identity, sexual orientation, age, non-disqualifying physical or mental disability, national origin, veteran status, or any other basis covered by law. All employment is decided on the basis of qualifications, merit, and business need.<br/><br/><em>Kasa Living is an E-Verify participant. We will verify the identity and employment eligibility of all persons hired to work in the United States by matching information employees provide on the form i-9 against records available to the Social Security Administration (SSA) and the Department of Homeland Security (DHS). You may find more information here and here.<br/><br/></em><em>Kasa does not accept unsolicited resumes from individual recruiters or third party recruiting agencies in response to job postings. No fee will be paid to third parties who submit unsolicited candidates directly to our hiring managers or People &amp; Talent team. <br/><br/></em><em>The Kasa Talent Acquisition team will only communicate from email addresses that use the URLs kasa.com and us.greenhouse-mail.io. We will not use apps such as Facebook Messenger, WhatsApp, or Google Hangouts for communicating with you. We will never ask you to send us money or technology to work for our company. If you believe you are a scam victim, please review your local government consumer protections guidance and reach out to them directly. US-based applicants may refer to this article from consumer.ftc.gov for more details.<br/><br/></em>", "responsibilities": "Develop Account &amp; Industry focused Action Plans\nImplement a sales management process to identify and prioritize key customers and prospects\nDevelop and sustain long-term relationships with customers\nHave a keen insight into regional conferences, meetings, and events to secure room share for Kasa properties\nPartner with our Revenue Management team to ensure our group rates are competitive\nProduce detailed group resumes and liaise with our property managers to ensure that group needs are met while onsite", "qualifications": {"required": "4+ years of sales experience in the hospitality space, with a focus on corporate and extended stay segments\nBroad and comprehensive knowledge of group and business travel segments and key contacts in Downtown Los Angeles, including extended-stay business\nProven ability to negotiate and close deals with accounts of all sizes and from all industries\nYou are a data-driven and influential leader with vision and can easily communicate with cross-functional stakeholders alike\nYou have a strong EQ and are able to generate deep empathy with guests and operating team members that enables you to truly listen and implement product feedback\nTravel is part of your DNA and you have a passion for the real estate, tech, and hospitality industry", "preferred": "You have previously worked in the Los Angeles market in hotel sales\nYou have working knowledge and understanding of hotel revenue management"}, "skills": [], "postedDate": "1 week ago", "benefits": "✈ Kasa Travel Credit: We love to travel! Kasa employees get an allowance of free stays with us in any of our locations, plus a discount on any night for friends and family. \n📈 Generous Stock Option Plan: At Kasa, our compensation philosophy is to offer a total compensation package that over-indexes on equity to encourage our team to think like owners (by being owners) and benefit from the growth in value that our collective hard work creates. \n🙌 Flexible PTO: Full-time exempt Kasa employees are encouraged to take time off as they need and see fit, ensuring that it's not disruptive to their work. \n📱 Cell phone reimbursement: We reimburse a portion of your monthly cell phone bill to say thanks for using your personal phone during the work day. \n📈 401(k) plan: As you invest in yourself and your future, Kasa invests in you too. \n💰 The Pay: The starting base pay range for this role is between $72,000 and $75,000 and is set based on multiple considerations including business needs, market demands, talent availability, experience, and unique skills and attributes. The base pay range is subject to change and may be modified in the future. This role may also be eligible for equity, bonus, perks, benefits, and Kasa Travel Credits. \n🩺 Health Coverage: We've invested in comprehensive health insurance options to help when you need it most, including a company-sponsored plan with fertility coverage. \n⭐ Other Perks: Qualifying full-time roles are eligible for a wi-fi stipend, home office stipend, and more!", "remoteWork": "No", "salary": {"amount": "72,000.00 - 75,000.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3999545084"}