{"jobTitle": "Merchandiser", "company": {"name": "PepsiCo", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Marketing and Sales", "industry": "Manufacturing and Food and Beverage Services", "description": "PBNA $20.00 / hour<br/><br/><strong>CLICK HERE to view our Merchandiser Realistic Job Preview Video <br/><br/>Position is responsible for product merchandising within large volume stores (Grocery, etc.). This includes stocking shelves, rotating shelved product, setting up displays, stocking and rotating products in coolers, organizing and rotating products in storage rooms, and moving products from storage to the sales floor. This position interacts with personnel at the store location.<br/><br/>This position is labor intensive, requiring lifting, loading, pushing, and pulling cases weighing from 20-45 pounds per case, as well as bending, reaching, and squatting while merchandising and moving products. This job follows a consistent schedule with specific start times and customers (opportunity to attain different work schedules with time.)<br/><br/><strong>PRIMARY ACCOUNTABILITIES:<br/><br/></strong><ul><li>Merchandise store shelving, coolers and displays with products in assigned accounts</li><li>Rotate products in the backroom and on the shelf</li><li>Transport products to and from backroom to shelf location</li><li>Use equipment to transport products (e.g., U Boats, hand trucks, pallet jacks, etc.)</li><li>Display promotional material such as signs and banners in accounts</li><li>Keep back room stock in neat and orderly condition</li><li>Communicate store issues to store managers and Pepsi management</li><li>Build customer relationships at the store level</li><li>Comply with operating procedures (e.g., scan-in/scan-out, following designated route, etc.)</li><li>Service accounts during designated times established by management</li><li>Deliver customer service (e.g., communication, rapport building, attentiveness to customer needs, etc.)</li><li>Ability to operate under minimal supervision (self-managed role)</li><li>Use hand held devices to write/input orders</li><li>Regular, reliable, predictable attendance<br/><br/></li></ul><strong>BASIC QUALIFICATIONS:<br/><br/></strong><ul><li>18 years or older</li><li>Pass the physical capabilities test (if applicable)</li><li>Must have car or personal transportation to access multi-store locations within assigned shift</li><li>Valid U.S. Driver's License</li><li>Proof of insurance<br/><br/></li></ul><strong>HELPFUL EXPERIENCE:<br/><br/></strong><ul><li>Working for a retail business or grocery store (e.g., understanding store operations, knowing the backroom and inventory, stocking aisles and shelves, etc.)</li><li>Moving products within a store (e.g., safely stacking and moving products on equipment such as a u-boat, hand truck/dolly and/or breakdown, etc.)</li><li>Merchandising products (e.g., filling shelves, building displays, making products look attractive, rotating products, cleaning shelves, eliminating out of stocks and out of date products, etc.)</li><li>Managing backroom/stock room inventory (e.g., organizing pallets, stacking and storing inventory or products, etc.)</li><li>Serving customers (handling customer complaints, responding to customer requests, or meeting customer needs)<br/><br/></li></ul>For positions that require use of a personal vehicle for a sales route, mileage reimbursement is provided.<br/><br/>Our Company will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Fair Credit Reporting Act, and all other applicable laws, including but not limited to, San Francisco Police Code Sections 4901-4919, commonly referred to as the San Francisco Fair Chance Ordinance; and Chapter XVII, Article 9 of the Los Angeles Municipal Code, commonly referred to as the Fair Chance Initiative for Hiring Ordinance.<br/><br/>&gt;<br/><br/>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.<br/><br/>PepsiCo is an Equal Opportunity Employer: Female / Minority / Disability / Protected Veteran / Sexual Orientation / Gender Identity<br/><br/>If you'd like more information about your EEO rights as an applicant under the law, please download the available EEO is the Law &amp; EEO is the Law Supplement documents. View PepsiCo EEO Policy.<br/><br/>Please view our Pay Transparency Statement</strong>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3999888359"}