{"jobTitle": "Human Resources Specialist", "company": {"name": "Bridgewater Consulting Group, Inc.", "industry": "Business Consulting and Services and Utilities", "size": "Not specified", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00/yr - $100,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Business Consulting and Services and Utilities", "description": "Bridgewater Consulting Group is a management consulting firm for the utilities industry, and we are looking for a Human Resources Specialist.", "responsibilities": "Performs routine tasks required to administer and execute human resource programs including but not limited to compensation, benefits, leaves, talent management, productivity, recognition, morale, and training and development. Supports talent management with on-boarding, performance management, workforce planning, succession planning, and off-boarding. Assist with the Human Resource systems by responding to questions and requests, running reports/dashboards. Processes employment-related inquiries from applicants, employees, and supervisors, referring complex and/or sensitive matters to the appropriate staff. Assists with all professional and organizational development programs by assisting with maintaining online compliance training records, survey feedback, and enrollment, provides facilitation of orientation and workshops, and aids in the enhancement of training programs for faculty and staff. Assists with organizational development initiatives such as focus groups for Adjuncts and Classified staff, and surveys as required. Work with supervisors and managers to coordinate a smooth transition for new faculty and staff. Audits payroll data entry and personnel files for compliance. Successfully administer key components of BCG’s onboarding process in support of high-volume hiring initiatives, ensuring a fulfilling new hire experience. Successfully administer key components of BCG’s offboarding process. Serve as key point of contact to employees and management in response to various back-office related questions and/or HR policy-related questions, guiding employees through basic HR queries, as appropriate. Proactively identifies human resources related process improvements to COO. Other projects and administrative tasks as assigned.", "qualifications": {"required": "Bachelor’s Degree in human resources, business administration, or a related field; or combination of education and experience equivalent to a degree. 5+ years human resources experience. Demonstrated knowledge of the human resources field. Awareness of OSHA regulations and compliance. Understanding of personnel and compliance records management. Strong analytical and problem-solving skills. Excellent written, verbal, and interpersonal communication abilities. Ability to maintain confidentiality. Proficiency with Microsoft Office (Microsoft Excel, Microsoft Outlook).", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4000552219"}