{"jobTitle": "Manager Show Quality", "company": {"name": "NBCUniversal", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "75,000.00/yr - 90,000.00/yr", "currency": "USD"}, "jobFunction": "Management", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "description": "We create world-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group and have world-renowned theme parks and attractions through Universal Destinations & Experiences. NBCUniversal is a subsidiary of Comcast Corporation.<br/><br/>Each day Universal Studios Hollywood creates unforgettable experiences for our guests from around the world. We bring to life the ultimate Hollywood experience with our real working movie studio and heart-pounding rides, shows and attractions that put you inside some of the world’s most popular movies and TV shows. USH offers something for everyone from thrill seekers to movie lovers to family fun for all ages. Our Team Members are passionate individuals who create memorable moments whether it’s on the studio lot, or in our conference rooms, theaters, or kitchens. We believe in the talent of our team members. It’s our passion and commitment to excellence that drives our business to succeed in everything we do across the park. We believe in a culture of family and fun, here you can make a difference and build your career!<br/><br/>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever-changing face of the world<br/><br/><strong>Job Description<br/><br/></strong><strong>Ensure that Universal Studios Hollywood's vision, mission, and values, as well as the Guest Service Philosophy and Standards, are understood and supported throughout the organization.<br/><br/></strong><strong>Essential Responsibilities<br/><br/></strong><ul><li>Cultivate and lead a culture that promotes a professional, collaborative, inspiring, fun, and teamwork-driven work setting for all Team Members. </li><li>Oversee and manage the daily functions and development of Show Quality supervision and casting teams, including managing staff and process/procedures as well as providing necessary support for the operations. Partner with venue/area management to ensure all Entertainment elements and shows are properly implemented, executed, and maintained. This includes providing notes and feedback on team member performance, overall set/show appearance (including props and scenic), training and any other components of show quality. </li><li>Lead and develop the Show Quality management team to ensure consistency, quantity, and quality of performance feedback for all performers/elements within Entertainment. Track and monitor feedback to ensure timeliness, accuracy, and regularity of feedback/notes.</li><li>Directly manage Show Quality team, overseeing all casting efforts and partnering with venue/area management to ensure consistency and quality of process and product. </li><li>Provide direction, development, and support to Assistant Managers and hourly team members. Communicate feedback and address performance issues, providing recognition, coaching and/or discipline when appropriate and completing employee evaluations annually. Assist in hiring, training and development of staff. </li><li>Work with other department Managers to develop and implement action plans for the department’s future success for team member satisfaction (TSAT) and guest satisfaction (GSAT).</li><li>Work closely and efficiently with other park operating departments, assisting with any and all employee and/or guest situations. </li><li>Ensure that collective bargaining agreements are upheld by partnering with Human Resources and Labor Relations in providing input, addressing issues, and maintaining positive union relationships. Support management and ensure that discipline is applied in accordance with company procedures and collective bargaining agreements.</li><li>Understand and actively participate in Environmental, Health, and Safety responsibilities by following established USH policy, procedures, training, and employee involvement activities.</li><li>Perform other duties as assigned.<br/><br/></li></ul><strong>Manage and maintain Show Quality and Casting for the department:<br/><br/></strong><ul><li>Ensure Show Quality team is providing regular performance feedback, aligned with Creative intent of the show and/or element.</li><li>Create, implement and update/maintain a note tracking system to capture and track all performer notes. Partner with venue/area management to establish criteria/standards for providing performer feedback and review regularly to ensure compliance with criteria/standards.</li><li>In conjunction with venue/area management, develop and manage training programs for all performer roles within Entertainment Department. Provide ongoing training for members of the department to ensure consistency and quality of performance. </li><li>Maintain knowledge of industry standards pertaining to different areas of performance (dance, improve, puppeteering, stilt walking, etc.), performance feedback methods, casting/auditions and /or other pertinent or related skills/areas.</li><li>Regularly watch and review Entertainment elements (including Street Performances, Shows, Events and any other projects) to ensure quality of product. Clearly report and communicate any concerns related to Show Quality aspects, including but not limited to individual performance, set/scenic appearance, props, scripting, etc. and ensure plan is in place to address said concerns.</li><li>Create and execute show quality timelines as they relate to Entertainment elements and/or shows, ensuring all milestones are met and completed on time. </li><li>Keep track of vendors and contact information, and forge positive, collaborative relationships with internal and external partners.</li><li>Collaborate with the Sr. Director to create and maintain the department budget in accordance with company procedures. Follow all company procedures for using purchase orders and submitting invoices and receipts.</li><li>Organize and lead regular meetings with the team to ensure awareness, consistency and quality. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>A BFA or 5+ years working in themed entertainment is preferred.</li><li>Minimum 3+ years in a live entertainment or theatrical environment.</li><li>Managerial or supervisory experience of departments and personnel.</li><li>Must be available to work on weekends, holidays, and nights as required.</li><li>Able to work outdoors in varying weather conditions and travel to multiple venues throughout the day.</li><li>Ability to read, interpret, and follow documents such as safety rules, operating and maintenance instructions, procedure manuals, and union contracts.</li><li>Ability to write reports, business correspondence, and training documentation. PowerPoint presentation experience is a plus.</li><li>Ability to effectively deliver performance notes and answer questions in one-on-one and group settings.</li><li>Strong interpersonal and analytical skills.</li><li>Strong time management skills.</li><li>Ability to partner across business units.</li><li>Demonstrates ability to work independently under pressure; proactive thinker/self-starter.<br/><br/></li></ul>Salary range: $75,000-$90,000 (Bonus Eligible)<br/><br/><strong>Additional Information<br/><br/></strong>NBCUniversal's policy is to provide equal employment opportunities to all applicants<br/><br/>and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation,<br/><br/>marital status, pregnancy, veteran status, membership in the uniformed services,<br/><br/>genetic information, or any other basis protected by applicable law.<br/><br/>NBCUniversal will consider for employment qualified applicants with criminal histories,<br/><br/>or arrest or conviction records, in a manner consistent with relevant legal<br/><br/>requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring<br/><br/>Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.<br/><br/>If you are a qualified individual with a disability or a disabled veteran, you have the<br/><br/>right to request a reasonable accommodation if you are unable or limited in your<br/><br/>ability to use or access nbcunicareers.com as a result of your disability. You can<br/><br/>request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.", "responsibilities": "Ensure that Universal Studios Hollywood's vision, mission, and values, as well as the Guest Service Philosophy and Standards, are understood and supported throughout the organization.<br/><br/><strong>Essential Responsibilities<br/><br/></strong><ul><li>Cultivate and lead a culture that promotes a professional, collaborative, inspiring, fun, and teamwork-driven work setting for all Team Members. </li><li>Oversee and manage the daily functions and development of Show Quality supervision and casting teams, including managing staff and process/procedures as well as providing necessary support for the operations. Partner with venue/area management to ensure all Entertainment elements and shows are properly implemented, executed, and maintained. This includes providing notes and feedback on team member performance, overall set/show appearance (including props and scenic), training and any other components of show quality. </li><li>Lead and develop the Show Quality management team to ensure consistency, quantity, and quality of performance feedback for all performers/elements within Entertainment. Track and monitor feedback to ensure timeliness, accuracy, and regularity of feedback/notes.</li><li>Directly manage Show Quality team, overseeing all casting efforts and partnering with venue/area management to ensure consistency and quality of process and product. </li><li>Provide direction, development, and support to Assistant Managers and hourly team members. Communicate feedback and address performance issues, providing recognition, coaching and/or discipline when appropriate and completing employee evaluations annually. Assist in hiring, training and development of staff. </li><li>Work with other department Managers to develop and implement action plans for the department’s future success for team member satisfaction (TSAT) and guest satisfaction (GSAT).</li><li>Work closely and efficiently with other park operating departments, assisting with any and all employee and/or guest situations. </li><li>Ensure that collective bargaining agreements are upheld by partnering with Human Resources and Labor Relations in providing input, addressing issues, and maintaining positive union relationships. Support management and ensure that discipline is applied in accordance with company procedures and collective bargaining agreements.</li><li>Understand and actively participate in Environmental, Health, and Safety responsibilities by following established USH policy, procedures, training, and employee involvement activities.</li><li>Perform other duties as assigned.<br/><br/></li></ul><strong>Manage and maintain Show Quality and Casting for the department:<br/><br/></strong><ul><li>Ensure Show Quality team is providing regular performance feedback, aligned with Creative intent of the show and/or element.</li><li>Create, implement and update/maintain a note tracking system to capture and track all performer notes. Partner with venue/area management to establish criteria/standards for providing performer feedback and review regularly to ensure compliance with criteria/standards.</li><li>In conjunction with venue/area management, develop and manage training programs for all performer roles within Entertainment Department. Provide ongoing training for members of the department to ensure consistency and quality of performance. </li><li>Maintain knowledge of industry standards pertaining to different areas of performance (dance, improve, puppeteering, stilt walking, etc.), performance feedback methods, casting/auditions and /or other pertinent or related skills/areas.</li><li>Regularly watch and review Entertainment elements (including Street Performances, Shows, Events and any other projects) to ensure quality of product. Clearly report and communicate any concerns related to Show Quality aspects, including but not limited to individual performance, set/scenic appearance, props, scripting, etc. and ensure plan is in place to address said concerns.</li><li>Create and execute show quality timelines as they relate to Entertainment elements and/or shows, ensuring all milestones are met and completed on time. </li><li>Keep track of vendors and contact information, and forge positive, collaborative relationships with internal and external partners.</li><li>Collaborate with the Sr. Director to create and maintain the department budget in accordance with company procedures. Follow all company procedures for using purchase orders and submitting invoices and receipts.</li><li>Organize and lead regular meetings with the team to ensure awareness, consistency and quality. <br/><br/></li></ul>", "qualifications": {"required": "Minimum 3+ years in a live entertainment or theatrical environment.", "preferred": "A BFA or 5+ years working in themed entertainment is preferred."}, "skills": ["Entertainment", "Theatrical", "Management", "Supervisory", "Training", "Performance", "Casting", "Budgeting", "Teamwork", "Communication", "Leadership", "Customer Service", "Safety", "Union Relations", "PowerPoint"], "postedDate": "1 week ago", "benefits": "Salary range: $75,000-$90,000 (Bonus Eligible)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000773493"}