{"jobTitle": "Shipping Clerk", "company": {"name": "FDH Aero", "location": "Commerce, CA"}, "location": "Commerce, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing", "description": "FDH Aero is a trusted global supply chain partner for aerospace and defense companies. With more than 55 years of experience, it specializes in c-class components that include hardware, electrical, chemical, and consumable products and services for global OEM and aftermarket customers. At FDH Aero, we understand that the strength of our brand comes from our people, and our culture empowers every team member to contribute and grow. As a global team, our culture is rooted in five (5) core values that begin with the words “We are” and include: service-first, respectful, amplifiers, open-minded and accountable.<br/><br/>FDH Aero is headquartered in Commerce, California, and has operations across the Americas, EMEA and APAC. FDH Aero has locations in 14 countries across the globe, with more than 1,200 best-in-industry employees and over 650,000 square feet of inventory space.<br/><br/>For more information, please visit the FDH Aero website .<br/><br/>FDH Aero is looking for Shipping Clerk to perform general warehouse duties such as storing inventory, processing customer orders for shipment, and shipping materials (including hazardous materials), supplies, tools, equipment, and parts.<br/><br/>Responsibilities<br/><br/><ul><li>Assist in the day-to-day operation of the warehouse in packing</li><li>Accurately package, label, and weigh items to be shipped and ensure proper shipment method and shipping charges</li><li>Organize the warehouse to ensures accurate labeling, logical placement, proper and arrangement</li><li>Relocate and move materials and supply within warehouse to its appropriate location</li><li>Perform general labor tasks including warehouse housekeeping and safety audits</li><li>Perform inventory controls and keep quality standard high for audits</li><li>Ensure that the facility and equipment are maintained in a safe and clean condition</li><li>Work directly or indirectly with customer or company representative to assess a customer’s needs and requirements to facilitate a successful quotation for the customer consideration</li><li>Establish methods and procedures to ensure productivity is maintained at an optimum level</li><li>Removes obstacles, allows for, and contributes needed resources, coordinates work efforts, and monitor’s progress. Always puts first things first</li><li>Performs other duties as assigned<br/><br/></li></ul>Basic Qualifications<br/><br/><ul><li>Must be a high school graduate or GED equivalent</li><li>Aerospace industry experience is preferred</li><li>1 to 3 years experience in receiving and/or warehouse operations preferred</li><li>Basic familiarity supplier Packing and Quality documents</li><li>Strong communication skills, both written and verbal</li><li>Comfortable working in a team setting</li><li>Computer literacy skills</li><li>Ability to use Microsoft Office applications</li><li>Knowledgeable of carriers such as UPS, FedEx, DHL, and freight forwarders</li><li>Organization skills</li><li>Must be able to lift 20lbs+<br/><br/></li></ul>FDH Aero is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability status, protected veteran status, or any other characteristic protected by law.", "postedDate": "1 week ago", "skills": ["Packing", "Shipping", "Warehouse Operations", "Inventory Control", "Quality Standards", "Customer Service", "Microsoft Office", "UPS", "FedEx", "DHL", "Freight Forwarders", "Organization", "Teamwork", "Communication"], "url": "https://www.linkedin.com/jobs/view/4000974331"}