{"jobTitle": "Operations Manager - Freight Forwarding", "company": {"name": "JobsInLogistics.com", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Company: **FreightTAS**<br/><br/><br/>**Job Description**<br/><br/>Sorry, Visa / sponsorship not available.<br/><br/>Operations Manager - Freight Forwarding<br/><br/><br/>**Location - Los Angeles - office based 5 days a week**<br/><br/>**Salary - $75k to $90k depending on experience**<br/><br/>Must have 3 years and more has a current Operations Manager<br/><br/>Must have AIRFREIGHT/SEAFREIGHT/IMPORT/EXPORT experience<br/><br/><br/>**Summary**<br/><br/>Directs and coordinates activities of the branch to obtain optimum efficiency and excellence of operations and maximize profits by performing the following duties personally or through subordinate supervisors under the direction and support of Branch Manager<br/><br/>The Operations Manager is responsible for the operational results of the branch. The major role is one of business leaderships for operational organization.<br/><br/><br/>**The Main Goals Of The Operations Manager**<br/><br/><ul><li>Ensure profitable growth</li><li>Operational excellence</li><li>Ensure customer satisfaction and retention</li><li>Staff development and leadership<br/><br/><br/></li></ul>**ESSENTIAL DUTIES AND RESPONSIBILITIES Includes, But Not Limited To**<br/><br/><ul><li>Plans, develops and implements organization policies and goals.</li><li>Coordinates activities of the branch office which may include export, import and brokerage, planning, and maintenance to effect operational efficiency and economy for all services.</li><li>Also includes maintaining and overseeing warehouse facilities and compliance with applicable safety regulations, if applicable</li><li>Assists Branch Manager with preparation and delivery of branch budget results</li><li>In concert with Branch Manager analyzes branch budget requests to identify areas for maximum efficiencies and allocations for operating budget. Confers with business unit managers regarding staffing, reviews activity, operations and sales needs reports to determine changes in services/programs and/ or operations requirements.</li><li>Directs preparation of directives to employees outlining policy, program, or operations changes to be implemented.</li><li>Promotes organization in industry or trade associations.</li><li>Analyzes and organizes office operations and procedures such as personnel, information management, filing systems, requisition of supplies, and other administrative functions.</li><li>Maximizes office productivity through proficient use of appropriate software applications.<br/><br/><br/></li></ul>**Supervisory Responsibilities**<br/><br/><ul><li>Directly supervises 4-8 employees. Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws.</li><li>Conduct performance evaluation for direct reports, customer services department, Operational function structure.</li><li>Responsible to hire, develop, train, promote and make termination decision</li><li>Identify and resolve personnel issues</li><li>Ongoing coaching and mentoring of staff to develop skills to the highest level<br/><br/><br/></li></ul>**Qualifications**<br/><br/>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><ul><li>Sound Decision Making</li><li>Strong leadership skills staff development/mentoring</li><li>Sound analytical skills</li><li>Ability to multi-task and think outside of the box</li><li>Excellence in Time-Management<br/><br/><br/></li></ul>**EDUCATION And/or EXPERIENCE**<br/><br/><ul><li>Strong knowledge of command of documentation, procedures and rules for air cargo transportation.</li><li>Experience with Cargowise preferred.</li><li>Excellent communication, interpersonal, and organizational skills.</li><li>A true passion for customer service; LANGUAGE SKILLS<br/><br/></li></ul>Proficient command of the English language French a plus. Ability to read, analyze, and interpret general business periodicals, professional journals, technical procedures, or governmental regulations. Ability to write reports, business correspondence, and procedure manuals. Ability to effectively present information and respond to questions from groups of managers, clients, customers, and the general public.<br/><br/><br/>**Sorry, visa / sponsorship not available.**", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4000980458"}