{"jobTitle": "Senior Vice President, MultiFamily Division", "company": {"name": "Shapell Properties, Inc.", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "General Business, Customer Service, and Management", "industry": "Real Estate", "description": "<strong><u>Company Background</u></strong><p><br/></p><p>Shapell Properties (https://shapell.com) carries forward a legacy of visionary “build and hold” real estate development and operations that spans multiple generations since 1955. The company is well founded and funded, very stable and their passion lies in creating exceptional properties that cater to both residential and commercial needs by providing spaces that their patrons can enjoy. Shapell’s Core Values include: (1) Achieving excellence throughout the company by drawing upon the individual strengths of their team members and the power of collaborative teams, (2) Approaching all business matters, no matter the size, with commitment to the highest ethical standards, (3) Pledging to quality, convenience, and customer satisfaction, they offer thoughtfully designed spaces that provide an unparalleled experience, bringing tangible value to their tenants, and (4) Striving to keep the company strong and successful through the strategic acquisition, development, and operation of outstanding properties. They treat their people well and foster a dynamic work environment that encourages innovation, collaboration, and personal growth and are committed to attracting top talent who share their passion for excellence. They are currently seeking an SVP of their Multifamily Division for immediate hiring reporting to the CEO, based at their West Los Angeles, California headquarters.</p><p><br/></p><p><strong><u>Job Scope</u></strong></p><p><br/></p><p>The final candidate for the Senior Vice President, MultiFamily Division, will have overall stewardship of the ~7,500 multifamily residential apartments that the company owns and operates in California. As the company’s multifamily expert, they will play a strategic role in planning future real estate investments both inside and outside the State. The SVP will lead and direct a team of about 110 colleagues including three VPs that lead Development, Asset Management and Property Management, including three Regional Property Managers. This leadership role is strategic, financial, and operational in nature and requires directing and leading the development and standardization of comprehensive business plans, programs, initiatives, and strategies that promote the achievement of superior operational, financial and business performance of the Company. Specifically, the three key areas of accountability for the role include (1) maximizing the financial performance of the portfolio, (2) enhancing staff hiring, engagement and retention, and (3) optimizing customer satisfaction. They will be a seasoned multifamily leader having a hands-on, highly ethical and collaborative approach to the business and with their people.</p><p><br/></p><p><strong><u>Key Accountabilities </u></strong></p><p><br/></p><ul><li>Demonstrating the highest level of collaboration, communication and cooperation through the establishment of trust and respect by developing a strong working relationship with the CEO.</li><li>Driving operational excellence and maximizing the financial performance of the portfolio in revenue, operating expenses, overhead and capital projects against both budget and peer groups. Driving margins higher than previously achieved levels.</li><li>Enhancing employee engagement through developing best practices for hiring, onboarding, training, developing, assessing and retaining of all existing and new colleagues.</li><li>Overseeing the expansion of the multifamily portfolio through the acquisition and/or the development of new properties that enhance the returns of the company.</li><li>Establishing, reviewing and ensuring that the company’s customer service KPIs are established, communicated, documented, maintained and improved.</li><li>Eliminating any operational blind spots by enhancing a company culture of ethics and integrity.</li><li>Managing relationships with outside partners and third-party management companies.</li><li>Presenting residential operations updates to the CEO, CFO, and Board of Directors during board meetings and additional shareholder meetings as required.</li><li>Ensuring all business decisions by the properties align with Company policies and procedures.</li><li>Communicating with senior leadership regarding any issues related to property performance as well as overall operational matters.</li><li>Ensuring “best-in-class” service is delivered to all residents and prospective residents.</li><li>Reviewing preventative maintenance programs, resident retention programs and safety programs.</li><li>Formulating and overseeing the implementation of annual plans and short and long-term property operation strategies for each of the properties within the portfolio.</li><li>Providing a strong day-to-day leadership presence throughout the company by providing strategic insights, timely feedback and thoughtful communication.</li><li>Closely collaborating with Construction, Marketing, Accounting, Human Resources and Legal to manage all aspects of the multifamily business.</li></ul><p><br/></p><p><strong><u>Required Skills, Qualifications, Education and Motivations</u></strong></p><p><br/></p><ul><li>A seasoned, multifamily “Servant Leader” with 15-20 years of management experience with minimum 5-10 years of senior leadership experience, 2 to 3 direct reports and leading +75 staff.</li><li>Prior responsibility for oversight of at least a 5,000 multifamily unit portfolio.</li><li>Minimum Bachelor degree in business, real estate or a related field. MBA optional.</li><li>Strong written and verbal communication and presentation skills at all levels.</li><li>Best practices focus on both operational management excellence and people leadership developed in a multifamily setting by knowing how to keep teams accountable and on-target.</li><li>Both a strategist and an executional leader with a collaborative spirit that is committed to growth.</li><li>Detail oriented and organized with the ability to interact effectively with prospects, residents and peers.</li><li>A disciplined senior management leader with an approach to the business that helps to further strengthen a collaborative company culture and enable the dispersion of decision making where appropriate.</li><li>Demonstrated strong financial and business acumen, including a deep understanding of strategic economic issues and other key multifamily metrics that impact valuations and investment returns.</li><li>Thinks creatively and strategically about a property’s performance in terms of meeting its stated objectives and specific budgetary requirements that are set forth, yet able to balance creativity with a disciplined approach and perspective.</li></ul><p><br/></p><p><strong><u>Reporting Relationships, Benefits and Location</u></strong></p><p><br/></p><p>The Senior Vice President, Multifamily Division reports to the Chief Executive Officer and has a total staff of 110 with three VP direct reports. The final candidate will be offered a competitive compensation and benefits package, be based in the company’s West Los Angeles headquarters with some travel expected. This is a national search assignment and relocation is available for the final candidate, as needed.</p><p><br/></p><p><strong><u>For Further Information, Please Contact:</u></strong></p><p><br/></p><p>Mr. Brandt A. Handley, Managing Director, ROI Executive Search, E: <u>Brandt@Go4ROI.com</u>, T: 805.455.2702</p><p><br/></p><p><em><u>Resource Options International, Inc</u>. or ROI Executive Search is a boutique, retained executive search firm that enables Middle Market companies to identify, recruit and retain top talent at the CXO, VP and Director levels. We are industry and discipline agnostic as we believe that the talent management needs and requirements of our Middle Market clients have much more in common than their industry sector or functional differences. We deliver superior integrity, talent and competency to ROI’s global clients with offices in Florida, California, Connecticut and the United Kingdom. Learn more at <u>www.Go4ROI.com</u>.</em></p>", "responsibilities": "The final candidate for the Senior Vice President, MultiFamily Division, will have overall stewardship of the ~7,500 multifamily residential apartments that the company owns and operates in California. As the company’s multifamily expert, they will play a strategic role in planning future real estate investments both inside and outside the State. The SVP will lead and direct a team of about 110 colleagues including three VPs that lead Development, Asset Management and Property Management, including three Regional Property Managers. This leadership role is strategic, financial, and operational in nature and requires directing and leading the development and standardization of comprehensive business plans, programs, initiatives, and strategies that promote the achievement of superior operational, financial and business performance of the Company. Specifically, the three key areas of accountability for the role include (1) maximizing the financial performance of the portfolio, (2) enhancing staff hiring, engagement and retention, and (3) optimizing customer satisfaction. They will be a seasoned multifamily leader having a hands-on, highly ethical and collaborative approach to the business and with their people.", "qualifications": {"required": "A seasoned, multifamily “Servant Leader” with 15-20 years of management experience with minimum 5-10 years of senior leadership experience, 2 to 3 direct reports and leading +75 staff.\nPrior responsibility for oversight of at least a 5,000 multifamily unit portfolio.\nMinimum Bachelor degree in business, real estate or a related field. MBA optional.\nStrong written and verbal communication and presentation skills at all levels.\nBest practices focus on both operational management excellence and people leadership developed in a multifamily setting by knowing how to keep teams accountable and on-target.\nBoth a strategist and an executional leader with a collaborative spirit that is committed to growth.\nDetail oriented and organized with the ability to interact effectively with prospects, residents and peers.\nA disciplined senior management leader with an approach to the business that helps to further strengthen a collaborative company culture and enable the dispersion of decision making where appropriate.\nDemonstrated strong financial and business acumen, including a deep understanding of strategic economic issues and other key multifamily metrics that impact valuations and investment returns.\nThinks creatively and strategically about a property’s performance in terms of meeting its stated objectives and specific budgetary requirements that are set forth, yet able to balance creativity with a disciplined approach and perspective.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "The final candidate will be offered a competitive compensation and benefits package, be based in the company’s West Los Angeles headquarters with some travel expected. This is a national search assignment and relocation is available for the final candidate, as needed.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4000827909"}