{"jobTitle": "Post Production Assistant", "company": {"name": "Crazy Maple Studio", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "3,000.00/mo - 3,500.00/mo", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Entertainment Providers", "description": "<strong>Company Overview<br/><br/></strong>Since 2016, Crazy Maple Studio, Inc. has trailblazed the way for quality interactive storytelling. Through CHAPTERS: INTERACTIVE STORIES, readers immerse themselves in compelling playable novels licensed from best-selling global authors. Through KISS: READ AND WRITE ROMANCE, enthusiastic players are welcomed into the world of serialized romance that they can consume and create. ESCAPE has opened up new avenues in visual narrative gaming, and now CMS has ventured into the next generation of HD streaming platforms with bite-sized episodic shows on their latest release, REELSHORT, standing at #1 on US Entertainment.<br/><br/><strong>Position Overview<br/><br/></strong>We are seeking a detail-oriented and organized Post Production Assistant to join our team. The Post Production Assistant will provide essential support to the post-production team, assisting with various tasks to ensure the timely and efficient completion of projects.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Oversee the preparation, execution, and filing of contracts, and ensure timely payments to contractors and suppliers.</li><li>Manage and maintain digital assets, post-production supplies, project files, media libraries, archives, and databases, ensuring that all resources are readily available and organized.</li><li>Provide comprehensive administrative support including scheduling meetings, managing calendars, handling correspondence, and coordinating activities among post-production staff such as editors and sound designers to facilitate a smooth workflow.</li><li>Assist with quality control checks to ensure all deliverables conform to project specifications and quality standards, and meet deadlines.</li><li>Assist with a variety of other post-production tasks as needed to support project completion and team objectives.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor’s or higher degree in Film Production, Media Studies, or related field.</li><li>Previous experience in post-production or a related role is preferred.</li><li>Strong organizational and multitasking skills.</li><li>Excellent attention to detail and problem-solving abilities.</li><li>Strong communication and interpersonal skills.</li><li>Ability to work effectively in a fast-paced environment and meet tight deadlines.</li><li>Basic knowledge of post-production workflow and software, such as Adobe Premiere Pro and Davinci Resolve.<br/><br/></li></ul><strong>Eligibility Requirements<br/><br/></strong><ul><li>Interested candidates must submit a resume online to be considered</li><li>Must be willing to work in Culver City, CA</li><li>Must have work authorization in the United States.</li><li>This position offers an opportunity for contractual employment with the potential for transition to full-time employment with CMS. The compensation range for this role during the contractual period is between $3000 and $3500 per month.<br/><br/></li></ul><strong>Benefits<br/><br/></strong>Medical, Dental, and Vision benefits", "responsibilities": "Oversee the preparation, execution, and filing of contracts, and ensure timely payments to contractors and suppliers. Manage and maintain digital assets, post-production supplies, project files, media libraries, archives, and databases, ensuring that all resources are readily available and organized. Provide comprehensive administrative support including scheduling meetings, managing calendars, handling correspondence, and coordinating activities among post-production staff such as editors and sound designers to facilitate a smooth workflow. Assist with quality control checks to ensure all deliverables conform to project specifications and quality standards, and meet deadlines. Assist with a variety of other post-production tasks as needed to support project completion and team objectives.", "qualifications": {"required": "Bachelor’s or higher degree in Film Production, Media Studies, or related field. Previous experience in post-production or a related role is preferred. Strong organizational and multitasking skills. Excellent attention to detail and problem-solving abilities. Strong communication and interpersonal skills. Ability to work effectively in a fast-paced environment and meet tight deadlines. Basic knowledge of post-production workflow and software, such as Adobe Premiere Pro and Davinci Resolve.", "preferred": "Interested candidates must submit a resume online to be considered Must be willing to work in Culver City, CA Must have work authorization in the United States. This position offers an opportunity for contractual employment with the potential for transition to full-time employment with CMS. The compensation range for this role during the contractual period is between $3000 and $3500 per month."}, "skills": ["Adobe Premiere Pro", "Davinci Resolve"], "postedDate": "1 week ago", "benefits": "Medical, Dental, and Vision benefits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000084220"}