{"jobTitle": "Human Resources Business Partner", "company": {"name": "Keurig Dr Pepper Inc.", "location": "Vernon, CA", "industry": "Food and Beverage Manufacturing"}, "location": "Vernon, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "59,000.00/yr - 99,000.00/yr", "currency": "USD"}, "jobFunction": "Distribution, Human Resources, and Manufacturing", "industry": "Food and Beverage Manufacturing", "description": "<strong>Are you ready to join a growing, dynamic company?</strong> Keurig Dr Pepper is a modern beverage company, with more than 125 brands people know and love. We challenge the usual and always push beyond the expected. We are building a culture that is our competitive advantage – one that is growth focused, change resilient, collaborative, innovative, nimble, diverse and inclusive.  <br/><strong>Are you ready to do impactful work? </strong> You’ll coach and mentor leaders. You’ll create and implement ambitious people strategies. You’ll play an important leadership role in our diversity &amp; inclusion efforts. You’ll work collaboratively with business partners and Centers of Excellence to deliver solutions that propel the business forward.  <br/><strong>Are you ready to grow?</strong> Here’s what will make you successful at KDP! We love passionate, courageous HR leaders who work with agility and are excited by new challenges. You’ll need consulting and influencing skills, a team-first, entrepreneurial spirit, business insight and analytical capability, and a heart for supporting the needs of our employees.  <br/><strong>Will you be the next member of our talented team?</strong> If you’re ready, here’s more about the job!  <br/><strong>***This position will based in our Vernon, CA facility. Hybrid schedule of 4 days in office and 1 day remote.***</strong>  <br/>As an <strong>HR Business Partner</strong>, you will work with managers and employees to address issues and concerns where judgment is required. You will interpret and enforce company policies and provide coaching to managers on all aspects of leadership and employee/labor relations. You will help to define the organization's talent needs, including organization structure and staffing. As a key culture leader in the organization, you will also counsel employees on work-related challenges and provide guidance to managers with respect to implementing Human Resources programs for a function or location. You will also act as a change agent to enable the growth &amp; development of our people  <br/><strong>Your Responsibilities will include</strong><ul><li>Coach and develop business partners in the areas of performance management and talent development, among others</li><li>Assist with the development and facilitation of various training initiatives predicated on business needs and corporate goals</li><li>Manage daily employee and perform initial investigations of employee complaints and alleged policy violations, escalating where necessary</li><li>Partner with HR Compliance Team to implement and monitor HR compliance with KDP policy, HR systems, and applicable federal/state law (including but not limited to 1-9s, personnel files, Worker’s Compensation, EEO, ADA, FMLA) and collective bargaining agreements</li><li>Partner with our Talent Acquisition team to track and report on open positions and help manage the position requisition process for internal transfers to ensure accuracy of postings and facilitate internal movement</li><li>Research and respond to initial unemployment requests for data as well as scheduling and notifying participants of upcoming hearings</li><li>Apply analytical skills to collect and synthesize data, tell the story and formulate recommendations based on data trends and insights</li><li>Develop basic communication materials (e.g., PowerPoint presentations, termination letters, and other employment-related correspondence)</li><li>Travel required</li></ul><br/><strong>Total Rewards</strong><ul><li>Salary Range: $59,000 - $99,000</li><li>Actual placement within the compensation range may vary depending on experience, skills, and other factors </li><li>Benefits, subject to election and eligibility: Medical, Dental, Vision, Disability, Paid Time Off (including paid parental leave, vacation, and sick time), 401k with company match, Tuition Reimbursement, and Mileage Reimbursement</li><li>Annual bonus based on performance and eligibility</li></ul><br/><br/><strong>Education &amp; Experience</strong><ul><li>Bachelor’s Degree in Human Resources, related field or professional experience equivalent</li><li>A minimum of 4-6 years of progressive experience in HR roles within fast-paced and matrix organizations</li><li>Advanced skills using Microsoft Office Suite (Work, Excel, PowerPoint, Outlook, Teams)</li></ul><br/><strong>Successful candidates will also demonstrate these additional qualifications</strong><ul><li>Proven ability to understand business goals and then design &amp; implement new approaches, policies and procedures to affect continual improvements in business objectives, productivity and development of the HR function within the company</li><li>Proven bias for action as evidenced through proactive, innovative and value-creating solution implementation</li><li>Proven ability to navigate ambiguity within a complex, dynamic and rapidly changing business environment</li><li>Proven ability to seamlessly transition between strategic thinking and tactical execution</li><li>Proven ability to prioritize the most impactful work amidst multiple competing priorities</li><li>Success in creating &amp; driving effective and positive employee and labor relations for large populations of hourly employees in a distribution and / or manufacturing environment</li><li>Success in leading and managing projects, some of which may be large-scale, cross-functional, and require strong stakeholder management and alignment</li></ul><br/><br/><br/>Keurig Dr Pepper (NASDAQ: KDP) is a leading beverage company in North America, with a portfolio of more than 125 owned, licensed and partners brands and powerful distribution capabilities to provide a beverage for every need, anytime, anywhere. We operate with a differentiated business model and world-class brand portfolio, powered by a talented and engaged team that is anchored in our values. We work with big, exciting beverage brands and the #1 single-serve coffee brewing system in North America at KDP, and we have fun doing it!  <br/>Together, we have built a leading beverage company in North America offering hot and cold beverages together at scale. Whatever your area of expertise, at KDP you can be a part of a team that’s proud of its brands, partnerships, innovation, and growth. Will you join us?  <br/>We strive to be an employer of choice, providing a culture and opportunities that empower our team of ~28,000 employees to grow and develop. We offer robust benefits to support your health and wellness as well as your personal and financial well-being. We also provide employee programs designed to enhance your professional growth and development, while ensuring you feel valued, inspired and appreciated at work.  <br/>Keurig Dr Pepper is an equal opportunity employer and affirmatively seeks diversity in its workforce. Keurig Dr Pepper recruits qualified applicants and advances in employment its employees without regard to race, color, religion, gender, sexual orientation, gender identity, gender expression, age, disability or association with a person with a disability, medical condition, genetic information, ethnic or national origin, marital status, veteran status, or any other status protected by law.", "responsibilities": "As an HR Business Partner, you will work with managers and employees to address issues and concerns where judgment is required. You will interpret and enforce company policies and provide coaching to managers on all aspects of leadership and employee/labor relations. You will help to define the organization's talent needs, including organization structure and staffing. As a key culture leader in the organization, you will also counsel employees on work-related challenges and provide guidance to managers with respect to implementing Human Resources programs for a function or location. You will also act as a change agent to enable the growth &amp; development of our people  <br/>Your Responsibilities will include<ul><li>Coach and develop business partners in the areas of performance management and talent development, among others</li><li>Assist with the development and facilitation of various training initiatives predicated on business needs and corporate goals</li><li>Manage daily employee and perform initial investigations of employee complaints and alleged policy violations, escalating where necessary</li><li>Partner with HR Compliance Team to implement and monitor HR compliance with KDP policy, HR systems, and applicable federal/state law (including but not limited to 1-9s, personnel files, Worker’s Compensation, EEO, ADA, FMLA) and collective bargaining agreements</li><li>Partner with our Talent Acquisition team to track and report on open positions and help manage the position requisition process for internal transfers to ensure accuracy of postings and facilitate internal movement</li><li>Research and respond to initial unemployment requests for data as well as scheduling and notifying participants of upcoming hearings</li><li>Apply analytical skills to collect and synthesize data, tell the story and formulate recommendations based on data trends and insights</li><li>Develop basic communication materials (e.g., PowerPoint presentations, termination letters, and other employment-related correspondence)</li><li>Travel required</li></ul>", "qualifications": {"required": "Bachelor’s Degree in Human Resources, related field or professional experience equivalent  A minimum of 4-6 years of progressive experience in HR roles within fast-paced and matrix organizations  Advanced skills using Microsoft Office Suite (Work, Excel, PowerPoint, Outlook, Teams)", "preferred": "Proven ability to understand business goals and then design &amp; implement new approaches, policies and procedures to affect continual improvements in business objectives, productivity and development of the HR function within the company  Proven bias for action as evidenced through proactive, innovative and value-creating solution implementation  Proven ability to navigate ambiguity within a complex, dynamic and rapidly changing business environment  Proven ability to seamlessly transition between strategic thinking and tactical execution  Proven ability to prioritize the most impactful work amidst multiple competing priorities  Success in creating &amp; driving effective and positive employee and labor relations for large populations of hourly employees in a distribution and / or manufacturing environment  Success in leading and managing projects, some of which may be large-scale, cross-functional, and require strong stakeholder management and alignment"}, "skills": ["Microsoft Office", "Human Resources", "Employee Relations", "Talent Acquisition", "Performance Management", "Training", "Compliance", "Analytical Skills", "Communication", "Project Management", "Stakeholder Management"], "postedDate": "1 week ago", "benefits": "Benefits, subject to election and eligibility: Medical, Dental, Vision, Disability, Paid Time Off (including paid parental leave, vacation, and sick time), 401k with company match, Tuition Reimbursement, and Mileage Reimbursement  Annual bonus based on performance and eligibility", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4000535173"}