{"jobTitle": "Front Office Supervisor", "company": {"name": "Montage International", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "24.00 - 26.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Hospitality", "description": "Live Your Passion. Add Your Magic.<br/><br/>At Montage International, we are doing something different, something exciting and it takes passionate people to bring our vision to life. We have built a culture that leads with the important notion we live by every day; do what you love. If this resonates with you, we look forward to receiving your application.<br/><br/>We welcome applicants with disabilities and provide reasonable accommodations as needed to our applicants. Please discuss with our hiring managers during our selection processes.<br/><br/><strong><strong>If you are an internal applicant, please log into Workday and apply for your application to be considered.<br/><br/></strong></strong><strong><strong>Please Click Here </strong></strong><strong><strong>to apply internally.<br/><br/></strong></strong><strong>Front Office Supervisor<br/><br/></strong><strong>Summary<br/><br/></strong>The Front Office Supervisor is responsible for assisting the Director of Front Office in managing the day-to-day operations for guest reception, guest services, reservations, and concierge; including profitable financial management and proactive strategic leadership. This role will contribute to the organization as an active business partner that is responsible for supporting the company's goals, objectives, vision, mission, and values.<br/><br/><strong>Essential Functions<br/><br/></strong>Job duties include; although are not limited to:<br/><br/><ul><li>Supporting the department operation and providing direct service to guests as needed, leading by example</li><li>Overseeing the arrival and departure experience, ensuring guests expectations are exceeded at all times</li><li>Assisting in creating and implementing profit and flow-through enhancing strategies and programs</li><li>Reviewing daily financial and labor reports; providing suggestions for adjusting the operation as needed to achieve annual budget and forecasts</li><li>Assisting in creating, implementing and executing department trainings, recruiting and innovative pre-shifts</li><li>Assisting in managing associate engagement, scheduling, payroll, counseling and quarterly department meetings</li><li>Supporting the hotel's life-safety systems and being prepared at all times for emergency situations<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor’s Degree required </li><li>Minimum of four (4) years’ experience in customer service</li><li> Two (2) to three (3) years of hotel supervisory experience</li><li> Advanced skills in Word, Excel, PowerPoint, Opera and Outlook; daily use of nearly all programs will occur</li><li>Luxury hotel experience strongly preferred</li><li>Knowledge and experience in using Birchstreet, HotSOS and Rex preferred<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong>Position requires walking and giving direction most of the working day. Must be able to stand and walk for 8 hours a day. Requires grasping, writing, standing, sitting, walking, repetitive motions, bending, climbing, listening and hearing ability and visual acuity. Must be able to lift up to 25 lbs. on a regular and continuing basis. Must be able to push and pull carts and equipment weighing up to 250 lbs. occasionally.<br/><br/>The pay scale for Front Office Supervisor is $24.00 - $26.00.<br/><br/>The pay scale is the base salary or hourly wage range, exclusive of incentive pay such as commissions, piece rates, gratuities, and the like, that Montage reasonably expects to pay for the position.<br/><br/><em>In the United States we are proud to be an EEO employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse testing.</em>", "responsibilities": "The Front Office Supervisor is responsible for assisting the Director of Front Office in managing the day-to-day operations for guest reception, guest services, reservations, and concierge; including profitable financial management and proactive strategic leadership. This role will contribute to the organization as an active business partner that is responsible for supporting the company's goals, objectives, vision, mission, and values.<br/><br/>Job duties include; although are not limited to:<br/><br/><ul><li>Supporting the department operation and providing direct service to guests as needed, leading by example</li><li>Overseeing the arrival and departure experience, ensuring guests expectations are exceeded at all times</li><li>Assisting in creating and implementing profit and flow-through enhancing strategies and programs</li><li>Reviewing daily financial and labor reports; providing suggestions for adjusting the operation as needed to achieve annual budget and forecasts</li><li>Assisting in creating, implementing and executing department trainings, recruiting and innovative pre-shifts</li><li>Assisting in managing associate engagement, scheduling, payroll, counseling and quarterly department meetings</li><li>Supporting the hotel's life-safety systems and being prepared at all times for emergency situations<br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s Degree required, Minimum of four (4) years’ experience in customer service, Two (2) to three (3) years of hotel supervisory experience, Advanced skills in Word, Excel, PowerPoint, Opera and Outlook; daily use of nearly all programs will occur, Luxury hotel experience strongly preferred, Knowledge and experience in using Birchstreet, HotSOS and Rex preferred", "preferred": ""}, "skills": ["Word", "Excel", "PowerPoint", "Opera", "Outlook", "Birchstreet", "HotSOS", "Rex"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000194222"}