{"jobTitle": "Account Executive", "company": {"name": "WebMD", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Sales, Business Development, and Consulting", "industry": "Technology, Information and Internet", "description": "WebMD is the most recognized and trusted brand of health information and is the leading provider of health information services, serving consumers, physicians, healthcare professionals, employers, and health plans through our public and private online portals and WebMD the Magazine. Our consumer portals and mobile health applications provide engaging, relevant, and credible health and wellness information, personalized health assessment tools, and access to online communities.\n\nOur mission is to help consumers take an active role in managing their own health and wellness.\n\nWebMD Care Physician Directory, one of the fastest-growing divisions within WebMD, is in search of an Account Executive to get in on the ground floor of our growing sales team!\n\nWhat you will do:\n- The Account Executive will be responsible for selling our WebMD Care and Vitals.com online physician directory listing space to medical practices across the country.\n- The right person will utilize their prospecting and consultative selling skills, self-sufficiency, and initiative to identify opportunities to sell.\n- This is a phone-heavy role, requiring 50 or more calls per day. We are looking for high-energy, organized, reliable, and goal-driven individuals to get in on the ground floor of our new sales team!\n\nWhy you should work here:\n- Uncapped commission incentives. The more you close, the higher your total compensation.\n- Established promotional paths for Inside Sales Representatives to advance professionally.\n- Hybrid work schedule with the opportunity to work 100% remote after month 6 based on performance\n- Work for a trusted brand with 100s of millions of site visitors each month.\n- Since Internet Brands acquired WebMD in 2017, the brand has shown growth year over year, including doubling annualized revenue during COVID.\n- Health is a recession-proof industry, digital media and the medical space are both exploding industries. While companies were furloughing /laying people off, WebMD was hiring and promoting and hasn’t stopped.\n\nCombining WebMD and Vitals, the two biggest health information networks, makes us the leader in the digital health space, when potential users are looking for a doctor\n\nGreat leadership and sales culture where hard work is recognized and rewarded, and fairness and respect are always top-of-mind.\nA unique blend of the innovation of a start-up with the resources, stability, and benefits of an established corporation and one of the largest private equity firms in the world, KKR.\n\nHow you will contribute:\n- Drive sales revenue and market share by managing a prospect list to achieve quota.\n- Prospecting new clients through cold calling.\n- Consult with the client to find strategies that will meet their business needs and will improve their ability to generate business.\n- Closing deals.\n- Excellent organizational and time management skills.\n- Ability to effectively communicate features, added value, and benefits of our patient referrals.\n- Meet and exceed daily, weekly, and monthly sales and productivity goals.\n\nThis describes you:\n- Strong hunter mentality.\n- Self-motivated.\n- Strong attention to detail and highly organized.\n- 1-2 years of inside/telesales experience with a track record of success in selling or appointment setting.\n- B2B and/or digital product experience is a plus.\n- Proficient in Windows including but not limited to: Excel, Outlook, and Word.\n\nCompensation: $45,000 base, with top AEs consistently making $100,000+ in total compensation. Commissions paid monthly.\nAbout Internet Brands:\nHeadquartered in El Segundo, Calif., Internet Brands® is a fully integrated online media and software services organization focused on four high-value vertical categories: Health, Automotive, Legal, and Home/Travel. The company's award-winning consumer websites lead their categories and serve more than 250 million monthly visitors, while a full range of web presence offerings has established deep, long-term relationships with SMB and enterprise clients. Internet Brands' powerful, proprietary operating platform provides the flexibility and scalability to fuel the company's continued growth. Internet Brands is a portfolio company of KKR and Temasek. For more information, please visit www.internetbrands.com.\n\nInternet Brands and its wholly-owned affiliates are an equal opportunity employer.\n\nNotice to California residents: you can find information about our privacy practices, on: https://www.internetbrands.com/work-with-us/cpra", "responsibilities": "- The Account Executive will be responsible for selling our WebMD Care and Vitals.com online physician directory listing space to medical practices across the country.\n- The right person will utilize their prospecting and consultative selling skills, self-sufficiency, and initiative to identify opportunities to sell.\n- This is a phone-heavy role, requiring 50 or more calls per day. We are looking for high-energy, organized, reliable, and goal-driven individuals to get in on the ground floor of our new sales team!", "qualifications": {"required": "1-2 years of inside/telesales experience with a track record of success in selling or appointment setting.\n- B2B and/or digital product experience is a plus.\n- Proficient in Windows including but not limited to: Excel, Outlook, and Word."}, "skills": ["Sales", "Prospecting", "Consultative Selling", "Cold Calling", "Business Development", "Time Management", "Communication", "Excel", "Outlook", "Word"], "postedDate": "1 week ago", "benefits": "Uncapped commission incentives. The more you close, the higher your total compensation.\n- Established promotional paths for Inside Sales Representatives to advance professionally.\n- Hybrid work schedule with the opportunity to work 100% remote after month 6 based on performance\n- Work for a trusted brand with 100s of millions of site visitors each month.\n- Since Internet Brands acquired WebMD in 2017, the brand has shown growth year over year, including doubling annualized revenue during COVID.\n- Health is a recession-proof industry, digital media and the medical space are both exploding industries. While companies were furloughing /laying people off, WebMD was hiring and promoting and hasn’t stopped.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4000382004"}