{"jobTitle": "Clerk", "company": {"name": "Chicanos Por La Causa, Inc. (CPLC)", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Non-profit Organizations", "description": "<strong>Position Summary<br/><br/></strong><ul><li> Please note: This is a Full-Time in office position.<br/><br/></li></ul>The Clerk position provides a wide range of administrative support and organizational assistance to the Regional Office Coordinator in a fast-paced, urgent, and high accountability environment in support of HSPRS program operations.<br/><br/><strong>Minimum Qualifications And Competencies<br/><br/></strong><ul><li>2+ years’ experience as an office manager, clerk, or other administrative duties.</li><li>21 years of age or older.</li><li>Maintain current licenses and certificates required for the position, including but not limited to</li><li>Pass a pre-employment drug screen and random drug screens throughout employment.</li><li>Provide proof of work eligibility status upon request.</li><li>Pass pre-employment and biennial criminal background checks.</li><li>Communicate effectively in writing and verbally in English (and Spanish strongly preferred).</li><li>Maintain computer literacy required to meet responsibilities of the position.</li><li>Highly proficient in Office programs such as: Google suites, excel, word, and power point.</li><li>Ability to work with and manage confidential and sensitive information.</li><li>Ability to work alone or with a team<br/><br/></li></ul>Effective January 3, 2022, all CPLC Employees and all Service Providers, are required to be Fully Vaccinated against COVID-19. Newly hired employees, who are not Fully Vaccinated at the time of hire, are expected to begin a vaccination series immediately upon hire. CPLC recognizes medical and religious exemptions to the COVID-19 vaccination requirement, in accordance with applicable law and upon approval by CPLC. However, any person approved for an exemption, without exception, is subject to masking, and other requirements established by CPLC from time to time.", "postedDate": "3 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4000737571"}