{"jobTitle": "Material Handler", "company": {"name": "Randstad USA", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$20.00/hr - $22.50/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "We are a leader in the design and production of critical power distribution products for many specific segments. This position requires the ability to use a forklift or power equipment to move and store a variety of materials, parts, and products. This position will transport items from incoming staging area or from finished goods staging area to a storage area and/or shipping area. This position may operate an overhead crane or hoist to assist in moving of material. Individual will also complete related documentation associated with shipping and receiving material as well as move or expedite material to the proper department.", "responsibilities": "Act as backup to other material handlers as needed in different sections. Visually inspect for damaged material. Keep areas neat and orderly using 5S guidelines. Safely and efficiently deliver materials as needed to storeroom locations, or POU locations. Notify internal customers of receipts / product marked to their attention. Maintain working relationship with internal customers. Receive P.O’s in system. Separate AML material from non-AML. (Kanban) Sort and disperse return material. Maintain all documentation accordingly. Unload trucks and check freight bills accordingly. Verify material against packing list. Perform duties of internal truck driver, making pick ups and deliveries in a timely fashion. Assist with delivery / receipt of product to outside vendors and / or contractors. Maintain stock levels. Coordinate movement of material. Locate material when required by other material handlers, internal customers or Supervisors. Work with planners and buyers to make them aware of problems. Assist with annual inventory. Process internal Kanban cards. Assist in the maintenance of the Kanban system. Package finished product in preparation for shipping.", "qualifications": {"required": "High School education", "preferred": "0 years of experience"}, "skills": ["Material Handling", "Moving Material", "Packaging", "Forklift", "Manufacturing", "Inspection"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4000395863"}