{"jobTitle": "Workplace (Facilities) Manager", "company": {"name": "Lugano Diamonds", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "<strong>About Us<br/><br/></strong>Guided by our core values – The Lugano Way – our team embodies a proactive mindset that fuels our drive for success. We work with a people-first mentality and foster an environment of continuous learning and mutual growth. Our ultimate goal? To consistently find a path to YES and deliver remarkable in all we do. Through innovation, teamwork, and collaboration, we bring this to life. Join us in shaping a future of brilliance and endless possibilities.<br/><br/><strong>Job Overview<br/><br/></strong>The Workplace Manager oversees and manages all aspects of facilities operations for a luxury retail company. They will play a crucial role in maintaining the high standards of our salons, ensuring that all locations are operationally efficient and provide an exceptional environment for both customers and employees. The Facilities Manager will coordinate maintenance activities, manage vendor relationships, and implement processes to support all Lugano salons and be the main point of contact for the Real Estate Development department during new location openings. This role also requires regular travel to various locations to conduct inspections and ensure compliance with company standards.<br/><br/><strong>What You W</strong><strong>ill Do<br/><br/></strong><ul><li>Ensure salons are clean, well-maintained, and efficiently operated, coordinating with the Salon Operations team.</li><li>Develop and implement preventive maintenance and repair schedules for all locations.</li><li>Supervise maintenance staff and external contractors, coordinating with the Salon Operations team.</li><li>Oversee workplace inbox, promptly addressing and resolving time-sensitive issues.</li><li>Create and distribute recurring reports on workplace requests and issues, updating stakeholders.</li><li>Conduct ongoing salon inspections, resolve issues, and communicate progress with stakeholders.</li><li>Collaborate with the Real Estate Development Team on new locations from building to opening, supporting ongoing operations.</li><li>Lead regular meetings to align teams on the project roadmap and task list for new locations.</li><li>Manage vendor relationships, including contract negotiation, service quality assurance, and procurement.</li><li>Oversee procurement and scheduling of services essential to salon operations, providing training and support to the salon team.<br/><br/></li></ul><strong>What You Bring<br/><br/></strong><ul><li>You have proven experience as a Workplace (Facilities) Manager or in a similar role, preferably in a retail or luxury environment.</li><li>You pride yourself on excellent organizational and project management skills.</li><li>You have strong negotiation and vendor management abilities.</li><li>You work independently and have the ability to manage multiple priorities.</li><li>You have proactive and clear communication and interpersonal skills.</li><li>You understand the need to be available to respond to emergencies and provide after-hours support as needed.</li><li>You have experience managing multiple locations, and retail is preferred.</li><li>Plus, if you have an understanding of luxury retail operations and customer expectations.<br/><br/></li></ul><strong>Pay Transparency<br/><br/></strong>Total annual compensation target is $90,000 (base salary plus quarterly bonus). The total compensation package is determined by work location and additional factors, including job-related skills, experience, and relevant education or training.<br/><br/><strong>Our Benefits<br/><br/></strong>Lugano Diamonds is a fast-growing company with many opportunities for you to master your craft and grow your career. We are proud to offer employees a generous compensation package that includes commission and bonus plans for all employees, multi-option healthcare plans, 401k with match, and paid time off. Join the team and carve your own path to the future.<br/><br/><strong>Being You at Lugano<br/><br/></strong>Lugano is committed to creating a diverse work environment that recruits and rewards employees based on capabilities and performance. We are inclusive, celebrate our differences, and welcome a broad range of perspectives and ideas without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.<br/><br/><strong>Join Our Team – </strong>Where People, Leadership, Innovation, and Passion come first.<br/><br/>CCPA disclosure notice here.", "responsibilities": "The Workplace Manager oversees and manages all aspects of facilities operations for a luxury retail company. They will play a crucial role in maintaining the high standards of our salons, ensuring that all locations are operationally efficient and provide an exceptional environment for both customers and employees. The Facilities Manager will coordinate maintenance activities, manage vendor relationships, and implement processes to support all Lugano salons and be the main point of contact for the Real Estate Development department during new location openings. This role also requires regular travel to various locations to conduct inspections and ensure compliance with company standards.", "qualifications": {"required": "You have proven experience as a Workplace (Facilities) Manager or in a similar role, preferably in a retail or luxury environment. You pride yourself on excellent organizational and project management skills. You have strong negotiation and vendor management abilities. You work independently and have the ability to manage multiple priorities. You have proactive and clear communication and interpersonal skills. You understand the need to be available to respond to emergencies and provide after-hours support as needed. You have experience managing multiple locations, and retail is preferred. Plus, if you have an understanding of luxury retail operations and customer expectations."}, "skills": [], "postedDate": "1 week ago", "benefits": "Lugano Diamonds is a fast-growing company with many opportunities for you to master your craft and grow your career. We are proud to offer employees a generous compensation package that includes commission and bonus plans for all employees, multi-option healthcare plans, 401k with match, and paid time off. Join the team and carve your own path to the future.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000946452"}