{"jobTitle": "Content Designer", "company": {"name": "Meta", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "29.14/yr - $106,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Technology, Information and Internet", "description": "Content designers at Meta craft simple, straightforward and human experiences. Approaching design through the lens of language, we leverage our expertise in user experience design, design thinking and product strategy. Come join our team to create and shape great, intuitive products and services used by billions of people around the world every day.You’ll be expected to design and deliver product flows, new features, in-product language, content frameworks, navigation, product naming and more, for platforms including mobile, desktop, AR/VR, hardware and voice. The Meta Content Design team is one of the largest and most established in the world, and includes people at various stages in their careers and from a range of backgrounds.<br/><br/>Content Designer Responsibilities:<br/><br/><ul><li>Design, write, edit and test clear, compelling in-product language to help users and teams meet their goals. This includes product flows, interface language, education materials, product names, navigational nomenclature, terminology, taxonomies and other content across Meta products and experiences.</li><li>Craft appropriate language for a product or audience, reflecting the right voice and tone to map to the user journey.</li><li>Give and solicit feedback from your UX design peers in service of building the best products.</li><li>Contribute to projects in ways that enhance the clarity and usability of product experiences.</li><li>Identify problems you can help solve and deliver on them.</li><li>Edit and contribute to designs and content using Figma.</li><li>Collaborate daily with peers across disciplines, including engineering, design, research, marketing and data science.</li><li>Partner with our internationalization team to ensure product experiences are of the highest quality in every language.<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>1+ years’ experience in UX writing.</li><li>Experience creating wireframes and editing design mocks using design tools.</li><li>Experience with simplifying and communicating complex ideas to broad audiences.</li><li>Familiarity with tools for managing and updating content at scale.</li><li>Experience applying systems thinking to digital experiences.<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$29.14/hour to $106,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "Content designers at Meta craft simple, straightforward and human experiences. Approaching design through the lens of language, we leverage our expertise in user experience design, design thinking and product strategy. Come join our team to create and shape great, intuitive products and services used by billions of people around the world every day.You’ll be expected to design and deliver product flows, new features, in-product language, content frameworks, navigation, product naming and more, for platforms including mobile, desktop, AR/VR, hardware and voice. The Meta Content Design team is one of the largest and most established in the world, and includes people at various stages in their careers and from a range of backgrounds.<br/><br/>Content Designer Responsibilities:<br/><br/><ul><li>Design, write, edit and test clear, compelling in-product language to help users and teams meet their goals. This includes product flows, interface language, education materials, product names, navigational nomenclature, terminology, taxonomies and other content across Meta products and experiences.</li><li>Craft appropriate language for a product or audience, reflecting the right voice and tone to map to the user journey.</li><li>Give and solicit feedback from your UX design peers in service of building the best products.</li><li>Contribute to projects in ways that enhance the clarity and usability of product experiences.</li><li>Identify problems you can help solve and deliver on them.</li><li>Edit and contribute to designs and content using Figma.</li><li>Collaborate daily with peers across disciplines, including engineering, design, research, marketing and data science.</li><li>Partner with our internationalization team to ensure product experiences are of the highest quality in every language.<br/><br/></li></ul>", "qualifications": {"required": "1+ years’ experience in UX writing.\nExperience creating wireframes and editing design mocks using design tools.\nExperience with simplifying and communicating complex ideas to broad audiences.\nFamiliarity with tools for managing and updating content at scale.\nExperience applying systems thinking to digital experiences.<br/><br/>", "preferred": ""}, "skills": ["UX Writing", "Wireframing", "Design Tools", "Content Management", "Systems Thinking"], "postedDate": "1 week ago", "benefits": "$29.14/hour to $106,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4000132103"}