{"jobTitle": "Production Operations Coordinator", "company": {"name": "Cosm", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "29.00/hr - 38.00/hour", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Entertainment Providers", "description": "Cosm is a global technology company that brings experiences to life in immersive environments. We help our partners create spaces and content that blur the lines of real and virtual across three primary markets: Sports and Entertainment, Science and Education, and Parks and Attractions. Cosm was born from the fusion of some of the greatest innovators in the history of technology. Evans & Sutherland, Spitz, Inc., and Cosm Immersive combined forces to power the immersive experiences of the future as Cosm. Innovation is in our DNA.<br/><br/><strong>Summary<br/><br/></strong>We are seeking a dynamic individual with exceptional administrative, project management, and interpersonal skills to join our team as a Production Operations Coordinator. This pivotal role will support all Cosm Immersive productions, encompassing a diverse array of tasks including scheduling, crew management, travel coordination, facilities oversight, and vendor relations supporting our remote broadcast control room in our LA office. The ideal candidate will thrive in a fast-paced environment and demonstrate a commitment to excellence in every aspect of their work. This role will work weekends and evenings to align to the schedule of major sporting events.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Operational Support: Collaborate closely with the production management to ensure seamless operations in the control room during broadcast days. </li><li> Crew Logistics: Facilitate production crew logistics, including facility access, parking, and meal coordination on show days. </li><li> Documentation Management: Maintain and distribute internal documentation promptly to management and production staff. </li><li> Vendor and Contractor Coordination: Oversee the onboarding process for vendors and contractors, managing invoicing and expense tracking. </li><li> Equipment and Supplies: Procure and manage equipment and supplies essential to the production team's success. </li><li> Production Support: Provide critical support to Production Managers during remote broadcasts. </li><li> Schedule and Budget Management: Maintain accurate production schedules, budgets, and records, identifying areas for improvement. </li><li> Gear Preparation: Assist in the packing and preparation of gear for deployment to events. <br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li> Minimum of two years of experience in production, ideally within high-performing, multidisciplinary teams. </li><li> Exceptional presentation, communication, and written skills, with the ability to engage effectively across all levels and departments. </li><li> Proven ability to thrive in a fast-paced, collaborative environment, demonstrating resourcefulness and adaptability. </li><li> Proficiency in Microsoft Office Suite (PowerPoint, Word, Excel). </li><li> Excellent time management skills and strong organizational abilities. </li><li> Familiarity with production or project management tools (e.g., Notion, Scheduall, Adobe) is a plus. </li><li> Ability to travel 5-15% of the time. <br/><br/></li></ul><strong> Join Us: </strong> Be part of a team redefining immersive experiences and shaping the future of live events. If you’re a dedicated Production Coordinator with a passion for sports and a knack for operational excellence, we’d love to hear from you!<br/><br/>The hourly rate range for this position in California is $29.00 to 38.00/hour. The pay offered will factor in internal equity and may also vary depending on the candidate's geographic region, job-related knowledge, skills, and relevant experience, among other factors.<br/><br/>Cosm is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.<br/><br/>Apply Now", "responsibilities": "Operational Support: Collaborate closely with the production management to ensure seamless operations in the control room during broadcast days. \nCrew Logistics: Facilitate production crew logistics, including facility access, parking, and meal coordination on show days. \nDocumentation Management: Maintain and distribute internal documentation promptly to management and production staff. \nVendor and Contractor Coordination: Oversee the onboarding process for vendors and contractors, managing invoicing and expense tracking. \nEquipment and Supplies: Procure and manage equipment and supplies essential to the production team's success. \nProduction Support: Provide critical support to Production Managers during remote broadcasts. \nSchedule and Budget Management: Maintain accurate production schedules, budgets, and records, identifying areas for improvement. \nGear Preparation: Assist in the packing and preparation of gear for deployment to events.", "qualifications": {"required": "Minimum of two years of experience in production, ideally within high-performing, multidisciplinary teams. \nExceptional presentation, communication, and written skills, with the ability to engage effectively across all levels and departments. \nProven ability to thrive in a fast-paced, collaborative environment, demonstrating resourcefulness and adaptability. \nProficiency in Microsoft Office Suite (PowerPoint, Word, Excel). \nExcellent time management skills and strong organizational abilities. \nFamiliarity with production or project management tools (e.g., Notion, Scheduall, Adobe) is a plus. \nAbility to travel 5-15% of the time.", "preferred": ""}, "skills": ["Production", "Project Management", "Microsoft Office Suite", "Notion", "Scheduall", "Adobe"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4000885990"}