{"jobTitle": "Production Manager", "company": {"name": "The Vomela Companies", "location": "Santa Fe Springs, CA", "industry": "Printing Services"}, "location": "Santa Fe Springs, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00/yr - $90,000.00/yr", "currency": "USD"}, "jobFunction": "Manufacturing and Management", "industry": "Printing Services", "description": "Build your career with an industry leader! Vomela West located in Santa Fe Springs, CA has an exciting opportunity for a Production Manager to join our team. This position will be responsible for overseeing the daily operations of the production floor from prepress through to shipping. They ensure that production schedules are met, resources are efficiently utilized, and products meet quality standards. The Production Manager also leads the production team, ensuring a safe and productive working environment.", "responsibilities": "• Production Planning and Control: \n\no Coordinate with both internal and external clients to fully understand customer requirements. \n\no Develop and implement production schedules and plans to meet customer demands and meet company targets and shipping schedules. \n\no Monitor production processes and adjust schedules as needed to ensure timely delivery. \n\n• Resource Management: \n\no Manage resources, including labor, materials, and equipment, to optimize production efficiency and throughput. \n\no Maintain equipment maintenance schedules and logs and oversee scheduling of necessary services and repairs to optimize performance and minimize downtime. \n\no Collaborate with project managers, procurement, and inventory teams to ensure the availability of necessary materials and supplies. \n\n• Quality Control: \n\no Monitor, develop, implement, and maintain quality control standards to ensure products meet specifications and meet or exceed customer expectations. \n\no Identify and address production issues that may affect product quality.\n\n• Team Management: \n\no Lead, mentor, and manage a team of production staff, including operators, technicians, warehouse personnel and supervisors. \n\no Conduct training and development programs to enhance team skills and performance.\n\n• Safety and Compliance: \n\no Ensure compliance with health and safety regulations (OSHA) and company policies. \n\no Promote a safe working environment and conduct regular safety audits and trainings.\n\n• Cost Management: \n\no Monitor and manage the production budget, optimizing costs and maximizing efficiency. \n\no Analyze production data and metrics to identify areas for cost savings and process improvements. \n\no Collaborate with finance and management teams to develop and manage budgets.\n\n• Process Improvement: \n\no Identify areas for process improvement and implement initiatives to increase efficiency and reduce waste. \n\no Recommend and assist in the purchasing of production capital equipment. \n\no Stay updated on industry trends and technological advancements to enhance production processes.\n\n• Reporting and Analysis: \n\no Prepare and present regular production reports, including metrics on efficiency, quality, and cost. \n\no Analyze production data to identify trends and make data-driven decisions.", "qualifications": {"required": "Minimum 5-years experience in production management. \n\nMinimum 5-years experience in digital print production with various substrates (e.g., vinyl, paper, fabric, flat stock) \n\nStrong knowledge of print production processes, quality control, and safety standards. \n\nExcellent leadership and team management skills. \n\nStrong analytical and problem-solving abilities. \n\nAbility to work under pressure and manage multiple priorities and projects. \n\nProficiency in relevant software (e.g., Adobe Creative Suite, Microsoft Office Suite, print / production management systems). \n\nExperience with shipping / receiving processes and systems. \n\nEffective communication and interpersonal skills", "preferred": "Bachelor's degree in Graphic Arts, Printing Technology, Business Administration, or a related field (preferred). \n\nExperience with print production RIP software (e.g., Caldera, Fiery, Onyx) (preferred).\n\nExperience in lean manufacturing or Six Sigma methodologies (preferred). \n\nKnowledge of ERP systems and supply chain management (preferred)."}, "skills": ["Production Management", "Digital Print Production", "Quality Control", "Leadership", "Team Management", "Analytical Skills", "Problem Solving", "Software Proficiency", "Shipping and Receiving"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "We offer the ideal candidate an opportunity to grow and evolve their careers while working in a fun, fast paced and dynamic environment. Our international network of companies allows members of our team to build relationships with and provide marketing and printing solutions to some of the largest and most recognized brands in the world. With us, you can make a difference.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000249292"}