{"jobTitle": "Project Coordinator / Project Administrator", "company": {"name": "Donlon Builders", "industry": "Construction", "size": "Not specified", "location": "Orange County, CA"}, "location": "Orange County, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Administrative", "industry": "Construction", "description": "SoCal General Contractor specializing primarily in Industrial Concrete Tilt-up Construction and Tenant Improvements, is seeking an experienced Project Coordinator / Project Admin to join our team. We are looking for a team player to work in a tight-knit environment and be a leader and active contributor.", "responsibilities": "Bidding Process: Set up and maintain new projects in ProCore. Assist with soliciting pricing for new and potential projects. Download, organize, and manage all incoming plans and specifications with acute attention to detail. Ensure all incoming bids and correspondence are accurately saved, filed, and distributed to appropriate team members. Project Coordination: Create all subcontracts, work authorizations, and letters of intent for projects. Prepare prime contract change orders and corresponding subcontractor change orders. Review and maintain all required subcontractor and consultants’ insurance, licenses, and all required approvals are always up to date and accurate. Prepare project meeting agendas and meeting minutes weekly as required. Assist with preparation of all RFI’s and follow up to ensure resolution. Collect and submit all required project submittals and follow up to ensure approval. Assist in the collection and organization of project close-out documents. Create and manage MSDS and safety binders for all projects. Maintain drawing logs. General Coordination: Prepare internal project meeting agendas and minutes twice weekly or as required. Provide all required administrative support for field and office project teams. Handle and direct incoming telephone calls in a professional and timely manner. Maintain strong relationships with subcontractors, consultants, suppliers, and clients by addressing any concerns and ensuring satisfaction.", "qualifications": {"required": "Previous construction office experience is required. Experience with ProCore and proficiency in the full suite of MS Office is preferred. Excellent written and verbal communication skills. Strong attention to detail is critical to this role. Reliability in attendance and punctuality is essential. Be professional, organized, positive, and proactive, and possess strong problem-solving and decision-making abilities. Ability to work under pressure and meet tight deadlines.", "preferred": "A 4-year degree is preferred."}, "skills": ["Project Coordination", "Bidding Process", "ProCore", "MS Office", "Communication", "Attention to Detail", "Problem Solving"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Medical insurance, 401(k)", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4000863956"}