{"jobTitle": "Director, Project Management", "company": {"name": "Los Angeles Tourism & Convention Board", "location": "Los Angeles, CA", "industry": "Hospitality, Travel Arrangements, and Non-profit Organizations"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$100,000.00/yr - $120,000.00/yr", "currency": "USD"}, "jobFunction": "General Business, Project Management, and Strategy/Planning", "industry": "Hospitality, Travel Arrangements, and Non-profit Organizations", "description": "<strong><u>WHO WE ARE</u></strong><p>The mission of the Los Angeles Tourism &amp; Convention Board (Los Angeles Tourism) is to improve the quality of life for all Angelenos through the economic and community benefits of tourism. Representing over 1,000 local tourism-related businesses, Los Angeles Tourism is a non-profit organization responsible for promoting the City of Angels as one of the world’s premier travel destinations. Through its global brand marketing and sales efforts, Los Angeles Tourism works to inspire visitors to immerse themselves in the kinds of unscripted moments and meaningful experiences that can only happen in LA.</p><p><br/></p><p><strong><u>THE OPPORTUNITY</u></strong></p><p>The Director, Project Management will be responsible for driving the organization’s project management function and overseeing the planning, execution, and delivery of major projects. In this highly visible and cross-functional role, you’ll work closely with all business functions and the Executive Team (ET). Reporting to our President &amp; CEO, you’ll focus on driving efficiency and optimizing productivity across the organization. The ideal candidate for this role can adapt quickly to evolving business needs, understand how to balance systemic thinking, and has a natural ability to communicate clearly and effectively.</p><p><br/></p><p><strong><u>WHAT YOU WILL DO</u></strong></p><ul><li>Serve as the organization’s lead project manager for implementation of major cross-functional projects involving multiple business units. This includes assuming primary responsibility for project managing the organization’s annual Business Planning process, including centrally tracking all major deliverables, regularly soliciting feedback from all business functions, and communicating progress against organizational objectives throughout the fiscal year to the Executive Team and Business Planning Committee. (30%)</li><li>As the primary project manager for the annual Business Planning process, collaborate with the Business Planning Committee to establish and evolve an effective framework to maximize the efficiency, timeliness, and cross-functional collaboration associated with developing the organization’s Business Plan. A major focus will be communicating all key deliverables and deadlines, ensuring that the process is completed on schedule and at a high level of quality. While each business function will be responsible for maintaining current information in the organization’s project management system, this role will additionally be charged with following up with the appropriate team members if deadlines/deliverables are not met as committed, acting as a proxy for the President &amp; CEO in this capacity. (20%)</li><li>Collaborate with the President &amp; CEO and Business Intelligence team to develop standardized reporting for overall organizational performance, including dashboards that holistically and clearly illustrate progress against core organizational metrics, and distribute this information on a timely basis to the Executive Team and Business Planning Committee. Assist the President &amp; CEO in the preparation of quarterly Board reporting and associated presentations highlighting organizational performance for the Board and other key external stakeholders. (15%)</li><li>Actively identify ongoing process improvements – including technology-based solutions where appropriate – to increase cross-functional collaboration, improve the efficiency of organizational communications and meetings, and streamline decision-making. (10%)</li><li>Serve as the primary record keeper for all key organizational and cross-functional meetings (e.g. – Executive Team, Business Planning Committee, Business Reviews, and other standing committees as appropriate), representing the President &amp; CEO in meetings or discussions when necessary. This includes capturing detailed, accurate minutes reflecting all agreed action items, deadlines, which team member has been assigned ownership for each deliverable and ensuring that these items are entered and tracked in the organization’s project management system. (10%)</li><li>Serve as a liaison between the President &amp; CEO and other leadership team members, fostering effective communication and collaboration. Act as a key advisor to the President &amp; CEO, providing guidance on organizational priorities, analyzing and synthesizing information to generate insights that inform executive-level decisions, and ensuring the President &amp; CEO is well-informed and prepared for a range of external stakeholder meetings. Lead and coordinate special projects and initiatives on behalf of the President &amp; CEO, ensuring successful and timely completion. Partner with the President &amp; CEO to draft and edit communication materials, including emails, white papers, presentations, and reports. (10%)</li><li>Performs other duties as assigned. (5%)</li></ul><p><br/></p><p><strong><u>SOME OTHER THINGS YOU MAY DO</u></strong></p><ul><li>Become a subject matter expert on the organization’s project management system, identifying opportunities to maximize adoption/usage, optimize platform efficiency, and serve as an internal resource for other team members requiring training/technical assistance.</li></ul><p><br/></p><p><strong><u>WHAT YOU’LL NEED TO SUCCEED</u></strong></p><ul><li>A minimum of 6-8 years of relevant experience required.</li><li>Must possess and maintain a current, valid driver’s license and be able to drive a vehicle for work-related travel as needed and as applicable to the position. Must be willing to partake in a comprehensive background check including a drug test in accordance with applicable laws.</li><li>Candidates must have strong previous experience serving as the primary project manager for complex, cross-functional initiatives in a multi-disciplinary environment – particularly business operations, marketing, and sales.</li><li>Exceptional project management skills including continuous process improvement and expert use of technology solutions – particularly project management platforms.</li><li>Strong problem-solving abilities, including the capacity to quickly assimilate new information, learn and adapt to evolving business circumstances, and troubleshoot issues as necessary.</li><li>Ability to effectively translate detailed data into clear, actionable reporting for business users.</li><li>Proven track record of handling sensitive information with discretion, ensuring the utmost confidentiality and strong ability to demonstrate a high level of integrity and ethical conduct in all interactions.</li><li>Strong interpersonal skills and the ability to work with diverse groups of people.</li><li>Must be proficient in MS Office (Word, Excel, PowerPoint).</li><li>Excellent verbal, written, and interpersonal communication skills.</li><li>Dependable, great attitude, highly motivated and a team player.</li><li>Ability to communicate effectively across various departments and partner with team members with a variety of different work and communications styles.</li></ul><p><br/></p><p><strong><u>COMPENSATION RANGE</u></strong></p><p>Exact compensation may vary based on skills and experience</p><p>$100,000 - $120,000</p><p>Bonus Eligible</p><p><br/></p><p><strong><u>WHAT’S IN IT FOR YOU</u></strong></p><p>At Los Angeles Tourism, we believe your best work happens when you have the tools to stay healthy, enjoy the present moment, save for your future, and look forward to coming into work. That’s why we’re committed to providing a competitive and comprehensive benefits program.</p><p>🚦 Hybrid work environment</p><p>🏠 Remote Monday and Friday</p><p>🏙 DTLA Office Tuesday through Thursday</p><p>🚗Company paid parking in DTLA</p><p>⏰Early Friday’s – our office closes every Friday at 2:30 pm</p><p>Work remotely week of Thanksgiving</p><p>❄ Holiday Office Closure (December 24th – January 1st)</p><p>📆12 Paid Company Holidays</p><p>🏝️Paid Vacation Time</p><p>😷Paid Sick Time</p><p>🎟Paid Floating Holidays</p><p>👶Paid Family Leave</p><p>🩺Comprehensive health insurance (both PPO and HMO plans available)</p><p>👓Dental and vision plans (100% employer paid for some elections)</p><p>⛑Employer-paid life insurance, AD&amp;D, short-term disability, and long-term disability, Aflac</p><p>💌Employee Assistance Program</p><p>💸Flexible Spending Account (Healthcare &amp; Dependent Care)</p><p>📈401(k) Retirement Savings Plan with up to 6% match that vests immediately</p><p>📞Monthly internet and phone stipend</p><p><br/></p><p><em>Los Angeles Tourism &amp; Convention Board reserves the right to modify the benefit plans and employee services at any time, with or without notice</em>.</p><p><br/></p><p><strong><u>PHYSICAL REQUIREMENTS – ESSENTIAL PHYSICAL TASKS</u></strong></p><p><em>The physical demands are representative of those that must be met by a team member to successfully perform the essential functions of the job. Reasonable accommodations may be made to enable individuals with disabilities to perform essential functions.</em></p><p><br/></p><p>While performing the duties of this job, the employee is frequently required to stand, walk, move. The employee must occasionally lift, carry, pull, push, transport and/or move up to <strong>40 </strong>pounds. Ascends and/or descends stairs. Specific vision abilities required by this job include color vision. Requires prolonged sitting, driving, some bending, some twisting neck and body, some stooping and stretching/reaching (up, down, out), requires grasping, feeling, and detecting, requires eye-hand coordination and manual dexterity sufficient to operate a keyboard, mouse, photocopier, fax machine, telephone, calculator, projector, screen for presentations, and other office equipment on a repetitive basis. Requires normal range of hearing, talking, and eyesight to record, prepare and communicate appropriate reports and information.</p><p><br/></p><p><strong>Mandatory Vaccine Requirement:</strong> Los Angeles Tourism continues to prioritize the health and safety of our workforce. Consistent with that commitment, in light of the substantial and growing body of evidence that vaccinations remain the most effective protection against the spread the COVID-19, we require that members of our team be fully vaccinated as a condition of employment. For individuals with medical conditions or sincerely held religious beliefs that prevent vaccination, the Company will consider requests for reasonable accommodation consistent with our policy and applicable law.</p>", "responsibilities": "The Director, Project Management will be responsible for driving the organization’s project management function and overseeing the planning, execution, and delivery of major projects. In this highly visible and cross-functional role, you’ll work closely with all business functions and the Executive Team (ET). Reporting to our President &amp; CEO, you’ll focus on driving efficiency and optimizing productivity across the organization. The ideal candidate for this role can adapt quickly to evolving business needs, understand how to balance systemic thinking, and has a natural ability to communicate clearly and effectively.", "qualifications": {"required": "A minimum of 6-8 years of relevant experience required.\nMust possess and maintain a current, valid driver’s license and be able to drive a vehicle for work-related travel as needed and as applicable to the position. Must be willing to partake in a comprehensive background check including a drug test in accordance with applicable laws.\nCandidates must have strong previous experience serving as the primary project manager for complex, cross-functional initiatives in a multi-disciplinary environment – particularly business operations, marketing, and sales.\nExceptional project management skills including continuous process improvement and expert use of technology solutions – particularly project management platforms.\nStrong problem-solving abilities, including the capacity to quickly assimilate new information, learn and adapt to evolving business circumstances, and troubleshoot issues as necessary.\nAbility to effectively translate detailed data into clear, actionable reporting for business users.\nProven track record of handling sensitive information with discretion, ensuring the utmost confidentiality and strong ability to demonstrate a high level of integrity and ethical conduct in all interactions.\nStrong interpersonal skills and the ability to work with diverse groups of people.\nMust be proficient in MS Office (Word, Excel, PowerPoint).\nExcellent verbal, written, and interpersonal communication skills.\nDependable, great attitude, highly motivated and a team player.\nAbility to communicate effectively across various departments and partner with team members with a variety of different work and communications styles.", "preferred": ""}, "skills": ["Project Management", "Business Operations", "Marketing", "Sales", "Process Improvement", "Technology Solutions", "Problem Solving", "Data Analysis", "Reporting", "Confidentiality", "Interpersonal Skills", "MS Office", "Communication"], "postedDate": "1 week ago", "benefits": "🚦 Hybrid work environment\n🏠 Remote Monday and Friday\n🏙 DTLA Office Tuesday through Thursday\n🚗Company paid parking in DTLA\n⏰Early Friday’s – our office closes every Friday at 2:30 pm\nWork remotely week of Thanksgiving\n❄ Holiday Office Closure (December 24th – January 1st)\n📆12 Paid Company Holidays\n🏝️Paid Vacation Time\n😷Paid Sick Time\n🎟Paid Floating Holidays\n👶Paid Family Leave\n🩺Comprehensive health insurance (both PPO and HMO plans available)\n👓Dental and vision plans (100% employer paid for some elections)\n⛑Employer-paid life insurance, AD&amp;D, short-term disability, and long-term disability, Aflac\n💌Employee Assistance Program\n💸Flexible Spending Account (Healthcare &amp; Dependent Care)\n📈401(k) Retirement Savings Plan with up to 6% match that vests immediately\n📞Monthly internet and phone stipend", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4000510610"}