{"jobTitle": "Director, Product Management - Mobile", "company": {"name": "National Football League (NFL)", "industry": "Spectator Sports", "size": "Not specified", "location": "Inglewood, CA"}, "location": "Inglewood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$170,000.00 - $205,000.00", "currency": "USD"}, "jobFunction": "Product Management and Marketing", "industry": "Spectator Sports", "description": "The NFL Media product development group is looking to fill a director level position in support of our flagship product NFL Mobile, supporting our subscription product NFL+ and our NFL Network mobile app. This role will serve as the primary point of contact for multiple stakeholder groups and be responsible for developing the product development roadmap, strategy and priorities. This role will also be responsible for intake and representing the needs of these stakeholders, pulling in the relevant team members to help shape and respond to the requests in a timely manner.", "responsibilities": "Oversee the end-to-end product management of the NFL Mobile and NFL Network mobile applications, including the development of a comprehensive product strategy that with inputs from stakeholders, Design U/X, Engineering, and Project Management, while setting and maintaining prioritization across the portfolio. Partner with cross-functional leaders (Strategy, Direct-to-Consumer, Marketing, Content, Business Development) in articulating a compelling product strategy, convert the strategy into a well-scoped roadmap, prioritize smartly among competing efforts, and lead the team to execute at a high level. Gain and maintain alignment from the broader organization about our product strategy and roadmap, continuously seek input to ensure the team is working on the most strategic work. Take product concepts from idea through validation, shipping, measurement, and iteration. Work as part of an autonomous agile team along with engineers, designers, U/X, research, data & analytics, and direct-to-consumer colleagues to deliver outstanding product experiences to our fans and customers. Work with your research and experience design partners to understand and socialize the evolving needs of our fans/customers, content team, and partners. Work closely with the Connected TV product team to determine shared and unique use cases across mobile and TV to ensure fans/customer needs are addressed holistically across device experiences. Foster an inclusive environment, where all viewpoints are welcomed and encouraged. Think broadly about the NFL business and contribute to efforts beyond your domain.", "qualifications": {"required": "10+ year’s experience in product management with a proven record of successfully launching products, or platforms. Preferably with experience leading mobile product development efforts. Significant experience working within different agile frameworks/methodologies. Demonstrated leadership working effectively with designers, UX, engineers, research, and colleagues across content and marketing. High attention to detail, with an ability to connect the smallest experience elements to the big picture goals at the company and team level. Excellent written and verbal communication skills, and ability to present technical content to diverse non-technical audiences. Experience working in an organizational structure with both vertical and horizontal teams where ownership of a capability cuts across multiple teams. Ability to partner with different stakeholder groups to ensure that your solutions drive real business impact. Strategic thinking and ability to incorporate larger business context into product development. Strong ability to prioritize, while balancing short-term goals and long-term vision. Experience with managing product managers. Experience working in Media, Direct-to-Consumer, and subscriptions is a plus.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "The NFL maintains a Flexible Workplace Policy that provides members of our workforce with opportunities to periodically work from a location of their choice while maintaining a priority on in-person work at an NFL office, which enables us to more effectively collaborate, connect, and build a workplace culture that will drive our continued success. The NFL is committed to building a diverse, equitable, and inclusive work environment that reflects our incredibly diverse fan base. We provide an environment of mutual respect where equal employment opportunities are available to all employees and applicants without regard to status as protected by applicable federal, state, or local law.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4000109019"}