{"jobTitle": "Merchandising Assistant", "company": {"name": "24 Seven Talent", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$20.00 - $24.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Staffing and Recruiting", "description": "Job title: Merchandising Assistant<br/><br/>Contract type:<br/><br/>Location: Los Angeles<br/><br/>Discipline:<br/><br/>Remote: No<br/><br/>Salary: $20-$24/hr<br/><br/>Reference: 449732<br/><br/>Contact name: Lauren Ferrara<br/><br/><strong>Job Description<br/><br/></strong><strong>Merchandising Assistant<br/><br/>Client Overview:<br/><br/></strong>As a Merchandising Assistant, you’ll work directly with vendors and members of the buying, e-commerce, purchase order execution, marketing and advertising teams to coordinate the order, processing, receiving, shipping, storing and tracking of merchandise samples.<br/><br/>Your organizational and data management skills will be critical in helping keep precise records, maintaining organized sample storage areas, and providing overall support to the Merchandising team in order to help achieve our goal to provide our customers with merchandise they’ll love at great values!<br/><br/><strong>Merchandising Assistant Responsibilities:<br/><br/><br/></strong><ul><li>Provide administrative support to Buying organization as requested. </li><li>Run shipping reports and check all deliveries to ensure timely shipment of goods. </li><li>Prepare purchase orders, complete order entry spreadsheets, and communicate with POE team/vendor for each DMM area. </li><li>Develop full understanding of the process, divisional order tracking, and follow up as necessary with outside vendors for shipment, audit orders and notify Buyers for any adjustment required. </li><li>Coordinate sample management process, i.e., tagging samples upon receipts, storing then, keeping track of samples that are providing to Advertising, request samples as needed, organizing sample room, etc. </li><li>Act as a liaison with the advertising and marketing team to address immediate needs for TV/Print media. <br/><br/><br/></li></ul><strong>Merchandising Assistant Qualifications:<br/><br/><br/></strong><ul><li>Candidates must have a high school diploma </li><li>College degree preferred </li><li>Proficiency in all Microsoft Office programs is required including Excel, Outlook, Word and PowerPoint </li><li>You’ll have to have great interpersonal communication skills as you correspond with fashion industry leaders and well-known brands to arrange the movement of a wide range of goods to and from our corporate offices. <br/><br/><br/></li></ul>Rate: $20-24/hr dependent on experience/background.<br/><br/><strong>Apply today!</strong>", "responsibilities": "Provide administrative support to Buying organization as requested. Run shipping reports and check all deliveries to ensure timely shipment of goods. Prepare purchase orders, complete order entry spreadsheets, and communicate with POE team/vendor for each DMM area. Develop full understanding of the process, divisional order tracking, and follow up as necessary with outside vendors for shipment, audit orders and notify Buyers for any adjustment required. Coordinate sample management process, i.e., tagging samples upon receipts, storing then, keeping track of samples that are providing to Advertising, request samples as needed, organizing sample room, etc. Act as a liaison with the advertising and marketing team to address immediate needs for TV/Print media.", "qualifications": {"required": "Candidates must have a high school diploma Proficiency in all Microsoft Office programs is required including Excel, Outlook, Word and PowerPoint You’ll have to have great interpersonal communication skills as you correspond with fashion industry leaders and well-known brands to arrange the movement of a wide range of goods to and from our corporate offices.", "preferred": "College degree"}, "skills": ["Microsoft Office", "Excel", "Outlook", "Word", "PowerPoint", "Communication"], "postedDate": "15 hours ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000868402"}