{"jobTitle": "Ferrari Sales Executive", "company": {"name": "Ferrari of Newport Beach", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$16.00 / hour + commission", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Automotive", "description": "<strong>FERRARI OF NEWPORT BEACH</strong> is seeking an ambitious <strong>SALES EXECUTIVE</strong> who shares our passion for excellence to be part of our dynamic team!<br/><br/><em>Working with Ferrari means working with one of the World's most powerful brands, engineering excellence and innovation on the highest level.<br/><br/></em><strong>Job Description:<br/><br/></strong>The <strong>Ferrari</strong> <strong>Sales Executive</strong> will ensure full customer satisfaction and seamless sales operations by selling new and used automobiles; understanding and demonstrating characteristics, capabilities, and features; developing and qualifying buyers; closing sales.<br/><br/><strong>Essential Responsibilities:<br/><br/></strong><ul><li>Gather information, highlight features, and demonstrate vehicle operation comparing and contrasting competitive models, inspecting automobiles.</li><li>Develop buyers by maintaining rapport with previous customers, suggesting trade-ins, greeting drop-ins, responding to inquiries, recommending sales campaigns and promotions.</li><li>Qualify buyers by understanding buyer's requirements and interests; matching requirements and interests to various models, building rapport.</li><li>Demonstrate automobiles by explaining characteristics, capabilities, and features, taking test-drives, and explaining warranties and services.</li><li>Close sales by overcoming objections, negotiating price, completing sales or purchase contracts, explaining provisions and offering warranties, services, and financing; delivering automobiles.</li><li>Provide sales management information by completing reports.<br/><br/></li></ul><strong>Skills/Education required to perform the role:<br/><br/></strong><ul><li>High School or equivalent</li><li>Outstanding communication skills</li><li>Professional appearance</li><li>Great attitude with a high-energy personality</li><li>Superior customer service skills</li><li>3-5 years of AUTOMOTIVE high line, luxury sales experience is A MUST</li><li>Knowledge of CDK is preferred</li><li>Excellent customer relations and negotiation skills</li><li>Must exhibit the ability to multi-task in a dynamic, ever changing environment</li><li>Must have a strong work ethic and integrity</li><li>Knowledge of the Ferrari brand preferred</li><li>Bilingual is a plus; English and Spanish, Italian, or Mandarin<br/><br/></li></ul><strong>Pay: $16.00 / hour + commission<br/><br/></strong><ul><li>As part of our hiring process, please take this quick assessment once you apply:<br/><br/></li></ul><strong>https://assessment.predictiveindex.com/bo/98NQ/AutomotiveSales_Aug2024_233839<br/><br/></strong><em>In addition to career-long personal development, our associates enjoy a number of benefits, including:<br/><br/></em><ul><li>Paid Vacation</li><li>We offer Healthcare benefits for our employees: medical, dental, vision, life insurance, STD, LTD, and more</li><li>401k retirement plan<br/><br/></li></ul><em>We believe that a diverse, empowering, and energizing work environment is key to unleashing everyone’s talent. Unrivaled individual and team performance goes hand-in-hand with a quality working life and an emphasis on professional development.<br/><br/></em><em><strong>“If you can dream it, you can do it.” – Enzo Ferrari</strong></em>", "responsibilities": "The <strong>Ferrari</strong> <strong>Sales Executive</strong> will ensure full customer satisfaction and seamless sales operations by selling new and used automobiles; understanding and demonstrating characteristics, capabilities, and features; developing and qualifying buyers; closing sales.", "qualifications": {"required": "High School or equivalent, Outstanding communication skills, Professional appearance, Great attitude with a high-energy personality, Superior customer service skills, 3-5 years of AUTOMOTIVE high line, luxury sales experience is A MUST, Knowledge of CDK is preferred, Excellent customer relations and negotiation skills, Must exhibit the ability to multi-task in a dynamic, ever changing environment, Must have a strong work ethic and integrity, Knowledge of the Ferrari brand preferred, Bilingual is a plus; English and Spanish, Italian, or Mandarin", "preferred": "Knowledge of CDK"}, "skills": ["Communication", "Customer Service", "Sales", "Automotive", "Luxury Sales", "CDK"], "postedDate": "1 week ago", "benefits": "Paid Vacation, We offer Healthcare benefits for our employees: medical, dental, vision, life insurance, STD, LTD, and more, 401k retirement plan", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000998265"}