{"jobTitle": "SAP Supply Chain and Logistics Advisor", "company": {"name": "Accenture", "industry": "Business Consulting and Services", "size": "Large", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$93,400.00/yr - $258,500.00/yr", "currency": "USD"}, "jobFunction": "Strategy/Planning and Consulting", "industry": "Business Consulting and Services", "description": "Do you thrive in a fast-paced environment? Are you a high performer who enjoys creating value for your clients? If so, then we want YOU on our team! As a member of our technology team, you will collaborate with some of the brightest minds as we week to solve our clients’ biggest challenges across Consumer, Life Science, Energy, Industrial & Retail. We are seeking a highly motivated, results -oriented individuals with diverse perspectives to join our team. Every step of the way, you will be guided by dedicated career counselors, mentors, and customized training programs to enable your success at Accenture. In this role, you’ll need the drive, resilience, and adaptability to excel in a competitive, creative, dynamic & people oriented work environment.", "responsibilities": "Deep expertise in at least one area of SAP Supply Chain and able to drive end-to-end discussions. Leverage your expertise in SAP to drive Transformation discussions for clients. Be a trusted advisor and build strong relationships with clients, acting as their guide on their digital transformation journey. Ability to articulate the value of a Digital Transformation. Possess a growth mindset. Constantly learning, refining your skills, and seeking ways to optimize your performance. Understand cross functional touchpoints and be able to proactively connect teams to tackle integration discussions. Travel may be required for this role. The amount of travel will vary from 0 to 100% depending on business need and client requirements.", "qualifications": {"required": "Minimum of 6 years’ experience in SAP Supply Chain and Warehouse Operations & Logistics, specifically Transportation, Inbound/Outbound, Warehouse Ops, and Global Trade (the experience must be mostly SAP project work). Prior Consulting and/or similar Advisory experience: advisory means ability to influence the right process and solution design decisions based on industry leading practices, as well as the ability to anticipate and mitigate project execution risks. Excellent communication skills and a balance between technical and process knowledge in SAP are important elements of the advisory work. Bachelor's degree or equivalent (minimum 12 years' work experience). If Associate’s Degree, must have equivalent minimum 6-year work experience.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4000116491"}