{"jobTitle": "Operations Coordinator", "company": {"name": "Sunbit", "location": "Los Angeles, CA", "industry": "Financial Services and Technology, Information and Media"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "24.00-26.00/hour", "currency": "USD"}, "jobFunction": "Administrative, Training, and General Business", "industry": "Financial Services and Technology, Information and Media", "description": "<strong>JOB TITLE:</strong> Operations Coordinator\n<p><strong>LOCATION:</strong> Los Angeles (In person Monday-Thursday, WFH Friday)</p><p><strong>REPORTS TO: </strong>Operations Manager</p><p><br/></p><p><strong>The Company: </strong></p><p>Sunbit builds financial technology for real life. Our technology eases the stress of paying for life’s expenses by giving people more options on how and when they pay. Founded in 2016, Sunbit offers a next-generation, no-fee credit card that can be managed through a powerful mobile app, as well as a point-of-sale payment option available at more than 20,000 service locations, including 1 in 3 auto dealerships, optical practices, dentist offices, veterinary clinics, and specialty healthcare services. By introducing a flexible way to pay over time, we are proud of our ability to lift up service providers and retailers while helping consumers when necessary expenses arise... regardless of whether they were expected or unexpected. <strong>Sunbit was included on the 2022 and 2023 Inc. 5000 list. The financial technology company has also been named as a Most Loved Workplace®, Best Point of Sale Company, and as a Top Fintech Startup by CB Insights.</strong> We use cutting-edge innovations in financial technology to bring leading data and features that allow individuals to be qualified instantly, making purchases at the point-of-sale fast, fair and easy for consumers from all walks of life. We create value focused on our core values; we work tirelessly to ensure that Sunbit becomes available to everyone, everywhere.</p><p>Sunbit is proud to be recognized on the CB Insights List of Unicorn Companies, with a valuation of $1.1B. (<u>https://www.cbinsights.com/research-unicorn-companies</u>)</p><p><br/></p><p><strong>The Role:</strong></p><p>As we continue to scale, the Operations Coordinator (Auto) is critically important to the high functioning of our organization. The Operations Coordinator will play a key role in coordinating and managing our pre-launch process, post-launch process with our partner, and field team communication. We believe that mentorship and development are a key part of growing professionally in this role. Our team and this role spends Monday through Friday each week working together in-person, in our Las Vegas office.</p><p><br/></p><p><strong>What You'll Own:</strong></p><ul><li>Conduct online pre-launch sessions for onboarding accounts</li><li>Assist the Account Managers in day-to-day coordination and management of business operational activities</li><li>Establish/maintain relationships, and engage in daily communication with accounts to promote product usage and meet growth targets</li><li>Monitor, control and manage business operations to meet expectations and company goals</li><li>Liaise between our accounts and our Account Managers to ensure smooth operational delivery</li><li>Coordinate and manage project tasks to ensure project delivery within allotted timelines</li><li>Critically assess operational problems and resolve them in a quick and timely manner</li><li>Follow standard operating procedures for efficient business operations</li></ul><p><br/></p><p><strong>What You Bring to the Table:</strong></p><ul><li>Preferred 2+ years of work experience</li><li>Energy! You are personable and enthusiastic</li><li>Excellent communication, time management skills, and detail oriented</li><li>Proficient with Microsoft Office (especially Excel/PowerPoint)</li><li>Proven ability to work collaboratively with others</li><li>Experience in onboarding and training a plus</li><li>Sales experience a plus</li></ul><p><br/></p><p><strong>The Perks:</strong></p><ul><li>Join one of LA’s fastest growing startups (2023), A Most Loved Workplace, #576 on the 2023 Inc 5000 list, and Forbes Fintech 50 (2024)</li><li>Mission driven + empowered + collaborative</li><li>Competitive pay and stock options</li><li>Health Insurance options including Medical, Dental, Vision, Life, EAP, FSA, &amp; Maternity Leave</li><li>Newly added HSA and Pet Insurance</li><li>401K Plan with Matching</li><li>Cell Phone Stipend</li><li>Commuter Supplement for LA Office eligible employees</li><li>Casual Dress</li><li>Open door policy / Open office floor plan</li><li>Team based strategic planning + Team owned deliverables</li></ul><p><br/></p><p><strong>How We Pay: </strong></p><ul><li>We believe in paying fairly and equitably based on a number of factors including but not limited to previous experience, relevant work history, interview performance, geographical location, internal equity, and expected level of ownership</li><li>We are targeting $24.00-26.00/hour for this role</li><li>This role will also be granted company equity via stock options</li></ul><p><br/></p><p><strong>Core Values for Success at Sunbit:</strong></p><p>SERVE OTHERS BEFORE SELF</p><ul><li>Take care of the needs of our business stakeholders to support their execution and delivery through data.</li><li>Being collaborative amongst your team.</li></ul><p>GENUINELY CONNECT</p><ul><li>Engage and build strong relationships with key stakeholders, other departments across the organization, and our partners.</li><li>Communicate well and professionally both verbally and in writing</li></ul><p>OWN THE IMPACT</p><ul><li>Strong organizational and time management skills with the ability to prioritize effectively</li></ul><p>ACT FAST</p><ul><li>Thrive in a fast-paced environment while maintaining a high level of support</li></ul><p>INCLUDE ALWAYS</p><ul><li>Demonstrate empathy, understanding, and collaboration with internal team to accomplish team goals and objectives</li></ul><p>INNOVATE FOR GOOD</p><ul><li>Passionate about solving real-world problems through operational excellence</li></ul><p></p>", "responsibilities": "Conduct online pre-launch sessions for onboarding accounts\nAssist the Account Managers in day-to-day coordination and management of business operational activities\nEstablish/maintain relationships, and engage in daily communication with accounts to promote product usage and meet growth targets\nMonitor, control and manage business operations to meet expectations and company goals\nLiaise between our accounts and our Account Managers to ensure smooth operational delivery\nCoordinate and manage project tasks to ensure project delivery within allotted timelines\nCritically assess operational problems and resolve them in a quick and timely manner\nFollow standard operating procedures for efficient business operations", "qualifications": {"preferred": "2+ years of work experience, Experience in onboarding and training a plus, Sales experience a plus", "required": "Energy! You are personable and enthusiastic, Excellent communication, time management skills, and detail oriented, Proficient with Microsoft Office (especially Excel/PowerPoint), Proven ability to work collaboratively with others"}, "skills": ["Microsoft Office", "Excel", "PowerPoint", "Communication", "Time Management", "Onboarding", "Training", "Sales"], "postedDate": "5 days ago", "benefits": "Join one of LA’s fastest growing startups (2023), A Most Loved Workplace, #576 on the 2023 Inc 5000 list, and Forbes Fintech 50 (2024)\nMission driven + empowered + collaborative\nCompetitive pay and stock options\nHealth Insurance options including Medical, Dental, Vision, Life, EAP, FSA, &amp; Maternity Leave\nNewly added HSA and Pet Insurance\n401K Plan with Matching\nCell Phone Stipend\nCommuter Supplement for LA Office eligible employees\nCasual Dress\nOpen door policy / Open office floor plan\nTeam based strategic planning + Team owned deliverables", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000603100"}