{"jobTitle": "Medical Director - 232629", "company": {"name": "Medix™", "industry": "Insurance", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "$300,000.00 - $400,000.00", "currency": "USD"}, "jobFunction": "Health Care Provider, Management, and Strategy/Planning", "industry": "Insurance", "description": "We are seeking an experienced and highly skilled Medical Director to oversee and enhance our Utilization Management (UM) policies and procedures. The ideal candidate will be responsible for ensuring the appropriateness and compliance of medical services, collaborating with healthcare professionals, and driving quality outcomes. This role requires a strong leader with a proven track record in medical management and excellent analytical skills.", "responsibilities": "Develop, implement, and oversee Utilization Management policies and procedures to ensure alignment with state regulations and organizational standards. Provide medical interpretation and decisions regarding the appropriateness of services requested or provided by other healthcare professionals, in compliance with UM policies and state regulations. Review cases promptly, providing clear, concise rationale and documented criteria. Conduct peer-to-peer discussions with ordering physicians, physician assistants, or nurse practitioners to educate them on established guidelines for managed services. Engage in peer-to-peer discussions with Health Plan Medical Directors to address grievances, appeals, and overturns. Work with the UM team to develop and communicate policies related to utilization, quality management, and education to contracted physicians. Actively review utilization patterns, including emergency department charges, specialist consultations, and the use of high-cost medical resources. Collaborate with Medical Directors, hospitalist teams, and case managers to determine medically necessary services and facilitate appropriate care for eligible members. Assist inpatient UM case managers with the review of daily hospital census logs. Support clinical teams in managing high-risk members and evaluating care. Work with the management team to create and maintain programs that incentivize providers to achieve quality outcomes. Participate in joint operating committees with partner health plans and attend UM and QM meetings, serving as a resource for decision-making. Review quality of care issues, provide corrective action plans, and deliver education and counseling through UM committees.", "qualifications": {"required": "M.D. or D.O. degree with a current unrestricted medical license in California. Current California DEA certificate and board certification required. Minimum of 1 year as a Medical Director in a managed care setting preferred, with at least 5 years of clinical experience and 2+ years in medical management, including experience in medical group, health plan settings, and claims review. Strong knowledge of CMS regulations, regulatory requirements, and health plans (HMO, commercial, Medi-Cal). Proven leadership with a collaborative style, excellent oral and written communication skills, strong analytical and decision-making abilities. Proficiency in Microsoft applications (Word, Excel, etc.) and overall computer skills.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4000763883"}