{"jobTitle": "Administrative Assistant ($70k-$90k)", "company": {"name": "J.R. Berry Search Group, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$70,000.00/yr - $90,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Financial Services", "description": "<strong>Administrative Assistant ($70k-$90k)</strong><br/><br/>Premier finance firm in West LA is looking for a driven and organized <strong>Administrative Assistant</strong> to join their team. This position will assist with general office management and will support multiple team members with administrative duties.<br/><br/><strong>Key Responsibilities:</strong><ul><li>Supporting the team with calendaring, expense reports, and travel arrangements</li><li>Assisting with general office support, such as greeting guests and managing incoming/outgoing mail</li><li>Booking conference rooms, preparing documents, and printing and compiling materials for meetings</li><li>Acting as the liaison for vendors and maintenance</li><li>Helping with event planning and coordination</li><li>Providing support on special projects</li></ul><br/><br/>Perks include a competitive base salary in the $70k-$90k range, commensurate with experience, as well as a generous bonus, comprehensive benefits, and hybrid flexibility (2-3 days onsite!).<br/><br/><strong>Candidates will need:</strong><ul><li>1-2 years of administrative experience in a professional setting</li><li>Experience in finance or corporate services highly preferred</li><li>A team player mentality and excellent communication skills</li><li>High level of poise and professionalism</li></ul><br/><br/>This opportunity offers the chance to work in a beautiful office in a collaborative team environment. If you are interested, please submit your resume today!", "responsibilities": "Supporting the team with calendaring, expense reports, and travel arrangements, Assisting with general office support, such as greeting guests and managing incoming/outgoing mail, Booking conference rooms, preparing documents, and printing and compiling materials for meetings, Acting as the liaison for vendors and maintenance, Helping with event planning and coordination, Providing support on special projects", "qualifications": {"required": "1-2 years of administrative experience in a professional setting, Experience in finance or corporate services highly preferred, A team player mentality and excellent communication skills, High level of poise and professionalism"}, "skills": [], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "competitive base salary in the $70k-$90k range, commensurate with experience, as well as a generous bonus, comprehensive benefits, and hybrid flexibility (2-3 days onsite!)", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4000235938"}