{"jobTitle": "Business Analyst, Amazon Transportation Services Planning & Analytics", "company": {"name": "Amazon", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$66,900.00/year - $143,100.00/year", "currency": "USD"}, "jobFunction": "Strategy/Planning, Analyst, and Information Technology", "industry": "Software Development", "description": "Do you want to be part of the team building new analytical frameworks helping Amazon Transportation organizations to optimize supply planning? Do you have effective problem-solving skills to solve ambiguous and large-scale business problems? Then Amazon Transportation Services (ATS) Planning & Analytics team is for you!<br/><br/>ATS Planning & Analytics is looking for a talented Business Analyst who will own analytics and develop solutions to drive insights and optimization for driving performance improvements. As a member of this team, you will have an opportunity to be a thought leader and work with a group of talented program managers, product managers, operations, and business leaders to design the Amazon network of the future. This position requires superior analytical thinking, ability to quickly approach large ambiguous problems and apply analytics, technical and engineering expertise to rapidly analyze, validate, visualize, prototype and deliver solutions. This position also requires significant cross functional activity and integration with transportation, tech, operations and finance. Successful candidates must thrive in a fast paced environment.<br/><br/>Business Analysts are responsible for converting data into actionable business insights. They are analysis experts who leverage a variety of data platforms and analytical tools to provide timely, meaningful, and consumable information. They build deep contextual and domain knowledge. They ensure data quality and build scalable tools. They communicate findings with the most effective and influential methods.<br/><br/>Amazon is seeking an exemplary Business Analyst with broad technical skills to develop data visualizations and build automation solutions that drive business decision making and process improvement. The ideal candidate will draw upon advanced analytical, problem solving skills, and passion for delivering business insights and analytics. The complexity of research and skills for a Senior Business Analyst is well beyond basic data entry and extraction. It involves design and development of automated data pipelines, sophisticated analytical modeling and intuitive data visualization.<br/><br/>Key job responsibilities<br/><br/><ul><li> Develop a deep understanding of Amazon’s Middle Mile operations and supply chain</li><li> Deep dive into large data sets to answer key business questions using SQL, Excel, and other data manipulation languages</li><li> Systematically identify data sources, perform analysis and build data pipelines to influence product roadmaps based on business problems</li><li> Communicate complex insights to stakeholders, both verbally, in writing and through visualization and dashboards</li><li> Perform complex data research to identify opportunities to improve delivery speeds, fill rate, cost to serve and support business decision making</li><li> Monitoring existent metrics, building new metrics, and partnering with internal teams to identify process and system improvement opportunities.</li><li> Perform and own reoccurring and ad-hoc business intelligence projects<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> Bachelor's degree in supply chain management, operations, engineering, analytics or related field</li><li> 3+ years of writing SQL queries and creating business intelligence reports using Tableau, Power BI, QuickSight experience</li><li> Experience defining requirements and using data and metrics to draw business insights</li><li> Experience making business recommendations and influencing stakeholders</li><li> 2+ years of business or financial analysis, product costing, procurement, or a quantitative role experience</li><li> Experience building and maintaining automated forecasting models, utilizing regression or statistical methodologies.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Master's degree/MBA in supply chain management, operations, engineering, analytics or related field</li><li> Fluency in a modeling language such as Python or R<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Pursuant to the Los Angeles Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $66,900/year in our lowest geographic market up to $143,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2702530", "responsibilities": "Develop a deep understanding of Amazon’s Middle Mile operations and supply chain\nDeep dive into large data sets to answer key business questions using SQL, Excel, and other data manipulation languages\nSystematically identify data sources, perform analysis and build data pipelines to influence product roadmaps based on business problems\nCommunicate complex insights to stakeholders, both verbally, in writing and through visualization and dashboards\nPerform complex data research to identify opportunities to improve delivery speeds, fill rate, cost to serve and support business decision making\nMonitoring existent metrics, building new metrics, and partnering with internal teams to identify process and system improvement opportunities.\nPerform and own reoccurring and ad-hoc business intelligence projects", "qualifications": {"required": "Bachelor's degree in supply chain management, operations, engineering, analytics or related field\n3+ years of writing SQL queries and creating business intelligence reports using Tableau, Power BI, QuickSight experience\nExperience defining requirements and using data and metrics to draw business insights\nExperience making business recommendations and influencing stakeholders\n2+ years of business or financial analysis, product costing, procurement, or a quantitative role experience\nExperience building and maintaining automated forecasting models, utilizing regression or statistical methodologies.", "preferred": "Master's degree/MBA in supply chain management, operations, engineering, analytics or related field\nFluency in a modeling language such as Python or R"}, "skills": ["SQL", "Tableau", "Power BI", "QuickSight", "Python", "R"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000326401"}