{"jobTitle": "Department Administrative Assistant (Contract)", "company": {"name": "Sony Interactive Entertainment", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "78,100.00/yr - 117,100.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Software Development, Consumer Services, and Entertainment Providers", "description": "Why PlayStation?<br/><br/>PlayStation isn’t just the Best Place to Play — it’s also the Best Place to Work. Today, we’re recognized as a global leader in entertainment producing The PlayStation family of products and services including PlayStation®5, PlayStation®4, PlayStation®VR, PlayStation®Plus, acclaimed PlayStation software titles from PlayStation Studios, and more.<br/><br/>PlayStation also strives to create an inclusive environment that empowers employees and embraces diversity. We welcome and encourage everyone who has a passion and curiosity for innovation, technology, and play to explore our open positions and join our growing global team.<br/><br/>The PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Corporation.<br/><br/><strong>Department Administrative Assistant (Contract)<br/><br/></strong>Los Angeles, CA<br/><br/>Sony Interactive Entertainment (SIE) seeks a qualified candidate for the contract position of Department Administrative Assistant in the Los Angeles area - and will need to go into the office as needed. The candidate will support Senior Directors and their staff in providing high-level administrative assistance as well as handling the coordination for on-site workshops and social events.<br/><br/><strong>Responsibilities:<br/><br/></strong>Provide administrative support to Senior Directors and their staff. Support will include scheduling meetings, expense reporting, travel arrangements as needed. Complete expense reports for the senior management team appropriately on a timely basis, including reconciliation of corporate credit statements. Making travel arrangements and detailed travel itineraries as needed. Help with on-boarding of new employees and contractors. Coordinate on-site events for Department needs (working with IT, Facilities, Catering Requests, and approval requests). Support will also include scheduling department meeting invitations, reserve conference rooms for both in-person and remote meetings. Handle correspondence from senior management to other managers, or other admins. Maintaining the current filing and database system and looking for ways to improve or streamline current systems. Works with other administrative staff and supports other colleagues as needed. Arrange daily lunches through a 2nd party vendor for on-site employees and managing access for on-site visitors. Candidate will also support any department requests such as order supplies, approval requests, and other requests.<br/><br/><strong>Skills and Qualifications:<br/><br/></strong><ul><li>Excellent written and verbal communication.</li><li>Good time-management skills, organization skills, and able to prioritize multiple requests.</li><li>Ability to pay attention to detail and take notes as needed.</li><li>Interpersonal skills.</li><li>Ability to work independently and as part of a team.</li><li>Ability to meet needs in a timely manner in a fast-paced, constantly evolving environment.</li><li>A proactive approach to problem-solving with strong decision-making skills.</li><li>Basic understanding of frequently used computer software and programs, such as Microsoft Office.</li><li>Professional discretion.</li><li>Ability to use creative thinking in coordinating fun social events, exploring new food options, activities, and keeping within the budget.</li><li>High school diploma or equivalent experience required; Associate’s or Bachelor’s degree preferred.<br/><br/></li></ul><strong>Preferred Qualifications:<br/><br/></strong><ul><li>2+ years experience in an administrative assistant or department assistant role.<br/><br/></li></ul><strong><em>Please refer to our Candidate Privacy Notice for more information about how we process your personal information, and your data protection rights.<br/><br/></em></strong>At SIE, we consider several factors when setting each role’s base pay range, including the competitive benchmarking data for the market and geographic location.<br/><br/>Please note that the base pay range may vary in line with our hybrid working policy and individual base pay will be determined based on job-related factors which may include knowledge, skills, experience, and location.<br/><br/>In addition, this role is eligible for SIE’s top-tier benefits package that includes medical, dental, vision, matching 401(k), paid time off, wellness program and coveted employee discounts for Sony products. This role also may be eligible for a bonus package. Click <strong>here</strong> to learn more.<br/><br/>The estimated base pay range for this role is listed below.<br/><br/>$78,100—$117,100 USD<br/><br/><strong>Equal Opportunity Statement:<br/><br/></strong>Sony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to gender (including gender identity, gender expression and gender reassignment), race (including colour, nationality, ethnic or national origin), religion or belief, marital or civil partnership status, disability, age, sexual orientation, pregnancy or maternity, trade union membership or membership in any other legally protected category.<br/><br/>We strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond.<br/><br/><em>PlayStation is a Fair Chance employer and qualified applicants with arrest and conviction records will be considered for employment.<br/><br/></em>", "responsibilities": "Provide administrative support to Senior Directors and their staff. Support will include scheduling meetings, expense reporting, travel arrangements as needed. Complete expense reports for the senior management team appropriately on a timely basis, including reconciliation of corporate credit statements. Making travel arrangements and detailed travel itineraries as needed. Help with on-boarding of new employees and contractors. Coordinate on-site events for Department needs (working with IT, Facilities, Catering Requests, and approval requests). Support will also include scheduling department meeting invitations, reserve conference rooms for both in-person and remote meetings. Handle correspondence from senior management to other managers, or other admins. Maintaining the current filing and database system and looking for ways to improve or streamline current systems. Works with other administrative staff and supports other colleagues as needed. Arrange daily lunches through a 2nd party vendor for on-site employees and managing access for on-site visitors. Candidate will also support any department requests such as order supplies, approval requests, and other requests.", "qualifications": {"required": "Excellent written and verbal communication. Good time-management skills, organization skills, and able to prioritize multiple requests. Ability to pay attention to detail and take notes as needed. Interpersonal skills. Ability to work independently and as part of a team. Ability to meet needs in a timely manner in a fast-paced, constantly evolving environment. A proactive approach to problem-solving with strong decision-making skills. Basic understanding of frequently used computer software and programs, such as Microsoft Office. Professional discretion. Ability to use creative thinking in coordinating fun social events, exploring new food options, activities, and keeping within the budget. High school diploma or equivalent experience required; Associate’s or Bachelor’s degree preferred.", "preferred": "2+ years experience in an administrative assistant or department assistant role."}, "skills": ["Communication", "Time Management", "Organization", "Problem Solving", "Microsoft Office"], "postedDate": "1 week ago", "benefits": "SIE’s top-tier benefits package that includes medical, dental, vision, matching 401(k), paid time off, wellness program and coveted employee discounts for Sony products. This role also may be eligible for a bonus package.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000126957"}