{"jobTitle": "Personal Assistant to Music Professional", "company": {"name": "Pocketbook Agency", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$55,000 - $65,000", "currency": "USD"}, "jobFunction": "Customer Service and Administrative", "industry": "Entertainment Providers", "description": "JRN: #1618\n\nWe are seeking a proactive and engaging Personal Assistant to support a prominent creative artist in the music industry and their household in Los Angeles, CA (Hollywood). This part-time role requires organization, communication skills, and versatility in managing various tasks, including household management, scheduling, studio assistance, pet care, and collaborating with guests and studio visitors. If you possess a proactive mindset and excel in anticipating household needs efficiently, we want to hear from you!\n\n**Requirements**:\n\n* Minimum of 2-3 years of personal assistant experience.\n* Proficiency in household management and light cooking.\n* Strong communication skills for effective collaboration with business managers, external partners, guests, and studio visitors.\n* Comfortable with pet care responsibilities.\n* Knowledgeable about travel destinations and excursions.\n* Familiarity with studio support tasks is a plus.\n* Ability to manage calendaring, scheduling appointments, and coordinating with internal staff and external contacts.\n\n**Responsibilities**:\n\n* Provide primary support to the creative artist and secondary support to other household members.\n* Maintain household inventory and restock supplies as required.\n* Assist with studio support tasks as needed.\n* Manage pet care responsibilities.\n* Coordinate travel arrangements and anticipate vacation preferences for the household.\n* Handle calendaring, scheduling appointments, and staying updated with weekly schedules and goals.\n* Collaborate with internal staff members and communicate with the business manager when necessary.\n* Establish rapport with household members, guests, and studio visitors, understanding their preferences and tastes.\n\n**Schedule**: Monday - Friday with occasional weekend availability as needed\n\n**Compensation**: $55,000 - $65,000 annually, no benefits\n\n**Location**: Los Angeles, CA (Fully In-Person)", "responsibilities": "Provide primary support to the creative artist and secondary support to other household members. Maintain household inventory and restock supplies as required. Assist with studio support tasks as needed. Manage pet care responsibilities. Coordinate travel arrangements and anticipate vacation preferences for the household. Handle calendaring, scheduling appointments, and staying updated with weekly schedules and goals. Collaborate with internal staff members and communicate with the business manager when necessary. Establish rapport with household members, guests, and studio visitors, understanding their preferences and tastes.", "qualifications": {"required": "Minimum of 2-3 years of personal assistant experience. Proficiency in household management and light cooking. Strong communication skills for effective collaboration with business managers, external partners, guests, and studio visitors. Comfortable with pet care responsibilities. Knowledgeable about travel destinations and excursions. Familiarity with studio support tasks is a plus. Ability to manage calendaring, scheduling appointments, and coordinating with internal staff and external contacts."}, "skills": [], "postedDate": "5 days ago", "applicationDeadline": "", "benefits": "no benefits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000296121"}