{"jobTitle": "Senior Print Production Manager", "company": {"name": "aKUBE", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Broadcast Media Production and Distribution, Technology, Information and Media, and Entertainment Providers", "description": "<strong>City: </strong>LA\n<p><strong>Onsite/ Hybrid/ Remote: </strong>Hybrid, once a week</p><p><strong>Duration: </strong>6 months extendable</p><p><strong>Rate Range: </strong>$96/hr on<strong> W2</strong> depending on experience (no C2C or 1099 or sub-contract)</p><p><strong>Work Authorization: </strong>GC, USC, All valid EADs except H1b</p><p><br/></p><p><strong>Top Skills:</strong></p><p><br/></p><p>1)Experience with workflow automation and optimization</p><p>2) Experience designing production work flows within digital marketing field or entertainment field</p><p>3)Airtable or project management technology</p><p>Experience helping teams design, train and provide support troubleshooting</p><p>Wants someone with experience using AI to support workflow analysis and automation</p><p><br/></p><p><br/></p><p><strong>Description:</strong></p><p><br/></p><ul><li>Manages print production of a variety of projects.</li><li>Duties include project planning, workflow management, vendor negotiations, print buying, cost control, quality control, logistical coordination and press checks.</li><li>Often supervises traffic coordinators and print buyers; may manage small design studio.</li><li>Requires expertise in both analog and digital print technologies, familiarity with design software applications and project management experience.</li><li>3-5 years experience.</li></ul><p><br/></p><p><strong>Basic Qualifications:</strong></p><ul><li>Bachelor’s degree in Marketing, Design, Computer Science, or a related field, or equivalent experience.</li><li>Minimum of 3-5 years of experience in a similar role, preferably within a marketing or creative environment. Experience in the creative or entertainment fields is highly desirable.</li><li>Proficiency in production management tools and systems, such as Adobe Creative Suite, project management software (Airtable, Workfront, Jira), and asset management systems.</li><li>Familiarity with the changing landscape of AI tools and technology is a plus.</li><li>Strong project management skills with a proven ability to meet deadlines and manage multiple projects simultaneously.</li><li>Excellent problem-solving skills with the ability to troubleshoot and resolve technical issues related to production systems.</li><li>Strong communication skills with the ability to collaborate effectively with creative, marketing, and technical teams.</li><li>The ability to take initiative and work independently to deliver high-quality results.</li></ul><p></p>", "responsibilities": "Manages print production of a variety of projects. Duties include project planning, workflow management, vendor negotiations, print buying, cost control, quality control, logistical coordination and press checks. Often supervises traffic coordinators and print buyers; may manage small design studio. Requires expertise in both analog and digital print technologies, familiarity with design software applications and project management experience. 3-5 years experience.", "qualifications": {"required": "Bachelor’s degree in Marketing, Design, Computer Science, or a related field, or equivalent experience. Minimum of 3-5 years of experience in a similar role, preferably within a marketing or creative environment. Experience in the creative or entertainment fields is highly desirable. Proficiency in production management tools and systems, such as Adobe Creative Suite, project management software (Airtable, Workfront, Jira), and asset management systems. Familiarity with the changing landscape of AI tools and technology is a plus. Strong project management skills with a proven ability to meet deadlines and manage multiple projects simultaneously. Excellent problem-solving skills with the ability to troubleshoot and resolve technical issues related to production systems. Strong communication skills with the ability to collaborate effectively with creative, marketing, and technical teams. The ability to take initiative and work independently to deliver high-quality results.", "preferred": ""}, "skills": ["Workflow Automation", "Project Management", "Airtable", "Adobe Creative Suite", "AI"], "postedDate": "1 week ago", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/4000243964"}