{"jobTitle": "Restaurant Shift Supervisor", "company": {"name": "Shake Shack", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "24.00/hr - 26.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Hospitality", "description": "Stand For Something Good With Us!<br/><br/>We make each day great - together. We create an exciting work atmosphere with a culture focused on our team, guests, and community. Our team members enjoy a positive work environment that is deeply committed to the philosophy that we \"Stand for Something Good.\"<br/><br/><strong>Shift Manager (Restaurant Supervisor)<br/><br/></strong>Shake Shack is a modern day \"roadside\" burger stand serving deliciously classic burgers, fries, hot dogs, frozen custard, beer, wine, and more. With our fresh, simple, high-quality food at a great value, Shake Shack is a fun and lively community-gathering place unlike any other. As we experience tremendous growth, our leaders are the driving force to our continued success. We are seeking a positive and enthusiastic <strong>Shift Manager</strong> who loves to serve!<br/><br/>This is an excellent opportunity for a leader with at least 1 year of restaurant leadership experience supervising a team… and someone interested in what we call - <strong>the <em>Shacksperience</em></strong>: a clearly defined path to success for every employee who joins our company. From Team Member through various levels of Management, we believe that building confidence through knowledge and experience is the first step to your success. We provide an environment that encourages learning and growth, and we reward individuals who meet and exceed our standards of success. We are committed to taking care of our entire team through the opportunities it creates.<br/><br/><strong>What’s In It For YOU<br/><br/></strong><ul><li>Career opportunities – we are growing!</li><li>Up to 40-hour work week + quarterly performance bonuses</li><li>8-week hands on training program</li><li>Medical, dental and vision insurance</li><li>401K plan with company match</li><li>Paid time off (3 weeks to start)</li><li>Charitable opportunities to give back<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>At least 1 year of restaurant leadership experience supervising a team</li><li>Food Safety Certification according to local jurisdiction</li><li>Strong problem solving skills </li><li>Effective communication skills, both written and verbal <br/><br/></li></ul><strong>Responsibilities<br/><br/></strong><ul><li>Lead the day-to-day operational excellence of the Shack.</li><li>Manage the flow of service to ensure the highest levels of safety, cleanliness, quality, and speed.</li><li>Help build and lead high performance team of hourly Team Members.</li><li>Complete operational support functions (i.e. Purchasing, Receiving, Inventory, etc.)</li><li>Ensure compliance with wage and hour, EEO, Department of Health, etc.<br/><br/></li></ul>Starting Hourly Rate - $24.00 - $26.00<br/><br/><strong>About Us<br/><br/></strong>Beginning as a hot dog cart in New York City’s Madison Square Park, Shake Shack was created by Danny Meyer, Founder and CEO of Union Square Hospitality Group and best-selling author of <em>Setting the Table</em>. Shack Fans lined up daily, making the cart a resounding success, and donating all proceeds back to the park beautification efforts. A permanent stand was eventually built…and the rest is Shack history! With our roots in fine dining and giving back to the community, we are committed to high quality food served with a high level of hospitality. Our team members enjoy a positive work environment that is deeply committed to the philosophy that we \"Stand for Something Good.\"<br/><br/>We are expanding across the U.S. and around the world! Join our #ShackFam<br/><br/><strong>Shake Shack is an Equal Opportunity Employer <br/><br/></strong>All qualified applicants will receive consideration for employment without regard to race, color, ancestry, national origin, religion, creed, age (over 40), disability (mental and physical), sex, gender identity, sexual orientation, gender expression, medical condition, genetic information, marital, military and veteran status.<br/><br/>Our company will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable laws.<br/><br/>The date posted below is the deadline for applications being accepted for this position (but is subject to an extension)<br/><br/>Aug/29/2024", "responsibilities": "<ul><li>Lead the day-to-day operational excellence of the Shack.</li><li>Manage the flow of service to ensure the highest levels of safety, cleanliness, quality, and speed.</li><li>Help build and lead high performance team of hourly Team Members.</li><li>Complete operational support functions (i.e. Purchasing, Receiving, Inventory, etc.)</li><li>Ensure compliance with wage and hour, EEO, Department of Health, etc.<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>At least 1 year of restaurant leadership experience supervising a team</li><li>Food Safety Certification according to local jurisdiction</li><li>Strong problem solving skills </li><li>Effective communication skills, both written and verbal <br/><br/></li></ul>", "preferred": ""}, "skills": ["Food Safety", "Problem Solving", "Communication"], "postedDate": "1 week ago", "benefits": "<ul><li>Career opportunities – we are growing!</li><li>Up to 40-hour work week + quarterly performance bonuses</li><li>8-week hands on training program</li><li>Medical, dental and vision insurance</li><li>401K plan with company match</li><li>Paid time off (3 weeks to start)</li><li>Charitable opportunities to give back<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000740014"}