{"jobTitle": "VICE PRESIDENT OF HUMAN RESOURCES", "company": {"name": "Gateways Hospital and Mental Health Center", "industry": "Hospitals and Health Care", "size": "Not specified", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Not specified", "employmentType": "Other", "experienceLevel": "Executive", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Human Resources", "industry": "Hospitals and Health Care", "description": "The Vice President of Human Resources (VP of HR) is a strategic and experienced leader responsible for overseeing all aspects of the organization's human resources functions. This includes recruitment and retention, compensation and benefits administration, labor/employee relations, compliance with employment laws, staff development, and policy and procedure development. The VP of HR plays a key role in the executive team, driving the alignment of HR strategies with the overall mission of the organization to support a positive workplace culture and enhance organizational performance.", "responsibilities": "Provide leadership and direction for the Human Resources department, ensuring alignment with organizational goals. Oversee recruitment, onboarding, and retention efforts to maintain a talented and engaged workforce. Administer compensation, benefits, and performance management systems to ensure equity and compliance. Manage labor and employee relations, ensuring compliance with state and federal employment laws. Develop and implement HR policies and procedures that promote a healthy work environment. Lead staff development initiatives, including training programs and succession planning. Maintain and analyze HR metrics to guide decision-making and improve HR practices. Collaborate with other executive team members to drive organizational change and culture initiatives. Ensure compliance with all legal and regulatory requirements related to HR.", "qualifications": {"required": "A minimum of 5 years of progressive experience in Human Resources leadership, with at least 3 years in a senior HR role. Extensive experience managing HR operations in both union and non-union environments. Demonstrated success in leading HR initiatives in a healthcare or nonprofit setting is preferred.", "preferred": "A Master's degree in Human Resources, Business Administration, or a related field is strongly preferred. Alternatively, a combination of education and experience that provides the required knowledge and skills may be considered. HR certification (e.g., SPHR, SHRM-SCP) is preferred."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4000228428"}