{"jobTitle": "Production Supervisor", "company": {"name": "All Star Auto Parts", "location": "Riverside, CA"}, "location": "Riverside, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Motor Vehicle Manufacturing", "description": "<strong>Production Supervisor – Full Time <strong>– 2nd Shift <strong>– </strong>4:30PM <strong>– 1AM</strong> <br/><br/></strong></strong>We are a dynamic organization in the Collision and Auto Repair Markets, operating a remanufacturing facility for automotive lights. We are seeking a highly motivated and skilled Production Supervisor to lead a team of 8-12 employees. The successful candidate will play a crucial role in optimizing material movement, ensuring safety, driving quality, and implementing operational standards to meet and exceed our customer's delivery expectations.<br/><br/><strong>What You’ll Be Doing<br/><br/></strong><ul><li>Lead daily operations to include inventory, material movement, quality, and shipping.</li><li>Auditing teams to ensure we are adhering to process and diminishing returns.</li><li>Comply with safety standards and requirements to ensure a safe and hazard-free environment.</li><li>Meeting and enforcing quality control, inventory accuracy, and daily production standards.</li><li>Ensure timely order commitment to meet customer delivery expectations.</li><li>Assist in developing OJT training programs.</li><li>Assisting Ops Manager/GM as needed.</li><li>Responsible for sending daily shift reports to site management.</li><li>Responsible for ensuring employees are cross-trained and a job rotation is consistently in place.</li><li>Confirm employee adherence to production tracking protocols and goals.</li><li>Involvement in the hiring process for the site.</li><li>Maintain quality standards by performing weekly meetings with team members.</li><li>Mentor, coach, train, and assist team members in production.</li><li>Manage ordering and organize raw materials for the production department.<br/><br/></li></ul><strong>Skills And Experience<br/><br/></strong><ul><li>2+ years of leadership experience preferred, in operations supervising a team of 20+ employees.</li><li>Highschool Diploma or GED required.</li><li>Bachelor’s Degree or equivalent working experience in a manufacturing, production and warehouse environment preferred.</li><li>Experience in inventory, distribution, shipping, or materials strongly preferred.</li><li>Build and maintain strong, positive partnerships to drive stronger business results and resolve quality control issues.<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li>Must be able to stand/walk for up to 8-10 hours.</li><li>Lift and move totes weighing up to 50 pounds.</li><li>Regular bending, lifting, stretching, and reaching, both below the waist and above the head.</li><li>Should be able to work in environments with variable noise levels, lighting conditions, and temperature variation and able to access all areas of the building without limitations.<br/><br/></li></ul><strong>Pay And Benefits<br/><br/></strong><ul><li>Competitive pay</li><li>Medical, Dental, and Vision Insurance</li><li>Paid Time Off </li><li>Paid Company Holidays</li><li>401K<br/><br/></li></ul><strong>Who We Are<br/><br/></strong>All Star is an industry leading auto parts supplier to the collision repair, wheel and tire repair centers, and automotive eCommerce industries. Founded in 2005 and headquartered in Orlando, Florida, All Star is a high growth company with a core competency in the remanufacturing of auto lights and wheels and a leading supplier of aftermarket products. The Company has grown 300%+ over the past three years and expects to continue at or above this pace through both organic and acquisitive growth. As All Star looks to the future, we are committed to adding highly motivated, passionate, and reliable team members to our company. We have five core values that are ingrained in everything we do as a company. <strong>We are Dependable, Knowledgeable, Proactive Communicators, Problem Solvers, and We Deeply Care</strong>. We are a fun and growing company of almost 500 employees, that celebrates our employees each year with an Employee Appreciation Week. We have an employee engagement committee made of employees throughout the company that sponsors fun activities each month. We hold wellness challenges, and recently completed our first Annual Corporate 5K. Come check out our growing company!<br/><br/>Check out our company website at https://allstarautoparts.com/<br/><br/><strong>Please Note<br/><br/></strong>All Star Auto Parts is an equal employment opportunity employer and participates in E-Verify. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of gender, race/ethnicity, gender identity, sexual orientation, protected veteran status, disability, or other protected group status.", "responsibilities": "<ul><li>Lead daily operations to include inventory, material movement, quality, and shipping.</li><li>Auditing teams to ensure we are adhering to process and diminishing returns.</li><li>Comply with safety standards and requirements to ensure a safe and hazard-free environment.</li><li>Meeting and enforcing quality control, inventory accuracy, and daily production standards.</li><li>Ensure timely order commitment to meet customer delivery expectations.</li><li>Assist in developing OJT training programs.</li><li>Assisting Ops Manager/GM as needed.</li><li>Responsible for sending daily shift reports to site management.</li><li>Responsible for ensuring employees are cross-trained and a job rotation is consistently in place.</li><li>Confirm employee adherence to production tracking protocols and goals.</li><li>Involvement in the hiring process for the site.</li><li>Maintain quality standards by performing weekly meetings with team members.</li><li>Mentor, coach, train, and assist team members in production.</li><li>Manage ordering and organize raw materials for the production department.<br/><br/></li></ul>", "qualifications": {"required": "Highschool Diploma or GED required.", "preferred": "2+ years of leadership experience preferred, in operations supervising a team of 20+ employees.\nBachelor’s Degree or equivalent working experience in a manufacturing, production and warehouse environment preferred.\nExperience in inventory, distribution, shipping, or materials strongly preferred."}, "skills": ["Leadership", "Inventory", "Distribution", "Shipping", "Materials", "Quality Control", "Safety", "Training", "Production", "Operations"], "postedDate": "1 week ago", "benefits": "<ul><li>Competitive pay</li><li>Medical, Dental, and Vision Insurance</li><li>Paid Time Off </li><li>Paid Company Holidays</li><li>401K<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000554968"}