{"jobTitle": "Warehouse Supervisor (Mandarin)", "company": {"name": "IntelliPro", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$60k - $75k", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "<strong>Job Title - Inventory Supervisor<br/><br/>Location - Los Angeles, CA<br/><br/>Full time<br/><br/>Salary - $60k - $75k + benefits<br/><br/>Bilingual - Fluent in English and Mandarin - \"Proficiency in Mandarin is preferred as the successful candidate will be required to communicate with business partners in China.\"<br/><br/>Job description:<br/><br/>Key Skills : Last Mile Management , Inventory , warehouse Management <br/><br/></strong><strong>Responsibilities<br/><br/></strong><ul><li>Main job: Last mile sorting management is to control the sorting cycle time to meet all the cut-off time.</li><li>Set up and ultimate the dispatching routes for the final delivery;</li><li>Manage the attendance plan for the sorting;</li><li>Deal with the daily issues of the sorting;<br/><br/></li></ul>About Us:<br/><br/>Founded in 2009, IntelliPro stands as a global leader in talent acquisition and HR solutions. Our commitment to delivering unparalleled service to clients, fostering employee growth, and building enduring partnerships sets us apart. With a dynamic presence in the USA, China, Canada, Singapore, Philippines, UK, India, Netherlands, and Germany, we continue to lead the way in global talent solutions.<br/><br/>IntelliPro, a global leader in connecting individuals with rewarding employment opportunities, is dedicated to understanding your career aspirations. As an Equal Opportunity Employer, IntelliPro values diversity and does not discriminate based on race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, disability, or any other legally protected group status. Moreover, our Inclusivity Commitment emphasizes embracing candidates of all abilities and ensures that our hiring and interview processes accommodate the needs of all applicants. Learn more about our commitment to diversity and inclusivity at https://intelliprogroup.com/.<br/><br/>Compensation: The pay offered to a successful candidate will be determined by various factors, including education, work experience, location, job responsibilities, certifications, and more. Additionally, IntelliPro provides a comprehensive benefits package, all subject to elig", "responsibilities": "Main job: Last mile sorting management is to control the sorting cycle time to meet all the cut-off time.\nSet up and ultimate the dispatching routes for the final delivery;\nManage the attendance plan for the sorting;\nDeal with the daily issues of the sorting;", "skills": ["Last Mile Management", "Inventory", "warehouse Management"], "postedDate": "1 week ago", "benefits": "IntelliPro provides a comprehensive benefits package", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000104044"}