{"jobTitle": "Strategy and Operations Manager, Organizational Effectiveness and Culture", "company": {"name": "Google", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$114,000-$167,000", "currency": "USD"}, "jobFunction": "Sales, General Business, and Customer Service", "industry": "Information Services and Technology, Information and Internet", "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <strong>San Francisco, CA, USA; Mountain View, CA, USA; New York, NY, USA</strong>.<strong>Minimum qualifications:<br/><br/></strong><ul><li>Bachelor's degree or equivalent practical experience.</li><li>4 years of experience in organizational transformation or design, leading strategy and operational initiatives.</li><li>2 years of experience working with executive stakeholders.<br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>MBA or Master's degree, or equivalent practical experience.</li><li>5 years of work experience in Finance, Sales Operations, Management Consulting or Investment Banking.</li><li>Experience in Business operations and strategy.</li><li>Ability to structure a compelling story line and build presentation decks and briefing documents that support the narrative.</li><li>Executive-level written or verbal communication skills.<br/><br/></li></ul><strong>About the job</strong>The US base salary range for this full-time position is $114,000-$167,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Partner with senior Revenue Strategy and Operations(RSO) leadership to identify strategic priorities and opportunities for the team by leveraging both qualitative and quantitative employee engagement data.</li><li>Design and implement initiatives aimed at improving organizational effectiveness and building the right culture for RSO.</li><li>Set the strategy for, and own the execution of, all people priorities.</li><li>Manage the RSO People Plan project, partnering with senior leadership.</li><li>Run the RSO Onboarding program for new hires, while introducing improvements to curriculum and process.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "Partner with senior Revenue Strategy and Operations(RSO) leadership to identify strategic priorities and opportunities for the team by leveraging both qualitative and quantitative employee engagement data. Design and implement initiatives aimed at improving organizational effectiveness and building the right culture for RSO. Set the strategy for, and own the execution of, all people priorities. Manage the RSO People Plan project, partnering with senior leadership. Run the RSO Onboarding program for new hires, while introducing improvements to curriculum and process.", "qualifications": {"required": "Bachelor's degree or equivalent practical experience. 4 years of experience in organizational transformation or design, leading strategy and operational initiatives. 2 years of experience working with executive stakeholders.", "preferred": "MBA or Master's degree, or equivalent practical experience. 5 years of work experience in Finance, Sales Operations, Management Consulting or Investment Banking. Experience in Business operations and strategy. Ability to structure a compelling story line and build presentation decks and briefing documents that support the narrative. Executive-level written or verbal communication skills."}, "skills": [], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "bonus + equity + benefits", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4000216618"}