{"jobTitle": "Logistics Supervisor", "company": {"name": "Accurate Personnel LLC", "location": "Fontana, CA"}, "location": "Fontana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Supply Chain", "industry": ["Transportation, Logistics, Supply Chain and Storage", "Food and Beverage Services"], "description": "We have an exciting, and urgent opportunity with one of our largest clients across the US as they are on the market for Logistic Supervisors!  \n\n<strong>Location:</strong> Fontana, California\n<strong>Industry: </strong>Food Industry<strong> </strong>\n\n<strong>Overview:</strong>\nThe Logistics Supervisor will be responsible for overseeing and optimizing the day-to-day operations of the logistics department within our client’s food distribution center. This role ensures that all logistical processes run efficiently, meeting company standards for quality, safety, and customer satisfaction. The Logistics Supervisor will lead a team, coordinate with various departments, and play a crucial role in maintaining the smooth flow of goods from the warehouse to the end customer. Please see below for further details. \n\n<strong>Key Responsibilities:</strong>\n\n<strong>Team Leadership:</strong>\n<ul><li>Supervise, train, and mentor a team of warehouse staff, drivers, and logistics coordinators.</li><li>Schedule shifts and manage team performance to ensure efficient operations.</li><li>Conduct regular meetings to communicate goals, updates, and feedback.</li></ul>\n<strong>Logistics Operations:</strong>\n<ul><li>Oversee the receiving, storage, and distribution of food products in compliance with food safety regulations.</li><li>Manage inventory levels, ensuring optimal stock levels are maintained.</li><li>Coordinate transportation and delivery schedules to meet customer demands.</li><li>Ensure all orders are fulfilled accurately and on time.</li></ul>\n<strong>Process Improvement:</strong>\n<ul><li>Identify and implement process improvements to enhance operational efficiency and reduce costs.</li><li>Monitor and analyze logistics metrics to identify areas for improvement.</li><li>Develop and enforce standard operating procedures (SOPs) for logistics operations.</li></ul>\n<strong>Compliance &amp; Safety:</strong>\n<ul><li>Ensure compliance with federal, state, and local regulations, including food safety standards.</li><li>Maintain a clean, safe, and organized warehouse environment.</li><li>Conduct regular safety audits and training sessions for staff.</li></ul>\n\n<strong>Qualifications:</strong>\n<ul><li>Minimum of 3-5 years of experience in logistics or warehouse management.</li><li>Proven track record of leading and managing teams in a fast-paced environment.</li><li>Strong organizational and multitasking abilities.</li><li>Excellent communication and leadership skills.</li><li>Proficiency in logistics software and inventory management systems.</li><li>Knowledge of food safety regulations and best practices.</li><li>Ability to lift and move heavy items (up to 50 lbs) as needed.</li><li>Willingness to work flexible hours, including evenings and weekends, as required.</li></ul><p></p>", "responsibilities": "The Logistics Supervisor will be responsible for overseeing and optimizing the day-to-day operations of the logistics department within our client’s food distribution center. This role ensures that all logistical processes run efficiently, meeting company standards for quality, safety, and customer satisfaction. The Logistics Supervisor will lead a team, coordinate with various departments, and play a crucial role in maintaining the smooth flow of goods from the warehouse to the end customer. Please see below for further details. ", "qualifications": {"required": "Minimum of 3-5 years of experience in logistics or warehouse management. Proven track record of leading and managing teams in a fast-paced environment. Strong organizational and multitasking abilities. Excellent communication and leadership skills. Proficiency in logistics software and inventory management systems. Knowledge of food safety regulations and best practices. Ability to lift and move heavy items (up to 50 lbs) as needed. Willingness to work flexible hours, including evenings and weekends, as required."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000850934"}