{"jobTitle": "Creator", "company": {"name": "Acorns", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$90,000.00/yr - $105,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing", "industry": "Financial Services", "description": "At Acorns we look after the financial best interest of the up-and-coming. We are innovators. We make bold decisions. We stay curious, inspiring one another to push past all previous thresholds of possibility. We are one team and are building a diverse community of team members, partners, and customers from all walks of life to foster creativity, challenge conventional thinking, and put the tools of wealth-making in everyone’s hands.\n<br/>\nWe are looking for missionaries who are rooted in purpose, to join our team. We can achieve our goals if we are a team of missionaries working toward a shared purpose and mission.\n<br/>\nOur mission? With benevolence and courage, we look after the financial best interests of the up-and-coming; beginning with the empowering, proud step of micro-investing.\n<br/>\nHow do we accomplish our mission? Our values.\n<br/>\n**Lead With Heart**\nWith compassion, integrity, and tenacity, inspire yourself and others to move past all previous thresholds of possibility\n<br/>\n**Make Bold Decisions**\nWe are creating a new world. Be optimistic, adventurous, and courageous. Leap fearlessly into the future\n<br/>\n**Always Build Trust**\nSay what you mean, mean what you say, and do what you say you’re going to do. We are all owners. We are one team\n<br/>\n**Never Stop Growing**\nChange IS the constant. Stay hungry and curious. Be relentless in the pursuit of progress\n<br/>\n**Find a way**\nNever settle, no excuses, nothing is impossible. Just make it happen\n<br/>\nOur values guide us, and our mission drives us.\n<br/>\nCome join us and help deliver financial wellness for the whole family, creating compound growth at every life stage.\n----------------\nCreator | Acorns\n<br/>\nAcorns is seeking a motivated content creator to create original growth creative for Acorns social channels (Meta, TikTok, Snapchat, Google) against evergreen core product initiatives, product launches, and new creative concepts. This is an exciting, fast-paced position that contributes directly to the storytelling and growth of the Acorns brand and will report directly into the Social Media Director.\n<br/>\nThis role has the option to be **remote** or based in our **Irvine, CA, ** or **New York, NY** offices.\n<br/>\n**Within 1 month, you will:**\n<ul>\n<li>Familiarize yourself with the processes of the design and growth teams and how to work within the broader matrix of the organization.</li>\n<li>Familiarize yourself with the current slate of influencers, social platforms and agencies that we work with. Identify what's working and what can be improved on.</li>\n<li>Familiarize yourself with Acorns brand values and how we use these in our growth creative and develop an understanding of our customer base. Communicate Acorns' brand and values across the Acorns growth creatives.</li>\n<li>Deep dive into how Acorns content is performing and perceived on our growth channels, identify strengths and weaknesses and develop core buckets of new growth creative to decrease CAC metrics.</li>\n<li>Complete Acorns’ best-in-class onboarding, Acorns’ Seedling Program</li>\n<li>Participate in a virtual coffee session hosted by Acorns’ CEO, Noah Kerner</li>\n<li>Attend your first community-wide virtual all-hands meeting</li>\n</ul>\n<br/>\n**Within 3 months, you will:**\n<ul>\n<li>Expand on our existing growth creative buckets and establish ongoing growth creative initiatives that leverage Acorns products and services.</li>\n<li>Work with manager and team to establish priorities, including new features, infrastructure, and tool building.</li>\n<li>Review your 30-60-90 day goals and accomplishments with your manager</li>\n<li>Opportunity to engage in Acorn’s Community &amp; Heritage celebrations</li>\n<li>Receive operational updates from our GoHenry &amp; PixPay team members during Acorns’ quarterly global virtual all-hands session</li>\n</ul>\n<br/>\n**Within 6 months, you will:**\n<ul>\n<li>Develop and manage multiple content ideas that fit our growth marketing content needs at a high velocity.</li>\n<li>Execute on high-level growth creative content that educates and entertains current and future subscribers.</li>\n<li>Come up with out-of-the-box growth creative ideas that will elevate the brand, and bring them to life!</li>\n<li>Participate in a performance check-in as a part of our performance management cycle</li>\n</ul>\n<br/>\n**What you will bring to Acorns:**\n<ul>\n<li>3 or more years of relevant experience</li>\n<li>Excellent knowledge of social media channels and user generated content (UGC)</li>\n<li>Passion for creating engaging content that educates and informs Acorns customers</li>\n<li>Clear understanding of content best-practices</li>\n<li>Excellent collaboration and interpersonal skills</li>\n<li>Extremely positive attitude; thrives in a fast-paced environment</li>\n<li>Confident in ability to pitch new, creative ideas</li>\n<li>Strong and clear point of view on social content</li>\n<li>Exceptional drive and precision in delivery</li>\n<li>A belief that your work is tied to your life's mission</li>\n<li>Optimistic about the potential of societal change</li>\n</ul>\n<br/>\n<u>You are not expected to have experience with all listed requirements. If you feel passionate about Acorns' mission, vision, and values, please apply.</u>\n<br/>\n**What we offer: **\n<ul>\n<li>Competitive salary and stock options</li>\n<li>A comprehensive benefits package to meet the needs of you and your family</li>\n<li>Flexible work hours, location, and paid time off</li>\n<li>401k discretionary match</li>\n<li>Monthly Acorns account contribution &amp; GoHenry account for your family</li>\n<li>Wellness Days - Company-wide quarterly days off to rest + recharge</li>\n<li>Mindfulness, Mental Health, and Financial Wellness resources: Headspace, Ginger, and Addition Wealth are offered at no cost to you</li>\n<li>Acorns Career Development Program (Monthly Acorns to Oaks training sessions, development plans, quarterly development check-ins, Cornerstone’s online training platform)</li>\n<li>Roots Leadership Program for emerging leaders</li>\n<li>Monthly community celebrations, events, panel discussions, and speakers</li>\n<li>Talented and motivated team members who care deeply about one another, our mission, and our customers.</li>\n<li>The rare opportunity to create a new world. We inspire one another every day to do meaningful work that solves big societal challenges.</li>\n</ul>\n<br/>\n**About Acorns:**\nAcorns is how everyday consumers save &amp; invest for the long term. By putting the tools of wealth-making in everyone's hands, Acorns has become the largest subscription service in U.S. consumer finance, serving over 10 million everyday Americans. Today, Acorns is a global company across five countries with three distinct products, including GoHenry, the leader in money management and financial education for kids in the US and UK, and Pixpay, a leading European money manager for teens. At Acorns, customers get automated investing in diversified portfolios, a simple retirement product, a bank account that helps people spend less to invest more, and bonus investments from 20k brands. Parents can easily invest in their kids and get money news they can use to grow at every life stage. From acorns, mighty oaks do grow!\n<br/>\n**Mission:**\nWith benevolence and courage, we look after the financial best interests of the up-and-coming; beginning with the empowering step of micro-investing.\n<br/>\n**Values:**\n<ul>\n<li>Lead With Heart</li>\n<li>Make Bold Decisions</li>\n<li>Always Build Trust</li>\n<li>Never Stop Growing</li>\n<li>Find a Way</li>\n</ul>\n<br/>\n**Commitment to a diverse community: **\nAcorns is committed to building a diverse community of customers, partners, and team members. We believe that fostering diversity not only fuels creativity but also challenges conventional thinking and helps us properly represent the unique experience of the everyday consumer that we serve.\n<br/>\n**Compensation Information:**\nThe pay range for this position at commencement of employment is expected to be between $90,500 and $106,500/year; however, base pay offered may vary depending on multiple individualized factors, including market location, job-related knowledge, skills, and experience. The total compensation package for this position may also include other elements, including equity grants and discretionary cash bonus awards in addition to a full range of medical, financial, and/or other benefits (including 401(k) eligibility and various paid time off benefits, such as vacation, sick time, and parental leave), dependent on the position offered. Details of participation in these benefit plans will be provided if an employee receives an offer of employment.\n<br/>\nIf hired, employee will be in an “at-will position” and the Company reserves the right to modify base salary (as well as any other discretionary payment or compensation program) at any time, including for reasons related to individual performance, Company or individual department/team performance, and market factors.\n<br/>\n**Work Authorization:**\nAcorns participates in E-Verify to confirm the employment eligibility of all newly hired employees. For more information about E-Verify, please visit www.e-verify.gov", "responsibilities": "Acorns is seeking a motivated content creator to create original growth creative for Acorns social channels (Meta, TikTok, Snapchat, Google) against evergreen core product initiatives, product launches, and new creative concepts. This is an exciting, fast-paced position that contributes directly to the storytelling and growth of the Acorns brand and will report directly into the Social Media Director.", "qualifications": {"required": "3 or more years of relevant experience, Excellent knowledge of social media channels and user generated content (UGC), Passion for creating engaging content that educates and informs Acorns customers, Clear understanding of content best-practices, Excellent collaboration and interpersonal skills, Extremely positive attitude; thrives in a fast-paced environment, Confident in ability to pitch new, creative ideas, Strong and clear point of view on social content, Exceptional drive and precision in delivery, A belief that your work is tied to your life's mission, Optimistic about the potential of societal change", "preferred": null}, "skills": ["Social Media", "Content Creation", "Social Media Marketing", "Content Strategy", "Social Media Management", "Marketing", "Digital Marketing", "Creative Strategy", "Brand Management", "Content Marketing"], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": "Competitive salary and stock options, A comprehensive benefits package to meet the needs of you and your family, Flexible work hours, location, and paid time off, 401k discretionary match, Monthly Acorns account contribution & GoHenry account for your family, Wellness Days - Company-wide quarterly days off to rest + recharge, Mindfulness, Mental Health, and Financial Wellness resources: Headspace, Ginger, and Addition Wealth are offered at no cost to you, Acorns Career Development Program (Monthly Acorns to Oaks training sessions, development plans, quarterly development check-ins, Cornerstone’s online training platform), Roots Leadership Program for emerging leaders, Monthly community celebrations, events, panel discussions, and speakers, Talented and motivated team members who care deeply about one another, our mission, and our customers., The rare opportunity to create a new world. We inspire one another every day to do meaningful work that solves big societal challenges.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4000245640"}