{"jobTitle": "Senior Facilities Planner", "company": {"name": "BioPhase", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "35/hr - 46/hr", "currency": "USD"}, "jobFunction": "Manufacturing, Strategy/Planning, and Engineering", "industry": "Biotechnology Research and Pharmaceutical Manufacturing", "description": "The Senior Facilities Planner is responsible for developing and overseeing all Planned Maintenance/Calibration activities. Working with minimal supervision, the Facilities Planner will coordinate and expedite the operations of the Facilities Department. As the primary system administrator of CMMS, the planner will ensure that work orders are documented, executed, and closed with the correct data entered into the system. Process and input corrective, preventive maintenance, and calibration work orders in to the system, as well as initiate scheduling modules, generate monthly status and metrics reports, and maintain and update parts inventory modules.  \n\n**Onsite Role: Monday - Friday**\nPay: **$35/hr - $46/hr**\nLocation: **Los Angeles Metropolitan**\n\n**Responsibilities**\n* Coordinate and communicate all planned maintenance activities, including ordering parts, maintaining necessary supplies, verifying orders and requests, managing and prioritizing work orders, resources, materials, and vendor relationships.\n* Ensure planned maintenance schedules are communicated effectively to all customers and support groups.\n* Process and track all facilities purchasing activities.\n* Support and implement new Standard Operating Procedures (SOPs), updates, activities, and training records. Perform additional administrative duties as needed.\n* Adhere to Safety and Good Manufacturing Practice (GMP) procedures to ensure a safe work environment.\n* Serve as the primary system administrator for the Computerized Maintenance Management System (CMMS).\n* Collaborate with production scheduling and provide input on work orders based on maintenance capacity, parts inventory, scheduled projects, and maintenance resources.\n* Track all preventive maintenance (PM), calibration (CAL), and corrective maintenance (CM) work orders to ensure completion.\n* Generate monthly reports on overdue work orders.\n* Ensure all assets have schedules set up in the system.\n* Maintain asset tracking for all equipment locations within Blue Mountain RAM (BMRAM).\n* Facilitate regular meetings with maintenance staff, including pre- and post-maintenance meetings, and track key metrics associated with work orders.\n* Oversee the inventory of non-BMRAM items, such as scale-up equipment.\n* Support the maintenance department staff and maintain training records.\n* Assist in drafting and maintaining department SOPs.\n* Review and approve orders for office supplies for department use.\n* Process and track all facilities purchasing activities.\n* Extract data and generate reports from the Blue Mountain RAM system to aid in the development of staff metrics.\n* Communicate with customers to provide updates and clarifications as necessary.\n* Provide reports to support validation requirements and manage deviations.\n\n**Qualifications**\n* 7+ year minimum working experience of Computerized Maintenance Management Systems\n* Bachelor’s degree in related area and/or equivalent experience/training\n* Minimum 5 years of facilities maintenance/ operations experience\n* GMP facility experience preferred, not required\n* Two years minimum experience working in an FDA regulated environment preferred, not required\n\nPlease send resumes to tiffany@biophaseinc.com", "responsibilities": "Coordinate and communicate all planned maintenance activities, including ordering parts, maintaining necessary supplies, verifying orders and requests, managing and prioritizing work orders, resources, materials, and vendor relationships. Ensure planned maintenance schedules are communicated effectively to all customers and support groups. Process and track all facilities purchasing activities. Support and implement new Standard Operating Procedures (SOPs), updates, activities, and training records. Perform additional administrative duties as needed. Adhere to Safety and Good Manufacturing Practice (GMP) procedures to ensure a safe work environment. Serve as the primary system administrator for the Computerized Maintenance Management System (CMMS). Collaborate with production scheduling and provide input on work orders based on maintenance capacity, parts inventory, scheduled projects, and maintenance resources. Track all preventive maintenance (PM), calibration (CAL), and corrective maintenance (CM) work orders to ensure completion. Generate monthly reports on overdue work orders. Ensure all assets have schedules set up in the system. Maintain asset tracking for all equipment locations within Blue Mountain RAM (BMRAM). Facilitate regular meetings with maintenance staff, including pre- and post-maintenance meetings, and track key metrics associated with work orders. Oversee the inventory of non-BMRAM items, such as scale-up equipment. Support the maintenance department staff and maintain training records. Assist in drafting and maintaining department SOPs. Review and approve orders for office supplies for department use. Process and track all facilities purchasing activities. Extract data and generate reports from the Blue Mountain RAM system to aid in the development of staff metrics. Communicate with customers to provide updates and clarifications as necessary. Provide reports to support validation requirements and manage deviations.", "qualifications": {"required": "7+ year minimum working experience of Computerized Maintenance Management Systems, Bachelor’s degree in related area and/or equivalent experience/training, Minimum 5 years of facilities maintenance/ operations experience", "preferred": "GMP facility experience preferred, not required, Two years minimum experience working in an FDA regulated environment preferred, not required"}, "skills": ["Computerized Maintenance Management Systems", "GMP", "FDA"], "postedDate": "1 week ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000252599"}