{"jobTitle": "Accounts Payable Associate", "company": {"name": "Jellyfish", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "40,000.00/yr - 50,000.00/yr", "currency": "USD"}, "jobFunction": "Accounting/Auditing", "industry": "Advertising Services", "description": "<em>At Jellyfish we believe that our individual differences are our greatest assets. We are passionate about empowering every employee to reach their full potential and contribute their unique perspectives to our collaborative environment. We are an equal opportunity employer and firmly believe that a diverse and inclusive workforce drives innovation and leads to better solutions. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, veteran status, or any other personal characteristics that make them who they are.</em><p> </p><p>Jellyfish is a global digital marketing agency; a unique fusion of tech enthusiasts, creative minds, and media and data experts all united to empower our clients along their digital journey. Our commitment to embracing diverse perspectives fuels our innovation and strategies that challenge the status quo, reinvent media activation, and craft influential stories for our global clients and their customers. Join us in shaping a future where business growth and personal fulfilment go hand in hand.<br/><br/></p><strong>Job Description<br/><br/></strong><p>Salary range for this position is $40,000 - $50,000 USD annual.</p><p>Reporting to the CFO. You'll manage outgoing transactions, and forging strong relationships with suppliers.</p><p>Maintain accurate records regarding payments to suppliers, processing payments from clients, and upskill others.</p><p>Improve department processes and build lasting relationships with others within and outside of the business. Be knowledgeable, analytical, and decisive with excellent leadership.</p><p>Be able to independently handle complex or new challenges and come up with solutions.</p><p> </p><p><strong>Responsibilities:</strong></p><ul><li>Ensure all documentation from suppliers/creditors and expense employees are monitored, effectively processed and paid on schedule.</li><li>Manage all data throughput in the department to ensure that it is managed and processed efficiently.</li><li>Reconcile supplier statements and other balance sheet data on a monthly basis.</li><li>Manage the Accounts Payable Inbox including ServiceNow AP ticketing system.</li><li>Build and maintain relationships with employees, vendors and clients.</li><li>Support with weekly/monthly Cash Forecasting deliverables.</li><li>Support with AP programs to standardize, simplify and automate processes.</li><li>Compile, analyze, and report financial information to management.</li><li>Set and help achieve department goals.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's degree in accounting, finance, management, or a related field.</li><li>Knowledge of accounting and management principles and accounts payable procedures.</li><li>Proficiency with computers, especially business solutions and bookkeeping software.</li><li>1+ years of experience analyzing information and processes.</li><li>1+ Experience managing internal and external relationships.</li><li>Commitment to ethical behavior with a willingness to follow all company policies and current financial legislation.</li></ul><p>Note: We emphasize skills, expertize and behavioral attributes over years of experience and traditional degrees. If you want to join our collaborative team, we invite you to apply today with your resumer in English.<br/><br/></p><strong>Additional Information<br/><br/></strong><p>Join Jellyfish and experience a workplace where we prioritize your growth, celebrate your contributions, and empower you to tailor your work environment to suit your needs.</p><p>💰 Reward: You'll receive a loyalty salary increase on your Jellyfish anniversary, in addition to our company-wide annual bonus and 401k retirement plan.</p><p>🏥 Healthcare plans: Have peace of mind with our healthcare, vision and dental insurance, plus short and long-term disability and life cover.</p><p><strong>💫</strong> Custom Work Environment: Work remotely for up to 60% of your days and shape your day between 8am. and 6:30pm with flexible working hours.</p><p>📈 Growth, Your Way: Grow your career with one paid day each month for self-development and access to LinkedIn Learning<strong> </strong>with unlimited online courses.</p><p>👪 Family Support: Enjoy 14 weeks of paid leave for primary caregivers and 4 weeks of paid leave for secondary caregivers.</p><p> </p><p>All your information will be kept confidential according to EEO guidelines.</p><p><em>Unfortunately, there has been an increase in fake recruiters impersonating Jellyfish and unlawfully using our brand name. If you are unsure if an email with a job offer you have received is genuinely from Jellyfish, or if you suspect any fraudulent activity, please report it to </em><em>talentacquisition@jellyfish.com</em><em>.</em></p><p></p>", "responsibilities": "Ensure all documentation from suppliers/creditors and expense employees are monitored, effectively processed and paid on schedule. Manage all data throughput in the department to ensure that it is managed and processed efficiently. Reconcile supplier statements and other balance sheet data on a monthly basis. Manage the Accounts Payable Inbox including ServiceNow AP ticketing system. Build and maintain relationships with employees, vendors and clients. Support with weekly/monthly Cash Forecasting deliverables. Support with AP programs to standardize, simplify and automate processes. Compile, analyze, and report financial information to management. Set and help achieve department goals.", "qualifications": {"required": "Bachelor's degree in accounting, finance, management, or a related field. Knowledge of accounting and management principles and accounts payable procedures. Proficiency with computers, especially business solutions and bookkeeping software. 1+ years of experience analyzing information and processes. 1+ Experience managing internal and external relationships. Commitment to ethical behavior with a willingness to follow all company policies and current financial legislation.", "preferred": ""}, "skills": ["Accounting", "Finance", "Management", "Accounts Payable", "Bookkeeping", "Data Analysis", "Relationship Management", "Financial Reporting"], "postedDate": "1 week ago", "benefits": "You'll receive a loyalty salary increase on your Jellyfish anniversary, in addition to our company-wide annual bonus and 401k retirement plan. Have peace of mind with our healthcare, vision and dental insurance, plus short and long-term disability and life cover. Work remotely for up to 60% of your days and shape your day between 8am. and 6:30pm with flexible working hours. Grow your career with one paid day each month for self-development and access to LinkedIn Learning with unlimited online courses. Enjoy 14 weeks of paid leave for primary caregivers and 4 weeks of paid leave for secondary caregivers.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4000951147"}