{"jobTitle": "Creative Operations Manager", "company": {"name": "Obagi", "industry": "Pharmaceutical Manufacturing", "size": "~115M", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Management and Manufacturing", "employmentType": "Temporary", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Pharmaceutical Manufacturing", "description": "Obagi Cosmeceuticals is an industry leading, ~$115M dermo-cosmetic brand that provides transformational skin care products clinically formulated to minimize signs of skin aging, address dark spots, hyperpigmentation, fine lines, and wrinkles. A 35-year legacy backed by science and innovation to protect and enhance skin tone and texture. Ranked No. 1 and widely recognized by US dermatologists and plastic surgeons for its clinical excellence and science-backed approach, Obagi remains a leader in the beauty space and operates as an innovative, global, omni-channel luxury consumer products business with sales distribution to physicians, wholesale partners, retail outlets, Amazon, and direct-to-consumer (DTC) channels. On a mission to create a global, best-in-class multi-brand, multicategory portfolio, Obagi will continue to redefine the future of skincare. We are Obagi. Fearless. Together.", "responsibilities": "Oversee execution and ensure smooth & efficient workflows and consistency of digital creative messaging, seasonal brand activations, and 'always-on' campaigns. Manage day-to-day communication, timelines, and deliverables across creative teams/vendors in support of product launches, photo shoots, design/brand projects, and marketing and e-commerce initiatives. Scope and schedule projects via Wrike, managing team workload and delivery bottlenecks. Intake creative briefs for marketing and e-commerce initiatives and oversee their execution, ensuring that all creative needs are properly resourced, monitored, and delivered in a timely and efficient manner. Collaborate with the creative, marketing, and merchandising teams on strategy of marketing briefs, timelines, and campaign launches, ensuring that all deliverables are clearly defined and communicated. Track and prioritize all creative requests, ensuring resources are allocated appropriately. Work closely with the Marketing Sr. Managers to streamline processes, improve efficiency and productivity, and ensure alignment between creative and business goals. Support DAM requirements and asset management.", "qualifications": {"required": "A bachelor’s degree from an accredited university in Graphic Design, Marketing, Visual Communication, or related field highly preferred. 3+ years of experience managing creative operations or project managements, ideally in a retail environment with a high confidence in understanding consumer behavior and industry trends. Strong project management skills, with a demonstrated ability to stay organized while managing multiple campaigns with competing deliverables and/or timelines. Excellent communication and interpersonal skills, with the ability to build relationships at all levels of the company and a keen eye for detail regarding design layouts and copy. General technical acumen for creative operations tooling and implementation, including familiarity with relevant software and systems used in creative workflows. Exceptional organizational and prioritization/time management skills; demonstrated ability to work under pressure to meet deadlines. Comfortable operating in a fast paced, ever-changing environment; someone who thrives in ambiguity and adapts quickly. Experience leading creative development of innovative creative from concept to delivery. Proficiency in Microsoft Office and other technologies, with advanced proficiency with Adobe Creative Suite (Photoshop, Illustrator, InDesign). Project Management Tools (PMS) – Wrike. Digital Asset Management (DAM) platforms - Bynder. Possess an energetic, positive attitude that encourages a team and supports the growth and professional development of others.", "preferred": ""}, "skills": ["Project Management", "Adobe Creative Suite", "Communication", "Organizational Skills", "Creative Development"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4000780029"}