{"jobTitle": "Data Analyst", "company": {"name": "Robert Half", "location": "Los Alamitos, CA"}, "location": "Los Alamitos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "26.13/hr - 30.25/hr", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Staffing and Recruiting", "description": "We are searching for a meticulous Data Analyst to join our team in the logistics industry. Located in Los Alamitos, California, this role offers a long-term contract employment opportunity. As a Data Analyst, your responsibilities will revolve around managing and maintaining contract rates, driver pay rates, fuel surcharge rates, and related documents. You will be pivotal in supporting various departments with contract rate and driver pay related issues and will frequently present findings on changes in MasterData.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Conduct thorough analysis and maintain processes for company MasterData information, including contract rate, vehicle class, and fuel surcharge data.</li><li> Manage and upkeep all contract rates, driver pay rates, fuel surcharge rates, and contract-related documents.</li><li> Support departments throughout the company with all contract rate and driver pay related issues.</li><li> Present findings on changes in MasterData frequently to different levels within the company.</li><li> Use advanced data mining techniques to collect, analyze, and present MasterData related items to varying levels of employees.</li><li> Use data visualization tools to articulate relevant information to varying levels throughout the organization in an organized and concise manner.</li><li> Continuously improve processes, with a strong interest in process improvement.</li><li> Establish and maintain detailed process documentation.</li><li> Use Informatica and other databases to maintain company MasterData information.</li><li> Create dashboards to visualize and present data effectively.</li><li> Prioritize tasks and navigate shifting business priorities, recognizing the sense of urgency when required.</li></ul>", "postedDate": "1 week ago", "skills": ["Data Analysis", "MasterData", "Informatica", "Data Mining", "Data Visualization"], "url": "https://www.linkedin.com/jobs/view/4000957886"}