{"jobTitle": "Merchandiser, International Distributors", "company": {"name": "Skechers", "location": "Manhattan Beach, CA"}, "location": "Manhattan Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "85,000.00/yr - 95,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Retail", "description": "Obtain an extensive knowledge of the product lines to effectively communicate company key initiatives, quarterly assortments, and store selling to our partners. Review business and assortments to determine additional opportunities based on the needs within each country. Work directly with the planning team to communicate product opportunities based on sales history, volume, store layouts, and capacities. Create assortment plans for INTL Skechers stores in over 20 countries focusing on key initiatives and historical selling data to help maximize sales.<br/><br/><strong>Essential Job Results-<br/><br/></strong><ul><li>Collaborate with INTL Merchandising Manager on overall country assortments to drive sales</li><li>Be a product expert to be able to communicate product lines and build compelling assortments for retail stores.</li><li>Review store assortments to determine additional opportunities based on sales, company key initiatives, and country specific needs.</li><li>Review U.S. retail store trends to communicate bestsellers to countries to leverage store testing and buys.</li><li>Review monthly and quarterly retail sales reports to determine what categories are driving the business and where there is opportunity to grow the business (division, outsole, style/sku level).</li><li>Effective communication thru email and conference calls to discuss business and future opportunities.</li><li>Meet with distributors to discuss current business, store assortments and future store openings.</li><li>Daily collaboration and communication with Planning, Product, and Customer Service teams<br/><br/></li></ul><strong>Supervisory Responsibilities-<br/><br/></strong><ul><li>No<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>JOB REQUIREMENTS-<br/><br/></strong><ul><li>Assortment planning background with a large volume of skus</li><li>Global Mindset</li><li>Excellent written and verbal communication skills</li><li>Ability to work independently as well as part of a team</li><li>Build and grow INTL relationships</li><li>Outstanding time management skills</li><li>Flexible schedule for INTL calls early or late in the evening</li><li>Sales forecasting</li><li>Inventory management</li><li>Trends and sales analysis<br/><br/></li></ul><strong>Education And Experience-<br/><br/></strong><ul><li>4+ years experience in Merchandising</li><li>Advanced Excel skills including Pivot Tables and V look-ups</li><li>Bachelor’s degree</li><li>International experience</li><li>Retail sales experience a plus<br/><br/></li></ul>The pay range for this role is $85,000-$95,000/yr USD.<br/><br/><strong>About Skechers<br/><br/></strong>Skechers (NYSE: SKX), a global, Fortune 500® brand develops and markets a diverse range of lifestyle and performance footwear, apparel, and accessories. Developing comfort technologies is the foundation of all we do – delivering stylish, innovative, and quality products. Serving over 180 countries and territories, Skechers connects customers to products through department and specialty stores, e-commerce and digital stores, and through our more than 5,200 company-and third-party-owned retail locations. Headquartered in Southern California, with offices and distribution centers around the globe, Skechers has spent 30 years helping people of all ages look and feel good.<br/><br/><strong>Equal Employment Opportunity<br/><br/></strong>Skechers is committed to providing a safe, inclusive, and respectful work environment. Skechers provides equal employment opportunities for all employees and applicants for employment without regard race, color, religion, gender, gender identification and expression, national origin, marital status, age, disability, genetic information, military status, sexual orientation, or any other protected characteristic established by local, state or federal law.<br/><br/><strong>Reasonable Accommodation<br/><br/></strong>Applicants for employment who require a reasonable accommodation to apply for a job should request appropriate accommodation by emailing benefits@skechers.com.<br/><br/>To perform this job successfully, an individual must be able to perform each job responsibility satisfactorily. The skills, abilities and physical demands described are representative of those duties that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable individuals with disabilities, who are otherwise qualified for the job position, to perform the essential functions.", "responsibilities": "Obtain an extensive knowledge of the product lines to effectively communicate company key initiatives, quarterly assortments, and store selling to our partners. Review business and assortments to determine additional opportunities based on the needs within each country. Work directly with the planning team to communicate product opportunities based on sales history, volume, store layouts, and capacities. Create assortment plans for INTL Skechers stores in over 20 countries focusing on key initiatives and historical selling data to help maximize sales.", "qualifications": {"required": "Assortment planning background with a large volume of skus, Global Mindset, Excellent written and verbal communication skills, Ability to work independently as well as part of a team, Build and grow INTL relationships, Outstanding time management skills, Flexible schedule for INTL calls early or late in the evening, Sales forecasting, Inventory management, Trends and sales analysis", "preferred": "4+ years experience in Merchandising, Advanced Excel skills including Pivot Tables and V look-ups, Bachelor’s degree, International experience, Retail sales experience a plus"}, "skills": ["Assortment Planning", "Global Mindset", "Communication", "Teamwork", "Relationship Building", "Time Management", "Sales Forecasting", "Inventory Management", "Trends Analysis", "Excel", "Pivot Tables", "V Look-ups", "Merchandising", "International Experience", "Retail Sales"], "postedDate": "1 week ago", "benefits": "The pay range for this role is $85,000-$95,000/yr USD.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000943948"}