{"jobTitle": "Regional Director California - LA, Santa Barbara & Ventura Counties", "company": {"name": "FIRST", "location": "Orange, CA"}, "location": "Orange, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "78,100.00/yr - 97,350.00/yr", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Internet Publishing", "description": "Does the thought of preparing kids to solve the world’s greatest problems excite and empower you?Do you want to be with an organization where your knowledge and skills will help increase school engagement and student success, and extend our global reach? Do you want to be on a team that crafts opportunities and provides life changing experiences for students?<br/><br/>These opportunities are as strong and dynamic as ever, as <em>FIRST®</em> creates the people who will change the world – today and tomorrow!<br/><br/><strong>What We Offer<br/><br/></strong>We promise a fast-paced, exciting, and rewarding environment where you will be part of a team that cares about each other and thrives on each other’s successes.You’ll feel good about the future of the world after doing hard work with the talented people at<em> FIRST®</em> and will have a front row seat to our life changing programs.<br/><br/>Our extensive benefits package is highly competitive and includes:<br/><br/><ul><li>Healthcare Insurance</li><li>Dental Insurance</li><li>Vision Insurance</li><li>Life &amp; AD&amp;D Insurance</li><li>Supplemental life insurance</li><li>Voluntary accident and legal plans</li><li>Income Protection Insurances (STD &amp; LTD)</li><li>Flexible Work Schedule</li><li>Hybrid Work Model</li><li>160 PTO hours for FT employees</li><li>14paid holidays per calendar year (one is a floating holiday)</li><ul><li>Paid July 4th Week Holiday Closure</li></ul><li>40 hours paid sick leave per calendar year</li><li>One paid volunteer day per anniversary year</li><li>Maternity and Parental Leave</li><li>401K Retirement Savings Plan (with employer match)</li><li>Medical and dependent pre-tax flex plans</li><li>Employee Assistance Program (EAP)<br/><br/></li></ul>The salary range for this position is $78,100 -$97,350 (min - midpoint). New hires typically start between the range minimum and midpoint based on qualifications, experience, and internal equity.<br/><br/><strong>Who You Are<br/><br/></strong>Are you passionate about fostering innovation, inspiring future leaders, and making a lasting impact in your community? Join us as the primary representative for <em>FIRST</em>® Robotics Competition (FRC) in the <strong>LA, Santa Barbara &amp; Ventura CA areas</strong>! Working locally and from your home office, you will build and maintain a passionate, volunteer driven, self-sustaining group of leaders who focus on engaging schools, encouraging local relationships, and fundraising as we grow our <em>FIRST</em> programs.<br/><br/>Applicants must be authorized to work for ANY employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa at this time.<br/><br/><strong>What You Will Do<br/><br/></strong>With <em>Gracious Professionalism</em>® you will develop teams, establish, and maintain sponsor relationships, and collaborate with <em>FIRST</em> leaders, volunteers, and program staff. Additionally, you will provide:<br/><br/><ul><li>Regional Leadership: Be the face of FIRST Robotics Competition (FRC), acting as the primary liaison between FRC regional planning committees, the Field Operations Manager, and other FIRST staff. Your role is instrumental in guiding the direction and growth of our programs</li><li>Strategic Collaboration: Collaborate with local leaders and champions within the FIRST Ecosystem, working together to ensure the long-term sustainability and growth of FIRST programs. Your efforts will contribute to the development and success of our next generation of innovators</li><li>Volunteer Engagement: Develop, recruit, and support a dynamic team of volunteer Regional Planning Committee members. Your leadership will empower them to conduct successful FRC competitions, ensuring adherence to FIRST standards and guidelines</li><li>Fundraising Mastery: Take the lead in fundraising efforts for the designated region/territory, cultivating relationships with sponsors, writing compelling grant proposals, and securing financial support to cover program delivery expenses. Your skills will be pivotal in ensuring the continued success of our impactful programs (refer to our Impact reports)</li><li>Cost-Effective Event Management: Drive cost-containment strategies for events, carefully analyzing budgets, exploring alternatives, and implementing innovative solutions. Your attention to detail will ensure optimal resource utilization without compromising the quality of event experiences</li><li>Team Growth and Support: Lead initiatives to retain, recruit, and communicate with FRC teams, aiming for target growth numbers and ongoing support to achieve sustainability. Your passion for mentorship will inspire and empower the teams within your region</li><li>Community Engagement: Cultivate relationships with local professional organizations, fostering alliances and initiating advocacy efforts. You'll be a key player in building awareness of the FIRST mission within the local business, education, and policymaking sectors</li><li>Monthly Reporting and Compliance: Ensure timely monthly reporting and active participation in meetings as required by Global Field Operations and FIRST Policies. Your commitment to transparency and accountability will contribute to the overall success of our programs</li><li>Advocacy and Outreach: Work collaboratively with local businesses, schools, community leaders, and policymakers to increase awareness of the FIRST mission. Your enthusiasm will inspire support for our cause and contribute to a thriving regional robotics community<br/><br/></li></ul><strong>What We Expect<br/><br/></strong>We are seeking candidates with the following knowledge, skills, and experience:<br/><br/><ul><li>BA/BS degree in a related field with minimum 5 years relationship management role experience, with 3 of those years including fundraising</li><li>Excellent organizational, verbal, andwritten communication skills</li><li>Proven budget management and financial reporting skills</li><li>Ability and willingness for regular travel</li><li>FIRST experience/knowledge strongly preferred</li><li>Previous event management experience a plus<br/><br/></li></ul><strong>Commitment to <em>FIRST® </em>Core Values<br/><br/></strong><strong>Discovery:</strong><strong><em>We explore new skills and ideas.<br/><br/></em></strong><strong>Innovation:</strong><strong> <em>We use creativity and persistence to solve problems.<br/><br/></em></strong><strong>Impact: </strong><strong><em>We apply what we learn to improve our world.<br/><br/></em></strong><strong>Inclusion: </strong><strong><em>We respect each other and embrace our differences.<br/><br/></em></strong><strong>Teamwork: </strong><strong><em>We are stronger when we work together.<br/><br/></em></strong><strong>Fun:</strong><strong> <em>We enjoy and celebrate what we do!<br/><br/></em></strong><strong>Thriving on our core values, celebrating the uniqueness of our employees and committed to inclusion. Proud to be an </strong><strong>equal opportunity employer</strong><strong>.<br/><br/></strong>Powered by JazzHR<br/><br/>BhxviHNbjB", "responsibilities": "With <em>Gracious Professionalism</em>® you will develop teams, establish, and maintain sponsor relationships, and collaborate with <em>FIRST</em> leaders, volunteers, and program staff. Additionally, you will provide:<br/><br/><ul><li>Regional Leadership: Be the face of FIRST Robotics Competition (FRC), acting as the primary liaison between FRC regional planning committees, the Field Operations Manager, and other FIRST staff. Your role is instrumental in guiding the direction and growth of our programs</li><li>Strategic Collaboration: Collaborate with local leaders and champions within the FIRST Ecosystem, working together to ensure the long-term sustainability and growth of FIRST programs. Your efforts will contribute to the development and success of our next generation of innovators</li><li>Volunteer Engagement: Develop, recruit, and support a dynamic team of volunteer Regional Planning Committee members. Your leadership will empower them to conduct successful FRC competitions, ensuring adherence to FIRST standards and guidelines</li><li>Fundraising Mastery: Take the lead in fundraising efforts for the designated region/territory, cultivating relationships with sponsors, writing compelling grant proposals, and securing financial support to cover program delivery expenses. Your skills will be pivotal in ensuring the continued success of our impactful programs (refer to our Impact reports)</li><li>Cost-Effective Event Management: Drive cost-containment strategies for events, carefully analyzing budgets, exploring alternatives, and implementing innovative solutions. Your attention to detail will ensure optimal resource utilization without compromising the quality of event experiences</li><li>Team Growth and Support: Lead initiatives to retain, recruit, and communicate with FRC teams, aiming for target growth numbers and ongoing support to achieve sustainability. Your passion for mentorship will inspire and empower the teams within your region</li><li>Community Engagement: Cultivate relationships with local professional organizations, fostering alliances and initiating advocacy efforts. You'll be a key player in building awareness of the FIRST mission within the local business, education, and policymaking sectors</li><li>Monthly Reporting and Compliance: Ensure timely monthly reporting and active participation in meetings as required by Global Field Operations and FIRST Policies. Your commitment to transparency and accountability will contribute to the overall success of our programs</li><li>Advocacy and Outreach: Work collaboratively with local businesses, schools, community leaders, and policymakers to increase awareness of the FIRST mission. Your enthusiasm will inspire support for our cause and contribute to a thriving regional robotics community<br/><br/></li></ul>", "qualifications": {"required": "BA/BS degree in a related field with minimum 5 years relationship management role experience, with 3 of those years including fundraising, Excellent organizational, verbal, andwritten communication skills, Proven budget management and financial reporting skills, Ability and willingness for regular travel, FIRST experience/knowledge strongly preferred, Previous event management experience a plus", "preferred": ""}, "skills": ["Fundraising", "Relationship Management", "Event Management", "Budget Management", "Communication"], "postedDate": "1 week ago", "benefits": "Healthcare Insurance, Dental Insurance, Vision Insurance, Life &amp; AD&amp;D Insurance, Supplemental life insurance, Voluntary accident and legal plans, Income Protection Insurances (STD &amp; LTD), Flexible Work Schedule, Hybrid Work Model, 160 PTO hours for FT employees, 14paid holidays per calendar year (one is a floating holiday), Paid July 4th Week Holiday Closure, 40 hours paid sick leave per calendar year, One paid volunteer day per anniversary year, Maternity and Parental Leave, 401K Retirement Savings Plan (with employer match), Medical and dependent pre-tax flex plans, Employee Assistance Program (EAP)", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4000959977"}