{"jobTitle": "Vice President, Financial Planning & Analysis", "company": {"name": "Creative Artists Agency", "location": "Los Angeles, CA", "industry": "Entertainment Providers"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "230,000.00 - 280,000.00", "currency": "USD"}, "jobFunction": "Finance and Sales", "industry": "Entertainment Providers", "description": "<strong>Job Description<br/><br/></strong><strong>Who We Are<br/><br/></strong>Creative Artists Agency (CAA) is the leading entertainment and sports agency, with global expertise in filmed and live entertainment, digital media, publishing, sponsorship sales and endorsements, media finance, consumer investing, fashion, trademark licensing, and philanthropy. Distinguished by its culture of collaboration and exceptional client service, CAA’s diverse workforce identifies, innovates, and amplifies opportunities for the people and organizations that shape culture and inspire the world. The trailblazer of the agency business, CAA was the first to build a sports business, create an investment bank, launch a venture fund, found technology start-up companies, establish a philanthropic arm, build a business in China, and form a brand marketing services division, among other innovations. Named Most Valuable Sports Agency by Forbes for eight consecutive years, CAA represents more than 2,000 of the world’s top athletes in football, baseball, basketball, hockey, soccer, in addition to coaches, on-air broadcasters, and sports personalities and works in the areas of broadcast rights, corporate marketing initiatives, social impact, and sports properties for sales and sponsorship opportunities. Founded in 1975, CAA is headquartered in Los Angeles, and has offices in New York, Nashville, Memphis, Chicago, Miami, London, Munich, Geneva, Stockholm, Shanghai, and Beijing, among other locations globally.<br/><br/><strong>The Role<br/><br/></strong>We are looking for a Vice President (VP) of Financial Planning and Analysis (FP&amp;A) to join our growing Finance team in Los Angeles and serve as a strategic and operational thought leader. Reporting to the Head of FP&amp;A and leveraging a small team of direct reports, the VP will work closely with both Finance and Agency senior leadership to provide crucial insight for the company’s continued growth.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Supervise the development of the annual operating and capital Budgets, as well as the mid-year Revised Forecast, utilizing research and analysis of both internal and external sources, including Department Heads and subsidiary leadership/submissions, general ledger, and contract management system</li><li>Ownership of the Long-Range Plan including alignment with relevant macroeconomic factors and relevant equity research reports</li><li>Oversight of annual strategic review of major business lines</li><li>Prepare quarterly financial Board presentations and provide commentary for lender and management reporting presentations</li><li>Provide leadership and development to both direct and indirect reports</li><li>Manage system and operational improvement projects, both self-identified and requested by Management</li><li>Partner with SVP on strategic initiatives</li><li>Other critical tasks and special projects as directed<br/><br/><br/></li></ul><strong>Experience<br/><br/></strong><ul><li>12+ years of corporate finance/financial modeling experience with increasing responsibility including previous supervisory roles</li><li>Strong presentation and communication skills at the C-Suite/Board level</li><li>Media &amp; Entertainment expertise a plus</li><li>Technical skills: Expert Excel &amp; PowerPoint (mandatory), Microsoft Dynamics 365 (helpful), PowerBI (a plus)</li><li>Strong strategic and analytical skills with the ability to interpret complex financial data and make data-driven decisions.</li><li>Exceptional leadership and communication skills with the ability to influence and collaborate effectively across departments and with external stakeholders.</li><li>Bachelor’s degree in quantitative major preferred</li><li>MBA/CFA/CPA a plus<br/><br/><br/></li></ul><strong>Location<br/><br/></strong>This role is based out of the Los Angeles office.<br/><br/><strong>Compensation<br/><br/></strong>The annual base salary for this position is in the range of $230,000 - $280,000. This position also is eligible for benefits and discretionary bonus. Ultimately, the salary may vary based upon, but not limited to, relevant experience, time in role, business sector, and geographic location, among other criteria. Please talk with a CAA Recruiter to learn more.<br/><br/>Creative Artists Agency, LLC (the “Company”) is committed to a policy of Equal Employment Opportunity and will not discriminate on the basis of race (inclusive of traits historically associated with race, including hair texture and protective hairstyles), color, religion, creed, gender or sex (including pregnancy, childbirth, breastfeeding or related medical conditions), national origin, ancestry, age, physical disability, mental disability, medical condition, genetic information, family and medical care leave status, military or veteran status, marital status, family status, sexual orientation, gender identity, gender expression, political affiliation, an employee’s or their dependent’s reproductive health decision making (e.g., the decision to use or access a particular drug, device or medical service), or any other characteristic protected by applicable law.<br/><br/>The Company also complies with the Americans with Disabilities Act and applicable state and local laws with regard to providing reasonable accommodation for qualified individuals with disabilities.<br/><br/>CAA does not accept unsolicited resumes from third-party recruiters unless they were contractually engaged by CAA to provide candidates for a specified opening. Any such employment agency, person or entity that submits an unsolicited resume does so with the acknowledgement and agreement that CAA will have the right to hire that applicant at its discretion without any fee owed to the submitting employment agency, person or entity.", "responsibilities": "<ul><li>Supervise the development of the annual operating and capital Budgets, as well as the mid-year Revised Forecast, utilizing research and analysis of both internal and external sources, including Department Heads and subsidiary leadership/submissions, general ledger, and contract management system</li><li>Ownership of the Long-Range Plan including alignment with relevant macroeconomic factors and relevant equity research reports</li><li>Oversight of annual strategic review of major business lines</li><li>Prepare quarterly financial Board presentations and provide commentary for lender and management reporting presentations</li><li>Provide leadership and development to both direct and indirect reports</li><li>Manage system and operational improvement projects, both self-identified and requested by Management</li><li>Partner with SVP on strategic initiatives</li><li>Other critical tasks and special projects as directed<br/><br/><br/></li></ul>", "qualifications": {"required": "<ul><li>12+ years of corporate finance/financial modeling experience with increasing responsibility including previous supervisory roles</li><li>Strong presentation and communication skills at the C-Suite/Board level</li><li>Media &amp; Entertainment expertise a plus</li><li>Technical skills: Expert Excel &amp; PowerPoint (mandatory), Microsoft Dynamics 365 (helpful), PowerBI (a plus)</li><li>Strong strategic and analytical skills with the ability to interpret complex financial data and make data-driven decisions.</li><li>Exceptional leadership and communication skills with the ability to influence and collaborate effectively across departments and with external stakeholders.</li><li>Bachelor’s degree in quantitative major preferred</li><li>MBA/CFA/CPA a plus<br/><br/><br/></li></ul>", "preferred": null}, "skills": ["Excel", "PowerPoint", "Microsoft Dynamics 365", "PowerBI", "Financial Modeling", "Strategic Planning", "Analytical Skills", "Leadership", "Communication"], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4000871837"}