{"jobTitle": "Office Administrator and Bookkeeper - Remote | WFH", "company": {"name": "Get It Recruit - Finance", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "20-$25/hour", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Human Resources Services", "description": "<strong>Job Summary<br/><br/></strong>Are you ready to embark on an exciting career journey with a dynamic boutique commercial real estate firm? We have a unique opportunity for an Office Administrator (OA) who will play a pivotal role in our vibrant team. This position offers a promising career path with room for advancement within our company.<br/><br/>As an Office Administrator, you'll be the heartbeat of our office operations, supporting a team. You will also provide essential executive assistance to the Managing Director (MD), ensuring that all key company initiatives are smoothly executed. Your responsibilities will include managing office supplies, acting as the main liaison for employees on internal business functions, and handling essential tasks like onboarding, deal closing, and working with third-party vendors. Additionally, you'll manage bookkeeping tasks, including QuickBooks categorizing, reconciliation, and reporting.<br/><br/>You'll work closely with the MD, helping to keep the office running efficiently in a fast-paced environment. Your role will involve managing calls, calendars, travel itineraries, and email correspondence, while also occasionally assisting with personal errands.<br/><br/>We're looking for a proactive and resourceful individual who thrives on solving new challenges with a blend of street smarts, customer support skills, and creative problem-solving. If you have a background as an Office Administrator or Executive Assistant and are looking for a long-term opportunity, we'd love to hear from you.<br/><br/><strong>Key Responsibilities<br/><br/></strong>Draft and manage correspondence, including contracts, recruitment materials, and employee documents.<br/><br/>Respond swiftly and appropriately to emerging situations, manage multiple high-priority tasks, and make decisions with minimal oversight.<br/><br/>Coordinate complex scheduling and calendar management, ensuring the smooth flow of information to senior leadership.<br/><br/>Support the MD with business and personal tasks, including meeting preparations and travel arrangements.<br/><br/>Ensure timely approval and payment of invoices.<br/><br/>Maintain a high level of professionalism and confidentiality in all dealings.<br/><br/>Support employees through onboarding, training, and access to necessary resources.<br/><br/>Handle bookkeeping tasks, including categorizing expenses, running monthly P&amp;L statements, reconciling expenses, and liaising with the CPA.<br/><br/><strong>Job Requirements<br/><br/></strong>3 years of experience as an Office Administrator or Executive Assistant.<br/><br/>Exceptional professional writing skills with a strong grasp of English grammar and punctuation.<br/><br/>Proficiency in Microsoft Office (Excel, PowerPoint, Outlook) and QuickBooks, with a general background in accounting.<br/><br/>Demonstrated initiative and self-starting abilities.<br/><br/>Excellent communication skills, both written and verbal.<br/><br/>Strong organizational skills with attention to detail and ability to manage multiple projects.<br/><br/>A collaborative and team-oriented approach with a strong sense of integrity and professionalism.<br/><br/>An interest or background in financial statement analysis, business valuation, accounting, and finance is a plus.<br/><br/>Familiarity with legal jargon (preparing, editing, managing legal documents) is preferred.<br/><br/>A reliable form of transportation is required.<br/><br/><strong>Education<br/><br/></strong>Bachelor's degree, preferably in Finance, Economics, or Business Administration.<br/><br/><strong>Employment Type<br/><br/></strong>Full-time<br/><br/>In-office, 5 days a week<br/><br/><strong>Compensation<br/><br/></strong>$20-$25/hour to start, with 40 hours per week<br/><br/>$55,000 annually after a 90-day trial period, plus ample bonus opportunities. Previous individuals in this role have earned over $100,000 yearly.<br/><br/><strong>About Us<br/><br/></strong>We are a boutique commercial real estate firm specializing in innovative capital solutions for real estate developers and investors. Our team is known for its dedication, creativity, and collaborative spirit. Despite market challenges, we've experienced significant growth and are looking for a passionate and driven individual to join our close-knit team.<br/><br/>Employment Type: Full-Time", "responsibilities": "Draft and manage correspondence, including contracts, recruitment materials, and employee documents.<br/><br/>Respond swiftly and appropriately to emerging situations, manage multiple high-priority tasks, and make decisions with minimal oversight.<br/><br/>Coordinate complex scheduling and calendar management, ensuring the smooth flow of information to senior leadership.<br/><br/>Support the MD with business and personal tasks, including meeting preparations and travel arrangements.<br/><br/>Ensure timely approval and payment of invoices.<br/><br/>Maintain a high level of professionalism and confidentiality in all dealings.<br/><br/>Support employees through onboarding, training, and access to necessary resources.<br/><br/>Handle bookkeeping tasks, including categorizing expenses, running monthly P&amp;L statements, reconciling expenses, and liaising with the CPA.", "qualifications": {"required": "3 years of experience as an Office Administrator or Executive Assistant.<br/><br/>Exceptional professional writing skills with a strong grasp of English grammar and punctuation.<br/><br/>Proficiency in Microsoft Office (Excel, PowerPoint, Outlook) and QuickBooks, with a general background in accounting.<br/><br/>Demonstrated initiative and self-starting abilities.<br/><br/>Excellent communication skills, both written and verbal.<br/><br/>Strong organizational skills with attention to detail and ability to manage multiple projects.<br/><br/>A collaborative and team-oriented approach with a strong sense of integrity and professionalism.", "preferred": "An interest or background in financial statement analysis, business valuation, accounting, and finance is a plus.<br/><br/>Familiarity with legal jargon (preparing, editing, managing legal documents) is preferred.<br/><br/>A reliable form of transportation is required."}, "skills": ["Microsoft Office", "QuickBooks", "Accounting", "Communication", "Organization"], "postedDate": "1 week ago", "benefits": null, "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4000733296"}