{"jobTitle": "Logistics Coordinator", "company": {"name": "Robert Half", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "22.80/hr - 26.40/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "We are seeking a Logistics Coordinator to join our team in Long Beach, California. The position is part of the logistics industry and will be based in an office setting. This role provides an opportunity for contract to hire employment and involves duties such as data entry and managing customer accounts.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Review and process driver manifests, applying additional charges as approved by the dispatch department.</li><li> Monitor and maintain the accuracy of driver settlement payments.</li><li> Conduct daily audits of driver manifests to ensure accuracy and identify any discrepancies.</li><li> Manage and update owner operator rate tables and payable setup in the Transportation Management System.</li><li> Perform data export for settlement transaction transfer for accounting driver settlement payment processing.</li><li> Assist in resolving any payment disputes with Owner/Operators.</li><li> Maintain and manage both physical and digital office documents and filing systems.</li><li> Collaborate with Driver Relations to follow up on missing documentation.</li><li> Assist in training on driver manifest/document upload.</li><li> Monitor customer accounts and take appropriate action based on account status.</li><li> Maintain proficiency in the company’s Transportation Management System, particularly the driver settlements and dispatch applications.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li> Minimum of 1 year of experience in a logistics or related role</li><li> Proficiency in data entry tasks</li><li> Ability to manage customer accounts effectively</li><li> Exceptional customer service skills</li><li> Experience in handling export and import customer service</li><li> Ability to multitask and prioritize work according to changing business needs</li><li> Strong communication and interpersonal skills</li><li> Proficiency in using logistics software and systems</li><li> Ability to work independently and as part of a team</li><li> Willingness to learn and adapt to new processes and technologies</li><li> Ability to handle stress and maintain professionalism under pressure</li><li> Good problem-solving and decision-making skills</li><li> High level of attention to detail and accuracy</li><li> Basic knowledge of supply chain processes and principles.<br/><br/></li></ul>Robert Half is the world’s first and largest specialized talent solutions firm that connects highly qualified job seekers to opportunities at great companies. We offer contract, temporary and permanent placement solutions for finance and accounting, technology, marketing and creative, legal, and administrative and customer support roles.<br/><br/>Robert Half works to put you in the best position to succeed. We provide access to top jobs, competitive compensation and benefits, and free online training. Stay on top of every opportunity - whenever you choose - even on the go.<br/><br/>All applicants applying for U.S. job openings must be legally authorized to work in the United States. Benefits are available to contract/temporary professionals, including medical, vision, dental, and life and disability insurance. Hired contract/temporary professionals are also eligible to enroll in our company 401(k) plan. Visit<br/><br/>© 2024 Robert Half. An Equal Opportunity Employer. M/F/Disability/Veterans. By clicking “Apply Now,” you’re agreeing to", "responsibilities": "Review and process driver manifests, applying additional charges as approved by the dispatch department. Monitor and maintain the accuracy of driver settlement payments. Conduct daily audits of driver manifests to ensure accuracy and identify any discrepancies. Manage and update owner operator rate tables and payable setup in the Transportation Management System. Perform data export for settlement transaction transfer for accounting driver settlement payment processing. Assist in resolving any payment disputes with Owner/Operators. Maintain and manage both physical and digital office documents and filing systems. Collaborate with Driver Relations to follow up on missing documentation. Assist in training on driver manifest/document upload. Monitor customer accounts and take appropriate action based on account status. Maintain proficiency in the company’s Transportation Management System, particularly the driver settlements and dispatch applications.", "qualifications": {"required": "Minimum of 1 year of experience in a logistics or related role, Proficiency in data entry tasks, Ability to manage customer accounts effectively, Exceptional customer service skills, Experience in handling export and import customer service, Ability to multitask and prioritize work according to changing business needs, Strong communication and interpersonal skills, Proficiency in using logistics software and systems, Ability to work independently and as part of a team, Willingness to learn and adapt to new processes and technologies, Ability to handle stress and maintain professionalism under pressure, Good problem-solving and decision-making skills, High level of attention to detail and accuracy, Basic knowledge of supply chain processes and principles."}, "skills": ["Data Entry", "Customer Service", "Logistics", "Transportation Management System", "Supply Chain"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000820721"}