{"jobTitle": "Account Manager, Physician Relations", "company": {"name": "Prenuvo", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "About Us\n\nAt Prenuvo, we are on a mission to flip the paradigm from reactive \"sick-care\" to proactive health care. Our award-winning whole body scan is fast (under 1 hour), safe (MRI has no ionizing radiation), and non-invasive (no contrast). Our unique integrated stack of optimized hardware, software, and increasingly AI, coupled with the patient-centric experience of our clinics across North America, have allowed us to lead the charge against \"we caught it too late again.\" Prenuvo operates preventative screening clinics in Vancouver, Silicon Valley, Dallas, Boca Raton, Minneapolis, Los Angeles, New York City, Bethesda, and Chicago, with more clinics in North America and internationally in the next 2 years.\n\nThe Opportunity\n\nWe are looking for an Account Manager, Physician Relations to join our Los Angeles Team!  As the Account Manager, you'll serve as the daily point of contact and relationship manager for our most important partners to ensure their long-term success. The Account Manager will be leading our outreach efforts in Los Angeles and will be responsible for developing their own book of business via the creation of a physician referral network. Help reshape the world through proactive healthcare while working with cutting-edge technology and high performing teams with deep expertise - join us to make a difference in people's lives!\n\nWhat You'll Do\n\n<ul><li>Serve as the primary liaison between the organization and physician practices, hospitals, and other healthcare providers to build and maintain positive relationships</li><li>Source and research leads that match the clinical profile of a physician partner</li><li>Prospecting within an assigned geographic area to generate new physician partnership opportunities</li><li>Develop and implement strategic plans to expand physician networks, increase patient referrals, and maximize revenue opportunities</li><li>Provide Prenuvo's internal teams with appropriate insights into the client's strategic business initiatives</li><li>Develop and implement account penetration strategies to create new opportunities for deeper collaboration and growth</li><li>Significantly grow the client relationship in terms of revenue generated and account profitability</li><li>Understand Prenuvo's Value Proposition and clearly articulate this to customers, providing solutions to grow profitable sales </li><li>Coordinate and lead meetings with physicians and other healthcare providers to address concerns and ensure satisfaction.</li><li>Adhere to company sales and pricing guidelines</li><li>Document, analyze and understand impact of customer-focused activities to increase productivity and develop insights for future cross/ up-selling opportunities</li><li>Maintain a strong understanding of the industry and client needs; cultivate a core book of business for consistent and repeated sales - aimed at long term growth</li><li>Collaborate with team members to secure the terms of sale, including negotiating pricing, implementation timeline mapping, and more</li><li>Track, analyze and update internal tracking and reporting systems throughout the day to maintain accuracy in sales, volume metrics and trends</li><li>Provide timely and accurate reporting on physician relations activities and outcomes</li><li>Participate in professional organizations and attend relevant conferences and events to stay up-to-date on industry trends and best practices<br/><br/></li></ul>What You'll Bring\n\n<ul><li>3-5 years experience in a quota carrying sales role and/or an account management role</li><li>At least 2 years of experience in healthcare/healthtech in provider relations, account management, or customer success role preferably in a hospital, clinic, medical imaging center or healthcare organization setting</li><li>Knowledge of healthcare regulations and compliance standards</li><li>Ability to communicate in an organized, clear and concise manner to effectively express ideas, plans, actions and projects to support customer needs</li><li>Self-motivated, possessing a high energy level and a desire to achieve goals beyond what is required</li><li>Business acumen around opportunity management and customer planning</li><li>Technological capabilities and understanding how to communicate in today's business environment</li><li>Ability to listen, gain trust and bring to closure on an action, project, resolution or sales with customers</li><li>Ability to maintain a plan of action until desired results are achieved</li><li>Nice to have:</li><ul><li>Knowledge of preventative healthcare and MRI technology is a plus</li><li>Experience with Salesforce or other CRM software is a plus</li><li>Bachelor's degree in Healthcare Administration, Business Administration, or a related field - pre-requisite experience will be considered<br/><br/><br/></li></ul></ul>Our Values \n\n\n\nFirst: we are Pioneers\n\n<ul><li>Transforming healthcare requires divergent thinking, bias for action, disciplined experimentation, and consistent grit and determination to maintain momentum. This journey is as challenging as it is rewarding.<br/><br/></li></ul>Second: we are Platform-Builders\n\n<ul><li>We're always building foundations that allow us to achieve tomorrow more than we did today. We never lose sight of what's ahead – in a mindset of ownership and duty to our mission.<br/><br/></li></ul>Above all: we are Patients\n\n<ul><li>We could all be the next person who walks through our very doors, seeking clarity or peace of mind. We are proud of our impact on our patients' lives, and we won't stop till everyone can benefit from our work.<br/><br/><br/><br/></li></ul>What We Offer\n\n<ul><li>An avenue to make a positive impact on people's lives and their health</li><li>We believe in preventative healthcare for everyone, including our team - Prenuvo provides free, whole-body scans to each team member </li><li>Growth opportunities are at the heart of our people journey, we're doing big things with bright minds - there is no single path to success, it can be shaped along the way</li><li>Building strong relationships is at the core of everything we do - our team gets together each week to connect, share, and socialize </li><li>Recognizing time away to restore is vital to our wellbeing - we have a flexible vacation policy and we will encourage you to use it</li><li>We offer a comprehensive benefits package including health, dental, vision, including Mental Health coverage, to support you and your family</li><li>The base salary for this role ranges from $60,000-$80,000 with OTE of up to $200,000 in local currency <br/><br/></li></ul><em>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em>", "responsibilities": "Serve as the primary liaison between the organization and physician practices, hospitals, and other healthcare providers to build and maintain positive relationships\nSource and research leads that match the clinical profile of a physician partner\nProspecting within an assigned geographic area to generate new physician partnership opportunities\nDevelop and implement strategic plans to expand physician networks, increase patient referrals, and maximize revenue opportunities\nProvide Prenuvo's internal teams with appropriate insights into the client's strategic business initiatives\nDevelop and implement account penetration strategies to create new opportunities for deeper collaboration and growth\nSignificantly grow the client relationship in terms of revenue generated and account profitability\nUnderstand Prenuvo's Value Proposition and clearly articulate this to customers, providing solutions to grow profitable sales \nCoordinate and lead meetings with physicians and other healthcare providers to address concerns and ensure satisfaction.\nAdhere to company sales and pricing guidelines\nDocument, analyze and understand impact of customer-focused activities to increase productivity and develop insights for future cross/ up-selling opportunities\nMaintain a strong understanding of the industry and client needs; cultivate a core book of business for consistent and repeated sales - aimed at long term growth\nCollaborate with team members to secure the terms of sale, including negotiating pricing, implementation timeline mapping, and more\nTrack, analyze and update internal tracking and reporting systems throughout the day to maintain accuracy in sales, volume metrics and trends\nProvide timely and accurate reporting on physician relations activities and outcomes\nParticipate in professional organizations and attend relevant conferences and events to stay up-to-date on industry trends and best practices", "qualifications": {"required": "3-5 years experience in a quota carrying sales role and/or an account management role\nAt least 2 years of experience in healthcare/healthtech in provider relations, account management, or customer success role preferably in a hospital, clinic, medical imaging center or healthcare organization setting\nKnowledge of healthcare regulations and compliance standards\nAbility to communicate in an organized, clear and concise manner to effectively express ideas, plans, actions and projects to support customer needs\nSelf-motivated, possessing a high energy level and a desire to achieve goals beyond what is required\nBusiness acumen around opportunity management and customer planning\nTechnological capabilities and understanding how to communicate in today's business environment\nAbility to listen, gain trust and bring to closure on an action, project, resolution or sales with customers\nAbility to maintain a plan of action until desired results are achieved", "preferred": "Knowledge of preventative healthcare and MRI technology is a plus\nExperience with Salesforce or other CRM software is a plus\nBachelor's degree in Healthcare Administration, Business Administration, or a related field - pre-requisite experience will be considered"}, "skills": ["Sales", "Account Management", "Healthcare", "Healthtech", "Provider Relations", "Customer Success", "Healthcare Regulations", "Compliance", "Communication", "Business Acumen", "Opportunity Management", "Customer Planning", "Technology", "Salesforce", "CRM"], "postedDate": "1 week ago", "benefits": "An avenue to make a positive impact on people's lives and their health\nWe believe in preventative healthcare for everyone, including our team - Prenuvo provides free, whole-body scans to each team member \nGrowth opportunities are at the heart of our people journey, we're doing big things with bright minds - there is no single path to success, it can be shaped along the way\nBuilding strong relationships is at the core of everything we do - our team gets together each week to connect, share, and socialize \nRecognizing time away to restore is vital to our wellbeing - we have a flexible vacation policy and we will encourage you to use it\nWe offer a comprehensive benefits package including health, dental, vision, including Mental Health coverage, to support you and your family\nThe base salary for this role ranges from $60,000-$80,000 with OTE of up to $200,000 in local currency ", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000587726"}