{"jobTitle": "Lead, Shipping and Logistics", "company": {"name": "Relativity Space", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "39.74/hr - 51.42/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing", "description": "At Relativity Space, we have two audacious goals: to build the next great commercial launch company with Terran R and to become America's leading force in additive manufacturing innovation. Both contribute to our long-term vision of creating humanity’s industrial base on Mars, paving the way for interplanetary life to expand the possibilities of the human experience. This journey begins right here on Earth – where we design, build, and fly rockets to deliver customer payloads to orbit. Terran R, our medium-to-heavy lift reusable rocket, fulfills the growing demand for launch capacity, thanks to our iterative approach that accelerates design, testing, and development while minimizing costs. While our groundbreaking research and development in 3D printing pushes the boundaries of large-scale additive manufacturing.<br/><br/>Your journey with us is more than just a job – it’s an opportunity to shape the future of aerospace technology, additive manufacturing, and the human experience alongside a community of passionate, creative individuals. Join us on this extraordinary journey, as we work together to transform our vision into reality.<br/><br/><strong>About The Team<br/><br/></strong>Supply Chain at Relativity Space is responsible for designing, implementing, and optimizing the end-to-end supply chain networks required to manufacture, test, and launch the cutting edge next generation reusable launch vehicle - Terran R. Within the Supply Chain org, the Materials Management team is responsible for the physical and systematic movement of inventory, including all operations related to shipping, receiving, logistics, inventory control, material handling, and production control. As a part of the Materials Management team, you will ultimately be responsible for inventory accuracy and ensuring efficient and timely material movement. In this role, you will become a subject matter expert on the enterprise systems we use (ERP, MES, etc.) and you will interact with a number of cross-functional stakeholders and internal customers spanning various workcenters, including but not limited to: Avionics, propulsion, machine shop, tube shop, additive, and structures &amp; integration. To thrive in this position, we seek candidates who possess strong problem-solving skills, can navigate ambiguity with ease, and exhibit a process-oriented mindset. We look forward to welcoming an exceptional candidate to our team.<br/><br/><strong>About The Role<br/><br/></strong><em><strong>This individual will be supporting logistics operations at Relativity Space between 11:30am-8pm.<br/><br/></strong></em><ul><li>Lead and manage Shipping and Logistics Specialists who support dock to stock operations including offloading, tracking, delivery and shipping operations</li><li>Coordinate daily shipping and receiving operations in accordance with material, labor, and equipment availability</li><li>Manage the daily workflow by assigning responsibilities and preparing schedules</li><li>Manage inbound/outbound transportation, while supporting receiving, and inventory control processes to streamline operations and minimize lead times</li><li>Spend ~50-75% of your time on lead duties and the remaining time working as an individual contributor, with this breakdown being subject to change depending on the needs of the business</li><li>Shift scheduling, timecards, OT management</li><li>Ensure KPIs / metrics are met, providing recommendations for improved metrics</li><li>Establishes and optimizes Shipping and Logistics processes</li><li>Coaching employees on day-to-day performance and is 1st point of contact for escalations<br/><br/></li></ul><strong>About You<br/><br/></strong><ul><li>High school diploma or equivalent</li><li>3+ years of experience in a Logistics Role within aerospace manufacturing or relevant field</li><li>2+ years of experience with ERP, MES and/or WMS software</li><li>3+ years of international shipping, HS Code, ECCN</li><li>Proficient communication skills across multiple platforms (email, Slack, etc.)</li><li>Extensive experience interacting with engineering, supply chain, and technicians</li><li>Strong computer skills; proficient with Microsoft Office</li><li>Flexible schedule and ability to work non-standard shifts, overtime, and weekends as required</li><li>Attention to EHS guidelines<br/><br/></li></ul><strong>Nice To Haves But Not Required<br/><br/></strong><ul><li>5+ years of experience in a Logistics Role within aerospace manufacturing or relevant field</li><li>2+ years of experience leading or managing a team of logistics personnel</li><li>Experience in aerospace or automotive environments</li><li>Knowledge of International shipping, HS Code, ECCN</li><li>Ability to thrive in ambiguity and to adapt in a dynamic environment</li><li>Well-versed in hands-on process development and first-time manufacturing efforts</li><li>Highly organized and able to provide structure and direction to the previously undefined</li><li>Self-starter that has demonstrated the ability to define and own a process from scratch and roll out that process through adept communication to a diverse team<br/><br/></li></ul><strong>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br/><br/></strong>At Relativity Space, we are committed to transparency and fairness in our compensation practices. Actual compensation will be determined based on experience, qualifications, and other job-related factors.<br/><br/>Compensation is only one part of our total rewards package. Relativity Space offers competitive salary and equity, a generous PTO and sick leave policy, parental leave, an annual learning and development stipend, and more! To see some of the benefits &amp; perks we offer, please visit here.<br/><br/><strong>Hiring Range<br/><br/></strong>$39.74—$51.42 USD", "responsibilities": "<ul><li>Lead and manage Shipping and Logistics Specialists who support dock to stock operations including offloading, tracking, delivery and shipping operations</li><li>Coordinate daily shipping and receiving operations in accordance with material, labor, and equipment availability</li><li>Manage the daily workflow by assigning responsibilities and preparing schedules</li><li>Manage inbound/outbound transportation, while supporting receiving, and inventory control processes to streamline operations and minimize lead times</li><li>Spend ~50-75% of your time on lead duties and the remaining time working as an individual contributor, with this breakdown being subject to change depending on the needs of the business</li><li>Shift scheduling, timecards, OT management</li><li>Ensure KPIs / metrics are met, providing recommendations for improved metrics</li><li>Establishes and optimizes Shipping and Logistics processes</li><li>Coaching employees on day-to-day performance and is 1st point of contact for escalations<br/><br/></li></ul>", "qualifications": {"required": "High school diploma or equivalent\n3+ years of experience in a Logistics Role within aerospace manufacturing or relevant field\n2+ years of experience with ERP, MES and/or WMS software\n3+ years of international shipping, HS Code, ECCN\nProficient communication skills across multiple platforms (email, Slack, etc.)\nExtensive experience interacting with engineering, supply chain, and technicians\nStrong computer skills; proficient with Microsoft Office\nFlexible schedule and ability to work non-standard shifts, overtime, and weekends as required\nAttention to EHS guidelines<br/><br/>", "preferred": "5+ years of experience in a Logistics Role within aerospace manufacturing or relevant field\n2+ years of experience leading or managing a team of logistics personnel\nExperience in aerospace or automotive environments\nKnowledge of International shipping, HS Code, ECCN\nAbility to thrive in ambiguity and to adapt in a dynamic environment\nWell-versed in hands-on process development and first-time manufacturing efforts\nHighly organized and able to provide structure and direction to the previously undefined\nSelf-starter that has demonstrated the ability to define and own a process from scratch and roll out that process through adept communication to a diverse team<br/><br/>"}, "skills": ["ERP", "MES", "WMS", "International Shipping", "HS Code", "ECCN", "Communication", "Microsoft Office"], "postedDate": "1 week ago", "benefits": "Relativity Space offers competitive salary and equity, a generous PTO and sick leave policy, parental leave, an annual learning and development stipend, and more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000847129"}