{"jobTitle": "Staff Accountant", "company": {"name": "Lavi Industries", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "70,000.00/yr - 80,000.00/yr", "currency": "USD"}, "jobFunction": "Accounting/Auditing", "industry": "Retail Office Equipment and Manufacturing", "description": "<strong>Job Overview:</strong> <br/>The Staff Accountant will be responsible for performing a variety of accounting tasks, including but not limited to, preparing financial reports, managing accounts payable and receivable, reconciling accounts, and assisting with budgeting and forecasting processes. The Staff Accountant will ensure accuracy and compliance with accounting standards and regulations while supporting the finance team in daily operations.<br/><strong>Responsibilities:</strong><ul><li>Process, administer and manager contracts including monthly contract reporting</li><li>Full cycle Accounts Receivable from invoicing to collections</li><li>Accounts Payable processing – match, code and voucher creation</li><li>Prepare month-end journal entries and reconciliations</li><li>Prepared Annual review supporting schedules</li><li>Assist with sales and use tax filings</li><li>Assist with monthly financial reporting</li></ul><br/><strong>Requirements:</strong><ul><li>Bachelor’s degree in accounting or related required. 2-3 years’ work experience preferred. Recent college grad will be considered</li><li>Previous experience in SaaS company preferred</li><li>Strong data analysis skills</li><li>Strong attention to detail</li><li>Can work self-directed with limited supervision and is a self-starter</li></ul><br/><em>Qtrac (a sister company of Lavi Industries) is committed to the employment and advancement of minorities, females, individuals with disabilities, and veterans. We are an equal opportunity employer and do not discriminate in hiring or employment on the basis of race, color, religion, sex, national origin, ancestry, citizenship status, age, marital status, disability, veteran status, sexual orientation, genetic information or any other characteristic protected by applicable law.</em>", "responsibilities": "Process, administer and manager contracts including monthly contract reportingFull cycle Accounts Receivable from invoicing to collectionsAccounts Payable processing – match, code and voucher creationPrepare month-end journal entries and reconciliationsPrepared Annual review supporting schedulesAssist with sales and use tax filingsAssist with monthly financial reporting", "qualifications": {"required": "Bachelor’s degree in accounting or related required. 2-3 years’ work experience preferred. Recent college grad will be consideredPrevious experience in SaaS company preferredStrong data analysis skillsStrong attention to detailCan work self-directed with limited supervision and is a self-starter", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4000280605"}