{"jobTitle": "Licensed Psychiatric Nurse Practitioner", "company": {"name": "Headway", "industry": "Mental Health Care", "size": "Not specified", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Remote", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Between $144-$222 an hour", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Mental Health Care", "description": "Remote Licensed Psychiatric Nurse Practitioner\n\nWage: Between $144-$222 an hour\n\nAre you a licensed Psychiatric Nurse looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance!\n\nHeadway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing private practice.\n\nMental health clinicians use Headway in a number of ways, ranging from conducting psychotherapy sessions with patients to providing and overseeing medication management. Whether you're new to private practice or already have an established practice of your own, we’re excited to support you in reaching your goals!\n\nBy joining the Headway community, we’ll help you:\n\n- Accept insurance hassle-free by credentialing you with the nation’s largest networks and handling the billing and admin paperwork for you.\n- Maintain a flexible schedule by deciding how many clients you see through Headway, so that you can set the hours that work for you.\n- Grow your caseload by providing marketing support and patient referrals.\n\nWe’ll also support your patients by\n\n- Providing customized support to clinicians and patients in order to streamline the process of both seeking and providing care.\n- Verifying client insurance benefits instantly and automatically, so that access to care is never delayed, and you can see your patients with confidence.\n\nAnd we do this completely free of charge to you! Headways is a flexible service, meaning your hours are yours to set, and it’s up to you whether you see your patients in-person or remotely via telehealth while working from home.\n\nWe accept the following licenses on a state by state basis:\n\n- APRN-CNP / APRN-FPA / APRN-PA\n- APN\n- PMHNP-BC\n- NP\n\nReady to get started?\n\nWe are excited to begin helping you if you are a fully-licensed, ANCC board-certified Psychiatric Nurse Practitioner with:\n\n- A valid NPI number\n- Malpractice insurance\n- A DEA or CDS number\n- CAQH\n\nPlease note, at this time, we are unable to service mental health professionals that are not fully licensed. Your application will be rejected until you obtain a valid license.\n\nNot sure if you’re qualified to work with us? Send in your application and our team will do our best to help.", "responsibilities": "Not specified", "qualifications": {"required": "Fully-licensed, ANCC board-certified Psychiatric Nurse Practitioner with a valid NPI number, malpractice insurance, a DEA or CDS number, and CAQH.", "preferred": "Not specified"}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4000873917"}