{"jobTitle": "Manager, Supply Chain and Planning", "company": {"name": "Triple H Food Processors", "location": "Riverside, CA"}, "location": "Riverside, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Food and Beverage Services", "description": "<strong>Company Description</strong>\nTriple H Food Processors is a food & beverage manufacturing plant located in Riverside, California. We have a second plant, Pacific Choice Brands, in Fresno, California. Both facilities focus on quality food production.\n<br/>\n<strong>Role Description</strong>\nThis is a full-time on-site role for a Manager, Supply Chain and Planning at Triple H Food Processors in Riverside, CA. The Manager will be responsible for demand planning, supply and inventory management, procurement, and utilizing analytical skills to optimize the supply chain process.\n<br/>\n<strong>Qualifications</strong>\n<ul><li><strong>Demand Planning & Supply Management:</strong> Expertise in forecasting, inventory management, and developing strategies to optimize supply chain efficiency.</li><li><strong>Analytical Proficiency:</strong> Strong ability to interpret data for demand forecasting and inventory planning.</li><li><strong>Procurement Mastery:</strong> Extensive experience in sourcing, vendor management, and negotiating purchasing agreements to ensure material and product specifications are met.</li><li><strong>Supply Chain Optimization:</strong> Proven track record in process improvement and implementing best practices to enhance efficiency and reduce costs.</li><li><strong>Organizational & Communication Skills:</strong> Highly organized with strong written and verbal communication abilities, adept at cross-functional collaboration to close operational gaps.</li><li><strong>ERP Systems Expertise:</strong> In-depth knowledge of ERP systems, particularly SYSPRO and NetSuite, including implementation, training, and support.</li><li><strong>Educational Background:</strong> Bachelor’s degree in Supply Chain Management, Business Administration, or related field.</li><li><strong>Industry Experience:</strong> Minimum 15+ years in supply chain and planning, with a focus on food manufacturing.</li></ul><br/>\n<strong>Qualifications</strong>\n<ul><li><strong>Strategic Supply Chain Management:</strong> Develop and implement strategies that optimize supply chain operations, increase efficiency, and speed up processes.</li><li><strong>Team Leadership & Development:</strong> Lead the supply chain team, ensuring best practices are executed and performance is measured through Key Performance Indicators (KPIs). Provide training and mentorship to staff, reinforcing safety guidelines and promoting continuous improvement.</li><li><strong>End-to-End Supply Chain Ownership:</strong> Manage all aspects of the supply chain from procurement to distribution, ensuring alignment with the Sales & Operations Planning (S&OP) process.</li><li><strong>Inventory & Demand Management:</strong> Establish and manage demand forecasting, capacity planning, and inventory control to align with production schedules and market demand. Ensure accuracy of inventory levels and optimize working capital.</li><li><strong>Cross-Functional Collaboration:</strong> Work closely with sales, production, logistics, and other departments to ensure seamless operations and effective interdepartmental communication.</li><li><strong>Process Improvement & Cost Efficiency:</strong> Identify and drive initiatives for continuous improvement, cost savings, and efficiency gains. Ensure data integrity and compliance with industry regulations.</li><li><strong>ERP & System Management:</strong> Act as the process owner for ERP Supply Chain modules, leading the deployment of new modules and driving the Sales & Operations Planning process.</li><li><strong>Supplier & Vendor Management:</strong> Source and negotiate with key suppliers to ensure a reliable supply of materials, meeting all specifications. Manage supplier documentation to maintain compliance with BRC standards.</li><li><strong>Reporting & Analysis:</strong> Regularly report on department KPIs, including Demand Plan Accuracy, Customer Service Levels, Working Capital, and Distribution Expenses. Provide analysis and implement countermeasures where necessary.</li></ul><br/>\n<strong>Additional</strong>\n<ul><li><strong>Safety & Compliance:</strong> Ensure all operations comply with safety regulations and industry standards. Report and manage accidents and injuries, ensuring proper treatment protocols are followed.</li><li><strong>Warehouse & Logistics Optimization:</strong> Oversee warehouse functions and manage relationships with third-party logistics providers to ensure cost-effective distribution solutions.</li><li><strong>Communication & Negotiation:</strong> Handle communications with suppliers and negotiate terms to optimize supply chain operations.</li><li><strong>Process Owner:</strong> Own the process for demand planning, capacity planning, and supply management, ensuring alignment across the organization.</li></ul><br/>\n<strong>Education</strong><span> </span>\n<ul><li><strong>Bachelors in Business, Supply Chain Planning, or Equivalent</strong></li><li><strong>MBA or BS in Statistics, preferred</strong></li></ul><br/>\n<strong>Legal Work Eligibility:</strong> Applicants must be legally authorized to work in the United States without sponsorship for employment visa status.\n<br/>\nTriple H Foods and Pacific Choice Brands are Equal Opportunity Employers. We celebrate diversity and are committed to creating an inclusive environment for all employees. We do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other characteristic protected by applicable federal, state, or local law.\n<br/>\n<strong>Our Core Values </strong>\n<span>Safety, Food Safety, Quality and Productivity</span><br/>", "postedDate": "1 week ago", "skills": ["Demand Planning", "Supply Chain Management", "Inventory Management", "Procurement", "Vendor Management", "ERP Systems", "SYSPRO", "NetSuite", "Process Improvement", "Team Leadership", "Sales & Operations Planning", "Capacity Planning", "Cross-Functional Collaboration", "Cost Efficiency", "Data Integrity", "Safety & Compliance", "Warehouse Management", "Logistics Optimization", "Communication", "Negotiation", "Statistics"], "url": "https://www.linkedin.com/jobs/view/4000500404"}