{"jobTitle": "Human Resources Director", "company": {"name": "Round-Peg Solutions (RPS)", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$177,700.00/yr - $228,300.00/yr", "currency": "USD"}, "jobFunction": "Human Resources, Management, and Strategy/Planning", "industry": "Staffing and Recruiting, Aviation and Aerospace Component Manufacturing, and Defense and Space Manufacturing", "description": "Are you a Human Resource Director with a background in Aerospace & Defense manufacturing?\nAre you looking for a progressive role that can lead to global HR leadership positions within a multi-billion-dollar company? \n<br/>\nOur exclusive client, a multi-billion-dollar Aerospace & Defense manufacturing organisation, is seeking a HR Director to lead a talented HR team, driving both tactical execution and strategic initiatives to attract, develop, and retain top talent. As a strategic partner to the senior leadership team, your expertise will shape the future of the organisation, aligning people strategies with business goals to drive business performance.\n<br/>\n**Responsibilities of the HR Director:**\n<ul><li>**Strategic Business Partner:** Serve as a key business partner to senior leadership, influencing and developing people strategies that drive business success.</li><li>**Successful Leadership:** Perform the role of a successful HR leader to a large HR Management and Talent Acquisition team to lead the way in people-focused initiatives</li><li>**Talent Management:** Anticipate industry trends, leading efforts in recruiting, retention, and workforce productivity. Build a pipeline of future leaders through robust succession planning and talent development initiatives.</li><li>**Organizational Effectiveness:** Champion change management, performance management, and diversity & inclusion programs to foster a high-performing, inclusive culture.</li><li>**HR Excellence:** Leverage data analytics to inform decisions, track HR metrics, and provide actionable insights to senior management.</li><li>**Muti-site HR Leadership:** Mentor and guide the local HR teams, maximizing their potential and driving continuous improvement in HR practices.</li></ul><br/>\n**Requirements of the HR Director**\n<ul><li>Bachelor’s degree with 10+ years of progressive HR experience in manufacturing, including 5+ years at management level (ideally within aerospace or defence).</li><li>A track record of success in strategic HR leadership, with a deep understanding of employment laws, workforce trends, and talent management in a complex environment.</li><li>Strength of character with exceptional influencing, communication, and analytical skills, with the ability to drive results in a fast-paced, matrixed organization.</li><li>A proven history of partnering with senior leadership in a complex, large organization to enable successful business operations through strong HR leadership </li></ul><br/>\nIf you are a Human Resource Director looking for a role that can offer genuine career progression on a global scale, where you can make a significant impact upon the future direction of a growing, multi-billion-dollar organization, please apply today. \nSuitable candidates will be contacted within 24 hours!", "responsibilities": "Serve as a key business partner to senior leadership, influencing and developing people strategies that drive business success. Perform the role of a successful HR leader to a large HR Management and Talent Acquisition team to lead the way in people-focused initiatives. Anticipate industry trends, leading efforts in recruiting, retention, and workforce productivity. Build a pipeline of future leaders through robust succession planning and talent development initiatives. Champion change management, performance management, and diversity & inclusion programs to foster a high-performing, inclusive culture. Leverage data analytics to inform decisions, track HR metrics, and provide actionable insights to senior management. Mentor and guide the local HR teams, maximizing their potential and driving continuous improvement in HR practices.", "qualifications": {"required": "Bachelor’s degree with 10+ years of progressive HR experience in manufacturing, including 5+ years at management level (ideally within aerospace or defence). A track record of success in strategic HR leadership, with a deep understanding of employment laws, workforce trends, and talent management in a complex environment. Strength of character with exceptional influencing, communication, and analytical skills, with the ability to drive results in a fast-paced, matrixed organization. A proven history of partnering with senior leadership in a complex, large organization to enable successful business operations through strong HR leadership "}, "skills": [], "postedDate": "1 week ago", "benefits": "401(k), Dental insurance, Vision insurance, Medical insurance, Pension plan", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000556447"}