{"jobTitle": "Planning Analyst", "company": {"name": "Kimley-Horn", "location": "Orange, CA"}, "location": "Orange, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "83,000 - 89,500", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Civil Engineering", "description": "<strong>Overview<br/><br/></strong>Kimley-Horn is looking for Planning graduates to join our Orange,CA office! This is not a remote position.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Contribute to the pre-construction planning, modification, permitting, and analysis for multiple projects ranging in size and scope.</li><li>Solve complex problems, assist project managers, and collaborate across disciplines to produce our clients’ visions for the future built environment.</li><li>Develop familiarity with the federal, state, and local regulations, as well as Kimley-Horn’s and our client’s practices, procedures, and standards.</li><li>Evaluate development proposals to identify compliance with zoning regulations.</li><li>Prepare planning and land use studies. </li><li>Coordinate with various municipal and state agencies. </li><li>Gain exposure to diverse project experiences as we provide services to both the public and private sectors.</li><li>Help prepare Environmental Quality Act documents, environmental impact reports, and negative and mitigated negative declarations</li><li>Assist in Specific Plans, Master Plans, and other environmental or planning policy documents in support of a full range of infill and/or land development related projects</li><li>Will likely gain expertise in: CEQA/NEPA, sustainability, climate action planning, ENVISION, LEED, and Salmon-Safe </li><li>Working with infrastructure projects from across industries such as transportation, transit, land planning, aviation<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>A Planning Degree (Bachelors or Masters) from an accredited program by Summer of 2025 in these majors:</li><ul><li>City and Regional Planning </li><li>Urban Planning</li><li>Transportation Planning </li><li>Environmental Science/Sustainability/Management </li><li> Or Other Related Major <br/></li></ul></ul>Salary Range: $83,000 - 89,500<br/><br/><strong> Why Kimley-Horn? <br/><br/></strong>As an Analyst with Kimley-Horn, you will benefit from hands-on experience, technical software and consulting trainings, and developmental programs geared towards growing Kimley-Horn’s future leaders. We expect Analysts to one day achieve licensure in their field and provide financial resources to help you succeed. You will also gain exposure to managing tasks and client relationships.<br/><br/>We believe mentorship should be formed naturally and organically. Kimley-Horn provides ample opportunities to facilitate the best mentor relationships for you! These opportunities include, but are not limited to, employee resource groups, lunch and learns, networking events, national training programs, volunteer events, and social outings.<br/><br/>At Kimley-Horn, we do things differently. People, clients and employees, are at the forefront of who we are. Clients know we prioritize achieving their goals and growing their success. Employees know our culture and approach to business are built on a desire to provide an environment for everyone to flourish. Our commitment to quality is only as good as the people behind it— that’s why we welcome and develop passionate, hardworking, and proactive employees. We take pride in how our employee retention, robust benefits package, and company values have led to Kimley-Horn’s placement on the Fortune “100 Best Companies to Work” list for 17 years!", "responsibilities": "Contribute to the pre-construction planning, modification, permitting, and analysis for multiple projects ranging in size and scope.Solve complex problems, assist project managers, and collaborate across disciplines to produce our clients’ visions for the future built environment.Develop familiarity with the federal, state, and local regulations, as well as Kimley-Horn’s and our client’s practices, procedures, and standards.Evaluate development proposals to identify compliance with zoning regulations.Prepare planning and land use studies. Coordinate with various municipal and state agencies. Gain exposure to diverse project experiences as we provide services to both the public and private sectors.Help prepare Environmental Quality Act documents, environmental impact reports, and negative and mitigated negative declarationsAssist in Specific Plans, Master Plans, and other environmental or planning policy documents in support of a full range of infill and/or land development related projectsWill likely gain expertise in: CEQA/NEPA, sustainability, climate action planning, ENVISION, LEED, and Salmon-Safe Working with infrastructure projects from across industries such as transportation, transit, land planning, aviation", "qualifications": {"required": "A Planning Degree (Bachelors or Masters) from an accredited program by Summer of 2025 in these majors:City and Regional Planning Urban PlanningTransportation Planning Environmental Science/Sustainability/Management  Or Other Related Major ", "preferred": ""}, "skills": [], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "As an Analyst with Kimley-Horn, you will benefit from hands-on experience, technical software and consulting trainings, and developmental programs geared towards growing Kimley-Horn’s future leaders. We expect Analysts to one day achieve licensure in their field and provide financial resources to help you succeed. You will also gain exposure to managing tasks and client relationships.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000284096"}