{"jobTitle": "Operations Manager - Los Angeles", "company": {"name": "Bird", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "69,700—$82,000", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Software Development", "description": "This role is hybrid, must reside in/close to Los Angeles. CA.<br/><br/>Bird’s cleaner, affordable, and on-demand mobility solutions are available in cities globally. We take a collaborative, community-first approach to micromobility. Bird partners closely with the cities in which it operates to provide a reliable and affordable transportation option for people who live and work there.<br/><br/><strong>Role Overview<br/><br/></strong>The Market Manager role is a key role within Birds’ Operations Team. The Market Manager will work with our regional Operations leadership to manage our business in the Los Angeles area including full P&amp;L ownership, vendor and stakeholder relationship management, and key strategic project delivery. We need a strategic critical thinker who can start at thirty thousand feet and dive deep into the details to ensure full alignment between strategy, execution, and outcomes. The ideal candidate for this role should have a “doer” attitude, strong strategic skills, excellent time-management and execution habits, and the ability to communicate clearly and present information to seek buy-in.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Manage the end-to-end operation of the respective portfolio, with support from the Operations leadership team</li><li>Manage performance and efficiency of our operations: track and report critical operational, ridership, supply and demand metrics.</li><li>Use data to optimize processes, creatively solve problems, and track results</li><li>Be the representative and resolve any operational matters for Bird with stakeholders, whether city, vendors or other third parties</li><li>Work on continuous growth, as well as local campaigns and initiatives to improve market share</li><li>Manage costs, with a keen eye on profitability and positive margins</li><li>Build a highly efficient and motivated operations team, including daily oversight, coordination and training of our operational staff, including hourly, front-line workforce in specific markets</li><li>Problem solve - prioritize tasks, and overcome obstacles that come your way</li><li>Collaborate, communicate and influence across the organization to ensure timely resolutions, quality control, and process feedback</li><li>Be resourceful and a self-starter - take initiative, work well without supervision and begin projects independently</li><li>Be part of the Bird culture - build a fun, inclusive, and safe workplace<br/><br/></li></ul><strong>Must-Have<br/><br/></strong><ul><li>3+ years of relevant experience, at least 1+ year experience managing team members</li><li>Self-motivated, energetic and driven individual with the ability to learn new skills, monitor and manage a team and grow with the role</li><li>Engaging communicator with the ability to connect with senior leaders as well as motivate teams</li><li>Excels at building networks and liaising with external partners and city stakeholders</li><li>Strong Excel / data management skills</li><li>Experience solving complex problems, exercising good judgment in decision-making, and navigating ambiguous environments</li><li>Ability to simplify difficult problems into actionable and solvable tasks</li><li>Data-driven by nature, strong attention to detail, and obsessed with process improvement</li><li>Comfortable learning and adapting to new concepts and using new tools<br/><br/></li></ul><strong>Culture at Bird<br/><br/></strong>We're an ambitious, smart and open-minded team that is passionate about our mission. Each day is unlike the last, as we’re constantly moving forward, challenging each other, and working together to create the future of micro-mobility.<br/><br/><strong>Bird is the world<br/><br/></strong>Bird stands for a culture of inclusion. We celebrate different backgrounds, experiences, and perspectives —encouraging everyone to bring their authentic selves to work. We have a diverse environment that empowers our team to feel comfortable when they voice their opinions. For these reasons and more Bird is a proud equal employment opportunity employer. We welcome everyone regardless of their race, colour, religion, sex, national origin, age, disability, veteran status, or genetics, and we are dedicated to providing an inclusive, open, and diverse work environment.<br/><br/>Sound like a place you’d like to work? Sweet. Let’s chat.<br/><br/>Job Type: Full-time<br/><br/><strong>Pay Range Disclosure<br/><br/></strong>Bird offers competitive pay and benefits packages. The base salary range/hourly rate that Bird currently reasonably expects to pay for this role is included below. However, actual compensation may vary upon a number of factors such as experience, knowledge, skill level, skill sets, or the city in which work is performed. Accordingly, under certain circumstances, it is possible that a candidate’s actual compensation may be above or below this range. Some roles may also be entitled to receive other forms of compensation such as bonus, variable pay, and equity, and you will be eligible for paid time off, health and welfare benefits, and retirement benefits pursuant to the Company’s policies.<br/><br/><strong>Pay Range<br/><br/></strong>$69,700—$82,000 USD", "responsibilities": "Manage the end-to-end operation of the respective portfolio, with support from the Operations leadership team\nManage performance and efficiency of our operations: track and report critical operational, ridership, supply and demand metrics.\nUse data to optimize processes, creatively solve problems, and track results\nBe the representative and resolve any operational matters for Bird with stakeholders, whether city, vendors or other third parties\nWork on continuous growth, as well as local campaigns and initiatives to improve market share\nManage costs, with a keen eye on profitability and positive margins\nBuild a highly efficient and motivated operations team, including daily oversight, coordination and training of our operational staff, including hourly, front-line workforce in specific markets\nProblem solve - prioritize tasks, and overcome obstacles that come your way\nCollaborate, communicate and influence across the organization to ensure timely resolutions, quality control, and process feedback\nBe resourceful and a self-starter - take initiative, work well without supervision and begin projects independently\nBe part of the Bird culture - build a fun, inclusive, and safe workplace", "qualifications": {"required": "3+ years of relevant experience, at least 1+ year experience managing team members\nSelf-motivated, energetic and driven individual with the ability to learn new skills, monitor and manage a team and grow with the role\nEngaging communicator with the ability to connect with senior leaders as well as motivate teams\nExcels at building networks and liaising with external partners and city stakeholders\nStrong Excel / data management skills\nExperience solving complex problems, exercising good judgment in decision-making, and navigating ambiguous environments\nAbility to simplify difficult problems into actionable and solvable tasks\nData-driven by nature, strong attention to detail, and obsessed with process improvement\nComfortable learning and adapting to new concepts and using new tools"}, "skills": ["Operations Management", "Stakeholder Management", "Strategic Planning", "Data Analysis", "Problem Solving", "Team Management", "Communication", "Leadership", "Excel", "Project Management"], "postedDate": "1 week ago", "benefits": "Bird offers competitive pay and benefits packages.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000129161"}