{"jobTitle": "Business Development Manager - Los Angeles, CA", "company": {"name": "Bellissimo Foods Company", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Food & Beverages", "description": "The primary responsibilities of this position are to analyze new business opportunities, analyze existing customer profitability and participate in new business strategy and feasibility planning.<br/><br/>Responsibilities<br/><br/><ul><li>Acquire and validate data from prospective new customers</li><li>Provide relevant data and direction to Distribution Services, Purchasing, Procurement, Operations, and Finance to analyze the impact of the new business</li><li>Validate the reasonability of the departmental input and modify it as necessary</li><li>Proforma the new business</li><li>Assist in preparation of RFP submission</li><li>Participate as requested in meetings with potential new customers to obtain data and explain proposals</li><li>Analyze the profitability of existing customers and recommend new fees upon the expiration of existing contracts</li><li>Proforma “what if” scenarios on ways to improve Greco’s profitability</li><li>Continually refine the proforma process to improve accuracy and timeliness</li><li>Participate in Greco’s strategic planning</li><li>Other duties as assigned or necessary<br/><br/></li></ul>Qualifications<br/><br/>Education<br/><br/>4-year degree in business, marketing or related field<br/><br/>Experience<br/><br/>Plus a minimum of 3 years experience in sales, or the food distribution industry<br/><br/>Physical Demands<br/><br/>Must be able to communicate clearly via telephone and personal contact with customers and other company personnel<br/><br/>Mental/Visual Demands <br/><br/>Must be able to read at a distance close to the eyes. Driving requires distance vision<br/><br/>Travel<br/><br/>Occasional travel by automobile and air is required<br/><br/>Equipment Operated<br/><br/>Automobile, Personal Computer with Microsoft Office Suite knowledge<br/><br/>License, Certificates, and Registration<br/><br/>Valid driver’s license and certificate of auto insurance as defined in Company Policy<br/><br/>Overview<br/><br/>Sysco is the global leader in foodservice distribution. With over 71,000 colleagues and a fleet of over 13,000 vehicles, Sysco operates approximately 333 distribution facilities worldwide and serves more than 700,000 customer locations.<br/><br/>We offer our colleagues the opportunity to grow personally and professionally, to contribute to the success of a dynamic organization, and to serve others in a manner that exceeds their expectations. We’re looking for talented, hard-working individuals to join our team. Come grow with us and let us show you why Sysco is at the heart of food and service.<br/><br/>Affirmative Action Statement<br/><br/>Applicants must be currently authorized to work in the United States.<br/><br/>We are proud to be an Equal Opportunity and Affirmative Action employer, and consider qualified applicants without regard to race, color, creed, religion, ancestry, national origin, sex, sexual orientation, gender identity, age, disability, veteran status or any other protected factor under federal, state or local law.<br/><br/>This opportunity is available through Sysco Corporation, its subsidiaries and affiliates.", "responsibilities": "<ul><li>Acquire and validate data from prospective new customers</li><li>Provide relevant data and direction to Distribution Services, Purchasing, Procurement, Operations, and Finance to analyze the impact of the new business</li><li>Validate the reasonability of the departmental input and modify it as necessary</li><li>Proforma the new business</li><li>Assist in preparation of RFP submission</li><li>Participate as requested in meetings with potential new customers to obtain data and explain proposals</li><li>Analyze the profitability of existing customers and recommend new fees upon the expiration of existing contracts</li><li>Proforma “what if” scenarios on ways to improve Greco’s profitability</li><li>Continually refine the proforma process to improve accuracy and timeliness</li><li>Participate in Greco’s strategic planning</li><li>Other duties as assigned or necessary<br/><br/></li></ul>", "qualifications": {"required": "Plus a minimum of 3 years experience in sales, or the food distribution industry", "preferred": "4-year degree in business, marketing or related field"}, "skills": [], "postedDate": "1 week ago", "benefits": "For information on Sysco’s Benefits, please visit https://SyscoBenefits.com", "remoteWork": "No", "salary": {"amount": "$104,600.00 - $156,900.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4000598949"}