{"jobTitle": "SAP Supply Chain Planning (Sales & Ops, Supply, Demand, Production Planning & Scheduling) Advisor", "company": {"name": "Accenture", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Strategy/Planning and Consulting", "industry": "Business Consulting and Services", "description": "Do you thrive in a fast-paced environment? Are you a high performer who enjoys creating value for your clients? If so, then we want YOU on our team!<br/><br/>As a member of our technology team, you will collaborate with some of the brightest minds as we week to solve our clients’ biggest challenges across Consumer, Life Science, Energy, Industrial &amp; Retail. We are seeking a highly motivated, results -oriented individuals with diverse perspectives to join our team. Every step of the way, you will be guided by dedicated career counselors, mentors, and customized training programs to enable your success at Accenture.<br/><br/>In this role, you’ll need the drive, resilience, and adaptability to excel in a competitive, creative, dynamic &amp; people oriented work environment.<br/><br/><strong>The Work: <br/><br/><br/></strong><li>Deep expertise in at least one area of SAP Supply Chain and able to drive end-to-end discussions<br/><br/></li><li>Leverage your expertise in SAP to drive Transformation discussions for clients<br/><br/></li><li>Be a trusted advisor and build strong relationships with clients, acting as their guide on their digital transformation journey<br/><br/></li><li>Ability to articulate the value of a Digital Transformation<br/><br/></li><li>Possess a growth mindset. Constantly learning, refining your skills, and seeking ways to optimize your performance<br/><br/></li><li>Understand cross functional touchpoints and be able to proactively connect teams to tackle integration discussions<br/><br/><br/></li>Travel may be required for this role. The amount of travel will vary from 0 to 100% depending on business need and client requirements<br/><br/><strong>Here’s What You Need: <br/><br/><br/></strong><li>Minimum of 4 years’ experience in SAP Supply Chain Planning, for example: Sales &amp; Ops, Supply, Demand, Production Planning &amp; Scheduling (the experience must be mostly SAP project work)<br/><br/></li><li>Prior Consulting and/or similar Advisory experience: advisory means ability to influence the right process and solution design decisions based on industry leading practices, as well as the ability to anticipate and mitigate project execution risks. Excellent communication skills and a balance between technical and process knowledge in SAP are important elements of the advisory work.<br/><br/></li><li>Bachelor's degree or equivalent (minimum 12 years' work experience). If Associate’s Degree, must have equivalent minimum 6-year work experience.<br/><br/><br/></li>Compensation at Accenture varies depending on a wide array of factors, which may include but are not limited to the specific office location, role, skill set, and level of experience. As required by local law, Accenture provides a reasonable range of compensation for roles that may be hired in California, Colorado, District of Columbia, Maryland, New York or Washington as set forth below. We accept applications on an on-going basis and there is no fixed deadline to apply. Information on benefits is here.<br/><br/><strong>Role Location: Annual Salary Range:<br/><br/></strong>California $63,200 to $188,600<br/><br/>Colorado $63,200 to $163,000<br/><br/>District of Columbia $67,300 to $173,500<br/><br/>New York $58,500 to $188,600<br/><br/>Maryland $58,500 to $150,900<br/><br/>Washington $67,300 to $173,500<br/><br/><em><strong>What We Believe<br/><br/></strong></em><em>We have an unwavering commitment to diversity with the aim that every one of our people has a full sense of belonging within our organization. As a business imperative, every person at Accenture has the responsibility to create and sustain an inclusive environment.<br/><br/></em><em>Inclusion and diversity are fundamental to our culture and core values. Our rich diversity makes us more innovative and more creative, which helps us better serve our clients and our communities. Read more here<br/><br/></em><strong><em>Equal Employment Opportunity Statement</em> <br/><br/></strong><em>Accenture is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation.<br/><br/></em><em>All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.<br/><br/></em><em>Accenture is committed to providing veteran employment opportunities to our service men and women.<br/><br/></em><em>For details, view a copy of the Accenture Equal Employment Opportunity and Affirmative Action Policy Statement.<br/><br/></em><strong><em>Requesting An Accommodation</em> <br/><br/></strong><em>Accenture is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are hired by Accenture and require accommodation to perform the essential functions of your role, you will be asked to participate in our reasonable accommodation process. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired.<br/><br/></em><em>If you would like to be considered for employment opportunities with Accenture and have accommodation needs for a disability or religious observance, please call us toll free at 1 (877) 889-9009, send us an email or speak with your recruiter.<br/><br/></em><em><strong>Other Employment Statements<br/><br/></strong></em><em>Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States.<br/><br/></em><em>Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.<br/><br/></em><em>Job candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.<br/><br/></em><em>The Company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Additionally, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company's legal duty to furnish information.<br/><br/></em>", "responsibilities": "Deep expertise in at least one area of SAP Supply Chain and able to drive end-to-end discussions<br/><br/>Leverage your expertise in SAP to drive Transformation discussions for clients<br/><br/>Be a trusted advisor and build strong relationships with clients, acting as their guide on their digital transformation journey<br/><br/>Ability to articulate the value of a Digital Transformation<br/><br/>Possess a growth mindset. Constantly learning, refining your skills, and seeking ways to optimize your performance<br/><br/>Understand cross functional touchpoints and be able to proactively connect teams to tackle integration discussions<br/><br/><br/>Travel may be required for this role. The amount of travel will vary from 0 to 100% depending on business need and client requirements", "qualifications": {"required": "Minimum of 4 years’ experience in SAP Supply Chain Planning, for example: Sales &amp; Ops, Supply, Demand, Production Planning &amp; Scheduling (the experience must be mostly SAP project work)<br/><br/>Prior Consulting and/or similar Advisory experience: advisory means ability to influence the right process and solution design decisions based on industry leading practices, as well as the ability to anticipate and mitigate project execution risks. Excellent communication skills and a balance between technical and process knowledge in SAP are important elements of the advisory work.<br/><br/>Bachelor's degree or equivalent (minimum 12 years' work experience). If Associate’s Degree, must have equivalent minimum 6-year work experience."}, "skills": ["SAP", "Supply Chain", "Sales & Operations Planning", "Demand Planning", "Production Planning", "Scheduling", "Consulting", "Digital Transformation", "Project Management", "Communication", "Relationship Building", "Problem Solving", "Process Improvement", "Teamwork", "Leadership", "Growth Mindset"], "postedDate": "1 week ago", "benefits": "Compensation at Accenture varies depending on a wide array of factors, which may include but are not limited to the specific office location, role, skill set, and level of experience. As required by local law, Accenture provides a reasonable range of compensation for roles that may be hired in California, Colorado, District of Columbia, Maryland, New York or Washington as set forth below. We accept applications on an on-going basis and there is no fixed deadline to apply. Information on benefits is here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000120360"}