{"jobTitle": "General Manager, Full Time, Temecula- Pottery Barn", "company": {"name": "Pottery Barn", "industry": "Retail"}, "location": "Temecula, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$67,000-$83,000", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "We hope you're interested in building a home with us. Even if you don't feel that you meet every requirement listed in this job description, we still encourage you to apply.<br/><br/>Our mission is to enhance the quality of our customers’ lives at home. We put the customer at the center of everything we do, every day. Our corporate values that guide our actions and decisions are our People First culture, customers, quality, shareholders, integrity, and corporate responsibility.<br/><br/>You will hire great people and develop associates for future growth. You will provide leadership to achieve or exceed budgeted sales, payroll, and controllable expense goals. You will effectively manage store operations, maintain appropriate inventory levels, and maintain visual merchandising standards. You will ensure that all internal and external customers receive exemplary customer service and have a positive store/brand experience. You will ensure that sales associates build relationships with customers.<br/><br/>Ensure store meets or exceeds sales and contest goals and meet payroll goals based on current trends<br/>Prioritize, plan, and adjust schedules and daily agendas to meet business goals; hold team accountable to achieving goals<br/>Train and motivate all associates through on-going programs in sales, customer service, and product knowledge<br/>Assess performance and provide on-going feedback<br/>Complete and deliver performance appraisals and development plans<br/>Ensure team provides an exceptional customer experience in the store to achieve world-class service standards<br/>Maintain presence through effective floor management and ensure staff coverage in all areas of the store as needed<br/>Create and maintain an environment where all associates are treated fairly and with dignity and respect, in accordance with our “People First” philosophy<br/>Work with District Managers and peers to develop best practices in store management<br/><br/>Proven ability to manage staff to exceed sales goals, while meeting payroll goals<br/>Proven to identify top talent, create teams, and train/develop/retain great people<br/>Proven ability to think through complex issues, and allocate time to execute multiple tasks and changing priorities<br/>Proven ability to motivate and influence others through personal actions and examples<br/>Effective communication, organization and leadership skills<br/>4 + years management experience in specialty retail and/or multi-unit retail business environment<br/><br/>Must be able to be mobile on the sales floor for extended periods of time<br/>Must be able to lift and mobilize medium to large items, up to 75 lbs., while utilizing appropriate equipment and safety techniques<br/>Employment/promotion to this role will be contingent on successful completion of a background check<br/>Full time associates are expected to have open availability to meet the needs of the business.<br/><br/>We firmly believe that working in a culture focused on diversity, equity, and inclusion spurs innovation, creates healthy and high-performing teams, and delivers superior customer experiences. We will create and nurture a global company culture where we confidently bring our authentic selves to work every day: where the only criteria for advancement are the quality of our work, the contributions we make to our teams and the business, and our ability to lead; and where our individual differences—whatever they may be—are valued, explored and appreciated.<br/><br/>This role offers a competitive compensation package including pay and benefits. Pay is based on several factors including but not limited to education, work experience, certifications, geographic location etc. The anticipated pay range for this role will be: $67,000-$83,000 annual salary.<br/><br/>Depending on your position and your location, here are a few highlights of what you might be eligible for:<br/><br/>A generous discount on all Williams-Sonoma, Inc. brands<br/>A 401(k) plan and other investment opportunities<br/>Paid vacations and holidays<br/>Health benefits, dental and vision insurance, including same-sex domestic partner benefits<br/>A wellness program that supports your physical, financial and emotional health<br/><br/>Individual development plans and career pathing conversations<br/>Annual performance appraisals<br/>Cross-brand and cross-functional career opportunities<br/>Online learning opportunities through brand specific resources and WSI University<br/>Leadership development opportunities<br/><br/>WSI will not commence an immigration case or “sponsor” an individual for this position at this time (for example, H-1B or other employment-based immigration).<br/><br/>This role is not eligible for relocation assistance.<br/><br/>Williams-Sonoma, Inc. is an Equal Opportunity Employer. Williams-Sonoma, Inc. will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements ofthe San Francisco Fair Chance Ordinance, or other applicable state or local laws and ordinances.<br/><br/>Founded in 1956, Williams-Sonoma, Inc. is the premier specialty retailer of high-quality products for the kitchen and home in the United States. Our family of brands are Williams Sonoma, Williams Sonoma Home, Pottery Barn, Pottery Barn teen, pottery barn kids, Rejuvenation, Mark &amp; Graham, west elm, or Outward. These brands are among the best known and most respected in the industry. We offer beautifully-designed, stylish and functional products for every area of the home, including the kitchen, living room, bedroom, home office, closet, laundry room and even outdoor spaces. We've seen some big changes since our first brick-and-mortar store opened more than half of a century ago. What hasn't changed is our passion for high-quality products, functional design, outstanding customer service, and enhancing the lives of our customers and the communities where we operate. Today, we're a multi-brand, multi-channel, global enterprise supported by state-of-the-art technology and some of the most talented teams in retailing - and we're always looking for new energy and ideas.", "responsibilities": "Ensure store meets or exceeds sales and contest goals and meet payroll goals based on current trends\nPrioritize, plan, and adjust schedules and daily agendas to meet business goals; hold team accountable to achieving goals\nTrain and motivate all associates through on-going programs in sales, customer service, and product knowledge\nAssess performance and provide on-going feedback\nComplete and deliver performance appraisals and development plans\nEnsure team provides an exceptional customer experience in the store to achieve world-class service standards\nMaintain presence through effective floor management and ensure staff coverage in all areas of the store as needed\nCreate and maintain an environment where all associates are treated fairly and with dignity and respect, in accordance with our “People First” philosophy\nWork with District Managers and peers to develop best practices in store management", "qualifications": {"required": "Proven ability to manage staff to exceed sales goals, while meeting payroll goals\nProven to identify top talent, create teams, and train/develop/retain great people\nProven ability to think through complex issues, and allocate time to execute multiple tasks and changing priorities\nProven ability to motivate and influence others through personal actions and examples\nEffective communication, organization and leadership skills\n4 + years management experience in specialty retail and/or multi-unit retail business environment", "preferred": null}, "skills": ["Sales", "Customer Service", "Retail Management", "Leadership", "Team Building", "Training", "Performance Management", "Inventory Management", "Visual Merchandising", "Customer Experience", "Communication", "Organization"], "postedDate": "1 month ago", "applicationDeadline": null, "benefits": "A generous discount on all Williams-Sonoma, Inc. brands\nA 401(k) plan and other investment opportunities\nPaid vacations and holidays\nHealth benefits, dental and vision insurance, including same-sex domestic partner benefits\nA wellness program that supports your physical, financial and emotional health", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4000307023"}