{"jobTitle": "Project Coordinator", "company": {"name": "truData Solutions", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting", "description": "<strong>Position Title: PM/Project Coordinator – IT Implementations Engineering</strong><p><strong>Location: Santa Monica, CA - Hybrid</strong></p><p><strong>Start Date: ASAP </strong></p><p><strong>Rate: $60-$70/hr</strong></p><p><strong>Duration: 12 months+</strong></p><p><br/></p><p><strong>Summary</strong></p><p>The IT Implementations Engineering Project Coordinator (ITDE PC) plays an integral role in supporting the deployment of IT infrastructure, network, AV and security systems in global construction projects. This role supports the client by partnering with the client’s IT Infrastructure Engineers, AV Engineers and internal stakeholders such as Design and Construction and Global Security Operations in order to complete new office construction, decommission, team relocations and special projects.</p><p><br/></p><p><strong>Position Responsibilities</strong></p><p>Project Coordinator is responsible for the below tasks as they pertain to new office builds, decommissions, moves, adds, changes, and special projects:</p><ul><li>Identifying scope, schedule, and budget for office deployment and post occupancy projects.</li><li>Assisting with project tasks and communications throughout the duration of the project such as resource scheduling, schedule management, progress updates, and stakeholder sign-offs.</li><li>Attending construction, design, and trade specific coordination meetings throughout the life of a project functioning as a project manager (taking meeting notes, communicating progress to the project team, tracking schedule, change management etc.)</li><li>Updating the project team with new developments, schedule changes, scope changes, procurement progress and monthly budget forecasts.</li><li>Highlighting and documenting risks to project deliverables, schedule and compliance with client standards.</li><li>Ensuring client standards are met and office deployment processes are compliant with all client policies.</li><li>Hosting regular meetings with the client’s engineers and other project stakeholders as needed to ensure project status visibility and facilitated in a way that is tailored appropriately to each audience (Google Meet, in-person etc.)</li><li>Providing construction coordination between the client team and various other construction trades, architects, construction managers and design team members as requested</li><li>Collaborate with vendors for office design and timely completion of deliverables</li><li>Evaluating completed projects and identifying opportunities for process improvements</li><li>Ensuring that project trackers, weekly updates and meeting notes are current and up to date.</li><li>Updating and maintaining client documentation in various internal tools such as JIRA, Confluence and Google Drive.</li></ul><p><br/></p><p><strong>Other Qualifications &amp; Desired Competencies</strong></p><ul><li>5-10% travel</li><li>3-4 days/week onsite in Santa Monica, CA</li><li>Construction/Design skills (AutoCAD, Fieldwire, Bluebeam, etc)</li><li>Documentation / meeting minutes using Google sheets / Google drive / Slack, Jira, Confluence</li></ul><p></p>", "postedDate": "5 days ago", "skills": ["AutoCAD", "Fieldwire", "Bluebeam", "Google sheets", "Google drive", "Slack", "Jira", "Confluence"], "url": "https://www.linkedin.com/jobs/view/4000280929"}