{"jobTitle": "Production Manager", "company": {"name": "Impact Theory", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$95,000 to $110,000", "currency": "USD"}, "jobFunction": "Production", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "About Impact Theory<br/><br/>Impact Theory is a mission-driven modern media company designed to create positive change in people's lives through the creation of entertaining and empowering content. Designed as an integrated studio, Impact Theory develops and produces video games, webcomics, film &amp; TV, as well as world-class YouTube and podcast content that has garnered half a billion views on YouTube alone. Regardless of type, Impact Theory's content underscores the company's mission to ensure the global spread of a growth mindset through ideas and entertainment.<br/><br/>About The Role<br/><br/>Reporting to the EVP of Production, you as the Production Manager will oversee the day-to-day logistical operations directly related to the physical and post-production responsibilities of our modern digital media company. You will schedule and supervise Editors, Camera Operators, Assistant Editors, Coordinators, and Contractors, as needed. If you are obsessed with logistics, organization, time management, and production environments, with an ability to pivot at a moment's notice, this is the role for you.<br/><br/>Position Responsibilities<br/><br/>Supervisory Responsibilities:<br/><br/><ul><li>Recruits, interviews, hires, and trains freelance Editors, Camera ops, crew</li><li>Oversees the daily workflow of the department</li><li>Manages and oversees all location shoots. From budget, to crew, to set up, quality assurance, invoices etc. Location shoots can occasionally be an international endeavor. </li><li>Manages the daily schedule of Assistant Editors, Coordinators, Editors, and Production Assistants<br/><br/></li></ul>Duties/Responsibilities:<br/><br/><ul><li>Creates and facilitates editing schedules to ensure timely release of episodes</li><li>Manages Physical Production schedule and coordinating</li><li>Manages post-production purchases and editor invoices for the department</li><li>Creates and manages workflows for production and post-production for any and all content required by the company. </li><li>Coordinate strategy, logistics, and asset creation/implementation across departments</li><li>Project manages company key initiatives as it relates to production</li><li>Partner with internal stakeholders on content strategy to create relevant programming</li><li>Work closely with Senior Producers and Producers of all channels</li><li>Work with the Podcast Development team for scheduling and releases</li><li>Partners with the Marketing team for Clips, Ads, and other editorial functions</li><li>Management of departmental expenses and budgets</li><li>May be required to be on location at off-site locations (occasionally international)</li><li>Additional duties and responsibilities as assigned <br/><br/><br/></li></ul>Requirements<br/><br/><ul><li>4+ years experience as a Production Manager</li><li>Preferably experienced with YouTube/Podcast Production environments</li><li>Must be an expert across production logistics. Having a network of contacts is extremely beneficial to this role. </li><li>Experience with Monday; Trello; or similar project management software/tools</li><li>Experienced leading/managing/mentoring direct reports and vendors</li><li>Excellent verbal and written communication skills</li><li>Excellent organizational skills and attention to detail</li><li>Excellent time management skills with a proven ability to meet deadlines</li><li>Strong analytical and problem-solving skills</li><li>Self-motivated and ability to work autonomously</li><li>Ability to prioritize tasks and to delegate them when appropriate</li><li>Ability to function well in a fast-paced, highly agile environment</li><li>Proficient with Google Suite, Adobe Suite, and editing softwares helpful </li><li>Willing to travel as needed, a valid passport is recommended</li><li>Ability to work at the HQ office, up to 5 days a week, in West Hollywood, CA</li><li>Compensation for this position is $95,000 to $110,000, depending on experience<br/><br/><br/></li></ul>Benefits<br/><br/><ul><li>Medical/Dental/Vision Insurance Plans</li><li>Life Insurance</li><li>401k</li><li>Flexible, \"Unlimited\" PTO Policy</li><li>1-year subscription to Audible</li><li>Full employee access to Impact Theory University</li><li>2 Complimentary Books (Radical Confidence by Lisa Bilyeu and Principles by Ray Dalio)<br/><br/><br/></li></ul>FRAUD/SCAM NOTICE<br/><br/>Please note that Impact Theory interview requests and job offers only originate from an @impacttheory.com email address. We have a robust interview process that includes phone, video Google Meets calls, and in-person interviews at our Los Angeles, California-based office prior to any person receiving an offer of employment. Impact Theory will also never ask for bank account information (including routing or account numbers), social security numbers, passwords or any other sensitive information to be delivered over email or phone. Always reference our career site, Impact Theory Careers, to see if the position that you are applying to is legitimate. If you receive a scam issue or a security issue involving Impact Theory, please notify us at hr@impacttheory.com.<br/><br/>EQUAL EMPLOYMENT OPPORTUNITY &amp; FAIR CHANCE HIRING<br/><br/>Impact Theory is an Equal Opportunity employer. We celebrate and embrace diversity, and believe the strongest teams are from a broad tapestry of backgrounds, perspectives, and skills. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected veteran status, or any other characteristics protected by applicable federal, state, or local law. We will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance.", "responsibilities": "Supervisory Responsibilities:<br/><br/><ul><li>Recruits, interviews, hires, and trains freelance Editors, Camera ops, crew</li><li>Oversees the daily workflow of the department</li><li>Manages and oversees all location shoots. From budget, to crew, to set up, quality assurance, invoices etc. Location shoots can occasionally be an international endeavor. </li><li>Manages the daily schedule of Assistant Editors, Coordinators, Editors, and Production Assistants<br/><br/></li></ul>Duties/Responsibilities:<br/><br/><ul><li>Creates and facilitates editing schedules to ensure timely release of episodes</li><li>Manages Physical Production schedule and coordinating</li><li>Manages post-production purchases and editor invoices for the department</li><li>Creates and manages workflows for production and post-production for any and all content required by the company. </li><li>Coordinate strategy, logistics, and asset creation/implementation across departments</li><li>Project manages company key initiatives as it relates to production</li><li>Partner with internal stakeholders on content strategy to create relevant programming</li><li>Work closely with Senior Producers and Producers of all channels</li><li>Work with the Podcast Development team for scheduling and releases</li><li>Partners with the Marketing team for Clips, Ads, and other editorial functions</li><li>Management of departmental expenses and budgets</li><li>May be required to be on location at off-site locations (occasionally international)</li><li>Additional duties and responsibilities as assigned <br/><br/><br/></li></ul>", "qualifications": {"required": "4+ years experience as a Production Manager, Preferably experienced with YouTube/Podcast Production environments, Must be an expert across production logistics. Having a network of contacts is extremely beneficial to this role., Experience with Monday; Trello; or similar project management software/tools, Experienced leading/managing/mentoring direct reports and vendors, Excellent verbal and written communication skills, Excellent organizational skills and attention to detail, Excellent time management skills with a proven ability to meet deadlines, Strong analytical and problem-solving skills, Self-motivated and ability to work autonomously, Ability to prioritize tasks and to delegate them when appropriate, Ability to function well in a fast-paced, highly agile environment, Proficient with Google Suite, Adobe Suite, and editing softwares helpful, Willing to travel as needed, a valid passport is recommended, Ability to work at the HQ office, up to 5 days a week, in West Hollywood, CA", "preferred": ""}, "skills": ["YouTube", "Podcast", "Project Management", "Monday", "Trello", "Google Suite", "Adobe Suite"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "Medical/Dental/Vision Insurance Plans, Life Insurance, 401k, Flexible, \"Unlimited\" PTO Policy, 1-year subscription to Audible, Full employee access to Impact Theory University, 2 Complimentary Books (Radical Confidence by Lisa Bilyeu and Principles by Ray Dalio)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000586129"}