{"jobTitle": "Logistics Analyst", "company": {"name": "Tata Technologies", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Engineering", "industry": "Automation Machinery Manufacturing", "description": "At Tata Technologies we make product development dreams a reality by designing, engineering, and validating the products of tomorrow for the world’s leading manufacturers. Due to our continued growth, we are now recruiting for a Logistics Analyst to strengthen our team in Irvine California.Description:SAP Material Management experience- at least 2 yearsInventory/Replenishment planning with supply chain knowledgeadvanced excel for analysis and using tableau for reporting (using, building is a plus)SAP and order management are keyRoles and Responsibilities:SQL and Python are a plus3+ years using MS Excel, Jira and Atlassian Products • Experience in Supply Chain or Manufacturing Product Lifecycle Management departments • Experience working with engineering leads to establish acceptance criteria for development work and user acceptance testing efforts • Be comfortable with database queries to measure performance KPIs and evaluate experiments • Experience with ReactJS, GraphQL and web development is a plus • Experience with Figma, Lucid and any other design tool is a plusSkills Preferred:Execute the Channel Planning and Analytics strategic plan which will support better service levels with less inventory and optimized safety stocks.Own master data and inventory parameters for Service Center materials to support stocking to meet the demand forecast, provide excellent fill rates, reduce down-time, and deliver cost efficient supply chain models.Develop, launch, and continuously improve the part inventory stocking models and strategies, part order replenishment generation logic, and distribution planning to meet our global SLAs.Evaluate and analyze system outputs to ensure correct materials are being ordered, replenished, and available to support global service requirements.Focus on automation and controls to quickly identify errors to eliminate supply chain noise by modifying, removing, or adding orders to meet demand.Coordinate and execute transactional movements of materials to optimize and reduce logistics costs, meet Service Level Agreements, and reduce global inventory costs.Deliver on service level expectations, part allocation strategy, part availability, inventory refresh cycles, part consumption, and field performance.If you are passionate about bringing innovation to the projects, you work on then we would love to hear from you. We offer a complete benefits package, including medical, dental, vision, life insurance, short- and long-term disability, FMLA and 401K.Tata Technologies Inc. is an Equal Opportunity/ Affirmative Action employer. We provide equal employment opportunities to all qualified employees and applicants for employment without regard to race, religion, sex, age, marital status, national origin, sexual orientation, citizenship status, veteran status, disability, or any other legally protected status. We prohibit discrimination in decisions concerning recruitment, hiring, compensation, benefits, training, termination, promotions, or any other condition of employment or career development.Tata Technologies: Engineering a better world.Tata Technologies would like to thank all applicants for their interest, each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.", "responsibilities": "Execute the Channel Planning and Analytics strategic plan which will support better service levels with less inventory and optimized safety stocks.Own master data and inventory parameters for Service Center materials to support stocking to meet the demand forecast, provide excellent fill rates, reduce down-time, and deliver cost efficient supply chain models.Develop, launch, and continuously improve the part inventory stocking models and strategies, part order replenishment generation logic, and distribution planning to meet our global SLAs.Evaluate and analyze system outputs to ensure correct materials are being ordered, replenished, and available to support global service requirements.Focus on automation and controls to quickly identify errors to eliminate supply chain noise by modifying, removing, or adding orders to meet demand.Coordinate and execute transactional movements of materials to optimize and reduce logistics costs, meet Service Level Agreements, and reduce global inventory costs.Deliver on service level expectations, part allocation strategy, part availability, inventory refresh cycles, part consumption, and field performance.", "qualifications": {"required": "3+ years using MS Excel, Jira and Atlassian Products • Experience in Supply Chain or Manufacturing Product Lifecycle Management departments • Experience working with engineering leads to establish acceptance criteria for development work and user acceptance testing efforts • Be comfortable with database queries to measure performance KPIs and evaluate experiments • Experience with ReactJS, GraphQL and web development is a plus • Experience with Figma, Lucid and any other design tool is a plus", "preferred": "SAP Material Management experience- at least 2 yearsInventory/Replenishment planning with supply chain knowledgeadvanced excel for analysis and using tableau for reporting (using, building is a plus)SAP and order management are keySQL and Python are a plus"}, "skills": ["SAP", "Excel", "Jira", "Atlassian", "Supply Chain", "Manufacturing", "Database", "ReactJS", "GraphQL", "Web Development", "Figma", "Lucid", "Tableau"], "postedDate": "1 week ago", "benefits": "We offer a complete benefits package, including medical, dental, vision, life insurance, short- and long-term disability, FMLA and 401K.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000358467"}