{"jobTitle": "Transportation Manager", "company": {"name": "Pacific Seafood", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Food and Beverage Manufacturing", "description": "At Pacific Seafood, we do more than just provide the world with the healthiest proteins on the planet. We are an excellence-driven organization committed to being the brand of choice in the marketplace and the employer of choice in the community. We believe in servant leadership, investing in our team members, and rewarding performance. We live by the core values of our Diamond Philosophy: Quality, Teamwork, Productivity, and Excellence—which means consistently doing your best and always striving to do better.<br/><br/><strong>Summary: <br/><br/></strong>As the Transportation Manager, you are responsible for properly and efficiently carrying out all logistics, maintenance, and transportation functions of the branch. Supervise, train, and motivate team members to develop their productivity and ensure that resources are available to provide quality, efficient services, and on-time performance to new and existing accounts.<br/><br/><strong>Key Responsibilities:<br/><br/></strong><ul><li>Coordinate with contracted trucking dispatchers and drivers.</li><li>Sequence routes daily to keep loads even and profitable and make recommendations for route changes and/or consolidation to achieve maximum delivery efficiency.</li><li>Schedule routine ride – to determine route efficiency, reasonable route time requirements and stop sequence for all same day and next day routes in the Division</li><li>Oversee all scheduling, to include weekly driver routes, vacation and relief coverage and truck maintenance.</li><li>Oversee the loading product onto trailers or trucks.</li><li>Manage the preparation of delivery documents for truckers.</li><li>Coordinate pick-ups with purchasing.</li><li>Assist in developing incentive, safe driving, and cross training programs for drivers to improve their abilities and productivity.</li><li>Manage and/or develop budgets for an assigned unit including operating requirement, equipment, material purchases and ensure that actual expenses are consistent with the approved budget.</li><li>Answer questions and resolve complaints pertaining to any transportation issues.</li><li>Perform other duties, as assigned.<br/><br/><br/></li></ul><strong>What You Bring to Pacific Seafood:<br/><br/></strong><strong>Required<br/><br/></strong><ul><li>High school diploma or GED</li><li>Minimum of four years’ experience in the transportation supervisor field</li><li>Minimum of three years’ experience in fleet management and routing and safety compliance.<br/><br/><br/></li></ul><strong>Preferred<br/><br/></strong><ul><li>Associates degree from an accredited college or university in a related field.</li><li>Valid commercial driver’s license.</li><li>Forklift certification</li><li>DOT Compliance and Audit Knowledge<br/><br/><br/></li></ul><strong>Total Compensation:<br/><br/></strong>At Pacific Seafood, your base wage is only a portion of your overall compensation package. We invest in our Team Members through a comprehensive and attractive total rewards package, including but not limited to:<br/><br/><ul><li>Health insurance benefits options, including medical, prescription, vision, dental, basic group life and short-term disability</li><li>Flexible spending accounts for health flex and dependent care expenses</li><li>401(k) retirement plan options with generous annual company profit sharing match</li><li>Paid time-off for all regular FT team members to include sick days, paid holidays, vacation, and personal time</li><li>Employee assistance program providing confidential professional counseling, financial and legal assistance at no charge to team members and immediate family members</li><li>Product purchase program<br/><br/><br/></li></ul>Pacific Seafood is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.", "responsibilities": "As the Transportation Manager, you are responsible for properly and efficiently carrying out all logistics, maintenance, and transportation functions of the branch. Supervise, train, and motivate team members to develop their productivity and ensure that resources are available to provide quality, efficient services, and on-time performance to new and existing accounts.", "qualifications": {"required": "High school diploma or GED, Minimum of four years’ experience in the transportation supervisor field, Minimum of three years’ experience in fleet management and routing and safety compliance.", "preferred": "Associates degree from an accredited college or university in a related field., Valid commercial driver’s license., Forklift certification, DOT Compliance and Audit Knowledge"}, "skills": [], "postedDate": "1 week ago", "benefits": "Health insurance benefits options, including medical, prescription, vision, dental, basic group life and short-term disability, Flexible spending accounts for health flex and dependent care expenses, 401(k) retirement plan options with generous annual company profit sharing match, Paid time-off for all regular FT team members to include sick days, paid holidays, vacation, and personal time, Employee assistance program providing confidential professional counseling, financial and legal assistance at no charge to team members and immediate family members, Product purchase program", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000715284"}