{"jobTitle": "SSRS Reports Developer/ Data Analyst SQL", "company": {"name": "Calqulate", "industry": "Business Consulting and Services", "size": "Not specified", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Information Technology", "industry": "Business Consulting and Services", "description": "Data Analyst SQL/ Analyst\n\nIrvine, California (Hybrid)\n\nOur client is an innovative Technology Consulting Firm looking for a Data Analyst SQL for a hybrid role in Irvine, Ca.\n\nRole Overview\n\nWe are looking for an experienced SSRS Developer / Data Analyst to work closely with clients on multiple projects. Youll transform report and form requirements into visually appealing, data-rich solutions, ensuring accuracy and reliability. This role involves collaborating with internal teams and client experts, troubleshooting issues, and supporting enhancements. The ideal candidate excels in communication, manages multiple priorities, and thrives in a virtual work environment.", "responsibilities": "SSRS Development: Design, develop, and maintain SSRS reports and forms that meet client needs, focusing on clarity and accuracy.\nData Analysis & Integration: Collaborate with stakeholders to translate reporting needs into actionable solutions, collecting and integrating data from various sources.\nData Validation & Optimization: Ensure data accuracy in all reports and continuously optimize for better performance.\nDocumentation & QA: Maintain thorough documentation of development processes and conduct rigorous testing to resolve issues.\nUser Support: Provide guidance and support on forms and reports to team members and clients.\nProject Management: Monitor tasks, document progress, and communicate status updates to clients, vendors, and team members.\nMeeting Coordination: Organize and lead meetings as needed.", "qualifications": {"required": "Bachelors Degree or equivalent experience.\nProven experience in SSRS development and strong skills in MS SQL.\nUnderstanding of data warehousing and database design.\nStrong analytical abilities with a commitment to high-quality output.\nExcellent verbal, written, and client-facing communication.", "preferred": "Productive in virtual environments, proactive, and capable of managing multiple priorities.\nStrong relationship-building skills and responsiveness.\nMaintain a high degree of confidentiality."}, "skills": ["SSRS", "SQL", "Data Analysis", "Documentation", "Project Management", "Communication"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/4000608365"}