{"jobTitle": "Workplace Operations Coordinator", "company": {"name": "GITAI", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "25.00/hr - 35.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Defense and Space Manufacturing", "description": "Humanity has been developing horizontally on Earth, but we believe now is the time to expand vertically. With the decreasing costs of space access, the possibilities for exploration and utilization of space are expanding exponentially. At GITAI, we are at the cutting edge of this vertical development, providing the robotic technologies that enable safe and affordable labor in space. Our space robot solution reduces the operational cost in space by 100 times and will make sustained human presence and activity in space a reality.\n\nAbout The Role\nWe're looking for a workplace operations coordinator who can ensure the smooth functioning of our office, providing a safe, efficient, and supportive environment for all employees. We seek energetic, proactive individuals who can enliven the office atmosphere and meet the various needs of a dynamic workspace.\n\nResponsibilities\n* Maintain a clean, organized, and secure office environment\n* Coordinate repairs, maintenance, and vendor services\n* Ensure compliance with health and safety standards\n* Manage inventory and order office supplies and equipment\n* Oversee vendor relationships for timely service delivery\n* Assist with workspace setups and relocations\n* Support the planning and execution of company events and activities to encourage the team-building and employee engagement\n* Arrange travel accommodations, including flights, hotels, and transportation for employees that align with company policies and budgets\n* Manage office documentation and support mail distribution\n* Provide general administrative assistance to the corporate team\n\nMinimum Qualifications\n* Associate’s or Bachelor’s degree\n* 3+ years of experience in office administration and/or facilities management in small engineering organizations\n* Excellent communication skills, including verbal, email, and several communication software tools such as Slack and Google Workspace\n* Strong organizational and multitasking skills\n* Proficiency in Microsoft Office Suite\n* Ability to manage physical tasks (lifting up to 50 lbs)\n* Supportive and energetic character, proactive and detailed oriented towards work\n\nPreferred Qualifications\n* 1+ years of experience working for a pre-series B startup company\n* Excellent IT skills with the ability to build efficient business operations by making full use of extended functionality of various software tools\n\nAdditional Qualifications\n* Must be available to work extended hours and weekends as needed\n\nLocation and Position Type\nTorrance, CA (On-Site), Full-time\n\nSalary/Pay\n$25/hr - $35/hr\nSalary for the successful applicant depends on a variety of job-related factors, including but not limited to geographic location, market demands, experience, training, and education.\n\nBenefits\n* Comprehensive Healthcare: 100% paid medical, dental, and vision insurance for employees, with 90% coverage for dependents, plus life insurance\n* Retirement Savings: 401(k) plan with a company match up to 3.5%, offering both traditional and Roth options\n* Competitive Compensation: Attractive salary packages to reward your talent and dedication\n* Work Hard, Play Hard Culture: Paid holidays, PTO, and sick days to keep you refreshed and motivated\n* Dynamic Work Environment: Collaborate and innovate with a passionate team\n* Office Perks: Enjoy free snacks and drinks, plus regular social events to foster team spirit\n* Cutting Edge Experience: Work alongside state-of-the-art robots, driving the future of space technology\n\nImportant Notice\nThis position is subject to compliance with U.S. export control requirements including EAR and ITAR. We are interested in every qualified candidate who is legally authorized to work in the United States. We are not able to sponsor visas for this position.\n\nGITAI USA Inc. is Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status", "responsibilities": "Maintain a clean, organized, and secure office environment\nCoordinate repairs, maintenance, and vendor services\nEnsure compliance with health and safety standards\nManage inventory and order office supplies and equipment\nOversee vendor relationships for timely service delivery\nAssist with workspace setups and relocations\nSupport the planning and execution of company events and activities to encourage the team-building and employee engagement\nArrange travel accommodations, including flights, hotels, and transportation for employees that align with company policies and budgets\nManage office documentation and support mail distribution\nProvide general administrative assistance to the corporate team", "qualifications": {"required": "Associate’s or Bachelor’s degree\n3+ years of experience in office administration and/or facilities management in small engineering organizations\nExcellent communication skills, including verbal, email, and several communication software tools such as Slack and Google Workspace\nStrong organizational and multitasking skills\nProficiency in Microsoft Office Suite\nAbility to manage physical tasks (lifting up to 50 lbs)\nSupportive and energetic character, proactive and detailed oriented towards work", "preferred": "1+ years of experience working for a pre-series B startup company\nExcellent IT skills with the ability to build efficient business operations by making full use of extended functionality of various software tools"}, "skills": ["Microsoft Office Suite", "Slack", "Google Workspace"], "postedDate": "5 days ago", "benefits": "Comprehensive Healthcare: 100% paid medical, dental, and vision insurance for employees, with 90% coverage for dependents, plus life insurance\nRetirement Savings: 401(k) plan with a company match up to 3.5%, offering both traditional and Roth options\nCompetitive Compensation: Attractive salary packages to reward your talent and dedication\nWork Hard, Play Hard Culture: Paid holidays, PTO, and sick days to keep you refreshed and motivated\nDynamic Work Environment: Collaborate and innovate with a passionate team\nOffice Perks: Enjoy free snacks and drinks, plus regular social events to foster team spirit\nCutting Edge Experience: Work alongside state-of-the-art robots, driving the future of space technology", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000609151"}