{"jobTitle": "Distribution Center Warehouse Supervisor", "company": {"name": "Ross Stores, Inc.", "location": "Perris, CA"}, "location": "Perris, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "<strong>Our values start with our people, join a team that values you!<br/><br/></strong>We are the nation’s largest off-price retailer with over 2,000 stores, and a strong track record of success and growth. Our focus has always been bringing our customers a constant stream of high-quality brands and on-trend merchandise at extraordinary savings. All while providing a fun and exciting treasure hunt experience.<br/><br/><strong>As Part Of Our Team, You Will Experience<br/><br/></strong><ul><li>Success. Our winning team pursues excellence while learning and evolving</li><li>Career growth. We develop industry leading talent because Ross grows when our people grow</li><li>Teamwork. We work together to solve the hard problems and find the right solution</li><li>Our commitment to Diversity, Equity &amp; Inclusion, and our community. We celebrate the backgrounds, identities, and ideas of those who work and shop with us because our differences make us stronger. We strive to be a positive force in our community.<br/><br/></li></ul>Our Corporate headquarters are in Dublin, CA, we have 3 buying offices in key markets in New York City, Los Angeles, and Boston, and 8 distribution centers nationwide. With 2023 revenues of $20.4 billion, we are a Fortune 500 company who is committed to providing an inclusive work environment with continuous learning opportunities and development for our teams.<br/><br/><strong>General Purpose<br/><br/></strong>Supervises activities of regular associates and temporary workers. Assesses production schedules and man-hour requirements for completion of job assignments. Interprets company policies and procedures to ensure compliance and adherence. Enforces safety regulations. Evaluates and assesses production methods, performances and efficiency for improvements and/or changes. Prepares associate performance evaluations and assists in the administration of reviews. Determines time and production standards and maintains records. Must have a \"can-do\", \"make-it-happen\" attitude. This is demonstrated by displaying the ability to use perseverance and initiative in order to ensure top performance, quality and service to our stores. Responsible for developing and maintaining an open, engaging labor relation's environment which remains issue free.<br/><br/><strong>The base salary range for this role is $66,560 - $75,150. The base salary range is dependent on factors including, but not limited to, experience, skills, qualifications, relevant education, certifications, seniority, and location. The range listed is just one component of the total compensation package for employees. Other rewards vary by position and location.<br/><br/></strong><strong>Essential Functions<br/><br/></strong><ul><li> Manages hourly team to ensure timely and accurate processing and distribution of merchandise to stores</li><li> By effectively using the MAP (Managing Associate Performance) process, trains, assesses, motivates, coaches, and evaluates associates in all areas of job duties using established methods and standards.</li><li> Ensures rapid, accurate movement and processing of merchandise using established engineered methods and standards.</li><li> Organizes and prioritizes daily work orders and staffing needs to meet production goals.</li><li> Responsible for accuracy/quality of work for all assigned Ross &amp; Temp associates.</li><li> Responsible for creating an effective team culture which recognizes individual and team performance, while maintaining an issue free environment in a demanding work environment.</li><li> Establishes and maintains strong working relationships with other Area Supervisors, DC Merchandise Managers, and Human Resources.</li><li> Conducts daily huddle meetings to communicate important daily events &amp; priorities.</li><li> Facilitates associate training/meetings for subjects such as safety, human resources, new process orientation, and other subjects as conditions necessitate.</li><li> Enforces policies and safety regulations, providing appropriate negative &amp; positive consequences to team to manage safe working behaviors.</li><li> Conducts disciplinary meetings regarding job performance with associates, in compliance with company policies and procedures, including the separation process when direct reports are terminated.</li><li> Manages all administrative tasks and functions for responsible area.</li><li> Performs job applicant interviews and makes hiring decisions.</li><li> Prepares associate evaluations and administers reviews with the assistance of the DC Merchandise Manager.</li><li> Maintains daily paperwork, such as time and production/CP2 records.</li><li> Assists merchandise processors with paperwork, ticketing problems and troubleshooting orders.</li><li> Provides updates to DC Merchandise Manager on production planning information and needs/problems of the area.</li><li> Miscellaneous functions and responsibilities:</li><li> Works on special projects as needed.</li><li> Attends and helps plan any special events planned for his/her team.<br/><br/></li></ul><strong>Competencies<br/><br/></strong><ul><li> Interpersonal Skills</li><li> Communication</li><li> Collaboration</li><li> Drives Results</li><li> Adaptability</li><li> Leadership</li><li> Planning &amp; Organizing</li><li> Commitment<br/><br/></li></ul><strong>Qualifications And Special Skills Required<br/><br/></strong><ul><li> BS degree or two years supervisory experience in a production or merchandising function (preferred).</li><li> Developed written and verbal communication skills, as well as organization/prioritization skills are necessary.</li><li> Excellent interpersonal skills, ability to work collaboratively across multiple shifts/departments is required.<br/><br/></li></ul><strong>Physical Requirements/Ada<br/><br/></strong>Job requires ability to work in a warehouse environment, on a concrete floor all day.<br/><br/>Requires continuous, standing, walking, hearing, pushing, and pulling.<br/><br/>Consistent timeliness and regular attendance is necessary.<br/><br/>Frequently reaching, bending, stooping, talking, hearing (audio equipment), handling objects with hands and lifting to 50 lbs.<br/><br/>Vision requirements: Ability to see information in print and/or electronically.<br/><br/>This role requires full-time in-office presence, including to engage in in-person team interaction, meetings and collaboration, client support, mentoring, coaching, and/or feedback.<br/><br/><strong>Supervisory Responsibilities<br/><br/></strong>Hourly Associates of varying classifications, including Checker, Marker, Packer, Material Handler, Splitter, Loader, Unloader, Inductor, etc.<br/><br/><strong>DISCLAIMER<br/><br/></strong>This job description is a summary of the primary duties and responsibilities of the job and position. It is not intended to be a comprehensive or all-inclusive listing of duties and responsibilities. Contents are subject to change at management's discretion.<br/><br/>Ross is an equal employment opportunity employer. We consider individuals for employment or promotion according to their skills, abilities and experience. We believe that it is an essential part of the Company's overall commitment to attract, hire and develop a strong, talented and diverse workforce. Ross is committed to complying with all applicable laws prohibiting discrimination based on race, color, religious creed, age, national origin, ancestry, physical, mental or developmental disability, sex (which includes pregnancy, childbirth, breastfeeding and medical conditions related to pregnancy, childbirth or breastfeeding), veteran status, military status, marital or registered domestic partnership status, medical condition (including cancer or genetic characteristics), genetic information, gender, gender identity, gender expression, sexual orientation, as well as any other category protected by federal, state or local laws.<br/><br/>#Supply Chain, Operations, Area Manager, Production Supervisor, Shipping Receiving Supervisor, Logistics Supervisor; Facilities Supervisor, Coach; Mentor, People Leader", "responsibilities": "Supervises activities of regular associates and temporary workers. Assesses production schedules and man-hour requirements for completion of job assignments. Interprets company policies and procedures to ensure compliance and adherence. Enforces safety regulations. Evaluates and assesses production methods, performances and efficiency for improvements and/or changes. Prepares associate performance evaluations and assists in the administration of reviews. Determines time and production standards and maintains records. Must have a \"can-do\", \"make-it-happen\" attitude. This is demonstrated by displaying the ability to use perseverance and initiative in order to ensure top performance, quality and service to our stores. Responsible for developing and maintaining an open, engaging labor relation's environment which remains issue free.", "qualifications": {"required": "BS degree or two years supervisory experience in a production or merchandising function (preferred). Developed written and verbal communication skills, as well as organization/prioritization skills are necessary. Excellent interpersonal skills, ability to work collaboratively across multiple shifts/departments is required.", "preferred": "BS degree or two years supervisory experience in a production or merchandising function"}, "skills": ["Supply Chain", "Operations", "Area Manager", "Production Supervisor", "Shipping Receiving Supervisor", "Logistics Supervisor", "Facilities Supervisor", "Coach", "Mentor", "People Leader"], "postedDate": "1 week ago", "benefits": "The base salary range for this role is $66,560 - $75,150. The base salary range is dependent on factors including, but not limited to, experience, skills, qualifications, relevant education, certifications, seniority, and location. The range listed is just one component of the total compensation package for employees. Other rewards vary by position and location.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000744307"}