{"jobTitle": "Marketing Account Coordinator", "company": {"name": "Gunn | Jerkens Marketing Communications", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "50,000.00/yr - 60,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Advertising Services", "description": "Looking to kick-start your career by becoming an integral part of a talented group of creatives and industry leaders by doing your part to support an account services team? If so, we’ve got an opportunity for you!\n<br/>\nGunn | Jerkens—a creative branding and marketing firm headquartered in Long Beach, California—is seeking an Account Coordinator to work with our account services team, with a primary focus on the management of day-to-day tasks to ensure continued success for our clients and the enhancement of our business in an ever-changing industry.\n<br/>\n**<u>What Are We All About?</u>**\nGunn | Jerkens is a fully integrated digital marketing and brand agency. With a driven team of ever-ready, in-house strategists, marketers, creatives, interactive developers, copywriters and media masters, we work together to build brands. We put an emphasis on collaboration and leverage our unique talents to create exceptional brands, campaigns and experiences through storytelling and creative problem-solving. We work to inspire real connections and create a quantifiable impact for our clients and their customers. We have fun. We get creative. And we do more than just get the job done—we lead the charge in this industry.\n<br/>\n**<u>What Makes You the Perfect Fit?</u>**\nIf you’re highly organized, maintain strong time management skills, bring an eagle-eyed attention to detail and an eagerness to collaborate to implement initiatives, you may be the right fit. You understand that a positive attitude, strong work ethic and keen sense of prioritizing are key to providing support that is beneficial to the team you work with—and that’s what keeps the group running effectively and clients happy. You also take pride in your robust attention to detail and are used to maintaining the highest degree of accuracy in the review of documents, both internal and client-facing, and you’re always eager to do your part to the highest standards. Plus, you have a non-negotiable knack for staying on top of things and remain cognizant of weekly activities and deadlines. You’re always looking to learn and seeking the opportunity to grow in this role and beyond.\n<br/>\nIf this sounds like you, you may have what it takes to thrive here, so let’s chat.\n<br/>\n**<u>Essential Functions</u> </strong>\n<ul><li>Work in tandem with the account team to develop and implement various initiatives in a timely manner. That includes creative copywriting, robust digital marketing campaigns, email marketing, websites, social media, special events and promotions</li><li>Serve as the day-to-day contact with internal agency counterparts</li><li>Traffic projects between various internal departments efficiently and in a manner that maintains a steady workflow</li><li>Help research, gather and organize information and insights for the development of creative briefs, weekly client reports and proposals</li><li>Provide logistical support for client meetings by:</li><li>Preparing meeting agendas and necessary info packets</li><li>Taking notes and preparing necessary reports with input and direction from the account team</li><li>Working with creative team members to prepare creative materials for client presentations</li><li>Review copy, artwork and proofs as assigned by the account team to ensure compliance with standard agency approval process</li><li>Maintain the highest form of accuracy on all work produced, reviewed and delivered to internal teams, clients and vendors</li><li>Remain cognizant of weekly client activities and deadlines</li><li>Provide clients with exceptional and effective customer service</li><li>Track client jobs and accurately enter time and expenses in the agency’s project management software</li><li>Maintain effective verbal and written communication skills</li><li>Desire to accept mentoring and guidance from the account team and other team members in an effort to grow marketing skillset</li></ul><p><br/></p><p><strong><u>Qualifications</u></strong></p><ul><li>BS/BA degree in marketing, communications or related field</li><li>Past account coordinator/services work or internship experience desired</li><li>Minimum one to two years of agency experience in an account management or client-facing role</li><li>Must reside within commuting distance of Long Beach, CA and be available to work in the office five days a week</li><li>Confident, positive attitude and ability to problem solve</li><li>Strong attention to detail</li><li>Exceptional customer service skills</li><li>Effective time management and prioritization skills</li><li>Solid knowledge of marketing principles</li><li>Experience working at an advertising agency is a plus</li></ul><p><br/></p><p><br/></p><p>Equal Opportunity Employer.</p>", "responsibilities": "Work in tandem with the account team to develop and implement various initiatives in a timely manner. That includes creative copywriting, robust digital marketing campaigns, email marketing, websites, social media, special events and promotions\nServe as the day-to-day contact with internal agency counterparts\nTraffic projects between various internal departments efficiently and in a manner that maintains a steady workflow\nHelp research, gather and organize information and insights for the development of creative briefs, weekly client reports and proposals\nProvide logistical support for client meetings by:\nPreparing meeting agendas and necessary info packets\nTaking notes and preparing necessary reports with input and direction from the account team\nWorking with creative team members to prepare creative materials for client presentations\nReview copy, artwork and proofs as assigned by the account team to ensure compliance with standard agency approval process\nMaintain the highest form of accuracy on all work produced, reviewed and delivered to internal teams, clients and vendors\nRemain cognizant of weekly client activities and deadlines\nProvide clients with exceptional and effective customer service\nTrack client jobs and accurately enter time and expenses in the agency’s project management software\nMaintain effective verbal and written communication skills\nDesire to accept mentoring and guidance from the account team and other team members in an effort to grow marketing skillset", "qualifications": {"required": "Must reside within commuting distance of Long Beach, CA and be available to work in the office five days a week\nConfident, positive attitude and ability to problem solve\nStrong attention to detail\nExceptional customer service skills\nEffective time management and prioritization skills\nSolid knowledge of marketing principles", "preferred": "BS/BA degree in marketing, communications or related field\nPast account coordinator/services work or internship experience desired\nMinimum one to two years of agency experience in an account management or client-facing role\nExperience working at an advertising agency is a plus"}, "skills": ["Marketing", "Digital Marketing", "Email Marketing", "Social Media", "Creative Copywriting", "Customer Service", "Time Management", "Prioritization", "Problem Solving", "Collaboration"], "postedDate": "6 days ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000697312"}