{"jobTitle": "Operations Manager", "company": {"name": "Michael Page", "location": "San Fernando, CA"}, "location": "San Fernando, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": ["Personal Care Product Manufacturing", "Retail Groceries", "Food and Beverage Manufacturing"], "description": "Room for growth and development at a top company|Incredible full benefits <br/><br/><br/><strong>About Our Client<br/><br/></strong>My client is a top consumer packaged goods company that prioritizes high quality ingredients. Additionally, they work hard to improve the quality of their product every opportunity they get.<br/><br/><strong>Job Description<br/><br/></strong><ul><li>Oversee daily operations of the production floor, ensuring that production schedules are met.</li><li>Implement and monitor quality control processes to maintain product standards.</li><li>Coordinate with the supply chain team to manage inventory levels and ensure the timely availability of raw materials.</li><li>Manage and mentor a team of production supervisors and staff, fostering a culture of teamwork and continuous improvement.</li><li>Conduct regular performance reviews and provide training opportunities to enhance team skills.</li><li>Ensure compliance with safety regulations and promote a safe working environment.</li><li>Identify areas for process improvements and implement strategies to enhance efficiency and reduce waste.</li><li>Collaborate with the R&amp;D team to integrate new products into the production line.</li><li>Develop and enforce standard operating procedures (SOPs) across all operations.<br/><br/></li></ul><em>MPI does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, disability, veteran status, marital status, or based on an individual's status in any group or class protected by applicable federal, state or local law. MPI encourages applications from minorities, women, the disabled, protected veterans and all other qualified applicants.<br/><br/></em><strong>The Successful Applicant<br/><br/></strong><ul><li>Bachelor's Degree</li><li>10+ years of experience in Manufacturing, ideally CPG industry</li><li>Strong leadership skills with experience managing production teams.</li><li>Excellent problem-solving abilities and a track record of process improvements.</li><li>Proficient in using ERP systems and other production management software.</li><li>Knowledge of supply chain management and logistics.</li><li>Strong communication and interpersonal skills.</li><li>Ability to thrive in a fast-paced, dynamic environment.<br/><br/></li></ul><strong>What's on Offer<br/><br/></strong><ul><li>Great Benefits (Medical, Dental, Vision)<br/><br/><br/></li></ul><strong>Contact: Delaney Mayfield<br/><br/></strong><strong>Quote job ref: JN-082024-6509577</strong>", "postedDate": "1 week ago", "skills": [], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000605728"}