{"jobTitle": "Occupational Therapy Assistant", "company": {"name": "OMNI Therapy, Inc.", "location": "Hesperia, CA"}, "location": "Hesperia, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Health Care Provider", "industry": "Internet Publishing", "description": "Certified Occupational Therapy Assistant (COTA or OTA/L) for Home Health<br/><br/>Omni Therapy in Hesperia, Ca.<br/><br/><em>Pay: $60 - $63 per visit<br/><br/></em>Professional Opportunity Details:<br/><br/>Omni Therapy is looking for a contract Certified Occupational Therapy Assistant (COTA or OTA/L) to evaluate and treat patients in their homes in Hesperia, Ca.<br/><br/>Did You Know?<br/><br/><ul><li>Omni Therapy gives you complete control over your work schedule and accept or decline patients without penalty or pressure</li><li>Omni Therapy takes much of the administrative work off your hands so that you can focus on what you do best - providing excellent occupational therapy services to patients in your area</li><li>Don't get bogged down with the details! Just let Omni Therapy know what you need, and we'll take care of it. Whether it's getting more visits for your patients, getting help with properly filling out or submitting a note, or appointment scheduling with your patient... We're standing on the sidelines and ready to help you every step of the way so that you have the support you need to ensure your patients reach their goals</li><li>Our exceptional support staff will keep you updated on any patient changes and alert you when any items are needed to continue your patient’s plan of care</li><li>Our dedicated team of care coordinators and case managers step in and assist with completing portions of your notes for you when needed</li><li>Omni Therapy acts as a bridge between our occupational therapy partners and the home health agencies to handle all questions, concerns, or corrections that need to be made on visitation documentation<br/><br/></li></ul>Company Overview:<br/><br/><ul><li>Omni Therapy has provided excellent in-home occupational therapy solutions throughout California for 13 years</li><li>Omni Therapy pays you on time, every time, via direct deposit, twice every month</li><li>Omni Therapy takes care of all invoicing for your visits. No need to send us an invoice!</li><li>We will send you a preliminary paystub to review and then we will reliably deposit your money into your account twice every month</li><li>We have weekend support staff consisting of experienced case managers to aid with any questions you may have from</li><li>Omni Therapy uses an innovative tiered referral system designed to provide you with a larger number of referrals within a smaller radius in your preferred territories</li><li>Our therapy partners spend less time in traffic and more time caring for patients. Keep more money in your pocket instead of in your gas tank!</li><li>Omni Therapy offers competitive pay and flexible hours to our therapy partners</li><li>Omni Therapy offers user-friendly web-based electronic documentation and assistance with note submission</li><li>Omni Therapy’s messaging app allows therapists to communicate directly with office staff, case managers, and any other clinicians who are treating mutual patients<br/><br/></li></ul>Powered by JazzHR<br/><br/>AMYl5Hjv63", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4000856627"}