{"jobTitle": "Executive Assistant, Marketing, Ads, Comms, CPX (MACC) Legal", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "50,000.00 - 235,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong><strong>Responsibilities<br/><br/></strong>Netflix is seeking an Executive Assistant to provide support for Vice President, Marketing, Ads, Comms, CPX (MACC) Legal in Los Angeles along with two additional senior team members. The successful candidate will be self-motivated, quick-thinking, flexible, and able to juggle multiple and diverse responsibilities with a strong emphasis on organization and unwavering attention to detail at all times. This is a demanding and fast-moving position that requires someone who is able to exercise good judgment and significant initiative and is looking for a new challenge. Specific responsibilities include, but are not limited to:<br/><br/><ul><li>Maintaining calendars for the VP and senior team members, building relationships and working hand-in-hand with other EAs for our stakeholders across the business</li><li>Scheduling meetings &amp; calls, internally &amp; externally </li><li>Helping to plan agendas and programs for the whole team (~35 people)</li><li>Taking notes in meetings and circulating information to the team</li><li>Coordinate travel arrangements (domestic and international) and other administrative duties (i.e. processing travel and expense reports, digital filing, etc.)</li><li>Creating presentations and documents using Google Suite</li><li>Maintaining a log used to track projects and their status</li><li>The ability to assist with team projects and events as needed including an annual Offsite/Onsite and a variety of monthly team VCs across multiple time zones</li><li>Coordinating offsite events &amp; activities</li><li>Location scouting, talking with vendors, working on all logistics</li><li>Executing logistics for projects and events that impact the entire org<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Experience in an EA support role</li><li>Advanced proficiency with Google Suite including Gmail, Google Calendar, Google Slides, Google Sheets and Slack in a business environment (not just personal use)</li><li>Resourceful and understands how to navigate stakeholder management</li><li>Excellent organizational, communication, and customer service skills</li><li>Quick learner</li><li>Self Starter</li><li>Strong problem-solving skills with the ability to see the big picture</li><li>Ability to work comfortably with people at all levels of the organization</li><li>Loads of common sense, flexibility, and maturity – must be discreet and able to maintain confidential information</li><li>Positive attitude and team player, especially when faced with changing responsibilities</li><li>Belief that no contribution to the team is too big or too small</li><li>Understanding how to prioritize and respond accordingly<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $50,000 - $235,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "Netflix is seeking an Executive Assistant to provide support for Vice President, Marketing, Ads, Comms, CPX (MACC) Legal in Los Angeles along with two additional senior team members. The successful candidate will be self-motivated, quick-thinking, flexible, and able to juggle multiple and diverse responsibilities with a strong emphasis on organization and unwavering attention to detail at all times. This is a demanding and fast-moving position that requires someone who is able to exercise good judgment and significant initiative and is looking for a new challenge. Specific responsibilities include, but are not limited to:<br/><br/><ul><li>Maintaining calendars for the VP and senior team members, building relationships and working hand-in-hand with other EAs for our stakeholders across the business</li><li>Scheduling meetings &amp; calls, internally &amp; externally </li><li>Helping to plan agendas and programs for the whole team (~35 people)</li><li>Taking notes in meetings and circulating information to the team</li><li>Coordinate travel arrangements (domestic and international) and other administrative duties (i.e. processing travel and expense reports, digital filing, etc.)</li><li>Creating presentations and documents using Google Suite</li><li>Maintaining a log used to track projects and their status</li><li>The ability to assist with team projects and events as needed including an annual Offsite/Onsite and a variety of monthly team VCs across multiple time zones</li><li>Coordinating offsite events &amp; activities</li><li>Location scouting, talking with vendors, working on all logistics</li><li>Executing logistics for projects and events that impact the entire org<br/><br/></li></ul>", "qualifications": {"required": "Experience in an EA support role, Advanced proficiency with Google Suite including Gmail, Google Calendar, Google Slides, Google Sheets and Slack in a business environment (not just personal use), Resourceful and understands how to navigate stakeholder management, Excellent organizational, communication, and customer service skills, Quick learner, Self Starter, Strong problem-solving skills with the ability to see the big picture, Ability to work comfortably with people at all levels of the organization, Loads of common sense, flexibility, and maturity – must be discreet and able to maintain confidential information, Positive attitude and team player, especially when faced with changing responsibilities, Belief that no contribution to the team is too big or too small, Understanding how to prioritize and respond accordingly"}, "skills": ["Google Suite", "Gmail", "Google Calendar", "Google Slides", "Google Sheets", "Slack", "Stakeholder Management", "Organizational Skills", "Communication Skills", "Customer Service", "Problem Solving"], "postedDate": "1 week ago", "benefits": "Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $50,000 - $235,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4000103343"}