{"jobTitle": "Training and Development Manager", "company": {"name": "Kelly", "location": "Monrovia, CA"}, "location": "Monrovia, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Staffing and Recruiting", "description": "Kelly® is seeking a Manufacturing Training and Development Manager for a direct-hire role with an electrical manufacturing company in Monrovia, CA. This opportunity is perfect for those looking to align their career with their lifestyle.<br/><br/><strong>Responsibilities<br/><br/></strong>The Training and Development Manager is responsible for designing, implementing, and managing effective training programs to enhance the skills, knowledge, and productivity of employees in the manufacturing plant. This role involves working closely with department heads to identify training needs, developing training materials, and ensuring that all training initiatives align with company goals and regulatory requirements.    <br/><br/><li></li><ul><li>Design and develop training programs, materials, and resources tailored to the needs of the manufacturing workforce. </li><li>Collaborate with department managers to identify specific training needs based on job roles, performance goals, and regulatory requirements. </li><li>Create and implement onboarding programs for new employees to ensure they are equipped with the necessary skills and knowledge. </li></ul><li>Training Delivery:</li><ul><li>Conduct training sessions using a variety of methods (e.g., classroom, e-learning, hands-on, simulations) to accommodate different learning styles. </li><li>Coordinate with external trainers or consultants as needed to deliver specialized training. </li></ul><li>Program Management and Evaluation:</li><ul><li>Monitor and assess the effectiveness of training programs through evaluations, feedback, and performance metrics. </li><li>Adjust training content and delivery methods as necessary to ensure continuous improvement. </li><li>Maintain accurate records of training activities, employee progress, and certification statuses. </li></ul><li>Compliance and Safety Training:</li><ul><li>Ensure that all training programs comply with industry regulations, safety standards, and company policies. </li><li>Develop and deliver mandatory safety training programs to ensure a safe working environment. </li><li>Keep up-to-date with changes in safety regulations and industry standards, updating training programs accordingly. </li><li>Identify and develop potential future leaders through targeted training and mentoring programs. </li><li>Bachelor’s degree in Human Resources, Organizational Development, Education, or a related field. </li><li>5+ years of experience in training and development, preferably in a manufacturing environment with high voltage electrical experience. </li><li>Strong understanding of manufacturing processes and industry-specific training requirements. </li><li>Bilingual in Spanish a plus </li><li>Salary: $130k+ a year </li><li>Schedule: Monday-Friday 8am-5pm/ 7am-4pm 100% onsite <br/><br/></li></ul><strong>Next Steps<br/><br/></strong>Apply today! If it’s not the right fit, we’ll keep you in our network for future opportunities. Contact Daisy at 562-471-7322 or email your resume to daid740@kellyservices.com.<br/><br/>As part of our promise to talent, Kelly supports those who work with us through a variety of benefits, perks, and work-related resources. Kelly offers eligible employees voluntary benefit plans including medical, dental, vision, telemedicine, term life, whole life, accident insurance, critical illness, a legal plan, and short-term disability. As a Kelly employee, you will have access to a retirement savings plan, service bonus and holiday pay plans (earn up to eight paid holidays per benefit year), and a transit spending account. In addition, employees are entitled to earn paid sick leave under the applicable state or local plan. Click here for more information on benefits and perks that may be available to you as a member of the Kelly Talent Community.<br/><br/>Get a complete career fit with Kelly®.<br/><br/>You’re looking to keep your career moving onward and upward, and we’re here to help you do just that. Our staffing experts connect you with top companies for opportunities where you can learn, grow, and thrive. Jobs that fit your skills and experience, and most importantly, fit right on your path of where you want to go in your career.<br/><br/><strong>About Kelly<br/><br/></strong>Work changes everything. And at Kelly, we’re obsessed with where it can take you. To us, it’s about more than simply accepting your next job opportunity. It’s the fuel that powers every next step of your life. It’s the ripple effect that changes and improves everything for your family, your community, and the world. Which is why, here at Kelly, we are dedicated to providing you with limitless opportunities to enrich your life—just ask the 300,000 people we employ each year.<br/><br/>Kelly Services is proud to be an Equal Employment Opportunity and Affirmative Action employer. We welcome, value, and embrace diversity at all levels and are committed to building a team that is inclusive of a variety of backgrounds, communities, perspectives, and abilities. At Kelly, we believe that the more inclusive we are, the better services we can provide. Requests for accommodation related to our application process can be directed to Kelly’s Human Resource Knowledge Center. Kelly complies with the requirements of California’s state and local Fair Chance laws. A conviction does not automatically bar individuals from employment. Kelly participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.<br/><br/>", "responsibilities": "The Training and Development Manager is responsible for designing, implementing, and managing effective training programs to enhance the skills, knowledge, and productivity of employees in the manufacturing plant. This role involves working closely with department heads to identify training needs, developing training materials, and ensuring that all training initiatives align with company goals and regulatory requirements.", "qualifications": {"required": "Bachelor’s degree in Human Resources, Organizational Development, Education, or a related field. 5+ years of experience in training and development, preferably in a manufacturing environment with high voltage electrical experience. Strong understanding of manufacturing processes and industry-specific training requirements.", "preferred": "Bilingual in Spanish a plus"}, "skills": ["Training and Development", "Manufacturing", "High Voltage Electrical", "Onboarding", "Program Management", "Compliance", "Safety", "Leadership Development"], "postedDate": "3 days ago", "benefits": "Kelly offers eligible employees voluntary benefit plans including medical, dental, vision, telemedicine, term life, whole life, accident insurance, critical illness, a legal plan, and short-term disability. As a Kelly employee, you will have access to a retirement savings plan, service bonus and holiday pay plans (earn up to eight paid holidays per benefit year), and a transit spending account. In addition, employees are entitled to earn paid sick leave under the applicable state or local plan.", "remoteWork": "No", "salary": {"amount": "130k+", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4000583990"}