{"jobTitle": "Inventory Manager II", "company": {"name": "Azelis", "location": "Santa Fe Springs, CA"}, "location": "Santa Fe Springs, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Chemical Manufacturing", "description": "<strong>Summary<br/><br/></strong>The Inventory Manager II (IM II) for Ross Organics Specialty Sales, LLC (Ross Organics) is responsible for overall inventory management for assigned suppliers. The IM II reports direct to the Supply Chain Manger for Ross Organics. Maintaining proper inventory levels in all assigned warehouses, identifies and actively resolves slow-moving or short-dated inventory, maintains accurate cost records and forecast information, communicates with transportation management provider for delivery of inbound material, build solid bilateral communication lines with the suppliers, sales force, customer service reps and management<br/><br/><strong>Essential Duties and Responsibilities </strong>include the following. Other duties may be assigned.<br/><br/><ul><li>Manage proper inventory levels to meet customer demand.</li><li>Effectively utilize forecasting software when applicable to determine need for purchasing</li><li>Regular evaluation of slow-moving, expired and obsolete inventory.</li><li>Responsible for preparing, reviewing and placing orders.</li><li>Provide communication to Customer Service regarding purchase orders including availability and communication of any delays</li><li>Prepare, issue, revise and monitor Purchase Orders making appropriate revisions as necessary.</li><li>Ensure maintenance of purchasing records in the ERP. Appropriate and effective use of pop up notes. </li><li>Provide feedback and input as appropriate for Supply-chain and cross-departmental meetings</li><li>Make recommendation to create or improve purchasing procedures in conjunction with business objectives and Customer Service excellence.</li><li>Make recommendations and implement increasing inventory turns, reducing inventory costs and improving service quality.</li><li>Negotiate and maintain detailed records of pricing for raw materials from supplier partners utilizing tools such as contracts and maintain existing supplier relationships.</li><li>Meet with vendors when applicable. </li><li>Communicate changes in market conditions to Sales Team.</li><li>Work closely with Pricing department</li><li>Placing purchase orders for products, parts, material, components, and services.<br/><br/></li></ul><strong>Other Responsibilities Include (but Not Limited To)<br/><br/></strong><ul><li>Understand and adhere to/follow the department procedures and policies</li><li>Adhere to and support the principles of Responsible Distribution™.</li><li>Assume other activities and responsibilities from time to time as directed.</li><li>Additional responsibilities may be assigned as needed.<br/><br/></li></ul><strong>Competencies<br/><br/></strong>To perform the job successfully, an individual should demonstrate the following competencies:<br/><br/>Analytical - Synthesizes complex or diverse information; Collects and researches data; Uses intuition and experience to complement data; Designs workflows and procedures.<br/><br/>Design - Generates creative solutions; Translates concepts and information into images; Uses feedback to modify designs; Demonstrates attention to detail.<br/><br/>Problem Solving - Identifies and resolves problems in a timely manner; Gathers and analyzes information skillfully; Develops alternative solutions; Works well in group problem solving situations; Uses reason even when dealing with emotional topics.<br/><br/>Technical Skills - Assesses own strengths and weaknesses; Pursues training and development opportunities; Strives to continuously build knowledge and skills; Shares expertise with others.<br/><br/>Oral Communication - Speaks clearly and persuasively in positive or negative situations; Listens and gets clarification; Demonstrates group presentation skills and a good command presence; Participates in meetings.<br/><br/>Written Communication - Writes clearly and informatively; Presents numerical data effectively.<br/><br/>Teamwork - Balances team and individual responsibilities; Exhibits objectivity and openness to others' views; Gives and welcomes feedback; Contributes to building a positive team spirit; Puts success of team above own interests; Able to build morale and group commitments to goals and objectives; Supports everyone's efforts to succeed.<br/><br/>Business Acumen - Understands business implications of decisions; Displays orientation to profitability; Demonstrates knowledge of market and competition; Aligns work with strategic goals. Significant level of experience in running a chemical distribution entity.<br/><br/>Cost Consciousness - Works within approved budget; Develops and implements cost saving measures; Contributes to profits and revenue; Conserves organizational resources. Has a strong command of margin optimization opportunities within the operation.<br/><br/>Ethics - Treats people with respect; Keeps commitments; Inspires the trust of others; Works with integrity and ethically.<br/><br/>Strategic Thinking - Develops strategies to achieve organizational goals; Understands organization's strengths &amp; weaknesses.<br/><br/><strong>Qualifications<br/><br/></strong>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required<br/><br/><strong>Education And Experience<br/><br/></strong><ul><li>Previous Buying or Inventory Planning Experience Required</li><li>College Degree, some college, or relevant Business Experience required.</li><li>Chemical Industry Knowledge Desired</li><li>2+ years’ experience in Inventory Management, Supply Chain or Chemical field</li><li>Must be able to multitask.</li><li>Ability to organize work as required to meet customer demands or corporate demands.</li><li>Ability to prioritize work, determining what is critical and needs to be completed.</li><li>Self-motivated, honest, dependable and a high-level of integrity.</li><li>Superior interpersonal skills.</li><li>Detail-oriented, well organized, and strong analytical and math skills.</li><li>Inventory forecasting model development experience.</li><li>Good PC and MS Office skills, especially Excel.</li><li>Ability to read, analyze, and interpret general business correspondence.</li><li>Effectively present information as necessary in written and spoken form.</li><li>Able to treat others with respect and dignity, maintain confidentiality on sensitive issues.</li><li>Able to effectively work in a team-based and quality driven environment, where all team members hold themselves mutually accountable.<br/><br/></li></ul><strong>Mathematical Skills<br/><br/></strong>Ability to work with mathematical concepts such as probability and statistical inference, and fundamentals of plane and solid geometry and trigonometry. Ability to apply concepts such as fractions, percentages, ratios, and proportions to practical situations.<br/><br/><strong>Reasoning Ability<br/><br/></strong>Ability to define problems, collect data, establish facts, and draw valid conclusions. Ability to interpret an extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables.<br/><br/><strong>Computer Skills<br/><br/></strong>To perform this job successfully, an individual should have knowledge of Internet software; Inventory software; Order processing systems; Project Management software; Spreadsheet software and Word Processing software.<br/><br/><strong>Physical Demands<br/><br/></strong>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><strong>Work Environment<br/><br/></strong>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4000730462"}