{"jobTitle": "Customer Support Program Manager", "company": {"name": "Compass", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "79,000.00/yr - 118,000.00/yr", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Real Estate", "description": "At Compass, our mission is to help everyone find their place in the world. Founded in 2012, we’re revolutionizing the real estate industry with our end-to-end platform that empowers residential real estate agents to deliver exceptional service to seller and buyer clients.<br/><br/>At Compass, we envision a world where the experience of selling or buying a home is simple, efficient and pleasant for everyone. Founded in 2012, Compass provides an end-to-end platform that empowers residential real estate agents to deliver exceptional service to their seller and buyer clients, all in service of our mission to help everyone find their place in the world.<br/><br/>Are you passionate about putting technology to work? Are you seeking a career that allows you to develop in one of the world’s fastest growing companies, and to have a tremendous impact on that growth? Compass is looking for passionate, driven professionals with a strong technical aptitude and the ability to connect products and business to constantly improve the customer experience to join our Executive Escalations and Product Operations Team.<br/><br/>The <strong>Support Escalations Program Manager</strong> will be the driving force behind Compass’ support escalation strategy, ensuring that both customer and staff problems are rapidly addressed with a high-touch and a white glove. This strategic role requires a systems thinker who can bring a data-driven and customer-centric approach to our escalation response plans. You will work closely with Product Operations, Support Engineering, and IT managers to create and implement strategies to enhance the escalated support experience, reduce defects in lower tiers, and improve responsiveness and quality metrics.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Assist in the creation and execution of a roadmap to address support-wide improvements that deliver systemic solutions to escalated issues.</li><li>Design and implement a 24/7 escalations strategy that ensures continuous, gap-free coverage and a blue sky vision of flawless support.</li><li>Apply systems thinking to design and implement a comprehensive defect reduction program aimed at minimizing escalation rates.</li><li>Partner with P&amp;E and Support Engineering to optimize and iterate on incident management processes, ensuring SLA adherence and timely customer and frontline communications.</li><li>Act as the primary liaison between Product Operations, Support Engineering, Support Accounts, and IT teams to drive alignment on escalation priorities and strategies.</li><li>Monitor and improve key support health metrics to evaluate efforts and provide regular reports on program outcomes.</li><li>Collaborate with leadership, support managers, regional leads, and other stakeholders to identify, define, and prioritize the problems they face.</li><li>Facilitate regular cross-functional meetings to discuss ongoing escalations, process improvements, and strategic initiatives.</li><li>Be the face of change management initiatives related to new processes, technologies, or strategies within support operations, ensuring smooth transitions and working with people managers to address pushback and resistance.</li><li>Identify potential risks associated with existing business processes and develop and implement strategies to mitigate them.</li><li>Provide thought leadership on escalation management and operational strategies.</li><li>Serve as a backup for senior IT and product support during technology/infrastructure incidents and outages. Flexibility for occasional after-hours or weekend commitments may be required, but this is not expected to be a regular responsibility.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Experience leading continuous improvement initiatives related to support operations, or similar processes to the benefit of end customers.</li><li>Experience resolving customer-facing issues in partnership with product managers and/or engineers, leveraging software-based ticketing systems such as Zendesk, Jira, or similar.</li><li>Experience analyzing structured and unstructured datasets using advanced spreadsheet formulas and techniques.</li><li>Excellent problem solving, communication, and collaboration skills.</li><li>Fast learning self-starter who is technically skilled, open-minded, and willing to adapt to changing situations.</li><li>Bachelor’s degree in Information Technology, Operations Management, Communications, or equivalent.</li><li>Experience with process improvement modalities such as Six Sigma, Lean, Agile, etc., with the ability to integrate these approaches into defect reduction and escalation management strategies preferred</li><li>This is an onsite-only role (sorry, no remote).<br/><br/></li></ul>The base pay range for this position is $79,000-$118,000 annually; however, base pay offered may vary depending on job-related knowledge, skills, and experience. Bonuses and restricted stock units may be provided as part of the compensation package, in addition to a full range of benefits. Base pay is based on market location. Minimum wage for the position will always be met.<br/><br/><strong>Perks That You Need To Know About<br/><br/></strong>Participation in our incentive programs (which may include where eligible cash, equity, or commissions). Plus paid vacation, holidays, sick time, parental leave, marriage leave, and recharge leave; medical, tele-health, dental and vision benefits; 401(k) plan; flexible spending accounts (FSAs); commuter program; life and disability insurance; Maven (a support system for new parents); Carrot (fertility benefits); UrbanSitter (caregiver referral network); Employee Assistance Program; and pet insurance.<br/><br/><strong>Do your best work, be your authentic self.<br/><br/></strong>At Compass, we believe that everyone deserves to find their place in the world — a place where they feel like they belong, where they can be their authentic selves, where they can thrive. Our collaborative, energetic culture is grounded in our Compass Entrepreneurship Principles and our commitment to diversity, equity, inclusion, growth and mobility. As an equal opportunity employer, we offer competitive compensation packages, robust benefits and professional growth opportunities aimed at helping to improve our employees' lives and careers.<br/><br/>Notice for California Applicants", "responsibilities": "Assist in the creation and execution of a roadmap to address support-wide improvements that deliver systemic solutions to escalated issues.\nDesign and implement a 24/7 escalations strategy that ensures continuous, gap-free coverage and a blue sky vision of flawless support.\nApply systems thinking to design and implement a comprehensive defect reduction program aimed at minimizing escalation rates.\nPartner with P&E and Support Engineering to optimize and iterate on incident management processes, ensuring SLA adherence and timely customer and frontline communications.\nAct as the primary liaison between Product Operations, Support Engineering, Support Accounts, and IT teams to drive alignment on escalation priorities and strategies.\nMonitor and improve key support health metrics to evaluate efforts and provide regular reports on program outcomes.\nCollaborate with leadership, support managers, regional leads, and other stakeholders to identify, define, and prioritize the problems they face.\nFacilitate regular cross-functional meetings to discuss ongoing escalations, process improvements, and strategic initiatives.\nBe the face of change management initiatives related to new processes, technologies, or strategies within support operations, ensuring smooth transitions and working with people managers to address pushback and resistance.\nIdentify potential risks associated with existing business processes and develop and implement strategies to mitigate them.\nProvide thought leadership on escalation management and operational strategies.\nServe as a backup for senior IT and product support during technology/infrastructure incidents and outages. Flexibility for occasional after-hours or weekend commitments may be required, but this is not expected to be a regular responsibility.", "qualifications": {"required": "Experience leading continuous improvement initiatives related to support operations, or similar processes to the benefit of end customers.\nExperience resolving customer-facing issues in partnership with product managers and/or engineers, leveraging software-based ticketing systems such as Zendesk, Jira, or similar.\nExperience analyzing structured and unstructured datasets using advanced spreadsheet formulas and techniques.\nExcellent problem solving, communication, and collaboration skills.\nFast learning self-starter who is technically skilled, open-minded, and willing to adapt to changing situations.\nBachelor’s degree in Information Technology, Operations Management, Communications, or equivalent.", "preferred": "Experience with process improvement modalities such as Six Sigma, Lean, Agile, etc., with the ability to integrate these approaches into defect reduction and escalation management strategies preferred"}, "skills": ["Support Operations", "Customer Service", "Data Analysis", "Problem Solving", "Communication", "Collaboration", "Technical Skills", "Six Sigma", "Lean", "Agile"], "postedDate": "1 week ago", "benefits": "Participation in our incentive programs (which may include where eligible cash, equity, or commissions). Plus paid vacation, holidays, sick time, parental leave, marriage leave, and recharge leave; medical, tele-health, dental and vision benefits; 401(k) plan; flexible spending accounts (FSAs); commuter program; life and disability insurance; Maven (a support system for new parents); Carrot (fertility benefits); UrbanSitter (caregiver referral network); Employee Assistance Program; and pet insurance.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001211453"}