{"jobTitle": "Executive Assistant", "company": {"name": "Russell Tobin", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "26.00/hr - 28.00/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Staffing and Recruiting", "description": "What are we looking for in our Executive Assistant?<br/><br/>Russell Tobin is hiring an <strong>Executive Assistant</strong> for one of our top clients, an industry leading media and entertainment company in <strong>Burbank, CA! </strong>As an Assistant, you will be responsible for administrative and other supportive tasks.<br/><br/><strong>Pay:</strong> $26-$28/hr. depending on experience<br/><br/><strong>Location:</strong> Burbank, CA 91521<br/><br/><strong>Schedule</strong>: M-F Hybrid- 4 days onsite- 1 remote<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Handle all scheduling responsibilities in a proactive nature</li><li>Prepare and manage expense reports plus book occasional travel</li><li>Coordinate meetings with 10+ attendees: prepare agendas, secure and plan space, facilitate and follow up as appropriate</li><li>Attend meetings, take notes and track action items</li><li>Serve as a liaison between various teams and groups under Social and Experiential</li><li>Manage distribution lists and contact/assignment sheets</li><li>Provide additional office support such as organizing documents, ordering supplies, and processing purchase orders and billing related items <br/><br/></li></ul><strong> Basic Qualifications:<br/><br/></strong><ul><li>1+ years administrative experience in entertainment</li><li>Strong organizational skills and the ability to pay close attention to detail</li><li>Able to prioritize against busy schedules and ever-changing calendars and work environment</li><li>Exceptional communication skills</li><li>A positive ‘can-do’ attitude, nothing is too large or too small and the ability to work effectively under pressure</li><li>Strong proficiency with Microsoft Word, PowerPoint, Excel, Outlook and Google Docs/Spreadsheets, Gmail and Zoom Excellent interpersonal skills</li><li>Ability to problem solve at all times<br/><br/></li></ul><strong>Preferred Qualifications:<br/><br/></strong><ul><li>2+ years administrative experience in entertainment, ideally in marketing</li><li>Passion for pop culture and all things television</li><li>Past experience at a major studio or streamer is a plus<br/><br/></li></ul><em>Russell Tobin is a leading minority-owned professional and technical recruitment and staffing advisory organization.<br/><br/></em><em>We are comprised of specialized practices focusing on a variety of skill sets and industries. Having a depth and breadth of industry expertise, our subject matter experts are able to provide tailored and swift sourcing solutions to fulfill client hiring needs. In other words, we connect top talent with companies.<br/><br/></em><em>As a certified minority-owned business, Pride Global and its affiliates - including Russell Tobin, Pride Health, and Pride Now - are committed to creating a diverse environment and are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics.<br/><br/></em><strong>Russell Tobin offers eligible employees comprehensive healthcare coverage (medical, dental, and vision plans), supplemental coverage (accident insurance, critical illness insurance and hospital indemnity), a 401(k)-retirement savings, life &amp; disability insurance, an employee assistance program, identity theft protection, legal support, auto and home insurance, pet insurance, and employee discounts with some preferred vendors.<br/><br/></strong>#CB<br/><br/>Rate/Salary: $26-$28/hr. DOE", "responsibilities": "As an Assistant, you will be responsible for administrative and other supportive tasks.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Handle all scheduling responsibilities in a proactive nature</li><li>Prepare and manage expense reports plus book occasional travel</li><li>Coordinate meetings with 10+ attendees: prepare agendas, secure and plan space, facilitate and follow up as appropriate</li><li>Attend meetings, take notes and track action items</li><li>Serve as a liaison between various teams and groups under Social and Experiential</li><li>Manage distribution lists and contact/assignment sheets</li><li>Provide additional office support such as organizing documents, ordering supplies, and processing purchase orders and billing related items <br/><br/></li></ul>", "qualifications": {"required": "1+ years administrative experience in entertainment, Strong organizational skills and the ability to pay close attention to detail, Able to prioritize against busy schedules and ever-changing calendars and work environment, Exceptional communication skills, A positive ‘can-do’ attitude, nothing is too large or too small and the ability to work effectively under pressure, Strong proficiency with Microsoft Word, PowerPoint, Excel, Outlook and Google Docs/Spreadsheets, Gmail and Zoom Excellent interpersonal skills, Ability to problem solve at all times", "preferred": "2+ years administrative experience in entertainment, ideally in marketing, Passion for pop culture and all things television, Past experience at a major studio or streamer is a plus"}, "skills": ["Microsoft Word", "PowerPoint", "Excel", "Outlook", "Google Docs", "Spreadsheets", "Gmail", "Zoom"], "postedDate": "1 week ago", "benefits": "Russell Tobin offers eligible employees comprehensive healthcare coverage (medical, dental, and vision plans), supplemental coverage (accident insurance, critical illness insurance and hospital indemnity), a 401(k)-retirement savings, life &amp; disability insurance, an employee assistance program, identity theft protection, legal support, auto and home insurance, pet insurance, and employee discounts with some preferred vendors.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4001225432"}