{"jobTitle": "Communications Manager, Basketball", "company": {"name": "LA Clippers", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000.00 - $85,000.00", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Spectator Sports", "description": "The LA Clippers are looking for a Communication Manager to join the team! As the Basketball Communications manager you will help drive the overall narrative of the Clippers across all owned and earned media channels and assist in developing the voice and tone of the team and organization. In this role you will be primarily responsible for increasing fan and media engagement with number-driven notes and unique storylines that add onto the team’s content strategy, while working closely with players, coaches, and front office staff. This position will help lead basketball communications for the team, assist in many projects related to players and the team and assist with the corporate communications and Intuit Dome communications departments.<br/><br/>The development of local and national media relationships is crucial to the success of the position. Attending team practices and traveling with team will be required. In addition, this role will assist in coordinating day-to-day interviews with coaches and players. This role reports directly to our VP of Communications and plays a vital role in our team's success, while working with our Director of Basketball communications. High energy, maturity, and leadership can serve as a unifying force and position communications discussions at the strategic and tactical levels.<br/><br/>This is a full-time role based in Inglewood, CA and is eligible for our competitive benefit offering including medical, dental, vision, 401(k) plan with company contribution, Well-Being Allowance, and more. This position's scope includes a 24-hour, 7-day a week operation with the transition of many daily events. Due to the nature of this industry, the candidate must be available to work a flexible schedule including weeknights, weekends, and holidays to cover high profile concerts and NBA games.<br/><br/><strong>What You Will Do<br/><br/></strong><ul><li>Work within the basketball and communications teams to develop daily basketball storylines that drive our narrative. </li><li>Ensure that all basketball publications including game notes, coach and media stats, daily clips are done properly and on time. </li><li>Bring high energy, maturity, and leadership to serve as a unifying force and position communications discussions at the strategic and tactical levels. </li><li>Create written, basketball editorial content and deal with media daily. </li><li>Closely monitor media coverage for the organization to provide daily updates that creates internal messaging and helps to determine immediate response needs. </li><li>Travel with team, attend practices and assist in daily interview needs under guidance of Director of Communications. </li><li>Ability to come up with strong basketball story ideas and pitch to media to ensure proper basketball narrative for the organization. </li><li>Ability to help manage Coordinator, Communications, game night staff and stat crew. <br/><br/><br/></li></ul><strong>Your Background, Skills And Qualifications<br/><br/></strong><ul><li>4-7 years of strong communications experience, preferably in professional sports, events and entertainment. </li><li>Strong working relationships with national media outlets across multiple platforms. </li><li>Excellent writing, editing and verbal communication skills. </li><li>Ability to develop storylines and execute across multiple platforms. </li><li>Ability to manage multiple deadlines and priorities. </li><li>Knowledge of sports communications publications and ability to deliver them on time. </li><li>A strong track record as an implementer who thrives on managing a variety of key initiatives concurrently. </li><li>Ability to work with multiple stat programs. </li><li>Sincere commitment to work collaboratively with all media, visiting teams and departments within the organization. </li><li>Must be a reliable and flexible team player with a friendly and professional attitude. </li><li>Must be able to expertly and professionally handle all media types and independently troubleshoot on the fly. </li><li>Demonstrated dedication with the ability to lead projects from origin through execution. </li><li>Willingness to learn and should be able to flourish in a fast-growing, dynamic environment. </li><li>Effective interpersonal skills, both oral and written. </li><li>Self-starter and entrepreneurial spirit with hands-on approach towards business. </li><li>Demonstrated ability to communicate and positively interact in a diverse multi-cultural environment. <br/><br/><br/></li></ul><strong>About Intuit Dome:<br/><br/></strong>Opening in August 2024, Intuit Dome is the new home of the LA Clippers and will host hundreds of sporting events and concerts each year. Located in Inglewood, Calif., Intuit Dome is built differently -- it will redefine fans’ expectations for live experiences and change the music landscape in Los Angeles.<br/><br/>Set to host the 2026 NBA All-Star game, Intuit Dome is over 1 million square feet and features our team training center, business operations offices, five full-sized basketball courts, an 80,000 square foot outdoor plaza and a double-sided Halo Board composed of more than an acre of LED.<br/><br/><strong>Compensation<br/><br/></strong><ul><li>The range for this position is $75,000 - $85,000 annual compensation. The compensation package offered will be based on multiple individualized factors, including a candidate's job-related knowledge, skills, and experience. </li><li>The role is classified as exempt. <br/><br/><br/></li></ul><strong>Benefits And Perks<br/><br/></strong>We offer a competitive benefits program, including:<br/><br/><ul><li>Medical, Dental and Vision plans</li><li>401(k) plan with company contribution</li><li>Wellbeing Allowance of up to $1,000 per year</li><li>Financial Education and Wellness Program, including access to Certified Financial Planners</li><li>Paid vacation and sick time</li><li>Paid parental leave</li><li>Flexible Spending Accounts (Medical and Dependent Care)</li><li>Company-paid Long Term Disability insurance</li><li>Company-paid Life and AD&amp;D Insurance</li><li>Voluntary Life Insurance options for employee, spouse and children</li><li>Employee Assistance Program</li><li>Mind health support via Modern Health and Headspace<br/><br/><br/></li></ul>The LA Clippers are a proud equal opportunity employer. It is our desire and intent that all employees enjoy a professional business working environment that is free from discrimination and harassment. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment.<br/><br/>To view our employment privacy policy, please visit https://www.nba.com/clippers/california-employment-privacy-policy", "responsibilities": "As the Basketball Communications manager you will help drive the overall narrative of the Clippers across all owned and earned media channels and assist in developing the voice and tone of the team and organization. In this role you will be primarily responsible for increasing fan and media engagement with number-driven notes and unique storylines that add onto the team’s content strategy, while working closely with players, coaches, and front office staff. This position will help lead basketball communications for the team, assist in many projects related to players and the team and assist with the corporate communications and Intuit Dome communications departments.<br/><br/>The development of local and national media relationships is crucial to the success of the position. Attending team practices and traveling with team will be required. In addition, this role will assist in coordinating day-to-day interviews with coaches and players. This role reports directly to our VP of Communications and plays a vital role in our team's success, while working with our Director of Basketball communications. High energy, maturity, and leadership can serve as a unifying force and position communications discussions at the strategic and tactical levels.", "qualifications": {"required": "4-7 years of strong communications experience, preferably in professional sports, events and entertainment. \nStrong working relationships with national media outlets across multiple platforms. \nExcellent writing, editing and verbal communication skills. \nAbility to develop storylines and execute across multiple platforms. \nAbility to manage multiple deadlines and priorities. \nKnowledge of sports communications publications and ability to deliver them on time. \nA strong track record as an implementer who thrives on managing a variety of key initiatives concurrently. \nAbility to work with multiple stat programs. \nSincere commitment to work collaboratively with all media, visiting teams and departments within the organization. \nMust be a reliable and flexible team player with a friendly and professional attitude. \nMust be able to expertly and professionally handle all media types and independently troubleshoot on the fly. \nDemonstrated dedication with the ability to lead projects from origin through execution. \nWillingness to learn and should be able to flourish in a fast-growing, dynamic environment. \nEffective interpersonal skills, both oral and written. \nSelf-starter and entrepreneurial spirit with hands-on approach towards business. \nDemonstrated ability to communicate and positively interact in a diverse multi-cultural environment.", "preferred": ""}, "skills": ["Communications", "Media Relations", "Sports", "Content Strategy", "Storytelling", "Public Relations", "Writing", "Editing", "Event Management", "Leadership", "Teamwork", "Problem Solving", "Time Management", "Organization", "Communication"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Medical, Dental and Vision plans\n401(k) plan with company contribution\nWellbeing Allowance of up to $1,000 per year\nFinancial Education and Wellness Program, including access to Certified Financial Planners\nPaid vacation and sick time\nPaid parental leave\nFlexible Spending Accounts (Medical and Dependent Care)\nCompany-paid Long Term Disability insurance\nCompany-paid Life and AD&amp;D Insurance\nVoluntary Life Insurance options for employee, spouse and children\nEmployee Assistance Program\nMind health support via Modern Health and Headspace", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001807682"}