{"jobTitle": "Accounting Manager", "company": {"name": "ProducePay", "industry": "Non-profit Organizations and Primary and Secondary Education", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$110,000.00 - $130,000.00", "currency": "USD"}, "jobFunction": "Finance", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "ProducePay has created the first-ever online financing and marketplace for fresh perishable produce. Our company has raised over $290MM+ to help the multi-billion dollar Agriculture Industry and works with hundreds of growers, distributors, and wholesalers across the world. At the intersection of Tech, Finance, and Ag, ProducePay's product is as fascinating as it is challenging. We are committed to building a better supply chain for fresh produce, one that places trust at the center of every transaction.", "responsibilities": "Strong background in operational areas of accounting, accounts payable, liabilities, general ledger and balance sheet reconciliations. Background in mentoring and developing accounting staff. Along with Accounting staff responsible for Month End, Quarterly and Year End Close process under tight deadlines. Operate and supervise automated systems that track T&E as well as maintain and develop internal controls around T&E. Manage the audit process as needed along with team. Strong General Ledger maintenance, management and account reconciliation is a must. Ongoing review of accounting processes by working with teams across the company to find improvements in accounting operations. Ensure that GL is in accordance with GAAP in all non-technical operational areas of accounting.", "qualifications": {"required": "Minimum of 7 years of progressive Accounting experience with at least 3 years in a managerial role. Bachelor's degree in Accounting or Finance is a must. CPA or CMA Certification is required. Keen knowledge of US GAAP. Experience with foreign currency. A willingness to step up to get the job done and interest in process improvements and ad-hoc projects as needed. Expert Excel is a must with 10 years experience in MS Office. Proven records of accuracy, diligence, and responsiveness in accounting. Expert GL Transactional Management background. Experience with ERP system, with NetSuite is desirable. Self-starter, adaptive, proactive, and fast learning. Excellent communication and organization skills. Bilingual in English and Spanish desirable.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Salary Range: USD $110,000 to $130,000. Health Care Plan (Medical, Dental & Vision). Retirement Plan (401k, IRA). Life Insurance (Basic, Voluntary & AD&D). Paid Time Off (Vacation, Sick & Public Holidays). Family Leave (Maternity, Paternity). Short Term & Long Term Disability. Training & Development. Work From Home. Free Food & Snacks. Wellness Resources. Stock Option Plan.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4001748285"}