{"jobTitle": "Interactive Films Production Coordinator", "company": {"name": "Snail Games USA", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$60,000.00/yr - $80,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Software Development", "description": "<strong>Company Overview:<br/><br/></strong>Snail, Inc. is the leading independent global developer and publisher of digital entertainment. Interactive Films is a dynamic and innovative production studio under Snail Inc. dedicated to creating compelling and engaging short-form narrative content such as vertical web series, FMV, etc. We are committed to delivering high-quality entertainment to audiences worldwide.<br/><br/><strong>Job Description:<br/><br/></strong>We are seeking a dedicated and hyper-organized production operations specialist who can be relied on to oversee the day-to-day management of multiple ongoing webisode productions, leading coordination, logistics, and administrative efforts to ensure seamless high-quality output that meets deadlines and budgets.<br/><br/>The ideal candidate will have a strong background in production assisting, production coordination, and production management, with specific expertise within web series, vertical series, and mobisode productions.<br/><br/>A thorough understanding of the entertainment industry, as well as experience in managing production timelines, budgets, and personnel is required. The ability to think strategically, communicate efficiently, and manage many moving parts is a necessity. Deep knowledge and passion for vertical dramas and web series across the global market is a plus.<br/><br/>Candidates will need to be bilingual in Chinese/English, in order to be a vital connecting piece between Los Angeles-based divisions and Chinese employees, partners, and production studios.<br/><br/>This position will report directly to Interactive Films’ Content Director and will be an onsite full-time role at our Beverly Hills office.<br/><br/><strong>Responsibilities: <br/><br/></strong><ul><li>Track and manage all moving parts across a multi-show slate from concept through post-production, acting as project manager and keeping the Content Director and executives informed of progress, updates, and changes.</li><li>Work in partnership with the Content Director on frontlines communications, while taking responsibility for facilitating the creation, tracking, and transfer of relevant information and materials across individuals and divisions. </li><li>Handle logistics around payments, invoices, and how these impact bottom line budget. Compare against presented deliverables to ensure efficient compensation, and prompt follow-up if deadlines are not met. </li><li>Run point on scheduling, showcasing comfortability in holding to and revising timelines as needed, all without deterrent to quarter-end and year-end goals. </li><li>Implement organizational systems alongside the Content Director to ensure consistency and quality is met across shows, locations, departments, talent, and partners. </li><li>Evaluate and prioritize the most vital tasks and communications, presenting to the Content Director for discussion, action, and sign-off. </li><li>Provide administrative assistance to the Content Director, as well as necessary support and creative input to Interactive Films as a whole. <br/><br/></li></ul><strong>Requirements: <br/><br/></strong><ul><li>2+ years as a production coordinator, preferably within the film and television industry. </li><li>Proven expertise working within web series, vertical series, and mobisode production, with the ability to link to specific IPs. </li><li>Must have thorough understanding and appreciation for short-form romantic dramas and made-for-mobile digital content. </li><li>Bilingual in Chinese/English, with comfortability translating both verbally and editorially. </li><li>Exceptional project manager: highly organized, detail-oriented, and communicative, with a track record of successful leadership and high-quality end results. </li><li>Solutions-oriented with the ability to think on feet quickly and present innovative alternatives if issues arise. </li><li>Demonstrated expertise in budgeting, scheduling, and creating, managing, and holding others accountable to timelines.</li><li>Ability to provide thoughtful feedback on communications, scripts, outlines, cuts, trailers, and drafts at all stages. </li><li>Knowledge of Movie Magic Scheduling and Movie Magic Budgeting is a plus. </li><li>Technical background in film or television production is a plus. </li><li>Contacts across the entertainment space (including writers, production personnel, talent, etc.) is a plus. <br/><br/></li></ul>$28.85-$38.46/hourly<br/><br/>$4,770-$6,667/monthly<br/><br/>$60,000-$80,000", "responsibilities": "Track and manage all moving parts across a multi-show slate from concept through post-production, acting as project manager and keeping the Content Director and executives informed of progress, updates, and changes. Work in partnership with the Content Director on frontlines communications, while taking responsibility for facilitating the creation, tracking, and transfer of relevant information and materials across individuals and divisions. Handle logistics around payments, invoices, and how these impact bottom line budget. Compare against presented deliverables to ensure efficient compensation, and prompt follow-up if deadlines are not met. Run point on scheduling, showcasing comfortability in holding to and revising timelines as needed, all without deterrent to quarter-end and year-end goals. Implement organizational systems alongside the Content Director to ensure consistency and quality is met across shows, locations, departments, talent, and partners. Evaluate and prioritize the most vital tasks and communications, presenting to the Content Director for discussion, action, and sign-off. Provide administrative assistance to the Content Director, as well as necessary support and creative input to Interactive Films as a whole.", "qualifications": {"required": "2+ years as a production coordinator, preferably within the film and television industry. Proven expertise working within web series, vertical series, and mobisode production, with the ability to link to specific IPs. Must have thorough understanding and appreciation for short-form romantic dramas and made-for-mobile digital content. Bilingual in Chinese/English, with comfortability translating both verbally and editorially. Exceptional project manager: highly organized, detail-oriented, and communicative, with a track record of successful leadership and high-quality end results. Solutions-oriented with the ability to think on feet quickly and present innovative alternatives if issues arise. Demonstrated expertise in budgeting, scheduling, and creating, managing, and holding others accountable to timelines. Ability to provide thoughtful feedback on communications, scripts, outlines, cuts, trailers, and drafts at all stages. Knowledge of Movie Magic Scheduling and Movie Magic Budgeting is a plus. Technical background in film or television production is a plus. Contacts across the entertainment space (including writers, production personnel, talent, etc.) is a plus."}, "skills": ["Production Coordination", "Project Management", "Budgeting", "Scheduling", "Communication", "Film Production", "Television Production", "Chinese", "English"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001790488"}