{"jobTitle": "Manager, Internal Communications - Feature Animation", "company": {"name": "Netflix", "location": "Los Angeles, CA", "industry": "Entertainment Providers"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "160,000.00 - 320,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>The internal communications team at Netflix seeks to inspire employees, increase understanding of our business strategy, and support our culture of transparency. We’re hiring a manager to partner with our animated film studio — Feature Animation at Netflix (FAN) — with creative hubs across Los Angeles, Sydney, and Vancouver. FAN is largely made up of artists and storytellers who are focused on making original and undeniably great animated movies.<br/><br/><strong>Role<br/><br/></strong>Our ideal candidate will be a strategic thinker, strong communicator, and a relationship builder who can be a trusted partner and adviser to teams across multiple disciplines. This role will create global communications strategies, heavily focused on executive comms (partnering closely with our Studio President and senior leaders) and driving key communications across the studio (e.g. organizing town halls, writing speeches, managing newsletters). Key to this role is ensuring that:<br/><br/><ul><li>There is more proactive communication across the studio, including what the strategic priorities are and how employees’ work is contributing to progress;</li><li>Important updates are communicated in a consistent and organized way across the studio; and </li><li>Leaders have the support they need in communicating with employees.<br/><br/></li></ul><strong>To Succeed In This Role You Will Need<br/><br/></strong><ul><li>7+ years of experience in communications, preferably within entertainment, animation and/or technology industries;</li><li>A passion for animation and storytelling;</li><li>To be entrepreneurial and scrappy — a willingness to roll-up your sleeves and get work done;</li><li>Excellent written and oral communication skills (i.e. an expert simplifier);</li><li>Meticulous organizational skills, good judgment, and effective time management;</li><li>Experience working across a variety of channels and tools (including town halls, newsletters, video, etc.);</li><li>The ability to thrive in a fast-paced environment and work with a wide variety of internal partners;</li><li>To be a trusted partner and adviser to disparate teams and leaders across multiple disciplines and studio locations;</li><li>A passion for helping people and a curiosity about different cultures;</li><li>The ability to challenge established wisdom and work well cross-functionally; and </li><li>A dislike of hierarchy and bureaucracy but also an understanding that some structure - as well as the ability to plan - is needed to effect change. <br/><br/></li></ul>This role is based out of Netflix’s Los Angeles office and reports to the Senior Director of Internal Communications.<br/><br/>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $160,000 - $320,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "The internal communications team at Netflix seeks to inspire employees, increase understanding of our business strategy, and support our culture of transparency. We’re hiring a manager to partner with our animated film studio — Feature Animation at Netflix (FAN) — with creative hubs across Los Angeles, Sydney, and Vancouver. FAN is largely made up of artists and storytellers who are focused on making original and undeniably great animated movies.<br/><br/><strong>Role<br/><br/></strong>Our ideal candidate will be a strategic thinker, strong communicator, and a relationship builder who can be a trusted partner and adviser to teams across multiple disciplines. This role will create global communications strategies, heavily focused on executive comms (partnering closely with our Studio President and senior leaders) and driving key communications across the studio (e.g. organizing town halls, writing speeches, managing newsletters). Key to this role is ensuring that:<br/><br/><ul><li>There is more proactive communication across the studio, including what the strategic priorities are and how employees’ work is contributing to progress;</li><li>Important updates are communicated in a consistent and organized way across the studio; and </li><li>Leaders have the support they need in communicating with employees.<br/><br/></li></ul>", "qualifications": {"required": "7+ years of experience in communications, preferably within entertainment, animation and/or technology industries; A passion for animation and storytelling; To be entrepreneurial and scrappy — a willingness to roll-up your sleeves and get work done; Excellent written and oral communication skills (i.e. an expert simplifier); Meticulous organizational skills, good judgment, and effective time management; Experience working across a variety of channels and tools (including town halls, newsletters, video, etc.); The ability to thrive in a fast-paced environment and work with a wide variety of internal partners; To be a trusted partner and adviser to disparate teams and leaders across multiple disciplines and studio locations; A passion for helping people and a curiosity about different cultures; The ability to challenge established wisdom and work well cross-functionally; and A dislike of hierarchy and bureaucracy but also an understanding that some structure - as well as the ability to plan - is needed to effect change. ", "preferred": ""}, "skills": [], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4001978655"}