{"jobTitle": "Title Administrator (WPM)", "company": {"name": "Westlake Financial", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "18 hour with potential monthly bonus pay.", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Financial Services", "description": "<strong>POSITION SUMMARY: <br/><br/></strong>The Titles Administrator position is an entry level position within the company and will involve all tasks necessary for the processing of repossession titles as well as the release of vehicle titles and liens including:<br/><br/><ul><li>Mailing titles and lien releases for paid off accounts</li><li>Sending titles to auctions for repossessed vehicles</li><li>Generating repossession affidavits for repossessed vehicles</li><li>Releasing paper titles and electronic titles through our online platform</li><li>Updating account notes for released titles or repossession titles</li><li>Notarizing, signing, and handling DMV paperwork<br/><br/><br/></li></ul>The position will handle tasks associated with processing titles for vehicle repossessions and/or paid off accounts. This individual will need to regularly review older accounts to ensure timely processing. Additionally, applicant must be willing to become a notary public after being hired.<br/><br/>The successful candidate must show the ability to pay close attention to detail and learn and adapt to new tasks on a regular basis. Additionally, the applicant will need to be able to retain the latest information and make decisions based on knowledge acquired during training.<br/><br/><strong>ESSENTIAL KNOWLEDGE, SKILLS &amp; LICENSES: <br/><br/></strong><ul><li>Strong ability to stay organized</li><li>Strong attention to detail</li><li>Ability to stay on task with minimal supervision</li><li>Highly productive</li><li>Team oriented<br/><br/><br/></li></ul><strong>EDUCATION AND/OR EXPERIENCE: <br/><br/></strong><ul><li>High School diploma or equivalent</li><li>Previous experience in retail, food service, or a clerical setting</li><li>Read and comprehend instructions and information; communicate professionally on the phone; and use standard office equipment.<br/><br/><br/></li></ul><strong>MACHINES, OFFICE EQUIPMENT &amp; SOFTWARE<br/><br/></strong><ul><li>Basic web browsers including Microsoft chrome or Microsoft Edge</li><li>Familiarity with basic office applications including Microsoft Word, Excel</li><li>10-key calculator and typing skills</li><li>Copier, Faxing &amp; other general office supplies<br/><br/><br/></li></ul>The exact starting compensation to be offered will be determined at the time of selecting an applicant for hire and will be dependent on a wide range of factors, including but not limited to geographic location, skill set, experience, education, credentials, and licensure when applicable.<br/><br/><strong>PAY RATE<br/><br/></strong><ul><li>$18 hour with potential monthly bonus pay.</li><li>The exact starting compensation to be offered will be determined at the time of selecting an applicant for hire and will be dependent on a wide range of factors, including but not limited to geographic location, skill set, experience, education, credentials, and licensure when applicable.<br/><br/><br/></li></ul><strong>Full-time Benefits<br/><br/></strong><ul><li>Medical, Dental, and Vision benefits </li><li>Life Insurance and Long-term disability plans </li><li>Flexible Spending Account </li><li>401K matching </li><li>Employee Stock Ownership Program in a $18.2 Billion Company, plus company matching </li><li>Wellness Programs </li><li>Metro Tap Card and Metro-link Reimbursement (for Los Angeles, CA employees only) </li><li>Career Path Opportunities </li><li>Discounts on Parks, Museums, Movie Tickets, and Attractions </li><li>Employee Loan Assistance </li><li>Annual Flu Shot</li><li>Paid Vacations Days </li><li>Paid Sick days </li><li>Paid holidays </li><li>HGym (available in our Los Angeles, CA &amp; Dallas,TX office) </li><li>Rental Car Discounts, Dell Member Purchase Program </li><li>UKG Wallet <br/><br/><br/></li></ul>We provide Equal Employment Opportunities (EEO) to all Team Members (employees) and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, or genetics.<br/><br/>In addition to federal law requirements, we comply with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.<br/><br/>We expressly prohibit any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status. Improper interference with our Team Members' ability to perform their job duties may result in discipline up to and including discharge.<br/><br/>We will consider for employment all qualified Applicants, including those with Criminal Histories, in a manner consistent with the requirements of applicable state and local laws; including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.", "responsibilities": "The Titles Administrator position is an entry level position within the company and will involve all tasks necessary for the processing of repossession titles as well as the release of vehicle titles and liens including:<br/><br/><ul><li>Mailing titles and lien releases for paid off accounts</li><li>Sending titles to auctions for repossessed vehicles</li><li>Generating repossession affidavits for repossessed vehicles</li><li>Releasing paper titles and electronic titles through our online platform</li><li>Updating account notes for released titles or repossession titles</li><li>Notarizing, signing, and handling DMV paperwork<br/><br/><br/></li></ul>The position will handle tasks associated with processing titles for vehicle repossessions and/or paid off accounts. This individual will need to regularly review older accounts to ensure timely processing. Additionally, applicant must be willing to become a notary public after being hired.<br/><br/>The successful candidate must show the ability to pay close attention to detail and learn and adapt to new tasks on a regular basis. Additionally, the applicant will need to be able to retain the latest information and make decisions based on knowledge acquired during training.", "qualifications": {"required": "Strong ability to stay organized, Strong attention to detail, Ability to stay on task with minimal supervision, Highly productive, Team oriented", "preferred": "High School diploma or equivalent, Previous experience in retail, food service, or a clerical setting, Read and comprehend instructions and information; communicate professionally on the phone; and use standard office equipment."}, "skills": ["Microsoft Word", "Microsoft Excel", "10-key calculator", "typing skills", "Microsoft Chrome", "Microsoft Edge"], "postedDate": "1 week ago", "benefits": "Medical, Dental, and Vision benefits, Life Insurance and Long-term disability plans, Flexible Spending Account, 401K matching, Employee Stock Ownership Program in a $18.2 Billion Company, plus company matching, Wellness Programs, Metro Tap Card and Metro-link Reimbursement (for Los Angeles, CA employees only), Career Path Opportunities, Discounts on Parks, Museums, Movie Tickets, and Attractions, Employee Loan Assistance, Annual Flu Shot, Paid Vacations Days, Paid Sick days, Paid holidays, HGym (available in our Los Angeles, CA & Dallas,TX office), Rental Car Discounts, Dell Member Purchase Program, UKG Wallet", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001997365"}