{"jobTitle": "Administrative Assistant IV, Global Creative Strategy & Research", "company": {"name": "Sony Pictures Entertainment", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "66,600.00/yr - 74,800.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Entertainment Providers", "description": "The Administrative Assistant for Sony Pictures Entertainment’s Business Intelligence Team will assist a Co-Head of Global Strategy and Research and the Head of Global Marketing Analytics and Insights. The role involves coordinating schedules for both executives, replying to email requests, processing invoices for payment, and performing administrative functions that include expenses, travel authorizations and arrangements, and other company processes like ordering supplies and equipment. This person has the opportunity to help other staff members with projects as desired and will also be expected to help the team with general scheduling of meetings. This person will always juggle multiple requests and needs to be adept with time management to prioritize tasks.<br/><br/><strong>Responsibilites<br/><br/></strong><ul><li>Calendar Maintenance: Schedule meetings with internal and external parties and keep the calendars of the three department head executives up to date with daily changes.</li><li>Office Management: Order supplies and equipment for the two departments, including items to on-board new team members. </li><li>Administrative Functions: Process invoices, complete and submit travel authorizations and other necessary business forms on behalf of the three department heads.</li><li>Written Communication: Reply to email requests on behalf of the department.</li><li>Other Project Work: As desired, support both teams on select project work for various movie campaigns on an as-needed basis including data tabulation, analysis, visualization, and reporting.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's degree</li><li>Passion for movies and entertainment and the theatrical moviegoing experience </li><li>Excellent written, oral communication, and effective team building skills</li><li>Strong verbal, written, and presentation skills</li><li>Proficient in Microsoft Office (Word, Excel, PowerPoint, Outlook)</li><li>Self-starter with high level of initiative</li><li>Passionate, committed with a high level of energy</li><li>Strong sense of ownership and urgency</li><li>Must have an open communication style which takes into account managing expectations with multiple stakeholders</li><li>Manage multiple projects, set priorities, and meet deadlines</li><li>Strategic critical thinker who also has a high attention to detail</li><li>Analyze and apply data to improve results</li><li>Work collaboratively in a team environment</li><li>Excellent organizational skills</li><li>Knowledge of social and digital media platforms a plus</li><li>Knowledge of market research a plus<br/><br/></li></ul>The anticipated base salary for this position is $66,600 to $74,800. This role may also qualify for annual incentive and/or comprehensive benefits. The actual base salary offered will depend on a variety of factors, including without limitation, the qualifications of the individual applicant for the position, years of relevant experience, level of education attained, certifications or other professional licenses held, and if applicable, the location of the position.<br/><br/>Sony Pictures Entertainment is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, national origin, disability, veteran status, age, sexual orientation, gender identity, or other protected characteristics.<br/><br/>To request an accommodation for purposes of participating in the hiring process, you may contact us at SPE_Accommodation_Assistance@spe.sony.com.", "responsibilities": "The Administrative Assistant for Sony Pictures Entertainment’s Business Intelligence Team will assist a Co-Head of Global Strategy and Research and the Head of Global Marketing Analytics and Insights. The role involves coordinating schedules for both executives, replying to email requests, processing invoices for payment, and performing administrative functions that include expenses, travel authorizations and arrangements, and other company processes like ordering supplies and equipment. This person has the opportunity to help other staff members with projects as desired and will also be expected to help the team with general scheduling of meetings. This person will always juggle multiple requests and needs to be adept with time management to prioritize tasks.", "qualifications": {"required": "Bachelor's degree, Passion for movies and entertainment and the theatrical moviegoing experience, Excellent written, oral communication, and effective team building skills, Strong verbal, written, and presentation skills, Proficient in Microsoft Office (Word, Excel, PowerPoint, Outlook), Self-starter with high level of initiative, Passionate, committed with a high level of energy, Strong sense of ownership and urgency, Must have an open communication style which takes into account managing expectations with multiple stakeholders, Manage multiple projects, set priorities, and meet deadlines, Strategic critical thinker who also has a high attention to detail, Analyze and apply data to improve results, Work collaboratively in a team environment, Excellent organizational skills, Knowledge of social and digital media platforms a plus, Knowledge of market research a plus", "preferred": ""}, "skills": ["Microsoft Office", "Word", "Excel", "PowerPoint", "Outlook", "Market Research", "Social Media"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "This role may also qualify for annual incentive and/or comprehensive benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001493820"}