{"jobTitle": "Merchandiser", "company": {"name": "Bimbo Bakeries USA", "location": "Montclair, CA"}, "location": "Montclair, CA", "jobType": "Part-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Food and Beverage Manufacturing", "description": "req40688<br/><br/><strong>Employment Type</strong>: Regular<br/><br/><strong>Location</strong>: MONTCLAIR,CA<br/><br/><em><strong>Have you ever enjoyed Arnold®, Brownberry® or Oroweat® bread? A Thomas’® English muffin or bagel? Or perhaps snacked on a Sara Lee®, Entenmann’s® or Marinela® cake or donut? If the answer is yes, then you know Bimbo Bakeries USA!<br/><br/>More than 20,000 associates in bakeries, sales centers, offices and on sales routes work to ensure our consumers have the freshest products at every meal. In addition to competitive pay and benefits, we provide a safe and inclusive work environment that appreciates diversity, promotes development and allows our associates to be their authentic selves.<br/><br/></strong></em><strong>Description<br/><br/></strong>MERCHANDISER<br/><br/>***This is a Part Time Position***<br/><br/>A Merchandiser is responsible for merchandising fresh bakery products in local accounts/grocery stores to ensure adequate product availability on the shelf and on displays.<br/><br/>Your New BBU Career Highlights -<br/><br/><ul><li>Average 20 hours per week (you can enjoy your free time!) </li><li>Competitive starting pay $24.13 /hr. </li><li>Bragging rights that you make the bread aisle and displays look amazing! <br/><br/></li></ul><strong>What You Can Expect<br/><br/></strong><ul><li>Keep bread aisle and display locations stocked appropriately in stores </li><li>Maintain clean and organized back-room product inventory </li><li>Rotate products according to color code <br/><br/></li></ul><strong>Position Requirements<br/><br/></strong>What we need from you:<br/><br/><ul><li>18 years of age or older </li><li>Valid driver’s license </li><li>Reliable transportation </li><li>Lift, push/pull up to 50lbs. </li><li>In some locations Merchandisers are required to drive a DOT regulated route truck. In those instances, candidates must meet DOT requirements including Medical Card, Road Test and must be 21 years or older. <br/><br/></li></ul>The physical and mental demands described in each job posting are representative of those that must be met by an associate to successfully perform the essential functions of each job. Reasonable accommodations may be requested to enable qualified individuals with disabilities to perform the essential functions of each job.<br/><br/>Bimbo Bakeries USA is an equal opportunity employer with a policy that provides equal employment opportunity for applicants and employees regardless of race, color, religion, sex (including pregnancy, sexual orientation, or gender identity), national origin, age, disability, genetic information, marital status, veteran status, any other classification protected by law.<br/><br/>", "postedDate": "6 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4001920373"}