{"jobTitle": "Product Marketing Coordinator", "company": {"name": "Malibu Events Promotions", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$38,000.00/yr - $45,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Business Consulting and Services", "description": "We are looking to hire a Product Marketing Coordinator to join our team. As the Product Marketing Coordinator, you will be responsible for providing day-to-date marketing and administrative support for the Campaign Management Team. Help the team determining the most marketable features of products and then building marketing campaigns focusing on these features that drive revenue growth, article submissions, customer retention, and usage growth. The successful candidate should be detail-oriented with good verbal and written communication skills, have excellent computer skills, and a positive attitude.\n\nSalary range: $38000 - $45000 per year\n\nResponsibilities \n\n* Becoming familiar with company products.\n* Assess, plan, and execute consumer experiential events, trade shows, and sponsorship activations to drive trial and reinforce the brand positioning.\n* Identifying key features in products that will appeal to customers.\n* Create campaign timelines and manage milestones to ensure timely and successful delivery.\n* Working with the marketing department to develop marketing campaigns for each product.\n* Prepare program and project-related documents such as meeting reports, meeting agendas, and other partner communications and correspondence as necessary.\n* Build and maintain long-lasting, healthy relationships with both clients and internal team members.\n* Participate in collaborative team projects to help grow and build the program community.\n* Perform other duties assigned as is deemed necessary to meet company needs.\n\nRequirement:\n\n* Bachelor's degree in Marketing, Advertising, or a related field.\n* Prior experience working in marketing.\n* Knowledge of analytical software.\n* Excellent interpersonal and communication skills.\n* Very good workload management.\n* Proficient with Microsoft products, including Excel, Word, and PowerPoint. Ability to learn new platforms.", "responsibilities": "Becoming familiar with company products. Assess, plan, and execute consumer experiential events, trade shows, and sponsorship activations to drive trial and reinforce the brand positioning. Identifying key features in products that will appeal to customers. Create campaign timelines and manage milestones to ensure timely and successful delivery. Working with the marketing department to develop marketing campaigns for each product. Prepare program and project-related documents such as meeting reports, meeting agendas, and other partner communications and correspondence as necessary. Build and maintain long-lasting, healthy relationships with both clients and internal team members. Participate in collaborative team projects to help grow and build the program community. Perform other duties assigned as is deemed necessary to meet company needs.", "qualifications": {"required": "Bachelor's degree in Marketing, Advertising, or a related field. Prior experience working in marketing. Knowledge of analytical software. Excellent interpersonal and communication skills. Very good workload management. Proficient with Microsoft products, including Excel, Word, and PowerPoint. Ability to learn new platforms."}, "skills": ["Marketing", "Advertising", "Analytical Software", "Communication", "Workload Management", "Microsoft Products", "Excel", "Word", "PowerPoint"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001651334"}