{"jobTitle": "Senior Manager, Editorial Strategy", "company": {"name": "REVOLVE", "location": "Cerritos, CA"}, "location": "Cerritos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000.00/year to $85,000.00/year", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Retail Apparel and Fashion", "description": "Meet REVOLVE<br/><br/>REVOLVE is the next-generation fashion retailer for Millennial and Generation Z consumers. As a trusted, premium lifestyle brand, and a go-to online source for discovery and inspiration, we deliver an engaging customer experience from a vast yet curated offering totaling over 45,000 apparel, footwear, accessories and beauty styles. Our dynamic platform connects a deeply engaged community of millions of consumers, thousands of global fashion influencers, and more than 500 emerging, established and owned brands. Through 20 years of continued investment in technology, data analytics, and innovative marketing and merchandising strategies, we have built a powerful platform and brand that we believe is connecting with the next generation of consumers and is redefining fashion retail for the 21st century. For more information please visit www.revolve.com.<br/><br/>At REVOLVE the most successful team members have the thirst and creativity to redefine fashion retail for the 21st century, making REVOLVE the leading online retail destination targeted towards Millennial and Generation Z consumers seeking premium fashion. With a team of 1,000 strong, we are a dynamic bunch that are motivated by getting the company to the next level. It’s our goal to hire high-energy, diverse, bright, creative, and flexible individuals who thrive in a fast-paced work environment.<br/><br/>Some of the sweetest perks we offer aren’t in a typical benefit package like hefty discount on items we carry – as in 50% or more off retail prices, free weekly lunches, and pretty rad company parties.<br/><br/>To take a behind the scenes look at the REVOLVE “corporate” lifestyle check out our Instagram @REVOLVEcareers or .<br/><br/>Are you ready to set the standard for Premium apparel?<br/><br/>Main Purpose Of The Senior Manager, Editorial Strategy Role<br/><br/>This is a full-time role for a candidate who is a smart, creative, fashion-loving fashion editor. This individual will help drive and execute a multi-channel content strategy. The right candidate will be ideas-driven with an eye for great product, and have experience developing engaging storytelling. The role reports to the Director of Editorial &amp; Merchandising Strategy.<br/><br/>Major Responsibilities<br/><br/>Essential Duties and Responsibilities include the following. Other duties may be assigned.<br/><br/><ul><li> Generate concepts, map layouts and select product for weekly emails with seasonality, customer mindset, fashion trends and performance in mind</li><li> Oversee email banner/secondary content strategy, ensuring each drives consistent traffic to top pages; identify new opportunities</li><li> Lead the email linking strategy and liaise with merchandising leads to ensure proper execution</li><li> Track performance of curated shops and facilitate changes as necessary</li><li> Bridge the storytelling between email and social, having each feed into the other where applicable with an understanding of how each concept can best be amplified</li><li> Closely track performance and use data across every touch point to help inform story ideas, image and product selection, templates, etc.</li><li> Make any necessary product swaps for email, staying true to the vision of the original concept/story</li><li> Pull product as needed for content projects such as trend reports, product overviews and more<br/><br/></li></ul>Required Competencies<br/><br/>To perform the job successfully, an individual should demonstrate the following competencies:<br/><br/><ul><li> 7+ years of experience developing content for a digital publication, magazine or fashion brand—digital experience specifically is a plus</li><li> Personal interest and prior experience in fashion essential</li><li> Strong fashion sense, pulse on cultural relevance</li><li> Knowledgeable on trends arising from Social (IG, TikTok, Pinterest) as well as competitive landscape</li><li> Ambitious, hardworking, driven and with an impeccable work ethic</li><li> Positive attitude and innate sense of respect for others</li><li> Good listener; able to incorporate feedback and take direction</li><li> Consistent attention to detail and ability to focus on managing multiple tasks simultaneously</li><li> Proven ability to manage time effectively, prioritize, multi-task and meet deadlines</li><li> Proactive and ideas-driven</li><li> Able to bring ideas/initiatives/projects to fruition; excellent follow-through</li><li> Strong communication and organizational skills</li><li> Solution-oriented and someone who can see things from a place of learning</li><li> Industry-aware and up to speed on key trends happening each season</li><li> Team player with strong intrapersonal skills to foster relationships with multiple cross- functional teams<br/><br/></li></ul>A successful candidate works well in a dynamic environment with minimal supervision. At REVOLVE we all roll up our sleeves to pitch-in and do whatever it takes to get the job done. Each day is a little different, it’s what keeps us on our toes and excited to come to work every day.<br/><br/>For individuals assigned and/or hired to work in California, Revolve includes a reasonable estimate of the salary or hourly rate range for this role. This takes into account the wide range of factors that are considered in making compensation decisions; including but not limited to business or organizational needs, skill sets, experience and training, licensure, and certifications.<br/><br/>A reasonable estimate of the current base salary range is $75,000/year to $85,000/year<br/><br/>Attention<br/><br/>After submitting your application, please check your spam folder for emails on your application status. Emails are sent from an ADP email address.", "responsibilities": "Essential Duties and Responsibilities include the following. Other duties may be assigned.<br/><br/><ul><li> Generate concepts, map layouts and select product for weekly emails with seasonality, customer mindset, fashion trends and performance in mind</li><li> Oversee email banner/secondary content strategy, ensuring each drives consistent traffic to top pages; identify new opportunities</li><li> Lead the email linking strategy and liaise with merchandising leads to ensure proper execution</li><li> Track performance of curated shops and facilitate changes as necessary</li><li> Bridge the storytelling between email and social, having each feed into the other where applicable with an understanding of how each concept can best be amplified</li><li> Closely track performance and use data across every touch point to help inform story ideas, image and product selection, templates, etc.</li><li> Make any necessary product swaps for email, staying true to the vision of the original concept/story</li><li> Pull product as needed for content projects such as trend reports, product overviews and more<br/><br/></li></ul>", "qualifications": {"required": "7+ years of experience developing content for a digital publication, magazine or fashion brand—digital experience specifically is a plus, Personal interest and prior experience in fashion essential, Strong fashion sense, pulse on cultural relevance, Knowledgeable on trends arising from Social (IG, TikTok, Pinterest) as well as competitive landscape, Ambitious, hardworking, driven and with an impeccable work ethic, Positive attitude and innate sense of respect for others, Good listener; able to incorporate feedback and take direction, Consistent attention to detail and ability to focus on managing multiple tasks simultaneously, Proven ability to manage time effectively, prioritize, multi-task and meet deadlines, Proactive and ideas-driven, Able to bring ideas/initiatives/projects to fruition; excellent follow-through, Strong communication and organizational skills, Solution-oriented and someone who can see things from a place of learning, Industry-aware and up to speed on key trends happening each season, Team player with strong intrapersonal skills to foster relationships with multiple cross- functional teams"}, "skills": ["Fashion", "Content Strategy", "Digital Marketing", "Social Media", "Email Marketing", "Data Analysis", "Trend Analysis", "Storytelling", "Communication", "Organization", "Teamwork"], "postedDate": "1 month ago", "benefits": "hefty discount on items we carry – as in 50% or more off retail prices, free weekly lunches, and pretty rad company parties.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001894691"}