{"jobTitle": "SCHEDULING SPECIALIST I - OPERATING ROOM", "company": {"name": "Hoag Health System", "industry": "Hospitals and Health Care", "size": "Not specified", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$22.50 - $33.59", "currency": "USD"}, "jobFunction": "Science and Health Care Provider", "industry": "Hospitals and Health Care", "description": "Under direct supervision, the Scheduling Specialist I assists in the coordination of Patient Procedure/Surgical schedule. The Scheduling Specialist I collaborates in the management and scheduling of routine procedures in treatment area as well as add-ons and emergent procedures, facilitating communication between patients, physicians, other departments, and staff members. Coordinates with patients in the scheduling of pre-procedure diagnostic tests and clearances. Provides information to Insurance Verification Specialists to obtain authorizations as necessary. Responsible for patient registration filing, data entry, preparation of patient charts and other clerical duties, as assigned. Interacts directly with patients and works in a high call volume environment. Participates in the continuous quality improvement processes. Maintains a working knowledge of departmental standard operating procedures, including the use of specialized instrumentation, Quality Control requirements, and preventative maintenance. Maintains confidentiality. Performs other duties as assigned.", "responsibilities": "Assist in the coordination of Patient Procedure/Surgical schedule, manage and schedule routine procedures, facilitate communication between patients and staff, coordinate scheduling of pre-procedure tests, provide information for insurance verification, handle patient registration and clerical duties.", "qualifications": {"required": "High School Graduate or equivalent required, Minimum of one (1) year front office or previous scheduling experience, Excellent interpersonal and communication skills, Knowledge of proper body mechanics and safety measures, Basic knowledge of Microsoft Office Suite, Full understanding of medical insurance procedures required, Basic keyboarding minimum 35 WPM preferred, BLS (through AHA) required upon hire", "preferred": "Strong knowledge of basic medical terminology preferred, Hospital experience preferred, Advanced Excel knowledge preferred"}, "skills": ["Excellent interpersonal and communication skills", "Basic knowledge of Microsoft Office Suite", "Full understanding of medical insurance procedures", "Basic keyboarding skills (minimum 35 WPM)", "Knowledge of proper body mechanics and safety measures"], "postedDate": "5 days ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4001992670"}