{"jobTitle": "Financial Analyst, Production", "company": {"name": "Sony Pictures Entertainment", "location": "Culver City, CA", "industry": "Entertainment Providers"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "64,000-80,000", "currency": "USD"}, "jobFunction": "Finance and Sales", "industry": "Entertainment Providers", "description": "The Production Finance Analyst is responsible for supporting Sony Pictures Animation production finance team. Individual will supervise accounting of pre-production, production and post production budgets for assigned animation titles. Position serves as production finance point of contact for animation films, provides insight and guidance to operation managers. This role reports to the VP, Production Finance.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Generate and evaluate weekly cost reports for various projects in different stages of production with Producers.</li><li>Partner with the Production Finance lead to prepare staffing scenarios, cost out production plans and run other analyses.</li><li>Manage the tracking of Episodic Writing, Voice, Animation Vendor &amp; Music expenditures for real-time analysis and review by Production Leadership.</li><li>Initiate series writer and cast talent payroll, minimal accounts payable, vendor setup and generating weekly financial actuals processed weekly and loaded into SAP.</li><li>Assist Sony Pictures Animation operations and finance team with analysis.</li><li>Explore and action opportunities to improve current tools/reporting and processes.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>B.A./B.S.</li><li>2+ years of production accounting experience</li><li>Advanced MS Excel skills</li><li>SAP, Essbase, and Movie Magic knowledge a plus</li><li>Outstanding interpersonal and communication skills</li><li>Excellent analytical, organizational and forecasting skills</li><li>Ability to work in a fast-paced environment and prioritize work and remain detail oriented</li><li>Understanding of animation production cycles</li><li>Strong presentation and communication skills<br/><br/></li></ul>The anticipated base salary for this position is $64,000-$80,000. This role may also qualify for annual incentive and/or comprehensive benefits. The actual base salary offered will depend on a variety of factors, including without limitation, the qualifications of the individual applicant for the position, years of relevant experience, level of education attained, certifications or other professional licenses held, and if applicable, the location of the position.<br/><br/>Sony Pictures Entertainment is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, national origin, disability, veteran status, age, sexual orientation, gender identity, or other protected characteristics.<br/><br/>To request an accommodation for purposes of participating in the hiring process, you may contact us at SPE_Accommodation_Assistance@spe.sony.com.", "responsibilities": "Generate and evaluate weekly cost reports for various projects in different stages of production with Producers. Partner with the Production Finance lead to prepare staffing scenarios, cost out production plans and run other analyses. Manage the tracking of Episodic Writing, Voice, Animation Vendor & Music expenditures for real-time analysis and review by Production Leadership. Initiate series writer and cast talent payroll, minimal accounts payable, vendor setup and generating weekly financial actuals processed weekly and loaded into SAP. Assist Sony Pictures Animation operations and finance team with analysis. Explore and action opportunities to improve current tools/reporting and processes.", "qualifications": {"required": "B.A./B.S. 2+ years of production accounting experience Advanced MS Excel skills Outstanding interpersonal and communication skills Excellent analytical, organizational and forecasting skills Ability to work in a fast-paced environment and prioritize work and remain detail oriented Understanding of animation production cycles Strong presentation and communication skills", "preferred": "SAP, Essbase, and Movie Magic knowledge a plus"}, "skills": ["MS Excel", "SAP", "Essbase", "Movie Magic", "Production Accounting", "Financial Analysis", "Communication", "Analytical Skills", "Organizational Skills", "Forecasting"], "postedDate": "1 week ago", "benefits": "This role may also qualify for annual incentive and/or comprehensive benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001492905"}