{"jobTitle": "Sr Manager, Global Brand Planning  - Disney", "company": {"name": "The Walt Disney Company", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Customer Service", "industry": "Entertainment Providers", "description": "Be Part of the Story as the Senior Manager Global Brand Planning within Disney Consumer Products! Build the strategy for Disney Classic brands and deliver global growth for licensed consumer products through integrated franchise strategies. We develop long term brand plans, champion alignment and execute strategy across the business. Here, you'll contribute to building and strengthening a culture that is nimble, productive, forward looking and entrepreneurial.<br/><br/>This is a Full Time role.<br/><br/>This role reports to the Director of Global Brand Planning.<br/><br/><strong>What You Will Do<br/><br/><br/></strong><ul><li>Understand franchise health, including regular commercial reviews with regional teams and global licensees, competitive analysis, and drive focus on franchise development and growth</li><li>Collaborate optimally with our regional brand and franchise partners, category partners and cross-functional partners while championing alignment and implementation driving and supporting execution across the business, empowering progress at pace</li><li>Communicate global franchise strategy to global licensees. Support their product development and marketing strategies and retail sell in</li><li>Support partner relationships with content partners across The Walt Disney Company, working closely with Content Franchise teams, filmmakers and content makers, serving as a voice of the franchises within Disney Consumer Products</li><li>Partner with creative, marketing and retail teams to drive ideation and implementation of marketing tactics to drive DCP revenue, in alignment with regional partners and global licensees to evaluate and prioritize opportunities</li><li>Develop &amp; implement Franchise Playbook, bi-annual brand presentations, content toolkits, activity calendars, one-pagers etc. Represent the franchise (e.g. keynote brand presenter) for all selected internal and external presentations and meetings</li><li>Ensure a constant flow of franchise information across the DCP team at a regional and local level. Set and manage regular planning and activation meetings, owning processes and workflows for the specific franchise function</li><li>Develop strategic market &amp; creative briefs for style guides, packaging, and strategy messaging, as well as updated fact sheets and other tools for the cross functional teams</li><li>Become the DCP brand steward for Disney Classics, supporting the business with licensee reviews and approvals to ensure consistency and compliance to the franchise attributes and goals<br/><br/><br/></li></ul><strong>Required Qualifications And Skills<br/><br/><br/></strong><ul><li>Bachelor's degree or equivalent experience </li><li>7+ years of related experience</li><li>Experience in consumer centered brand building and marketing (physical and digital)</li><li>Experience leading different senior business partners and getting support through negotiation and influencing, demonstrating resilience, tenacity and diplomacy</li><li>A strong mix of commercial and brand management skills</li><li>Strong financial competence </li><li>Operate as part of an effective and inclusive team by demonstrating an awareness of others; welcoming and valuing unique perspectives and ideas; offering support, sharing knowledge and best practices in order to contribute to overall departmental commitments</li><li>Open communicator who shows curiosity for solution seeking</li><li>Understanding of global perspective, external context and regional differences<br/><br/><br/></li></ul>Disney offers a rewards package to help you live your best life. This includes health and savings benefits, educational opportunities, and special extras that only Disney can provide. Learn more about our benefits and perks at https://jobs.disneycareers.com/benefits.<br/><br/>The hiring range for this position in Glendale, CA is $135,000 to $181,000 per year. The base pay actually offered will take into account internal equity and also may vary depending on the candidate’s geographic region, job-related knowledge, skills, and experience among other factors. A bonus and/or long-term incentive units may be provided as part of the compensation package, in addition to the full range of medical, financial, and/or other benefits, dependent on the level and position offered.", "responsibilities": "<ul><li>Understand franchise health, including regular commercial reviews with regional teams and global licensees, competitive analysis, and drive focus on franchise development and growth</li><li>Collaborate optimally with our regional brand and franchise partners, category partners and cross-functional partners while championing alignment and implementation driving and supporting execution across the business, empowering progress at pace</li><li>Communicate global franchise strategy to global licensees. Support their product development and marketing strategies and retail sell in</li><li>Support partner relationships with content partners across The Walt Disney Company, working closely with Content Franchise teams, filmmakers and content makers, serving as a voice of the franchises within Disney Consumer Products</li><li>Partner with creative, marketing and retail teams to drive ideation and implementation of marketing tactics to drive DCP revenue, in alignment with regional partners and global licensees to evaluate and prioritize opportunities</li><li>Develop &amp; implement Franchise Playbook, bi-annual brand presentations, content toolkits, activity calendars, one-pagers etc. Represent the franchise (e.g. keynote brand presenter) for all selected internal and external presentations and meetings</li><li>Ensure a constant flow of franchise information across the DCP team at a regional and local level. Set and manage regular planning and activation meetings, owning processes and workflows for the specific franchise function</li><li>Develop strategic market &amp; creative briefs for style guides, packaging, and strategy messaging, as well as updated fact sheets and other tools for the cross functional teams</li><li>Become the DCP brand steward for Disney Classics, supporting the business with licensee reviews and approvals to ensure consistency and compliance to the franchise attributes and goals<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent experience, 7+ years of related experience, Experience in consumer centered brand building and marketing (physical and digital), Experience leading different senior business partners and getting support through negotiation and influencing, demonstrating resilience, tenacity and diplomacy, A strong mix of commercial and brand management skills, Strong financial competence, Operate as part of an effective and inclusive team by demonstrating an awareness of others; welcoming and valuing unique perspectives and ideas; offering support, sharing knowledge and best practices in order to contribute to overall departmental commitments, Open communicator who shows curiosity for solution seeking, Understanding of global perspective, external context and regional differences<br/><br/><br/>", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "salary": {"amount": "135,000.00 to 181,000.00", "currency": "USD"}, "benefits": "Disney offers a rewards package to help you live your best life. This includes health and savings benefits, educational opportunities, and special extras that only Disney can provide. Learn more about our benefits and perks at https://jobs.disneycareers.com/benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001418993"}