{"jobTitle": "Supply Chain Manager, Amazon Fresh", "company": {"name": "Amazon", "location": "San Francisco, CA"}, "location": "San Francisco, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Distribution, Supply Chain, and Engineering", "industry": "Software Development", "description": "The Amazon Grocery Logistics team is looking for an experienced Supply Chain Manager to own strategic and cross-functional business initiatives that support the growth of our Grocery (Fresh, Amazon Go, Whole Foods) business. In this role, you will use analytical, technical, program management, strategic and operations management skills to design, plan and launch the Amazon Grocery supply distribution network of the future.\n\nKey job responsibilities\n\n<ul><li> Working with Retail, Finance and Operations partners to define supply chain, network design, and operating models</li><li> Owning and developing long term capacity plans for our distribution center network to support Amazon's Grocery business. Outputs feed directly into business financial and strategic plans</li><li> Building complex models to determine future topology and capacity needs for our network, communicating this vision clearly to partner teams and senior leadership to enable Real Estate/Capex decisions</li><li> Forming cross-functional project teams, planning, managing, and executing complex projects across multiple organizations and stakeholders. Examples include new distribution capabilities to enable the growth of our network</li><li> Developing tech requirements to ensure our fulfillment network can scale to address future challenges and growth<br/><br/></li></ul>A day in the life\n\nAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\n\n<ul><li> Medical, Dental, and Vision Coverage</li><li> Maternity and Parental Leave Options</li><li> Paid Time Off (PTO)</li><li> 401(k) Plan<br/><br/></li></ul>Learn more about our benefits here: https://www.amazon.jobs/en/internal/benefits/us-benefits-and-stock\n\n<strong>About The Team<br/><br/></strong>Amazon Fresh is where we are passionate about revolutionizing the grocery shopping experience. We are a team of talented professionals dedicated to reshaping how customers access and enjoy fresh, high-quality products. At Amazon Fresh, we embrace a fast-paced, entrepreneurial environment that encourages creativity, agility, and a commitment to delivering unparalleled service in the evolving world of online grocery. Together, we are building the future of convenience and customer satisfaction at the intersection of technology and everyday essentials.\n\n<strong>Basic Qualifications<br/><br/></strong><ul><li> 3+ years of program or project management experience</li><li> 3+ years of working cross functionally with tech and non-tech teams experience</li><li> 3+ years of defining and implementing process improvement initiatives using data and metrics experience</li><li> 2+ years of supply chain experience</li><li> Bachelor's degree</li><li> Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL</li><li> Experience defining program requirements and using data and metrics to determine improvements<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> 3+ years of driving end to end delivery, and communicating results to senior leadership experience</li><li> 3+ years of driving process improvements experience</li><li> Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization</li><li> Experience building processes, project management, and schedules<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\n\nPursuant to the Los Angeles Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $77,200/year in our lowest geographic market up to $141,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.\n\n<br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2724583", "responsibilities": "Working with Retail, Finance and Operations partners to define supply chain, network design, and operating models\nOwning and developing long term capacity plans for our distribution center network to support Amazon's Grocery business. Outputs feed directly into business financial and strategic plans\nBuilding complex models to determine future topology and capacity needs for our network, communicating this vision clearly to partner teams and senior leadership to enable Real Estate/Capex decisions\nForming cross-functional project teams, planning, managing, and executing complex projects across multiple organizations and stakeholders. Examples include new distribution capabilities to enable the growth of our network\nDeveloping tech requirements to ensure our fulfillment network can scale to address future challenges and growth", "qualifications": {"required": "3+ years of program or project management experience\n3+ years of working cross functionally with tech and non-tech teams experience\n3+ years of defining and implementing process improvement initiatives using data and metrics experience\n2+ years of supply chain experience\nBachelor's degree\nKnowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\nExperience defining program requirements and using data and metrics to determine improvements", "preferred": "3+ years of driving end to end delivery, and communicating results to senior leadership experience\n3+ years of driving process improvements experience\nExperience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\nExperience building processes, project management, and schedules"}, "skills": ["Supply Chain Management", "Program Management", "Project Management", "Operations Management", "Strategic Planning", "Network Design", "Capacity Planning", "Data Analysis", "Stakeholder Management", "Process Improvement", "Excel", "SQL"], "postedDate": "1 week ago", "benefits": "Medical, Dental, and Vision Coverage\nMaternity and Parental Leave Options\nPaid Time Off (PTO)\n401(k) Plan", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001895136"}