{"jobTitle": "FF&E Designer", "company": {"name": "Portico Recruitment Ltd - Interior Design Recruitment", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Architecture and Planning", "description": "<strong>Job Summary:</strong><p><br/></p><p>As a Senior FF&amp;E Designer, you will work hand in hand with our interior designers, playing a pivotal role in shaping the design concepts of our projects. The successful candidate will have a strong background in luxury interior design, a keen eye for detail, and the ability to manage projects from concept to installation. You would also have strong relationships with suppliers and able to source unique materials and furniture for our projects.</p><p>Candidates with less years of experience are welcome to apply and you will be considered for FF&amp;E Designer position.</p><p><br/></p><p><strong>Key Responsibilities:</strong></p><p><br/></p><ul><li>Work closely with Partner, and Projects Directors to to create FF&amp;E concepts and design proposals.</li><li>Source and select furniture, lighting, accessories, and materials that meet the highest standards of quality and design.</li><li>Build and maintain relationships with vendors and suppliers, negotiating pricing and terms to secure the best value for our clients.</li><li>Coordinate with interior designers, contractors, clients and suppliers.</li><li>Oversee the installation of FF&amp;E items, ensuring that the quality aligns with the design intent.</li></ul><p><br/></p><p><strong>Below are the minimum qualifications that we expect from you:</strong></p><p><br/></p><ul><li>The right to work in Los Angeles WITHOUT visa sponsorship</li><li>Bachelor's degree in Interior Design or a related field.</li><li>8+ years of experience as an FF&amp;E Designer in a similar industry (Candidates with less years of experience would be considered for junior/intermediate positions)</li><li>A portfolio of previous project experience in luxury hospitality, high-end residential, clubhouse or show flats</li><li>AutoCAD, SketchUp, Photoshop, PPT, InDesign</li><li>Fluent in English</li></ul><p><br/></p><p><strong>To be successful in the role you should also have:</strong></p><p><br/></p><ul><li>Strong conceptualization and presentation skills</li><li>Strong sense of design flair and love of art</li><li>Strong sense of responsibility</li><li>Ability to meet tight project deadlines</li><li>Proven ability to handle multiple projects simultaneously</li><li>A portfolio showcasing a diverse range of hospitality design projects.</li><li>Collaborative and enjoy working in team environments</li><li>Good communication skills</li></ul><p><br/></p>", "responsibilities": "Work closely with Partner, and Projects Directors to to create FF&amp;E concepts and design proposals. Source and select furniture, lighting, accessories, and materials that meet the highest standards of quality and design. Build and maintain relationships with vendors and suppliers, negotiating pricing and terms to secure the best value for our clients. Coordinate with interior designers, contractors, clients and suppliers. Oversee the installation of FF&amp;E items, ensuring that the quality aligns with the design intent.", "qualifications": {"required": "The right to work in Los Angeles WITHOUT visa sponsorship, Bachelor's degree in Interior Design or a related field., 8+ years of experience as an FF&amp;E Designer in a similar industry (Candidates with less years of experience would be considered for junior/intermediate positions), A portfolio of previous project experience in luxury hospitality, high-end residential, clubhouse or show flats, AutoCAD, SketchUp, Photoshop, PPT, InDesign, Fluent in English", "preferred": "Strong conceptualization and presentation skills, Strong sense of design flair and love of art, Strong sense of responsibility, Ability to meet tight project deadlines, Proven ability to handle multiple projects simultaneously, A portfolio showcasing a diverse range of hospitality design projects., Collaborative and enjoy working in team environments, Good communication skills"}, "skills": ["Interior Design", "AutoCAD", "SketchUp", "Photoshop", "PPT", "InDesign"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001707994"}