{"jobTitle": "Director of Strategic Accounts", "company": {"name": "AFS Logistics", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management, Sales, and Supply Chain", "industry": "Truck Transportation, Transportation, Logistics, Supply Chain and Storage, and Freight and Package Transportation", "description": "**Must currently reside in SoCal (Los Angeles/San Diego)**<br/><br/>**Purpose/Job Function:**<br/><u>The Director of Strategic Accounts will be responsible for the Southern California market. </u>The position will have two responsibilities: building and maintaining strong relationship with existing clients, and driving revenue growth by selling AFS solutions to qualified prospects and current clients. This position will maintain regular communication and contact with clients to provide outstanding in-region client support, while meeting/exceeding sales targets and client retention. In addition, this role is required to uphold our core values: Ethics, Engagement, and Excellence.<br/><br/>**Essential Functions:**<br/><ul><li>The role will be assigned a list of current AFS clients for management of the client relationship and prospecting for additional upsell opportunities.</li><li>From time to time, additional current clients in his territory may be assigned to the DSA including clients signed by an Enterprise Sales Director.</li><li>Prospect and sell multimodal/multiservice opportunities within assigned region, by identifying and acquiring new clients for AFS services.</li><li>Manage the AFS customer experience to ensure we retain clients with assigned existing and new customers in coordination with the Account Management team:</li><li><em>Work with assigned accounts and assist Customer Service in supporting the client’s needs.</em></li><li><em>Required to call on (e.g. in-person visits) assigned clients, as appropriate for the size of the client and as necessary to build the client relationship</em></li><li><em>Conduct structured periodic business reviews demonstrating the benefits that AFS is delivering to the client and exploring additional opportunities for AFS to support the client with their transportation needs</em></li><li>Understand all of AFS’s transportation modes and our value proposition to the client</li><li>Prospect, qualify attract, and win new clients in their region.</li><li>Generate leads by cold-calling in assigned areas, asking for customer referrals, attending tradeshows/networking events, and following up on all marketing leads</li><li>Act as client’s advocate during the development of solutions; work with operations and pricing groups to develop pricing and proposal, reviews proposals with clients and advises decision-making process, and monitoring progress during service launch, assuring that services are launched timely and delivering the desired results</li><li>Build a cross-functional relationship with all influencers in each account, for example, CFO, COO, VP of Ops, and Transportation Manager</li><li>This role will utilize Salesforce to manage their customer base, daily</li><li>Have a strong grasp and be proficient in demos of all AFS tools and products</li></ul><br/><br/>**Qualification/Requirements:**<br/><br/><ul><li>Solid sales, account management and transportation knowledge</li><li>Consultative sales training or experience</li><li>Ability to deliver effective communications and the business experience to obtain client’s commitment and agreement to proceed</li><li>A strong network of contacts in the transportation industry</li><li>Demonstrated ability to develop and maintain relationships with C-level decision makers</li><li>A willingness to prospect for new business.</li><li>Poses the maturity and discipline to work effectively with a minimum of supervision in a unique entrepreneurial environment</li><li>Excellent interpersonal skills with the ability to build rapport with a variety of groups</li><li>Highly motivated and self-driven with a persuasive personality</li><li>Superior decision making, problem solving, negotiations, verbal and written skills</li><li>Proficient at Salesforce, Excel, Word and PowerPoint</li><li>Ability to successfully lead an internal team to drive and deliver a compelling value proposition to the customer</li></ul><br/><br/>**Education/Experience:**<br/><ul><li>Bachelor’s degree in business, management or related field preferred or equivalent work experience</li><li>5 years or more of Transportation experience in multiple modes</li><li>Minimum of 3 years business development experience with third-party or contract logistics</li></ul>", "responsibilities": "The Director of Strategic Accounts will be responsible for the Southern California market. The position will have two responsibilities: building and maintaining strong relationship with existing clients, and driving revenue growth by selling AFS solutions to qualified prospects and current clients. This position will maintain regular communication and contact with clients to provide outstanding in-region client support, while meeting/exceeding sales targets and client retention. In addition, this role is required to uphold our core values: Ethics, Engagement, and Excellence.", "qualifications": {"required": "Solid sales, account management and transportation knowledge, Consultative sales training or experience, Ability to deliver effective communications and the business experience to obtain client’s commitment and agreement to proceed, A strong network of contacts in the transportation industry, Demonstrated ability to develop and maintain relationships with C-level decision makers, A willingness to prospect for new business., Poses the maturity and discipline to work effectively with a minimum of supervision in a unique entrepreneurial environment, Excellent interpersonal skills with the ability to build rapport with a variety of groups, Highly motivated and self-driven with a persuasive personality, Superior decision making, problem solving, negotiations, verbal and written skills, Proficient at Salesforce, Excel, Word and PowerPoint, Ability to successfully lead an internal team to drive and deliver a compelling value proposition to the customer", "preferred": "Bachelor’s degree in business, management or related field preferred or equivalent work experience, 5 years or more of Transportation experience in multiple modes, Minimum of 3 years business development experience with third-party or contract logistics"}, "skills": ["Sales", "Account Management", "Transportation", "Consultative Sales", "Client Relationship Management", "Business Development", "Salesforce", "Excel", "Word", "PowerPoint"], "postedDate": "1 week ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001912925"}