{"jobTitle": "Dispatch Supervisor", "company": {"name": "The Pasha Group", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": ["Transportation, Logistics, Supply Chain and Storage", "Maritime Transportation", "Truck Transportation"], "description": "<strong>Job Summary<br/><br/></strong>The Dispatch Supervisor coordinates the routing of incoming and outgoing shipments to achieve high customer satisfaction and Sea-Logix' operating targets.<br/><br/><strong>Primary Objectives<br/><br/></strong><ul><li>Accountably drive employee performance to meet or exceed KPI targets, including labor hours, purchased transportation levels, maintenance costs, casual usage, vehicle accidents, injuries, DOT compliance</li><li>Minimize injury and cost through effective management of safety program</li><li>Provide appropriate task-level direction to employees to meet daily operational requirements<br/><br/></li></ul><strong>Duties and Responsibilities<br/><br/></strong><ul><li>Ensure timely and orderly commencement of operations; monitor key service delivery requirements as shift progresses. </li><li>Provide on-site monitoring and management of work performed at multiple yard locations. </li><li>Efficiently manage labor and fuel costs and fleet maintenance costs and minimize total route miles through effective dispatch and employee performance management. </li><li>Track and review metrics to support performance management and operational decisions. </li><li>Determine optimal routing by prioritizing loads, defining routes, and setting schedules. Ensure routing decisions satisfy customer’s expectations and company financial requirements and comply with state and federal laws and regulations governing safety and capacity issues. </li><li>Resolve problems related to pickups and deliveries with drivers, partner carriers, and port operators. </li><li>Monitor containers to reduce demurrage and storage fees. </li><li>Maintain technical and professional proficiency in operational and customer service requirements and a working knowledge of contract provisions, safety requirements, and operational schedules. </li><li>Manage productive relationship with labor unions; work proactively to address issues and avoid unnecessary grievances</li><li>Keep track of invoice orders and sold moves to ensure commitments are met. </li><li>Provide supervision to union employees; provide coaching and feedback, performance management, and apply timely, properly documented disciplinary processes consistent with collective bargaining agreement provisions. </li><li>Execute timely reporting, recordkeeping, and documentation as required. </li><li>Other duties as assigned. <br/><br/></li></ul><strong>QUALIFICATIONS<br/><br/></strong><em>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/></em><strong>Education<br/><br/></strong><ul><li>High school diploma or equivalent required</li><li>Related college coursework preferred<br/><br/></li></ul><strong>Licenses and Certifications<br/><br/></strong><ul><li>Valid state-issued driver license and acceptable driving record required</li><li>Transportation Worker Identity Credential (TWIC) required</li><li>Commercial/Class A Driver's License strongly preferred<br/><br/></li></ul><strong>Work Experience<br/><br/></strong><ul><li>5+ years' experience in the transportation industry, intermodal required</li><li>Experience in collectively bargained environment strongly preferred<br/><br/></li></ul><strong>Required Knowledge, Skills and Abilities<br/><br/></strong><ul><li>Familiar with DOT safety compliance</li><li>Basic to intermediate proficiency in Microsoft applications: Excel, Work, and Outlook</li><li>Ability to effectively develop and manage a high performing team</li><li>Ability to effectively manage and deliver on multiple competing priorities</li><li>Self-motivated, able to work under pressure with minimal supervision</li><li>Excellent verbal and written communication skills</li><li>Excellent organizational skills<br/><br/></li></ul><strong>Competencies<br/><br/></strong><ul><li>Delivers Results Rigorously drives self and others to achieve high levels of individual and organization performance. </li><li>Engages &amp; Inspires Others Leads with energy, self-confidence and understanding in ways that motivate colleagues to achieve more than they thought possible. </li><li>Focuses on the Customer &amp; Market Continuously evaluates what is important to the customer/client and develops products or solutions that exceed expectations. </li><li>Makes Sound Business Decisions Makes timely and well-informed decisions that advance critical priorities, capitalize on new opportunities, and resolve problems. </li><li>Practices our Values Supports and models The Pasha Way; conduct reflects Excellence, Honesty, Integrity, Innovation and Teamwork. <br/><br/></li></ul><strong>PHYSICAL DEMANDS, WORK ENVIRONMENT, AND TRAVEL<br/><br/></strong><strong>Physical Demands<br/><br/></strong><em>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/></em><ul><li>Hear and speak with sufficient clarity to understand and engage in telephonic information exchange; hear and understand verbal instructions; give and receive information verbally in person or via communication device - Often</li><li>Walk/travel to and from yards up to one mile per day; crouch/bend to access floor-level storage - Regularly</li><li>Use hands/fingers to operate office equipment, type/complete data input, write - Often</li><li>Reach with hands, arms; lift, move and manipulate objects weighing up to 20 pounds - Regularly</li><li>Sight sufficient to read instructions, documents, and screen-based information - Often</li><li>Use hands/fingers to manipulate and file documents, folders, small objects - Regularly<br/><br/></li></ul><strong>Working Environment<br/><br/></strong><em>This role requires work that may involve the following environmental conditions:<br/><br/></em><ul><li>Corporate office environment</li><li>Vessel and terminal environment - includes moving, shifting surfaces, and active production areas including moving vehicles, equipment, and machinery. </li><li>Outdoor/open environments which may involve high/low temperatures, humidity and inclement weather conditions. </li><li>Active production areas including moving vehicles, equipment or machinery. <br/><br/></li></ul><strong>Screening Requirements<br/><br/></strong>Background Checks<br/><br/>Drug Testing<br/><br/><strong>Must be fully vaccinated against COVID-19, except as prohibited by law.<br/><br/></strong><em>The information included in this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive or exhaustive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.<br/><br/></em><em>The applicable salary range is aligned to one of 5 zones according to a cost of labor index for the geographic location of the role. Starting pay for the successful applicant will depend on a variety of job-related factors, which may include related experience, education and training, location, business needs, or market demands. The expected salary range for this role is set forth below. Ranges may be modified in the future.<br/><br/>Zone 2: $76,000 - $88,000<br/><br/></em><em>The Pasha Group family of companies are EOE/AA Employers – Minority/Female/Veteran/Disabled/and other Protected Categories</em>", "responsibilities": "Ensure timely and orderly commencement of operations; monitor key service delivery requirements as shift progresses. Provide on-site monitoring and management of work performed at multiple yard locations. Efficiently manage labor and fuel costs and fleet maintenance costs and minimize total route miles through effective dispatch and employee performance management. Track and review metrics to support performance management and operational decisions. Determine optimal routing by prioritizing loads, defining routes, and setting schedules. Ensure routing decisions satisfy customer’s expectations and company financial requirements and comply with state and federal laws and regulations governing safety and capacity issues. Resolve problems related to pickups and deliveries with drivers, partner carriers, and port operators. Monitor containers to reduce demurrage and storage fees. Maintain technical and professional proficiency in operational and customer service requirements and a working knowledge of contract provisions, safety requirements, and operational schedules. Manage productive relationship with labor unions; work proactively to address issues and avoid unnecessary grievances Keep track of invoice orders and sold moves to ensure commitments are met. Provide supervision to union employees; provide coaching and feedback, performance management, and apply timely, properly documented disciplinary processes consistent with collective bargaining agreement provisions. Execute timely reporting, recordkeeping, and documentation as required. Other duties as assigned.", "qualifications": {"required": "Familiar with DOT safety compliance Basic to intermediate proficiency in Microsoft applications: Excel, Work, and Outlook Ability to effectively develop and manage a high performing team Ability to effectively manage and deliver on multiple competing priorities Self-motivated, able to work under pressure with minimal supervision Excellent verbal and written communication skills Excellent organizational skills", "preferred": "Related college coursework Valid state-issued driver license and acceptable driving record Commercial/Class A Driver's License 5+ years' experience in the transportation industry, intermodal Experience in collectively bargained environment"}, "skills": ["DOT", "Microsoft Excel", "Microsoft Word", "Microsoft Outlook", "Team Management", "Problem Solving", "Communication", "Organization"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001835611"}