{"jobTitle": "Buyer I", "company": {"name": "Crane Company", "industry": "Manufacturing", "size": "51-200 employees", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$29.95 to $37.22", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Manufacturing", "description": "Crane Aerospace & Electronics has an exciting opportunity for a Buyer I at our Burbank, CA location. About Crane: Crane Aerospace & Electronics supplies critical systems and components to the aerospace and defense markets. You’ll find Crane Aerospace & Electronics in some of the toughest environments: from engines to landing gear; from satellites to medical implants and from missiles to unmanned aerial systems (UAS). Every 1.2 seconds, product built at our Crane Aerospace & Electronics Burbank facility is stopping aircraft – delivering passengers and military personnel safely to their destination. Home to our Landing & Cabin Systems team, Crane A&E’s brake control systems and premium cabin actuation solutions are flying on tens of thousands of aircraft throughout the world. You’ll join a business with a long track record of engineering excellence, set in the wonderful town of Burbank filled with great community atmosphere, schools, weather and no shortage of entertainment. Start the next chapter of your career with Crane Aerospace & Electronics!", "responsibilities": "The Buyer I is responsible for managing all aspects of purchasing components from suppliers in order to assure timely delivery of parts to support production needs. In addition, the Buyer I is the communication and logistics link between Value Streams, Supervisors, Marketing, Master Scheduler, and Purchasing. Essential Functions: Perform material requirements planning through high interaction/coordination with manufacturing personnel and external suppliers to support the Value Stream. Communicate priorities and schedule changes to Outside Processing Suppliers on a daily basis to support changes in production requirements. Establish and maintain positive working relationships with suppliers; Communicate common supplier problems with Leadership, Procurement Specialists and other Buyers. Train the value stream support personnel and facilitate the upgrade to a pull-based replenishment system (Kanban) to improve inventory turns and eliminate part shortages. Monitor supplier orders to assure they are shipped on a timely basis to support the Value Stream. Improve supplier fill rates, quality, and lead times to fit product mix and needs. Obtain quotes from suppliers for production material and Outside Processing operations. Interact with sourcing teams to ensure best practices and greatest leverage in procurement, low-cost region sourcing, supplier assessment & management. Publish daily shortage report to communicate current delivery information from suppliers. Resolve invoice discrepancies on a timely basis. Manage supplier quality through the Non-Conforming Report (NCR) Process; Minimize production impact by ensuring discrepant materials are addressed with Manufacturing Engineering, Procurement Quality, Supervisors and Suppliers. Work closely with suppliers and Procurement Quality Engineers to resolve Corrective Action Requests (CARs) generated from NCRs. Obtain Return Merchandise Authorization (RMA), and process return transactions in Oracle (ERP System); Follow Debit Memo process for supplier rework of discrepant materials. Any other task assigned by supervisor or management.", "qualifications": {"required": "High School diploma or equivalent. 0-2 years of experience buying in a similar industry or demonstrated knowledge of supply chain function through work experience or school. In-depth knowledge of the manufacturing process used in the operating unit of assignment; Working knowledge of buying and ordering procedures; Working knowledge of production planning, material requirements planning and Kanban systems; Working knowledge of computer systems that support production, e.g., inventory control, purchasing, production scheduling and Materials Requirement Planning (MRP). Well-developed skill in communicating with others; Proficiency in MS Office including Excel, Word and Access; Ability to coordinate materials and production schedules with multiple teams, solve urgent problems associated with the manufacture of products and document and communicate production outcomes and trends; Ability to perform math and logic computations requiring sequencing of times, critical incidents, and numeric information; Ability to negotiate changes with vendors and manufacturing teams.", "preferred": "Experience working in a regulated manufacturing environment. BA or BS degree in Supply Chain, Business, or Materials-related field."}, "skills": ["Communication", "MS Office", "Negotiation", "Problem-solving", "Material Requirements Planning (MRP)"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Health care, dental or life insurance starting the first day of the month. 15 days of paid time off that start accruing your first day at Crane and 12 paid holidays per year. 401k plan with company match. Education Reimbursement: eligible after 90 days of employment.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001286323"}