{"jobTitle": "Inventory Control Analyst", "company": {"name": "Reformation", "location": "Vernon, CA"}, "location": "Vernon, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "<strong>Who We Are:<br/><br/></strong>Founded in 2009, Reformation is a revolutionary lifestyle brand that proves fashion and sustainability can coexist. We combine stylish, vintage-inspired designs with sustainable practices, releasing limited-edition collections for individuals who want to look beautiful and live sustainably. Setting an example for the industry, Reformation remains at the forefront of innovation in sustainable fashion—running the first sustainable factory in Los Angeles, using deadstock and eco fabrics, tracking and sharing the environmental impact of every product, and investing in the people who make this revolution possible. The brand has also established itself as a pioneer in retail innovation, developing an in-store tech concept that brings the best of its online experience to its physical doors.<br/><br/>We are a future focused organization committed to the belief that the problems facing our planet and society can be solved through innovation, common sense and education. Being naked is the #1 most sustainable option. We're #2.<br/><br/>Here at Ref, we put people first. We know that you can't innovate and do cool stuff without having everyone on board. So we work to create a culture where everyone feels like they belong and where their voices are truly valued. We build an inclusive culture together and make a real impact along the way.<br/><br/><strong>Inventory Control Analyst:<br/><br/></strong>Reformation, an industry-leading sustainable fashion brand committed to reshaping the future of clothing with environmental consciousness, is seeking a dynamic Inventory Control Analyst to join our team. As advocates for eco-friendly practices in fashion, we are on a mission to redefine the industry landscape by crafting stylish apparel that minimizes environmental impact. In this pivotal role, you'll be instrumental in ensuring the integrity of our inventory management processes, fostering efficiency, accuracy, and sustainability. The role will report to the Inventory Manager as a part of the broader accounting team.<br/><br/><strong>What You'll Do:<br/><br/></strong><ul><li>Conduct analyses of large inventory data sets in Excel generated from the Enterprise Resource Planning (ERP) system and Warehouse Management System (WMS)</li><li>Work closely with colleagues across Finance, Accounting, Distribution Center (DC), retail operations, and supply chain teams to investigate and resolve discrepancies</li><li>Review historical inventory trends and evaluate actuals versus budget results</li><li>Monitor DC Inbound and Outbound activities, promptly reporting potential delays and implementing proactive solutions.</li><li>Create and maintain inventory reconciliation reports to ensure accurate inventory balances</li><li>Act as liaison and maintain good relationships with internal operating departments including Production, Purchasing, Import/Export, AP, AR, Import/Export IT, and DC teams</li><li>Assist with and ensure successful accounting audits</li><li>Prepare adhoc reports and analysis for management review</li><li>Ensure accuracy of inventory stock ledger within our ERP system</li><li>Organize and facilitate physical inventories and cycle counts</li><li>Partner with the technical team on design, testing, and implementation of inventory process improvements</li><li>Process inventory adjustments to correct costing issues in ERP<br/><br/></li></ul><strong>What You'll Need:<br/><br/></strong><ul><li>1-3+ years of experience analyzing large data sets in Excel including with Pivot Tables and VLOOKUP</li><li>Available to work onsite 3 days per week at the Reformation office in the Vernon neighborhood (with the option to work from home on Mondays and Fridays)</li><li>Strong ability to assess problem situations to identify causes, gather and process relevant information, generate possible solutions, and make recommendations</li><li>Effectively analyzes details and articulates key findings to management</li><li>Completes actions on time even in dynamic environments</li><li>Collaborates and builds positive, influential relationships with other teams</li><li>Bonus points for experience with inventory control, supply chain, or logistics<br/><br/></li></ul><strong>Benefits &amp; Perks:<br/><br/></strong><ul><li>Health, vision, and dental insurance for eligible employees</li><li>Paid vacation, sick, holidays &amp; volunteer time-off for eligible employees</li><li>Mission based company + casual and entrepreneurial work environment </li><li>Clothing discount, dog-friendly office, company events + parties and much more </li><li>401K with company match <br/><br/></li></ul><em>The Reformation is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, disability, or protected veteran status<br/><br/></em><em>Notice at Collection- Privacy Notice for California Candidates</em>", "postedDate": "1 week ago", "skills": ["Excel", "Pivot Tables", "VLOOKUP", "Inventory Control", "Supply Chain", "Logistics"], "benefits": "Health, vision, and dental insurance for eligible employees, Paid vacation, sick, holidays &amp; volunteer time-off for eligible employees, Mission based company + casual and entrepreneurial work environment , Clothing discount, dog-friendly office, company events + parties and much more , 401K with company match", "url": "https://www.linkedin.com/jobs/view/4001819464"}