{"jobTitle": "RN Supervisor", "company": {"name": "Advanced Care Partners", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "<strong>Job Description<br/><br/></strong><strong>Key Responsibilities<br/><br/></strong><strong>Supervision Responsibilities<br/><br/></strong><ul><li>Responsible for providing direct supervision, training, and guidance for the medical staff.</li><li>Ensures all direct reports are in compliance with HR 360 policies, procedures and position expectations and performance goals.</li><li>Gives ongoing feedback and conducts formal performance evaluations in a timely manner.</li><li>Responsible for direct report performance management including, performance improvement plans, formal written warning notices</li><li>Delivers and arranges trainings and resources required for direct reports as well as nursing staff to perform their roles.</li><li>Provides coaching, support, and performance management to direct reports to ensure productivity/client care expectations are met.</li><li>Supports the site medical staff in interviewing, selection, hiring and terminations for positions within program.</li><li>Maintains open communication with the Associate Medical Director/Medical Director and BH Program Directors concerning employee matters/needs and seeks consultation when needed.</li><li>Responsible for scheduling and facilitating team meetings as applicable to support client care and staff development.</li><li>Supports site medical staff to triage client’s medical concerns collaborating/coordinating with community medical partners.<br/><br/></li></ul><strong>Clinical Supervision Responsibilities<br/><br/></strong><ul><li>Responsible for clinical oversight of all nursing treatment services provided by nursing staff within scope of practice.</li><li>Responsible for ensuring that nursing staff provide strengths based, trauma informed, and culturally competent services.</li><li>Ensure charts meet quality management standards per monthly utilization review and/or chart review process, including completion of review tools within designated timeframe. meet intake timelines with regard to T.B. testing, Health Questionnaire's and the scheduling of intake physical exams, thorough review of clinical documentation and providing co-signature as applicable.</li><li>Responsible for all direct reports submitting documentation in accordance with program requirements and in compliance with all compliance and regulatory requirements and agency’s policies and procedures. This includes timeliness of documentation with progress notes being completed no later than the following business day, assessments, treatment plans, and discharges occur on time.</li><li>Assumes ownership for any crisis situation as it relates to service delivery and sees it through to completion. This may include consultation, direct service, crisis intervention, ensuring proper documentation, on-call duties, and LPS responsibilities as applicable.</li><li>Facilitates and assists with client case conferences as applicable.</li><li>Ensures that team communicates and collaborative with all members of the behavioral health team including medical, mental health, psychiatry, substance abuse staff and others.<br/><br/></li></ul><strong>Administrative Responsibilities<br/><br/></strong><ul><li>Responsible for ensuring that all treatment service plans and activities are executed in keeping with the organization’s values, mission, vision and strategy.</li><li>In collaboration with management, develops and maintains good relations with contractors and other collaborators to ensure program continuation within assigned program.</li><li>In collaboration with management and program leadership, responsible for ensuring compliance with all programmatic or project contractual requirements.</li><li>Ensures nursing staff remain in compliance with policies and procedures as it relates to day to day program operations in collaboration with the Managers, QI and EHR staff.</li><li>In collaboration with management and program leadership, responsible for direct report’s and team’s performance. Team performance includes contract utilization and the quality of services provided by the team.</li><li>Consults and collaborates with the Associate Medical Director/Medical Director concerning client assignment and workload distribution across the team.</li><li>Ensure lab orders are carried out within 14 days and that lab results are reviewed, and critical values reported to the provider.<br/><br/></li></ul><strong>Direct Service Responsibilities<br/><br/></strong><ul><li>Direct Service as necessary and within scope of practice, which may include crisis intervention, assessments, individual services, group services, case conferences, and treatment plans as assigned by the Associate Medical Director/Medical Director.</li><li>Maintain clinical oversight of the department.</li><li>Assist provider with medication management of patients.</li><li>Ensures medical department compliance with all HealthRIGHT 360 Policies and Procedures.</li><li>Maintain and track medication sheets to ensure patient adherence to prescribed medications.</li><li>Coordinate pharmacy services. Ensures control and oversight of any paper prescriptions.</li><li>Confirms that there is a progress note for every scheduled appointment whether kept, missed, or cancelled.</li><li>Provide medication education consultations and collaboration to staff and student interns.<br/><br/></li></ul>And, other duties as assigned.", "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001896816"}