{"jobTitle": "Warehouse Associate / Yard Truck Driver", "company": {"name": "Simplified Labor Staffing Solutions Inc.", "location": "Compton, CA"}, "location": "Compton, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "<strong>Job Description<br/><br/></strong><strong>Warehouse Associate / Yard Truck Driver <br/><br/></strong>We need a <strong>Warehouse Associate with Prior Yard Goat / Hostler Driving experience</strong> to work at a growing logistics company in Compton, CA. As a Warehouse Associate and Yard Driver, you will be responsible for moving containers for the first half of your shift and assisting with various warehouse tasks the second half of your shift. Part-time positions where you will work 20 hours per week and only be responsible for operating a yard truck are also available.<br/><br/><strong>You will earn $25.50 an hour, and work Monday through Friday from 6am to 2:30pm, plus some weekend work. You will also be eligible for:<br/><br/></strong><ul><li>Weekly Pay</li><li>Direct Deposit</li><li>Health Insurance</li><li>Sick pay and more!<br/><br/></li></ul><strong>Your responsibilities as a Warehouse Associate and Yard Driver, will also include:<br/><br/></strong><ul><li>Maintaining safety throughout the yard. </li><li>Ensuring the correct containers are located. </li><li>Spending half of the day assisting inside the warehouse. <br/><br/></li></ul><strong>To be considered, you must be at least 21 years of age and have:<br/><br/></strong><ul><li>A driving record with no more than 3 moving violations. </li><li>At least 1 year of verifiable driving experience in a similar type of vehicle and position. </li><li>The ability to work overtime on weekends, as needed. <br/><br/></li></ul><strong>If you seek a great opportunity with a top company, then we want to hear from you NOW! Apply today for immediate consideration.</strong>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4001582346"}