{"jobTitle": "Subcontract Material Coordinator III", "company": {"name": "Weber Metals, Inc.", "location": "Paramount, CA"}, "location": "Paramount, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Purchasing and Supply Chain", "industry": "Defense and Space Manufacturing", "description": "Job Details<br/><br/><strong>Description<br/><br/></strong>Total Compensation Hourly Range: $29.74- $35.10/hour<br/><br/><ul><li>All Applicants must comply with ITAR Requirements. US Citizens or Permanent Residents only**<br/><br/></li></ul><strong>Summary<br/><br/></strong>The Subcontract Material Coordinator III works closely with the Subcontract Material Supervisor to ensure all subcontract material transactions are properly executed on a daily basis. This includes dispatching and receiving subcontract and finished good materials from/into inventory and conducting the necessary system transactions.<br/><br/><strong>Major Job Duties<br/><br/></strong><ul><li> Perform all tasks of the Subcontract Material Coordinator II</li><li> Responsible for the safety, quality, and productivity of the work-center</li><li> Responsible for knowing and achieving daily standard production and efficiency goals</li><li> Responsible for knowing and achieving scrap and rework goals</li><li> Work with subcontract schedulers and production departments to coordinate production orders due to process to meet daily schedule requirements</li><li> Competently navigate the necessary functions of the ERP system to properly execute shipping/receiving transactions for die tooling, sub-contracting and finished goods transactions.</li><li> Properly prepare all required outbound paperwork for vendor pickup</li><li> Perform physical inspection of subcontract material received and conduct a quality check of paperwork to ensure accuracy and completeness</li><li> Properly record and respond to discrepancies related to subcontract receiving; work closely with Subcontract schedulers, Quality, and impacted departments to resolve issues as needed</li><li> Subcontractor Material Coordinator shall be able to perform at least four of the below processes:<br/><br/></li></ul>Heat Treat<br/><br/><ul><li> Have knowledge of aluminum and titanium heat treat process flow, product types and requirements in order to effectively manage suppliers to meet quality and delivery performance expectations.</li><li> Work with internal departments and outside vendors to arrange/coordinate transportation of subcontracted product</li><li> Work closely with Die Forge and Hand Forge departments to coordinate stress relieve operations; document location and time into freezer as needed</li><li> Oversee the loading and unloading of product onto vendor trucks</li><li> Properly prepare all required outbound paperwork for vendor pickup</li><li> Perform quality verification check of subcontract paperwork received for accuracy and completeness.</li><li> Submit test material in accordance to Weber Metals Quality procedures<br/><br/></li></ul>Non-Destructive Testing<br/><br/><ul><li> Have knowledge of ultrasonic and penetrant process flow, product types and requirements in order to effectively manage suppliers to meet quality and delivery performance expectations.</li><li> Work with internal departments and outside vendors to arrange/coordinate transportation of subcontracted product</li><li> Oversee the loading and unloading of product onto vendor trucks</li><li> Properly prepare all required outbound paperwork for vendor pickup</li><li> Perform quality verification check of subcontract paperwork received for accuracy and completeness.<br/><br/></li></ul>Dimensional Inspection<br/><br/><ul><li> Have knowledge of inspection / layout process flow, product types and requirements in order to effectively manage suppliers to meet quality and delivery performance expectations.</li><li> Work with internal departments and outside vendors to arrange/coordinate transportation of subcontracted product</li><li> Oversee the loading and unloading of product onto vendor trucks</li><li> Properly prepare all required outbound paperwork for vendor pickup</li><li> Perform quality verification check of subcontract paperwork received for accuracy and completeness.<br/><br/></li></ul>Surface Treatments<br/><br/><ul><li> Have knowledge of product and die process flow requiring sandblasting or chem mill, product types and requirements in order to effectively manage suppliers to meet quality and delivery performance expectations.</li><li> Work with internal departments and outside vendors to arrange/coordinate transportation of subcontracted product</li><li> Communicate and coordinate with outside processes, die shops, and external storage sites for the timely transport of dies needed for production</li><li> Oversee the loading and unloading of dies/tooling and product onto vendor trucks</li><li> Ensure returned dies are replaced in their designated storage area</li><li> Properly prepare all required outbound paperwork for vendor pickup</li><li> Perform quality verification check of subcontract paperwork received for accuracy and completeness.<br/><br/></li></ul>Machining<br/><br/><ul><li> Have knowledge of machining process flow, product types and requirements in order to effectively manage suppliers to meet quality and delivery performance expectations.</li><li> Work with internal departments and outside vendors to arrange/coordinate transportation of subcontracted product</li><li> Oversee the loading and unloading of product onto vendor trucks</li><li> Properly prepare all required outbound paperwork for vendor pickup</li><li> Perform quality verification check of subcontract paperwork received for accuracy and completeness.<br/><br/></li></ul>Finished Goods<br/><br/><ul><li> Oversee the loading and unloading of product onto trucks</li><li> Properly prepare all required outbound paperwork for vendor pickup<br/><br/></li></ul><strong>Maintain Accuracy Of Inventory<br/><br/></strong><ul><li> Perform periodic cycle counting of inventories</li><li> Maintain inventory in an orderly fashion with all material organized into designated areas.</li><li> Give direction to the Subcontract Material Handlers and/or Subcontract Material Coordinators (I and II) to prepare and move product to appropriate staging areas with required identification, as well as oversight to prepare, load, and unload subcontract and finished goods.<br/><br/></li></ul><strong>Additional Responsibilities Include<br/><br/></strong><ul><li> Train Subcontractor Material Coordinators Level II and below</li><li> Participate as an internal ISO Auditor when required</li><li> Assist the supervisor to assign job duties at the start of each shift</li><li> Request maintenance on equipment as needed</li><li> Other duties as assigned<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>To perform this job successfully, an individual must:<br/><br/><ul><li> Be able to comply with ITAR and EAR residency requirements</li><li> Meet all the requirements of Subcontract Material Coordinator II</li><li> Be able to perform each essential duty satisfactorily<br/><br/></li></ul><strong>Education/Experience<br/><br/></strong><ul><li> High school graduate or equivalent experience</li><li> Minimum 12 months experience as Material Coordinator II or equivalent at Weber Metals or similar company in the forging or metals industry.</li></ul>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4001827472"}