{"jobTitle": "Operations Assistant", "company": {"name": "Sunon Furniture", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Customer Service", "industry": "Office Furniture and Fixtures Manufacturing", "description": "<strong>Role and Responsibilities</strong><p>Sunon is looking for a driven individual to help fill out our customer service team as an Order Entry specialist. The right person will be adept at learning and adapting to new systems and processes as we develop the best customer experience department in the industry. The responsibilities for this position are:</p><p><br/></p><p>Efficiently and accurately inputting, updating, and maintaining orders and salesperson data into the company’s database promptly.</p><p>Transferring customer orders into our logistics system and following up with the logistics team to make sure orders are getting processed.</p><p>Following up with customers to make sure they receive orders and forwarding concerns and warranty issues to the right department.</p><p>Ensuring customer payment is made and recording payments.</p><p>Generating customer quotes to assist sales team.</p><p>Maintain the showroom and handle administrative tasks.</p><p>Keeping a continuous improvement mindset.</p><p><br/></p><p>Sunon Global is one of the largest furniture manufacturers in the world but are just getting started in the U.S. market. This is an exciting opportunity to experience the growth and rapid change of a startup without the risks. To work at Sunon is to work with a driven team that supports each other and provides opportunities for growth and learning every day.</p><p><br/></p><p><strong>Qualifications and Education Requirements</strong></p><p>AS degree or Equivalent Required</p><p>Highly organized</p><p>1-3 years order entry experience</p><p>Effective communication (written and spoken)</p><p>Familiar with MS Office suite and NetSuite</p><p>Positive Attitude</p><p>Resourceful and a problem solver.</p><p><br/></p><p><strong>Preferred Skills</strong></p><p>Furniture industry/commercial interiors experience</p><p>Fluent in Mandarin is a plus</p><p><br/></p><p><strong>BENEFITS:</strong></p><p><br/></p><p>Paid vacations</p><p>Medical, vision, and dental insurance are available</p>", "responsibilities": "Efficiently and accurately inputting, updating, and maintaining orders and salesperson data into the company’s database promptly. Transferring customer orders into our logistics system and following up with the logistics team to make sure orders are getting processed. Following up with customers to make sure they receive orders and forwarding concerns and warranty issues to the right department. Ensuring customer payment is made and recording payments. Generating customer quotes to assist sales team. Maintain the showroom and handle administrative tasks. Keeping a continuous improvement mindset.", "qualifications": {"required": "AS degree or Equivalent Required Highly organized 1-3 years order entry experience Effective communication (written and spoken) Familiar with MS Office suite and NetSuite Positive Attitude Resourceful and a problem solver.", "preferred": "Furniture industry/commercial interiors experience Fluent in Mandarin is a plus"}, "skills": ["Order Entry", "Customer Service", "MS Office", "NetSuite", "Communication"], "postedDate": "5 days ago", "benefits": "Paid vacations Medical, vision, and dental insurance are available", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001647181"}