{"jobTitle": "Medical Director (Remote- Medicare)", "company": {"name": "Molina Healthcare", "industry": "Hospitals and Health Care", "size": "Not specified", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Remote", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$161,914.25 - $315,732.78", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "Responsible for serving as the primary liaison between administration and medical staff. Assures the ongoing development and implementation of policies and procedures that guide and support the provisions of medical staff services. Maintains a working knowledge of applicable national, state, and local laws and regulatory requirements affecting the medical and clinical staff.", "responsibilities": "Provides medical oversight and expertise in appropriateness and medical necessity of healthcare services provided to members, targeting improvements in efficiency and satisfaction for patients and providers, as well as meeting or exceeding productivity standards. Educates and interacts with network and group providers and medical managers regarding utilization practices, guideline usage, pharmacy utilization and effective resource management. Develops and implements a Utilization Management program and action plan, which includes strategies that ensure a high quality of patient care, ensuring that patients receive the most appropriate care at the most effective setting. Evaluates the effectiveness of UM practices. Actively monitors for over and under-utilization. Assumes a leadership position relative to knowledge, implementation, training, and supervision of the use of the criteria for medical necessity. Participates in and maintains the integrity of the appeals process, both internally and externally. Responsible for the investigation of adverse incidents and quality of care concerns. Participates in preparation for NCQA and URAC certifications. Develops and provides leadership for NCQA-compliant clinical quality improvement activity (QIA) in collaboration with the clinical lead, the medical director, and quality improvement staff. Facilitates conformance to Medicare, Medicaid, NCQA and other regulatory requirements. Reviews quality referred issues, focused reviews and recommends corrective actions. Conducts retrospective reviews of claims and appeals and resolves grievances related to medical quality of care. Attends or chairs committees as required such as Credentialing, P&T and others as directed by the Chief Medical Officer. Evaluates authorization requests in timely support of nurse reviewers; reviews cases requiring concurrent review, and manages the denial process. Monitors appropriate care and services through continuum among hospitals, skilled nursing facilities and home care to ensure quality, cost-efficiency, and continuity of care. Ensures that medical decisions are rendered by qualified medical personnel, not influenced by fiscal or administrative management considerations, and that the care provided meets the standards for acceptable medical care. Ensures that medical protocols and rules of conduct for plan medical personnel are followed. Develops and implements plan medical policies. Provides implementation support for Quality Improvement activities. Stabilizes, improves and educates the Primary Care Physician and Specialty networks. Monitors practitioner practice patterns and recommends corrective actions if needed. Fosters Clinical Practice Guideline implementation and evidence-based medical practice. Utilizes IT and data analysts to produce tools to report, monitor and improve Utilization Management. Actively participates in regulatory, professional and community activities.", "qualifications": {"required": "Doctorate Degree in Medicine, Board Certified or eligible in a primary care specialty (Internal Medicine). 3+ years relevant experience, including 2 years previous experience as a Medical Director in a clinical practice. Current clinical knowledge. Experience demonstrating strong management and communication skills, consensus building and collaborative ability, and financial acumen. Knowledge of applicable state, federal and third party regulations.", "preferred": "Master’s in Business Administration, Public Health, Healthcare Administration, etc. Peer Review, medical policy/procedure development, provider contracting experience. Experience with NCQA, HEDIS, Medicaid, Medicare and Pharmacy benefit management, Group/IPA practice, capitation, HMO regulations, managed healthcare systems, quality improvement, medical utilization management, risk management, risk adjustment, disease management, and evidence-based guidelines. Experience in Utilization/Quality Program management, HMO/Managed care experience."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Molina Healthcare offers a competitive benefits and compensation package. Molina Healthcare is an Equal Opportunity Employer (EOE) M/F/D/V.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4001497066"}