{"jobTitle": "Retail Associate Part-Time - North Los Angeles", "company": {"name": "Dermalogica", "industry": "Personal Care Product Manufacturing", "location": "Carson, CA"}, "location": "Carson, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Personal Care Product Manufacturing", "description": "<strong>Who We Are<br/><br/></strong>Dermalogica stands tall as a beacon in the professional skincare realm, winning the trust of skin therapists across the globe. As a shining gem in the crown of the Unilever Prestige family, our commitment isn't just to nurture skin, but also to redefine industry standards with revolutionary skincare innovations. With a commitment to innovation, sustainability, and excellence, Dermalogica has been at the forefront of the skincare industry for over three decades. Bolstered by our International Dermal Institute – the apex of post-graduate skin and body therapy training – we are on an exhilarating journey of expansion. And you could be a part of this adventure!<br/><br/><strong>What You'll Do<br/><br/></strong>Are you a skincare enthusiast with a passion for sales and education? Transform your passion for beauty and sales into a dynamic role as <strong>Part-Time Retail Associate- North Los Angeles </strong>with the world-renowned skincare brand, Dermalogica! In this role, you will be driving retail sales and promoting Dermalogica services at our partner Ulta and Sephora locations. Working independently and collaboratively, you will embody the best practices of Dermalogica within a fast-paced, multi-branded retail environment.<br/><br/>We offer flexible shifts during peak retail hours, generally from 11:00 AM to 5:00 PM or 12:00 PM to 6:00 PM, including every Thursday thru Saturday, and occasional Wednesdays and Sundays. You can expect to work approximately 25-28 hours per week.<br/><br/><strong>Territory: </strong>The Ulta and Sephora door locations will be situated in Sherman Oaks &amp; Pasadena, providing an exciting and diverse customer base.<br/><br/><strong>Key Responsibilities:<br/><br/></strong><ul><li>Promote and sell Dermalogica and Clean Start products, striving to meet defined retail targets.</li><li>Maintain an extensive knowledge of Dermalogica products, including new product launches and in-store promotions.</li><li>Articulate the unique features and benefits of Dermalogica products, inspiring customers and Ulta/Sephora associates alike.</li><li>Provide product and promotional information to Ulta/Sephora associates.</li><li>Cultivate a positive, energetic work environment, driving motivation among store associates.</li><li>Execute events to meet defined objectives on a weekly, monthly, and seasonal basis.</li><li>Maintain regular and consistent communication with the Regional Manager regarding business successes, needs, and opportunities.</li><li>Exude the spirit of Dermalogica, becoming our Ultimate Brand Ambassador!<br/><br/></li></ul><strong>What You'll Bring<br/><br/></strong><strong>Key Qualifications:<br/><br/></strong><ul><li>Strong background in retail sales and promotional event planning within the skincare industry required</li><li>Experience with retailers Ulta/Sephora and multi-location responsibilities required</li><li>Esthetics/Cosmetology license required</li><li>Valid driver’s license with reliable transportation for extensive travel within the territory required</li><li>Proficiency in Microsoft Office applications (Outlook, Word, Excel, and PowerPoint) and ADP</li><li>Clear understanding of market and consumer needs, with the ability to effectively communicate these needs to retail partners and Dermalogica management</li><li>Ideal candidate would reside in the North Los Angeles area.<br/><br/></li></ul><strong>Key Skills and Abilities:<br/><br/></strong><ul><li>Stellar selling skills with a passion for educating and motivating others</li><li>Strong verbal communication skills to engage with a diverse team</li><li>Effective organizational skills and industry knowledge<br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li>Competitive Compensation</li><li>Flexible, part-time schedule with work-life balance</li><li>Monthly Product Allowances</li><li>Wellness programs</li><li>Education/training programs<br/><br/></li></ul><strong>The expected base hourly pay rate is $27.</strong> The exact base pay rate is determined by various factors including experience, skills, education, geographic location, and budget. This role is eligible for participation in our company bonus plan, rewarding personal performance and company results.<br/><br/><strong>Why Join Us?<br/><br/></strong><ul><li>A Legacy of Success: Dermalogica is the preferred choice of Skin Therapists worldwide, renowned for our exceptional skincare line and industry-leading postgraduate education. We have a record of achievement and are committed to building upon our brand's legacy.</li><li>Entrepreneurial Spirit and Innovation: At Dermalogica, we foster an entrepreneurial spirit and encourage our employees to bring their best ideas to the table. You'll have the opportunity to make a difference and contribute to our success by implementing innovative solutions that reach skincare professionals and consumers.</li><li>Backed by Unilever: In 2015, Dermalogica became part of the Unilever family, one of the world's largest and most successful consumer goods companies. While operating as an independent business, we now have access to cutting-edge capabilities and resources, empowering us to win in our markets.<br/><br/></li></ul><strong>Join the Dermalogica family and embark on an exciting journey with a global skincare leader. <br/><br/></strong>Hit the <strong>Apply Now</strong> button today! Rest assured, all applications will be thoughtfully reviewed, and our HR team will contact you if your skills align with the position.<br/><br/><em>Dermalogica LLC, a Unilever Prestige Brand, embraces diversity, equity, and inclusion. We are committed to the equal treatment of all current and prospective employees regardless of age, disability, sex, sexual orientation, pregnancy and maternity, race or ethnicity, religion or belief, gender identity, or marriage and civil partnership. We aspire to have a diverse workforce because, in our view, diversity enables better business outcomes. We also believe that a more inclusive workplace, where people of different backgrounds work together, ensures better outcomes for all staff. From application to interview, we place inclusion at the heart of all we do. In particular, we strongly encourage suitably qualified applicants from a wide range of backgrounds to apply and join Dermalogica</em>.", "responsibilities": "<ul><li>Promote and sell Dermalogica and Clean Start products, striving to meet defined retail targets.</li><li>Maintain an extensive knowledge of Dermalogica products, including new product launches and in-store promotions.</li><li>Articulate the unique features and benefits of Dermalogica products, inspiring customers and Ulta/Sephora associates alike.</li><li>Provide product and promotional information to Ulta/Sephora associates.</li><li>Cultivate a positive, energetic work environment, driving motivation among store associates.</li><li>Execute events to meet defined objectives on a weekly, monthly, and seasonal basis.</li><li>Maintain regular and consistent communication with the Regional Manager regarding business successes, needs, and opportunities.</li><li>Exude the spirit of Dermalogica, becoming our Ultimate Brand Ambassador!<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Strong background in retail sales and promotional event planning within the skincare industry required</li><li>Experience with retailers Ulta/Sephora and multi-location responsibilities required</li><li>Esthetics/Cosmetology license required</li><li>Valid driver’s license with reliable transportation for extensive travel within the territory required</li><li>Proficiency in Microsoft Office applications (Outlook, Word, Excel, and PowerPoint) and ADP</li><li>Clear understanding of market and consumer needs, with the ability to effectively communicate these needs to retail partners and Dermalogica management</li><li>Ideal candidate would reside in the North Los Angeles area.<br/><br/></li></ul>", "preferred": null}, "skills": ["Retail Sales", "Skincare", "Event Planning", "Ulta", "Sephora", "Esthetics", "Cosmetology", "Microsoft Office", "ADP", "Communication", "Customer Service"], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": "<ul><li>Competitive Compensation</li><li>Flexible, part-time schedule with work-life balance</li><li>Monthly Product Allowances</li><li>Wellness programs</li><li>Education/training programs<br/><br/></li></ul>", "remoteWork": null, "salary": {"amount": "27", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4001824580"}