{"jobTitle": "Floor Director, Beverly Hills Flagship", "company": {"name": "Hermès", "industry": "Retail Luxury Goods and Jewelry", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$133,000.00 - $165,000.00", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Retail Luxury Goods and Jewelry", "description": "<strong>The Team:<br/><br/></strong>The Hermès Beverly Hills Flagship Boutique opened in 1972 and focuses on providing extraordinary service to clients as a part of the Western Region. This position will report to the Managing Director and will work collaboratively with the sales team and selling support teams to support the client experience in a fast-paced, luxury environment.<br/><br/><strong>The Opportunity:<br/><br/></strong>The Floor Director supports the location with consistent team leadership, floor presence, and hands on Métier management with balanced attention to all teams and floors. This position is responsible for achievement of Floor Group Métier Sales volume, and Selling Team total goaled volume. Responsible for preparation, participation and attendance at Podium buy bi-annually.<br/><br/><strong>About the Role:<br/><br/></strong>Floor Ambassador – Day to day supervision, coaching, mentoring, and training of selling team, leading by example and ensuring excellent client service. Consistent floor presence and partner to other departments.<br/><br/>Manage Métier merchandising for floor of responsibility. Identify and address daily stock needs by floor, communicating timely with Managing Director, Operations Management team and Merchant team about opportunities, needs, and issues. Fully responsible for bi-annual attendance and preparation for buy for corresponding areas of responsibility. Ensures visual standards are met.<br/><br/>Team motivator and strategist. Monthly identification of a key Métier focus or a Standard of Service to focus on. Build contests, measurable selling campaigns or the like to bring about incremental improvement in business.<br/><br/>Consistent communication with Managing Director and store management team. Weekly reporting and presenting business updates at Leadership meeting including sales to plan by total group and floor responsibility, team highlights, issues, etc. Able to conduct full analysis of business issues and opportunities effecting decided strategies onto the floors and with the teams.<br/><br/>Coach staff for improved performance. Analyze productivity by Sales Associate and conduct Monthly Individual Productivity meetings coaching and setting goals for increased performance. Detailed client opportunities, selling by Métier performance, standards of service and goals should all be addressed on a monthly basis. Writes and delivers annual performance appraisals. Addresses all performance issues in a timely manner.<br/><br/>Responsible for timely preparation of inventories and cycle counts, including partnering with Operations Director in the reconciliation of discrepancies.<br/><br/>All other duties as assigned by the supervisor.<br/><br/><strong>Supervisory Responsibility:<br/><br/></strong><ul><li>YES<br/><br/></li></ul>Ability to represent Leadership of entire store in the absence of the Managing Director. Observant of support team, and Guard team productivity and adherence to policy. Ability to gain partnership on store needs, and lead these teams although not direct reports.<br/><br/><strong>Budget Responsibility:<br/><br/></strong><ul><li>YES<br/><br/></li></ul>P&amp;L responsibility and responsibility for meeting sales and budget plan and adhering to payroll budget. Also responsible for shrinkage and asset protection company goals.<br/><br/><strong> Decision Making Responsibility:<br/><br/></strong><ul><li>YES <br/><br/></li></ul>Client Services, Policy interpretation, Recommendation for hiring and promotion, Buying decisions, Merchandising efforts, etc.<br/><br/><strong>About You:<br/><br/></strong><ul><li>Minimum 3 years prior Store Management experience, or flagship Assistant Store Manager Experience</li><li>Previous buying experience relative to Floor responsibility</li><li>Individual Management of multi person teams</li><li>Prior reporting functions to Executive management and Merchant levels</li><li>Bachelor's Degree preferred</li><li>Managing people and projects, a good team leader, and motivational mentor</li><li>Creativity within effective business management and growth</li><li>Detailed, diligent, thorough, reliable, effective time management skills are KEY to this position</li><li>Effective decision making skills </li><li>Proficient at presentations, store meetings, Commercial Director and Executive visits</li><li>Working knowledge of Excel, Lotus Notes, Microsoft Office, Powerpoint (preferred)</li><li>Comfortable with calculations and formulas</li><li>Need to be a critical and creative thinker</li><li>Even tempered and ability to continuously multi-task </li><li>Managing stress and coaching through conflict when needed</li><li>Resolution on store issues by floor, and in total when manager on duty</li><li>Experience working with public and independently satisfy client requests</li><li>Prioritize tasks and communicate time sensitive information to appropriate parties </li><li>Keen eye to product and future trends needed for buying responsibility</li><li>Must be extremely professional and able to interact with all levels of management and the public</li><li>Knowledge of the French language helpful</li><li>Travel required, 3-5 weeks annually to Paris<br/><br/></li></ul>The annual salary range for this position is $133,000-$165,000. Actual rates are determined based on the job, location, and individual experience.<br/><br/>We are looking for a candidate that has a combination of the above attributes and can perform the key functions of the role with or without reasonable accommodations.<br/><br/><strong>Company Overview:<br/><br/></strong>Since 1837, Hermès has remained faithful to its artisan business model and humanist values. We place people at the heart of what we do and aspire to make a positive impact on the world. The freedom to create, the constant search for beautiful materials, the transmission of a savoir-faire of excellence and the aesthetic of functionality define the singularity of Hermès, a house dedicated to making highly-crafted, beautiful objects made to stand the test of time.<br/><br/>An independent, family-owned company, Hermès is dedicated to keeping production in France through its 42 workshops, The Hermès organization is also a truly global community with a network of 310 stores in 49 countries. Hermès employs more than 15,000 people worldwide with over 6,000 of the workforce being Hermès craftspeople engaged in making artisanal products, nurturing a 180+ year tradition of creativity and innovation.<br/><br/>At Hermès, our actions for sustainable development and corporate social responsibility are founded in values passed down by generations of humble artisans who have shaped the story of our house and the integrity of our objects. The roots of Hermès’ success and longevity lie in a sense of responsibility; a quest for authenticity and respect for time and preservation of natural resources. All at Hermès wish to leave a positive footprint on the world, a mission that’s at the heart of our commitment to progress. This narrative can be experienced in a series of shorts films “Footsteps Across the World” available on our website. Link here.<br/><br/><strong>Our Commitment:<br/><br/></strong>Family is at the heart of Hermès. At Hermès of Paris, we are committed to being a Maison for All, a home where we make efforts to generate, support and advance the values of diversity, inclusion and family both within our own walls and in the wider world. At Hermès of Paris we look to create a diverse workforce of talented and unique individuals with different backgrounds, skillsets and worldviews that will enrich our Hermès of Paris family. We support our individual team members personal and professional success through a culture that values equality, individuality and fairness and through an environment where individuals can thrive and feel comfortable being their authentic selves. Beyond the walls of our Maison, we advance our DIF values through the work that we do in partnership with our community and non-profit partners.<br/><br/>At Hermès of Paris, we are proud to be an equal opportunity workplace. It is the policy of Hermès of Paris, Inc. that applicants for employment are recruited, selected and hired on the basis of individual merit and ability with respect to positions being filled and potential for promotion or transfer which may be expected to develop. Applicants are recruited, selected and hired without discrimination because of race, color, religion, sex, age, national origin, disability, genetic information, sexual orientation, citizenship, military or veteran status or any other basis prohibited by applicable law. In addition, personnel procedures and practices with regard to training, promotion, transfer, compensation, demotion, lay off or termination are to be administered with due regard to job performance, experience and qualifications, but without discrimination because of race, color, religion, sex, age, national origin, disability, genetic information, sexual orientation, citizenship, military or veteran status or any other basis prohibited by applicable law. Hermès of Paris, Inc. also provides reasonable accommodations to qualified individuals with disabilities, in accordance with applicable laws.<br/><br/>We collect personal information (PI) from you in connection with your application for employment with Hermes, including the following categories of PI: identifiers, personal records, commercial information, professional or employment information, non-public education records, and inferences drawn from your PI. We collect your PI for our purposes, including performing services and operations related to your potential employment. For additional details or if you have questions, contact us at ccpa@hermes.com. Please do not submit resumes or applications to this email address.", "responsibilities": "Floor Ambassador – Day to day supervision, coaching, mentoring, and training of selling team, leading by example and ensuring excellent client service. Consistent floor presence and partner to other departments.\n\nManage Métier merchandising for floor of responsibility. Identify and address daily stock needs by floor, communicating timely with Managing Director, Operations Management team and Merchant team about opportunities, needs, and issues. Fully responsible for bi-annual attendance and preparation for buy for corresponding areas of responsibility. Ensures visual standards are met.\n\nTeam motivator and strategist. Monthly identification of a key Métier focus or a Standard of Service to focus on. Build contests, measurable selling campaigns or the like to bring about incremental improvement in business.\n\nConsistent communication with Managing Director and store management team. Weekly reporting and presenting business updates at Leadership meeting including sales to plan by total group and floor responsibility, team highlights, issues, etc. Able to conduct full analysis of business issues and opportunities effecting decided strategies onto the floors and with the teams.\n\nCoach staff for improved performance. Analyze productivity by Sales Associate and conduct Monthly Individual Productivity meetings coaching and setting goals for increased performance. Detailed client opportunities, selling by Métier performance, standards of service and goals should all be addressed on a monthly basis. Writes and delivers annual performance appraisals. Addresses all performance issues in a timely manner.\n\nResponsible for timely preparation of inventories and cycle counts, including partnering with Operations Director in the reconciliation of discrepancies.\n\nAll other duties as assigned by the supervisor.\n\nAbility to represent Leadership of entire store in the absence of the Managing Director. Observant of support team, and Guard team productivity and adherence to policy. Ability to gain partnership on store needs, and lead these teams although not direct reports.\n\nP&amp;L responsibility and responsibility for meeting sales and budget plan and adhering to payroll budget. Also responsible for shrinkage and asset protection company goals.\n\nClient Services, Policy interpretation, Recommendation for hiring and promotion, Buying decisions, Merchandising efforts, etc.", "qualifications": {"required": "Minimum 3 years prior Store Management experience, or flagship Assistant Store Manager Experience\nPrevious buying experience relative to Floor responsibility\nIndividual Management of multi person teams\nPrior reporting functions to Executive management and Merchant levels\nManaging people and projects, a good team leader, and motivational mentor\nCreativity within effective business management and growth\nDetailed, diligent, thorough, reliable, effective time management skills are KEY to this position\nEffective decision making skills \nProficient at presentations, store meetings, Commercial Director and Executive visits\nWorking knowledge of Excel, Lotus Notes, Microsoft Office, Powerpoint (preferred)\nComfortable with calculations and formulas\nNeed to be a critical and creative thinker\nEven tempered and ability to continuously multi-task \nManaging stress and coaching through conflict when needed\nResolution on store issues by floor, and in total when manager on duty\nExperience working with public and independently satisfy client requests\nPrioritize tasks and communicate time sensitive information to appropriate parties \nKeen eye to product and future trends needed for buying responsibility\nMust be extremely professional and able to interact with all levels of management and the public", "preferred": "Bachelor's Degree\nKnowledge of the French language helpful"}, "skills": ["Store Management", "Buying", "Team Leadership", "Client Service", "Merchandising", "Sales", "Budgeting", "Inventory Management", "Performance Management", "Communication", "Presentation Skills", "Excel", "Lotus Notes", "Microsoft Office", "Powerpoint", "French"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "The annual salary range for this position is $133,000-$165,000. Actual rates are determined based on the job, location, and individual experience.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001817021"}