{"jobTitle": "Event Assistant", "company": {"name": "Malibu Events Promotions", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$50,000.00/yr - $65,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Business Consulting and Services", "description": "Are you a detail-oriented individual with a passion for creating memorable experiences? Join our clients team as an Event Assistant and embark on an exciting career in event management! With a competitive salary ranging from $50,000 to $65,000 per year after training, this role offers the opportunity to thrive in a dynamic and collaborative environment.\n<br/>\n**Responsibilities:**\n<br/>\n<ul><li>**Event Coordination:** Assist in the planning, coordination, and execution of various events, including client meetings, seminars, conferences, and networking events. Coordinate logistics such as venue selection, catering, audiovisual equipment, and transportation.</li><li>**Attendee Management:** Manage event registrations, RSVPs, and attendee communications. Provide support to ensure a smooth check-in process and address any attendee inquiries or issues during the event.</li><li>**Vendor Liaison:** Communicate with vendors, suppliers, and contractors to negotiate contracts, secure services, and ensure timely delivery of goods and services. Maintain positive relationships with vendors to support future event needs.</li><li>**Budget Management:** Assist in creating event budgets, tracking expenses, and managing costs to ensure events are executed within budgetary constraints. Identify cost-saving opportunities without compromising quality or attendee experience.</li><li>**Marketing Support:** Collaborate with the marketing team to promote events through various channels, including email campaigns, social media, and website announcements. Create engaging event materials such as invitations, flyers, and signage.</li><li>**On-site Support:** Provide on-site support during events, including setup, breakdown, and coordination of staff and volunteers. Act as a point of contact for event vendors, attendees, and speakers to address any issues and ensure a seamless experience.</li><li>**Post-Event Evaluation:** Conduct post-event evaluations to gather feedback from attendees, sponsors, and stakeholders. Analyze data and insights to identify areas for improvement and implement enhancements for future events.</li></ul>\n<br/>\n**Qualifications:**\n<br/>\n<ul><li>Bachelor's degree in Event Management, Hospitality, Marketing, or a related field.</li><li>Previous experience in event planning, coordination, or hospitality is preferred.</li><li>Strong organizational skills with the ability to multitask and prioritize tasks effectively.</li><li>Excellent communication and interpersonal skills, with a customer service mindset.</li><li>Detail-oriented with a focus on delivering high-quality events and experiences.</li><li>Proficiency in Microsoft Office Suite and event management software is a plus.</li><li>Ability to work flexible hours, including evenings and weekends, as needed for events.</li></ul>\n<br/>\n**Benefits:**\n<br/>\n<ul><li>Competitive salary range of $50,000 - $65,000 per year after training.</li><li>Opportunities for career growth and advancement within a dynamic and growing company.</li><li>Collaborative and supportive work environment with a focus on teamwork and mutual success.</li></ul>\n<br/>\nJoin our team and become an integral part of creating exceptional events that leave a lasting impression on our clients and partners. If you're ready to take your career to the next level in event management, apply now!", "responsibilities": "Assist in the planning, coordination, and execution of various events, including client meetings, seminars, conferences, and networking events. Coordinate logistics such as venue selection, catering, audiovisual equipment, and transportation. Manage event registrations, RSVPs, and attendee communications. Provide support to ensure a smooth check-in process and address any attendee inquiries or issues during the event. Communicate with vendors, suppliers, and contractors to negotiate contracts, secure services, and ensure timely delivery of goods and services. Maintain positive relationships with vendors to support future event needs. Assist in creating event budgets, tracking expenses, and managing costs to ensure events are executed within budgetary constraints. Identify cost-saving opportunities without compromising quality or attendee experience. Collaborate with the marketing team to promote events through various channels, including email campaigns, social media, and website announcements. Create engaging event materials such as invitations, flyers, and signage. Provide on-site support during events, including setup, breakdown, and coordination of staff and volunteers. Act as a point of contact for event vendors, attendees, and speakers to address any issues and ensure a seamless experience. Conduct post-event evaluations to gather feedback from attendees, sponsors, and stakeholders. Analyze data and insights to identify areas for improvement and implement enhancements for future events.", "qualifications": {"required": "Bachelor's degree in Event Management, Hospitality, Marketing, or a related field. Strong organizational skills with the ability to multitask and prioritize tasks effectively. Excellent communication and interpersonal skills, with a customer service mindset. Detail-oriented with a focus on delivering high-quality events and experiences. Proficiency in Microsoft Office Suite and event management software is a plus. Ability to work flexible hours, including evenings and weekends, as needed for events.", "preferred": "Previous experience in event planning, coordination, or hospitality is preferred."}, "skills": ["Event Management", "Hospitality", "Marketing", "Event Planning", "Coordination", "Microsoft Office Suite", "Event Management Software"], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "Competitive salary range of $50,000 - $65,000 per year after training. Opportunities for career growth and advancement within a dynamic and growing company. Collaborative and supportive work environment with a focus on teamwork and mutual success.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001654009"}