{"jobTitle": "Sales Representative - FIJI Water - Retail Trade Execution", "company": {"name": "FIJI Water", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$66,560", "currency": "USD"}, "jobFunction": "Sales", "industry": "Manufacturing", "description": "It's more than just water. It's FIJI Water. Since 1996, FIJI Water has embodied what it means to be Earth's Finest Water®. Sold in more than 60 countries, FIJI Water is known for its iconic square bottle and unique mineral profile.<br/><br/>Just as discerning as FIJI Water, our Sales team is seeking a distinctive sales representative that can lead and execute within market, channel, and accounts by driving store level sales to support FIJI Water in the San Fernando Valley territory. This role is a unique opportunity to jump right into owning your accounts by merchandising and bringing forth your sales skills in the field.<br/><br/>This position is a Monday through Friday role, starting between 5:30am and 6:00am and finishing in the mid to late afternoon.<br/><br/><strong>Job Description<br/><br/></strong><ul><li>Maintain territory through Salesforce to build and establish retail relationships. </li><li>Take initiative to expand space and presence on FIJI Water, JUSTIN, Landmark and JNSQ products by building, moving displays, and/or product to establish best location for sales portfolio</li><li>Rotate and stock all company authorized products on every store call</li><li>Maintain schematic integrity, re-merchandising projects as needed including grand openings and re-models as requested by retailer</li><li>Facilitate account penetration and achieve maximum sales, execution, and participation on all company promotions and programs</li><li>Perform Consumer Wine Tastings for The Wonderful Company Wine Portfolio </li><li>Execute, maintain, and monitor company-driven marketing initiatives and programs including maintenance of POS and coupon and tie-in programs as assigned<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Prior sales and merchandising experience with beverage and/or grocery products preferred</li><li>Strong relationship building skills with customers and internal associates</li><li>Clean driving record is required - a background check will be conducted</li><li>Ability to lift 50lbs. with no restrictions. The merchandising portion of the role is a physical job and requires a candidate who enjoys being active throughout the day. </li><li>A customer service mindset to ensure internal/external partners receive quality sales support</li><li>Ability to be proactive in identifying issues, recommending solutions, multi-tasking, and staying organized in a fast-paced environment</li><li>Capability to commute within the territory boundaries as established and perform routine travel inside and outside the territory as required for sales driving activities; may require overnight travel from time to time. </li><li>Ability to travel by air outside the territory and state to trade shows, market blitzes, national sales meetings, and the corporate office, as required by the company</li><li>Ability to proficiently navigate MS Outlook, Word and Excel is required<br/><br/></li></ul>Pay Rate: $66,560 and may include a discretionary bonus. Final compensation will be dependent upon skills &amp; experience.<br/><br/><strong>Additional Information<br/><br/></strong><ul><li>$450 a month in car allowance and $0.17 in gas mileage reimbursement</li><li>Company technology provided including iPhone and iPad</li><li>Competitive benefits package including Medical, Vision, Dental and 401k with match eligibility</li><li>Opportunities for development and internal mobility</li><li>Manager and leadership training, L&amp;OD webinars, and eLearning offerings</li><li>Companywide problem solving and continuous improvement training</li><li>Wonderful Giving (wonderfulgiving.com) - allowing you to donate company money to a cause of your choice</li><li>Company prioritizes wellness through its Wonderful NOW (Nourish Our Wellness) initiative, which provides a robust suite of wellness offerings such as access to mental health resources and life coaching, employee community groups, cash rewards for healthy habits, and on-demand fitness<br/><br/></li></ul>FIJI® Water, natural artesian water bottled at the source in Viti Levu (Fiji islands), is the No. 1 premium imported bottled water in the United States. FIJI Water is the water of choice among discerning consumers and top chefs. Widely available at fine restaurants and hotels, all major retail channels and through a convenient home/business delivery service, FIJI Water has expanded globally to more than 90 countries. To discover Earth’s Finest Water®, please visit www.fijiwater.com, like us on Facebook, or follow us on Instagram or Twitter.<br/><br/>FIJI Water is part of The Wonderful Company, a successful, fast-growing privately held $6 billion company with 10,000 employees worldwide. The Wonderful Company’s connection to consumers has health at its heart and giving back in its DNA. The company has a long-standing commitment to corporate social responsibility, including more than $1 billion invested in environmental sustainability; $65 million in charitable giving, education initiatives, and innovative health and wellness programs each year; and $143 million toward the construction of two charter school campuses in California’s Central Valley. To view the current Corporate Social Responsibility report, visit csr.wonderful.com.<br/><br/>To discover Earth's Finest Water®, please visit www.fijiwater.com, like us on Facebook, or follow us on Instagram or Twitter.<br/><br/>The Wonderful Company is an Equality Opportunity Employer that provides opportunities for advancement. We are committed to creating a diverse workforce that embodies a deep culture of acceptance, equity, and inclusion. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, protected veteran status, or other protected categories.<br/><br/>EEO is the law - click here for more information", "responsibilities": "<ul><li>Maintain territory through Salesforce to build and establish retail relationships. </li><li>Take initiative to expand space and presence on FIJI Water, JUSTIN, Landmark and JNSQ products by building, moving displays, and/or product to establish best location for sales portfolio</li><li>Rotate and stock all company authorized products on every store call</li><li>Maintain schematic integrity, re-merchandising projects as needed including grand openings and re-models as requested by retailer</li><li>Facilitate account penetration and achieve maximum sales, execution, and participation on all company promotions and programs</li><li>Perform Consumer Wine Tastings for The Wonderful Company Wine Portfolio </li><li>Execute, maintain, and monitor company-driven marketing initiatives and programs including maintenance of POS and coupon and tie-in programs as assigned<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Prior sales and merchandising experience with beverage and/or grocery products preferred</li><li>Strong relationship building skills with customers and internal associates</li><li>Clean driving record is required - a background check will be conducted</li><li>Ability to lift 50lbs. with no restrictions. The merchandising portion of the role is a physical job and requires a candidate who enjoys being active throughout the day. </li><li>A customer service mindset to ensure internal/external partners receive quality sales support</li><li>Ability to be proactive in identifying issues, recommending solutions, multi-tasking, and staying organized in a fast-paced environment</li><li>Capability to commute within the territory boundaries as established and perform routine travel inside and outside the territory as required for sales driving activities; may require overnight travel from time to time. </li><li>Ability to travel by air outside the territory and state to trade shows, market blitzes, national sales meetings, and the corporate office, as required by the company</li><li>Ability to proficiently navigate MS Outlook, Word and Excel is required<br/><br/></li></ul>", "preferred": ""}, "skills": ["Salesforce", "Merchandising", "Customer Service", "Relationship Building", "Microsoft Outlook", "Microsoft Word", "Microsoft Excel"], "postedDate": "1 week ago", "benefits": "<ul><li>$450 a month in car allowance and $0.17 in gas mileage reimbursement</li><li>Company technology provided including iPhone and iPad</li><li>Competitive benefits package including Medical, Vision, Dental and 401k with match eligibility</li><li>Opportunities for development and internal mobility</li><li>Manager and leadership training, L&amp;OD webinars, and eLearning offerings</li><li>Companywide problem solving and continuous improvement training</li><li>Wonderful Giving (wonderfulgiving.com) - allowing you to donate company money to a cause of your choice</li><li>Company prioritizes wellness through its Wonderful NOW (Nourish Our Wellness) initiative, which provides a robust suite of wellness offerings such as access to mental health resources and life coaching, employee community groups, cash rewards for healthy habits, and on-demand fitness<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001762989"}