{"jobTitle": "Warehouse/Inventory Assoc. 1 - Progression 1", "company": {"name": "Arrowhead Products", "location": "Los Alamitos, CA"}, "location": "Los Alamitos, CA", "jobType": "Full-time", "employmentType": "Other", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Aviation & Aerospace", "description": "<strong>Job Summary<br/><br/></strong>This position will be responsible for warehouse and inventory duties in the Shipping and Receiving Department. <em>It is a combination of the following jobs: Material Clerk, Tool Shed Attendant, and Truck Driver.<br/><br/></em><strong>Essential Duties And Responsibilities<br/><br/></strong><ul><li>Wrap, package, receive, ship and issue various parts and packages. </li><li>Taping and labeling of cartons, boxes, packages and various parts. </li><li>Read and interpret carbon and box blueprints for commercial and government specifications.</li><li>Will operate forklift to load/unload parts, materials, tooling, company property, etc.</li><li>Will drive company vehicle(s) to pick-up and/or deliver parts, materials, tooling, company property, etc.</li><li>Utilize a handheld device to issue/receive parts into the storerooms. </li><li>On occasions use a computer to send emails, create labels and utilize AS400 (BPCS) to post transactions.</li><li>Responsible for assisting the department in the development of techniques to increase productivity, quality, and throughput of products and to share job knowledge in the department.</li><li>This job description is not all inclusive of all duties. Other job duties consistent with the Warehouse/ Inventory Clerk Job Family within the New Job Family Structure may be assigned.<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><ul><li>Valid Class “C” Driver License required</li><li>High School Diploma or equivalent; previous manufacturing experience may be substituted for education requirement.</li><li>Experience with MRP II or other Inventory Control system(s) preferred.</li><li>*Employees must bid into these classifications before progression is allowed to higher levels.<br/><br/></li></ul><strong>Knowledge, Skill And Abilities<br/><br/></strong>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><ul><li>Basic knowledge of various types of raw materials with emphasis on proper storage and handling techniques. </li><li>Basic knowledge of commercial and government preservation, packaging, packing, marking, shipping, bills of lading, travelers and shippers. </li><li>Will obtain forklift certification within first 60-days of hire.</li><li>Excellent communication skills both written and verbal. </li><li>Strong attention to detail.</li><li>Ability to perform quality work in a safe and efficient manner.<br/><br/></li></ul><strong>Supervisory Responsibilities<br/><br/></strong><ul><li>N/A<br/><br/></li></ul><strong>Physical Demands<br/><br/></strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><ul><li>Frequent lifting of up to 50 lbs.</li><li>Frequent pushing and pulling.</li><li>Bend, stoop, squat occasionally.</li><li>Sit, stand and walk frequently.</li><li>Talk and listen frequently.</li><li>Occasional use of computer.</li><li>Constant use and motion of hands and arms.</li><li>Constant exposure to manufacturing shop noise.<br/><br/></li></ul><strong>Special Requirements<br/><br/></strong>List any additional special requirements.<br/><br/><strong>Limitations And Disclaimer<br/><br/></strong>The statements herein are intended to describe the general nature and level of work being performed by employees and are not to be construed as an exhaustive list of responsibilities, duties, and skills required of personnel so classified. Furthermore, this job description does not establish a contract for employment. In compliance with the Americans with Disability Act (ADA) of 1990, the Company will make reasonable accommodations with those individuals with a disability as defined by the ADA.", "postedDate": "1 week ago", "skills": ["Forklift", "MRP II", "Inventory Control", "Communication", "Packaging", "Shipping", "Blueprints", "Forklift Certification", "Handheld Devices", "AS400", "BPCS", "Manufacturing", "Safety", "Quality", "Productivity", "Materials Handling", "Preservation", "Packing", "Marking", "Bills of Lading", "Travelers", "Shippers"], "url": "https://www.linkedin.com/jobs/view/4001808607"}