{"jobTitle": "Nike Factory Store - Accounting/Administrative Assistant - Ontario, CA", "company": {"name": "Nike", "location": "Ontario, CA"}, "location": "Ontario, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "21.50/hr - 27.95/hr", "currency": "USD"}, "jobFunction": "Customer Service", "industry": "Retail", "description": "Become a Part of the NIKE, Inc. Team<br/><br/><p>NIKE, Inc. does more than outfit the world's best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At NIKE, Inc. it's about each person bringing skills and passion to a challenging and constantly evolving game.<br/><br/></p><p>To work in retail is to be the face of NIKE, Inc. With a relentless focus on product knowledge and customer service, Nike Retail teams give valuable experiences to consumers every day. From Shanghai to San Francisco, every store has a unique perspective and hosts an inspiring community of sport and style devotees. A career in Nike Retail demands creativity and ambition and offers the opportunity to grow with some of the best athletes, teammates and retail partners in the industry.<br/><br/></p><p>The hourly rate for this position ranges from $21.50 to $27.95. Actual pay rate will vary based on a candidate's location, qualifications, skills and experience.<br/><br/></p><strong>Information About Benefits Can Be Found Here .<br/><br/></strong><p>As our Nike Store Accounting/Administrative Assistant your mission is to drive business results by providing a premium consumer and employee experience through an administrative lens.<br/><br/></p><strong>Responsibilities<br/><br/></strong><p></p><ul><li>Administer advanced cashiering tasks including all cash-related opening/closing duties, assembling/verifying cash deposits, counting tills, and ensuring that cashiers have adequate change on hand</li><li>Support scheduling through zone chart report generation and identifying/aiding with opportunities in daily athlete coverage</li><li>Review athlete tech functionality and store facilities to help troubleshoot, submit service tickets, and track ticket statuses</li><li>Ability to perform standard cashiering duties and resolve irregular or difficult transactions</li><li>Perform other support tasks as required including but not limited to processing staff uniform transactions, answering telephone calls, ordering supplies, and submitting change orders<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><p></p><ul><li>High school diploma or equivalent</li><li>1-year minimum retail experience</li><li>Ability to communicate in English</li><li>Proficient knowledge of office practices, procedures, and equipment</li><li>Intermediate skills in Microsoft Office products including Word and Excel</li><li>Ability to use the Internet/Intranet as a resource for department work activities</li><li>Strong customer service skills and the ability to exercise a high degree of professionalism</li><li>Strong attention to detail and deadlines<br/><br/></li></ul><p>NIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.<br/><br/></p><p>NIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability.<br/><br/></p><strong>Benefits<br/><br/></strong><p>Whether it's transportation or financial health, we continually invest in our employees to help them achieve greatness - inside and outside of work. All who work here should be able to realize their full potential.</p>", "responsibilities": "As our Nike Store Accounting/Administrative Assistant your mission is to drive business results by providing a premium consumer and employee experience through an administrative lens.<br/><br/>\n\nResponsibilities<br/><br/>\n\n<ul><li>Administer advanced cashiering tasks including all cash-related opening/closing duties, assembling/verifying cash deposits, counting tills, and ensuring that cashiers have adequate change on hand</li><li>Support scheduling through zone chart report generation and identifying/aiding with opportunities in daily athlete coverage</li><li>Review athlete tech functionality and store facilities to help troubleshoot, submit service tickets, and track ticket statuses</li><li>Ability to perform standard cashiering duties and resolve irregular or difficult transactions</li><li>Perform other support tasks as required including but not limited to processing staff uniform transactions, answering telephone calls, ordering supplies, and submitting change orders<br/><br/></li></ul>", "qualifications": {"required": "High school diploma or equivalent\n1-year minimum retail experience\nAbility to communicate in English\nProficient knowledge of office practices, procedures, and equipment\nIntermediate skills in Microsoft Office products including Word and Excel\nAbility to use the Internet/Intranet as a resource for department work activities\nStrong customer service skills and the ability to exercise a high degree of professionalism\nStrong attention to detail and deadlines<br/><br/>"}, "skills": ["Customer Service", "Microsoft Office", "Word", "Excel", "Retail"], "postedDate": "1 week ago", "benefits": "Whether it's transportation or financial health, we continually invest in our employees to help them achieve greatness - inside and outside of work. All who work here should be able to realize their full potential.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001836751"}