{"jobTitle": "Senior Designer - Seamless", "company": {"name": "SBH Fashion", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Staffing and Recruiting", "description": "Vertical company seeking Senior Designer for Seamless category. Must have good flat sketching in illustrator and fill for active seamless product. Should be able to create tech paks for sampling and travel if needed. Hybrid with strong benefits.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Fully responsible for entire product life cycle including trend research, inspiration, sketches, mock-ups, garment specs, specific details and fit.</li><li>Deadline driven with excellent organizational and time management skills and able to multitask in fast paced environment.</li><li>Expert in garment construction specific to Seamless category (garment fit, types of silhouettes etc.)</li><li>Strong communication skills to collaborate and communicate internally with cross-functional teams: Design, Sales, Production, &amp; Overseas.</li><li>Ability to manage seasonal calendar, adhere to product development deadlines and key benchmark meetings.</li><li>Designs a balanced collection appropriate to the demands of the business growth strategy.</li><li>Being accountable for sourcing incoming swatches/trims from the factories for seasonal fabric development.</li><li>Assign Print and Color to style ensuring prints and patterns are balanced and look integrated across various silhouettes.</li><li>Reviews all incoming samples making sure submits are matching to standard and licensing agreement.</li><li>Maintain a strong knowledge of trends, market demands, brand objectives and design aesthetic.</li><li>Solution oriented with ability to anticipate problems, address issues, and resolve challenges in a timely manner.</li><li>Maintains an organized design space (samples, files, visual CAD’s etc.) so that information is readily accessible to teammates.<br/><br/></li></ul><strong>Salary Up to $120,000<br/><br/></strong>", "postedDate": "1 week ago", "skills": ["Illustrator", "Seamless", "Garment Construction", "Trend Research", "Product Development", "Time Management", "Communication", "Collaboration", "Design", "Sales", "Production", "Overseas", "Seasonal Calendar", "Fabric Development", "Print", "Color", "Market Demands", "Brand Objectives", "Design Aesthetic", "Problem Solving", "Organization", "Visual CAD"], "url": "https://www.linkedin.com/jobs/view/4001754932"}