{"jobTitle": "Coordinator, Music Programming, Part-time", "company": {"name": "SiriusXM", "industry": "Entertainment Providers and Broadcast Media Production and Distribution", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Entertainment Providers and Broadcast Media Production and Distribution", "description": "Who We Are<br/><br/>SiriusXM and its brands (Pandora, SiriusXM Media, AdsWizz, Simplecast, and SiriusXM Connected Vehicle Services) are leading a new era of audio entertainment and services by delivering the most compelling subscription and ad-supported audio entertainment experience for listeners -- in the car, at home, and anywhere on the go with connected devices. Our vision is to shape the future of audio, where everyone can be effortlessly connected to the voices, stories and music they love wherever they are.<br/><br/>This is the place where a diverse group of emerging talent and legends alike come to share authentic and purposeful songs, stories, sounds and insights through some of the best programming and technology in the world. Our critically-acclaimed, industry-leading audio entertainment encompasses music, sports, comedy, news, talk, live events, and podcasting. No matter their individual role, each of our employees plays a vital part in bringing SiriusXM’s vision to life every day.<br/><br/>SiriusXM is the leading audio entertainment company in North America, and the premier programmer and platform for subscription and digital advertising-supported audio products. SiriusXM’s platforms collectively reach approximately 150 million listeners, the largest digital audio audience across paid and free tiers in North America, and deliver music, sports, talk, news, comedy, entertainment and podcasts. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM's subsidiaries Simplecast and AdsWizz make it a leader in podcast hosting, production, distribution, analytics and monetization. The Company’s advertising sales organization, which operates as SiriusXM Media, leverages its scale, cross-platform sales organization and ad tech capabilities to deliver results for audio creators and advertisers. SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers.<br/><br/>How You’ll Make An Impact<br/><br/>Works with members of the Music Programming team to create superior radio programs as needed. Supports creative processes, content development and production. Exercises both creative abilities and technical skills. Edits materials and operates an audio board. May be assigned to more than one program and perform slightly different functions across channels.<br/><br/>What You’ll Do<br/><br/><ul><li>Receives daily assignments from Director, Music Programming Operations, Program Directors &amp; VP, Music Programming</li><li>Creates playlists for long form reportable shows.</li><li>Reviews Royalty metadata across a variety of Third Party shows, to ensure accuracy.</li><li>Gains an understanding of the music scheduling software and automation system</li><li>Develops an understanding of and performs audio editing, fades and inserting correct digital markers that sound the most appealing based on music/content selection and channel genre</li><li>Loads audio elements into music automation system &amp; properly enters royalties related song information</li><li>Serves as a In Studio Producer, ensuring that live broadcasts air smoothly by maintaining proper audio levels, firing elements at proper times, troubleshooting technical issues under pressure</li><li>May act as liaison to music artists during celebrity visits and communicates with music labels, as directed by management</li><li>Performs other duties as assigned<br/><br/></li></ul>What You’ll Need<br/><br/><ul><li>Bachelor’s degree or equivalent experience</li><li>6-12 months of music programming related experience at a satellite, traditional commercial, and/or college radio station</li><li>Strong interest in learning all aspects of music programming and a desire to grow into a Program Director position</li><li>Strong interest in music and pop culture</li><li>Good public speaking and presentation skills.</li><li>Interpersonal skills and ability to interact and work with staff at all levels.</li><li>Excellent written and verbal communication skills.</li><li>Ability to work independently and in a team environment.</li><li>Detail-oriented and strong organizational skills.</li><li>Ability to project professionalism over the phone and in person.</li><li>Ability to handle multiple tasks in a fast-paced environment.</li><li>Willingness to take initiative and to follow through on projects.</li><li>Creative writing ability.</li><li>Excellent time management skills, with the ability to prioritize and task-switch, and work under shifting deadlines in a fast-paced environment.</li><li>Must have legal right to work in the U.S.<br/><br/></li></ul>At SiriusXM, we carefully consider a wide range of factors when determining compensation, including your background and experience. These considerations can cause your compensation to vary. We expect the hourly rate for this position to be around $19/hr. and will depend on your skills, qualifications, and experience. Additionally, this role might be eligible for discretionary short-term and long-term incentives. We encourage all interested candidates to apply.<br/><br/>Our goal at SiriusXM is to provide and maintain a work environment that fosters mutual respect, professionalism and cooperation. SiriusXM is an equal opportunity employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, national origin, ancestry, alienage or citizenship status, age, disability or handicap, sex, gender identity, marital status, familial status, veteran status, sexual orientation or any other characteristic protected by applicable federal, state or local laws.<br/><br/>The requirements and duties described above may be modified or waived by the Company in its sole discretion without notice.<br/><br/>R-2024-08-26", "postedDate": "1 week ago", "skills": ["Music Programming", "Audio Editing", "Music Scheduling", "Royalty Metadata", "Audio Automation", "Live Broadcasting", "Public Speaking", "Presentation Skills", "Interpersonal Skills", "Communication Skills", "Teamwork", "Organizational Skills", "Time Management", "Creative Writing"], "url": "https://www.linkedin.com/jobs/view/4001935763"}