{"jobTitle": "Grocery Manager", "company": {"name": "Sprouts Farmers Market", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "18.90 - 30.25 / hour", "currency": "USD"}, "jobFunction": "Customer Service", "industry": "Retail", "description": "<strong>Overview<br/><br/></strong>Does being in charge of multiple, customer-focused departments sound like a role you would fit perfectly in? Does being responsible of a total team sound like it’s up your alley? Do you have a passion for delivering an extraordinary customer service experience while working in a fast paced and friendly environment? If the thought of helping people make healthy choices in one of the fastest growing retailers is up your alley - then we need YOU to join our winning team at Sprouts Farmers Market as a Grocery Manager!<br/><br/><strong>Overview Of Responsibilities<br/><br/></strong><strong>At Sprouts Farmers Market, the Grocery Manager is responsible for the sales and operation of multiple departments including- Grocery, Dairy, Frozen Food, and the Beer/Wine. <br/><br/></strong><ul><li>Ensure that products are handled properly, rotated to ensure freshness, and that date controls are performed </li><li>Control costs by constantly monitoring and improving operations to increase profitability- manage labor costs and reduce loss due to shrink, damage, and pilferage </li><li>Assist in the preparation of store for physical inventory counts </li><li>Assist or oversee the unloading of trucks from our distribution centers, and verify all deliveries against invoices, notes shortages, and overages and report them to the appropriate supplier </li><li>Manage ordering, compliance, sanitation, back-room inventory, and department safety </li><li>Engage and evaluate team members through coaching, feedback, and one-on-one development discussions, and make recommendations on merit increases via completing the bi-annual performance review process. </li><li>Regularly attend and participate at in-store meetings. </li><li>Recruit, hire and make promotion/transfer decisions in collaboration with the Store Manager. </li><li>Confidently exercise independent judgment to address Team Member concerns. </li><li>Take and document corrective actions when needed, including collaboration with business and HR partners in managing performance to include coaching, counseling, progressive discipline, suspension, or termination when needed. </li><li>Ensure maximum productivity and efficiency by creating and adjusting schedules and staffing levels. </li><li>Communicate standards, expectations, policy changes, and product knowledge to team members. </li><li>Lead a team that collaborates to deliver the finest quality of product, highest level of service, and the greatest experience your customers will receive.<br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>To be a Grocery Manager at Sprouts Farmers Market qualified candidates must:<br/><br/></strong><ul><li>Be at least 18 years of age and possess 1 year managerial or supervisory experience which includes responsibility for managing a department/team within a multi-department operation within the retail, hospitality, or service industry </li><li>Have strong good communication skills both written and verbal and the ability to take and give direction, participating in a team environment </li><li>Have and show an outgoing and friendly behavior along with a positive attitude and the ability to interact with our customers </li><li>Possess a proven leadership ability to build, motivate and maintain staff, while possessing a working knowledge of personnel reports, margin reports, weekly sales numbers and financial goals </li><li>Have a strong focus on detail, analytical and problem solving skills </li><li>Have and maintain Food Safety certification. Also ensure that all federal, state, and company regulations and standards for product freshness, food safety, weights and measures, store safety, employee safety, refrigeration, and sanitation are met </li><li>Have strong organization and planning skills; able to prioritize and handle multiple tasks </li><li>Must vertically transfer milk trays weighing up to 60 lbs., from 9” to 62”, for up to 25 hours </li><li>Must vertically/horizontally transfer boxes weighing up to 50 lbs., from 5” to 34”, for a distance up to 5 feet for up to 25 hours without mechanical assistance </li><li>Repetitive squatting/kneeling/bending to access a point 5 inches from the floor for up to 30 hours is expected </li><li>Must have the ability to work a flexible schedule that changes as the business changes, including nights, weekends, and holidays. </li><li>Possess a working knowledge of personnel reports, margin reports, weekly sales numbers, and financial goals. </li><li>Have and show outgoing and friendly behavior along with a positive attitude towards Team Members and customers. <br/><br/><br/></li></ul><strong>Pay range <br/><br/></strong>The pay range for this position is $18.90 - $30.25 / hour. Sprouts Farmers Market determines pay based on applicable experience and qualifications of the applicant.<br/><br/><strong>Benefits<br/><br/></strong>In addition to a rewarding career, Sprouts offers a comprehensive program to help support you and your family. These programs include:<br/><br/><ul><li>Competitive pay</li><li>Sick time plan that you can use to support you or your immediate families health</li><li>Vacation accrual plan</li><li>Opportunities for career growth</li><li>15% discount for you and one other family member in your household on all purchases made at Sprouts</li><li>Flexible schedules</li><li>Employee Assistance Program (EAP)</li><li>401(K) Retirement savings plan with a generous company match</li><li>Company paid life insurance</li><li>Contests and appreciation events throughout the year full of prizes, food and fun!<br/><br/><br/></li></ul><strong>Eligibility Requirements May Apply For The Following Benefits<br/><br/></strong><ul><li>Bonus based on company and/or individual performance</li><li>Affordable benefit coverage, including medical, dental and vision</li><li>Health Savings Account with company match</li><li>Pre-tax Flexible Spending Accounts for healthcare and dependent care</li><li>Company paid short-term disability coverage</li><li>Paid parental leave for both mothers and fathers</li><li>Paid holidays<br/><br/><br/></li></ul><strong>Get Paid Every Day!<br/><br/></strong>Sprouts Farmers Market offers DailyPay - if you’re hired as an eligible employee, you’ll be able to <strong>transfer the money you’ve already earned at no extra cost, and get it the next business day, for free</strong>. We offer DailyPay so you don’t have to wait for payday to access the money you’ve already worked for. With DailyPay, you can see how much you’ve made every day and you can transfer your money any time before payday.<br/><br/>You can learn more by visiting <strong>https://www.dailypay.com/partners/sprouts-farmers-market/.<br/><br/></strong><strong>Why Sprouts<br/><br/></strong><strong>Grow with us!<br/><br/></strong>If you have a passion for inspiring people and a flair for fresh food, consider applying for a job at Sprouts! With a focus on customer service, our neighborhood grocery stores offer high-quality, farm fresh produce, natural meats, plenty of scoop-your-own bulk goods and much more in a fun, friendly, old-fashioned farmer’s market setting. Come grow your career in healthy living with a fast-paced, rapidly growing company and teams that pride themselves on empowering others along their journey.<br/><br/><em>The above statements are intended to describe the general nature and level of the work being performed by people assigned to this work. This is not an exhaustive list of all duties, responsibilities, and requirements. Sprouts’ management reserves the right to amend and change duties, responsibilities, and requirements to meet business and organizational needs as necessary.<br/><br/></em><em>Sprouts will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Fair Chance in Hiring Ordinance.<br/><br/></em><em>California Residents: We collect information in accordance with California law, please see here for more information.</em>", "responsibilities": "At Sprouts Farmers Market, the Grocery Manager is responsible for the sales and operation of multiple departments including- Grocery, Dairy, Frozen Food, and the Beer/Wine. <br/><br/>Ensure that products are handled properly, rotated to ensure freshness, and that date controls are performed Control costs by constantly monitoring and improving operations to increase profitability- manage labor costs and reduce loss due to shrink, damage, and pilferage Assist in the preparation of store for physical inventory counts Assist or oversee the unloading of trucks from our distribution centers, and verify all deliveries against invoices, notes shortages, and overages and report them to the appropriate supplier Manage ordering, compliance, sanitation, back-room inventory, and department safety Engage and evaluate team members through coaching, feedback, and one-on-one development discussions, and make recommendations on merit increases via completing the bi-annual performance review process. Regularly attend and participate at in-store meetings. Recruit, hire and make promotion/transfer decisions in collaboration with the Store Manager. Confidently exercise independent judgment to address Team Member concerns. Take and document corrective actions when needed, including collaboration with business and HR partners in managing performance to include coaching, counseling, progressive discipline, suspension, or termination when needed. Ensure maximum productivity and efficiency by creating and adjusting schedules and staffing levels. Communicate standards, expectations, policy changes, and product knowledge to team members. Lead a team that collaborates to deliver the finest quality of product, highest level of service, and the greatest experience your customers will receive.", "qualifications": {"required": "Be at least 18 years of age and possess 1 year managerial or supervisory experience which includes responsibility for managing a department/team within a multi-department operation within the retail, hospitality, or service industry Have strong good communication skills both written and verbal and the ability to take and give direction, participating in a team environment Have and show an outgoing and friendly behavior along with a positive attitude and the ability to interact with our customers Possess a proven leadership ability to build, motivate and maintain staff, while possessing a working knowledge of personnel reports, margin reports, weekly sales numbers and financial goals Have a strong focus on detail, analytical and problem solving skills Have and maintain Food Safety certification. Also ensure that all federal, state, and company regulations and standards for product freshness, food safety, weights and measures, store safety, employee safety, refrigeration, and sanitation are met Have strong organization and planning skills; able to prioritize and handle multiple tasks Must vertically transfer milk trays weighing up to 60 lbs., from 9” to 62”, for up to 25 hours Must vertically/horizontally transfer boxes weighing up to 50 lbs., from 5” to 34”, for a distance up to 5 feet for up to 25 hours without mechanical assistance Repetitive squatting/kneeling/bending to access a point 5 inches from the floor for up to 30 hours is expected Must have the ability to work a flexible schedule that changes as the business changes, including nights, weekends, and holidays. Possess a working knowledge of personnel reports, margin reports, weekly sales numbers, and financial goals. Have and show outgoing and friendly behavior along with a positive attitude towards Team Members and customers."}, "skills": [], "postedDate": "6 days ago", "benefits": "In addition to a rewarding career, Sprouts offers a comprehensive program to help support you and your family. These programs include: Competitive pay Sick time plan that you can use to support you or your immediate families health Vacation accrual plan Opportunities for career growth 15% discount for you and one other family member in your household on all purchases made at Sprouts Flexible schedules Employee Assistance Program (EAP) 401(K) Retirement savings plan with a generous company match Company paid life insurance Contests and appreciation events throughout the year full of prizes, food and fun! Bonus based on company and/or individual performance Affordable benefit coverage, including medical, dental and vision Health Savings Account with company match Pre-tax Flexible Spending Accounts for healthcare and dependent care Company paid short-term disability coverage Paid parental leave for both mothers and fathers Paid holidays", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001597169"}