{"jobTitle": "Production Manager", "company": {"name": "Michael Page", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$40.00/hr - $55.00/hr", "currency": "USD"}, "jobFunction": "Manufacturing, Product Management, and Research", "industry": "Glass Product Manufacturing, Household Appliance Manufacturing, and Personal Care Product Manufacturing", "description": "The Production Manager will play a key role in ensuring that our candle production processes run smoothly, efficiently, and safely. You will be responsible for managing the entire production cycle, from raw material procurement to finished goods, while maintaining the highest standards of quality and consistency.\n\nClient Details\n\nMy client is a leading manufacturer of premium candles, known for our commitment to quality, craftsmanship, and innovative designs. We are passionate about creating products that bring warmth and ambiance to homes worldwide. As we continue to grow, we are looking for an experienced and motivated Production Manager to oversee our manufacturing operations.\n\nDescription\n\n \n\n*Production Oversight:* Manage all aspects of the candle production process, including wax melting, fragrance blending, wick assembly, and packaging, to ensure timely and efficient production.\n*Team Leadership:* Lead, train, and supervise production staff, fostering a collaborative and safety-first work environment. Promote continuous improvement and innovation within the team.\n*Quality Assurance:* Ensure all products meet our stringent quality standards, conducting regular inspections and collaborating with the Quality Control team to address any issues.\n*Process Optimization:* Analyze production workflows and implement strategies to improve efficiency, reduce waste, and optimize the use of materials and labor.\n*Inventory Management:* Monitor inventory levels of raw materials and finished products, coordinating with the Procurement and Supply Chain teams to ensure uninterrupted production.\n*Safety Compliance:* Maintain a safe working environment by enforcing company policies and OSHA regulations, conducting regular safety audits, and providing ongoing training to staff.\n*Budget Management:* Develop and manage the production budget, tracking expenses and identifying opportunities for cost savings without compromising product quality.\n*Collaboration:* Work closely with other departments, including R&D, Marketing, and Logistics, to ensure alignment on production schedules, new product launches, and customer delivery timelines.\n*Reporting:* Generate and present regular production performance reports to senior management, including key performance indicators (KPIs) such as production output, efficiency, and quality metrics.\n\n \n\n \n\nProfile\n\n* Bachelor's degree in Manufacturing, Engineering, Business Management, or a related field.\n* Minimum of 5 years of experience in a production management role, preferably within the candle or related manufacturing industry.\n* Strong knowledge of production processes, materials, and equipment used in candle manufacturing.\n* Proven leadership and team management skills, with a focus on continuous improvement.\n* Excellent problem-solving abilities and attention to detail.\n* Ability to work under pressure and manage multiple priorities in a fast-paced environment.\n* Proficiency in production management software and Microsoft Office Suite.\n\nJob Offer\n\n* Great Benefits\n* Compensation between $40-$55 per hour\n* PTO\n* 7+ paid holidays\n* Health, Dental, Vision\n* 401k match\n\n \n\nMichael Page will consider for employment qualified applicants with criminal histories in a manner consistent with the Los Angeles Fair Chance Initiative for Hiring Ordinance.\n\n*MPI does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, disability, veteran status, marital status, or based on an individual's status in any group or class protected by applicable federal, state or local law. MPI encourages applications from minorities, women, the disabled, protected veterans and all other qualified applicants.*", "responsibilities": "The Production Manager will play a key role in ensuring that our candle production processes run smoothly, efficiently, and safely. You will be responsible for managing the entire production cycle, from raw material procurement to finished goods, while maintaining the highest standards of quality and consistency.", "qualifications": {"required": "Bachelor's degree in Manufacturing, Engineering, Business Management, or a related field.\nMinimum of 5 years of experience in a production management role, preferably within the candle or related manufacturing industry.\nStrong knowledge of production processes, materials, and equipment used in candle manufacturing.\nProven leadership and team management skills, with a focus on continuous improvement.\nExcellent problem-solving abilities and attention to detail.\nAbility to work under pressure and manage multiple priorities in a fast-paced environment.\nProficiency in production management software and Microsoft Office Suite.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Great Benefits\nCompensation between $40-$55 per hour\nPTO\n7+ paid holidays\nHealth, Dental, Vision\n401k match", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001826331"}