{"jobTitle": "Administration Assistant", "company": {"name": "Pacific Coast Wealth Strategies", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Financial Services", "description": "<strong>Job Description<br/><br/></strong><strong>Administrative Position for a Successful Financial Advisor<br/><br/></strong><em>Part-time, Flexible Hours, Potential Work-from-Home Option<br/><br/></em>We are seeking a highly organized and detail-oriented individual to join our team as an Administrative Assistant for a successful financial advisor. This is a part-time position, requiring approximately 4 hours of work per day or 18 hours per week. The working hours are flexible, and there is a possibility of working from home for a portion of the week once training is complete.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Process all new business applications and service-related activities promptly and accurately. </li><li>Secure and input client data into our systems with utmost attention to detail and confidentiality. </li><li>Creating, updating, maintaining advisor reports</li><li>Assisting with the advisor's calendar</li><li>Schedule reviews with clients and ensure timely coordination of communication. </li><li>Collaborate closely with an executive assistant and the advisor to support their administrative needs effectively. <br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>Bachelor's degree</li><li>4+ years of experience in administration</li><li>Clean criminal and financial background<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Ability to work both independently and as part of a team, demonstrating excellent collaboration skills. </li><li>Proactive decision-making skills to anticipate and address administrative needs. </li><li>Strong verbal and written communication skills. </li><li>Proficiency with the MS Office Suite. </li><li>Ability to handle confidential material with discretion and maintain a high level of trustworthiness. <br/><br/></li></ul>We offer a supportive and dynamic work environment where your contributions are valued. If you are a self-motivated individual with a keen eye for detail and a passion for providing exceptional administrative support, we would love to hear from you.<br/><br/>Thank you for considering this opportunity. We look forward to reviewing your application!", "postedDate": "1 week ago", "skills": ["MS Office Suite"], "url": "https://www.linkedin.com/jobs/view/4001548843"}