{"jobTitle": "Receptionist / Admin Assistant", "company": {"name": "Miracle Mile Law Group", "location": "Los Angeles, CA", "industry": "Law Practice"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Law Practice", "description": "<strong>Job Description<br/><br/></strong><strong>WHO WE ARE<br/><br/></strong>Miracle Mile Law Group is a plaintiff-side employment law firm focusing exclusively on employment-related matters such as sexual harassment, wrongful termination, discrimination, retaliation, wage/hour, etc. We are a small boutique firm who and pride ourselves on providing personalized service every step of the way. We are rapidly expanding and need individuals who share our passion for representing the disadvantaged and providing a voice for the voiceless.<br/><br/><strong>Position Description<br/><br/></strong>We are looking for an enthusiastic and dedicated legal secretary and administrative assistant to join our team.<br/><br/><strong>Principal Responsibilities<br/><br/></strong><ul><li>Answer and appropriately route incoming phone calls. </li><li>Greet office visitors in a professional and courteous manner. </li><li>Assist with staffing and job recruiting online. </li><li>Send, retrieve and scan mail. </li><li>Reserve court hearings, depositions and mediations. </li><li>Follow up on records requests, process of service, and emails. </li><li>Scan incoming documents and assist with invoices. </li><li>Print, compile and organize documents for attorneys and paralegals. </li><li>Prioritize and complete tasks in a timely and efficient manner. </li><li>Keep common office areas clean and organized. </li><li>Other office administrative assistant responsibilities. <br/><br/></li></ul><strong>Required Experience And Skills<br/><br/></strong><ul><li>Strong written and oral communication skills (ANY WRITING EXPERIENCE IS HIGHLY PREFERRED!)</li><li>Journalism, english literature degree or other writing background HUGE plus!</li><li>Proficiency in Microsoft Office Suite, including Outlook, Word, Excel, and Powerpoint</li><li>Great time management and multi-tasking skills</li><li>Ability to act independently and with minimal supervision</li><li>Must be organized, detail-oriented and a self-starter</li><li>Type at least 60 WPM</li><li>Bilingual in Spanish is a huge plus</li><li>Experience as a legal secretary preferred, but not required<br/><br/></li></ul>Miracle Mile Law Group offers competitive pay and great opportunities for growth and advancement. We strive to maintain a family atmosphere and team work environment by working collaboratively. We make sure to let our team know that management's door is always open.<br/><br/><strong>Company Description<br/><br/></strong>Miracle Mile Law Group is a plaintiff-side employment law firm focusing exclusively on employment-related matters such as sexual harassment, wrongful termination, discrimination, retaliation, wage/hour, etc. We fight exclusively for workers’ rights and pride ourselves on providing personalized service every step of the way. Our firm places a heavy emphasis on taking cases to trial. We take our work seriously, but believe the best way to do so is in a collaborative, self-directed, and laid-back work environment. We offer competitive pay and great opportunities for growth and advancement.<br/><br/>Miracle Mile Law Group is a plaintiff-side employment law firm focusing exclusively on employment-related matters such as sexual harassment, wrongful termination, discrimination, retaliation, wage/hour, etc. We fight exclusively for workers’ rights and pride ourselves on providing personalized service every step of the way. Our firm places a heavy emphasis on taking cases to trial. We take our work seriously, but believe the best way to do so is in a collaborative, self-directed, and laid-back work environment. We offer competitive pay and great opportunities for growth and advancement.", "responsibilities": "Answer and appropriately route incoming phone calls. Greet office visitors in a professional and courteous manner. Assist with staffing and job recruiting online. Send, retrieve and scan mail. Reserve court hearings, depositions and mediations. Follow up on records requests, process of service, and emails. Scan incoming documents and assist with invoices. Print, compile and organize documents for attorneys and paralegals. Prioritize and complete tasks in a timely and efficient manner. Keep common office areas clean and organized. Other office administrative assistant responsibilities.", "qualifications": {"required": "Strong written and oral communication skills (ANY WRITING EXPERIENCE IS HIGHLY PREFERRED!), Journalism, english literature degree or other writing background HUGE plus!, Proficiency in Microsoft Office Suite, including Outlook, Word, Excel, and Powerpoint, Great time management and multi-tasking skills, Ability to act independently and with minimal supervision, Must be organized, detail-oriented and a self-starter, Type at least 60 WPM, Bilingual in Spanish is a huge plus, Experience as a legal secretary preferred, but not required", "preferred": ""}, "skills": ["Microsoft Office", "Communication", "Time Management", "Multitasking", "Organization", "Detail-Oriented", "Self-Starter", "Legal Secretary", "Spanish"], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "Miracle Mile Law Group offers competitive pay and great opportunities for growth and advancement. We strive to maintain a family atmosphere and team work environment by working collaboratively. We make sure to let our team know that management's door is always open.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4001552452"}