{"jobTitle": "Business Operations Specialist", "company": {"name": "Pathways Management Group", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "30.00/hr - 36.00/hr", "currency": "USD"}, "jobFunction": "Administrative, Other, and Business Development", "industry": "Administrative and Support Services and Education", "description": "Pathways Management Group is seeking a Business Operations Specialist to provide exceptional leadership, compassion and diligence to the President. Compensation: $30-$36/hr<br/>\n<br/>\nThe Business Operations Specialist at Pathways Management Group plays a pivotal role in collaborating with management, faculty, and staff to implement strategic initiatives. Responsibilities include executing project plans, ensuring compliance with objectives, researching best practices, drafting proposals, overseeing operational functions, and providing high-level administrative support. This role requires advanced knowledge of sales executive assistant duties, and excellent communication skills. Additionally, this role requires addressing operational challenges, improving processes, scheduling meetings, preparing reports, supporting leadership and administrative support staff.<br/>\n<br/>\nEssential Functions include, but are not limited to the following:\n Oversee, identify and address operational challenges and obstacles as they arise.\n Develops and implements solutions to improve processes and workflows.\n Design and develop project plans for new policies, programs, and initiatives.\n Coordinate implementation to align with strategic goals.\n Establish short and long-term goals to ensure timely and cost-effective project completion.\n Research best practices and develop alternative systems and procedures.\n Review, compare, and prepare various legal documents (i.e. proposals, petitions, applications)\n Draft proposals and collaborative agreements, ensuring compliance with regulations.\n Consult with stakeholders to facilitate implementation and achieve program objectives.\n Assist with student enrollment processing and perform miscellaneous duties as assigned.\n Identify and address operational challenges, implementing solutions to improve processes.\n Streamline departmental processes to enhance productivity and efficiency.\n Act as a point of contact for internal and external communications, and schedule meetings for staff members.\n Provide on-site and off-site support for company engagements.\n Collect data, prepare reports, and provide organizational support for supervisors.\n Assist with project proposals, contracts, and financial documents.\n Coordinate schedules and calendars for the President.<br/>\n<br/>\nKnowledge, Skills and Abilities Required: \n Advanced knowledge of executive assistant duties and working with high level positions within an organization (CEO, CFO, Presidents, Directors of Departments).\n Establish and maintain operating goals and objectives.\n Proficiency in personal computers and related software applications.\n Skill in analyzing and re-engineering systems, processes, and procedures.\n Strong organizational, verbal, and written communication skills.\n Working knowledge of operational areas such as administrative or fiscal management.<br/>\n<br/>\nEducation and Experience:\n Minimum high school diploma or equivalent required. College degree preferred.\n Minimum of 5 years administrative experience at an executive level or equivalent related experience.<br/>\n<br/>\nAccounting background preferred.\n Previous experience in operations management, profit and loss operations preferred.\n Experience in implementing leadership service initiatives preferred.<br/>\n<br/>\n*The specific statements shown in each section of this description are not intended to be all inclusive. They describe the general nature and level of work being performed and/or represent typical elements and criteria considered necessary to successfully perform the job. The Company retains the discretion to add to or change the duties of the position at any time.", "responsibilities": "The Business Operations Specialist at Pathways Management Group plays a pivotal role in collaborating with management, faculty, and staff to implement strategic initiatives. Responsibilities include executing project plans, ensuring compliance with objectives, researching best practices, drafting proposals, overseeing operational functions, and providing high-level administrative support. This role requires advanced knowledge of sales executive assistant duties, and excellent communication skills. Additionally, this role requires addressing operational challenges, improving processes, scheduling meetings, preparing reports, supporting leadership and administrative support staff.", "qualifications": {"required": "Advanced knowledge of executive assistant duties and working with high level positions within an organization (CEO, CFO, Presidents, Directors of Departments).\n Establish and maintain operating goals and objectives.\n Proficiency in personal computers and related software applications.\n Skill in analyzing and re-engineering systems, processes, and procedures.\n Strong organizational, verbal, and written communication skills.\n Working knowledge of operational areas such as administrative or fiscal management.", "preferred": "College degree, Accounting background, Previous experience in operations management, profit and loss operations, Experience in implementing leadership service initiatives"}, "skills": ["Executive Assistant", "Project Management", "Communication", "Operations Management", "Administrative Support"], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001608650"}