{"jobTitle": "Assistant Operations Manager", "company": {"name": "A.P. Moller - Maersk", "location": "Santa Fe Springs, CA"}, "location": "Santa Fe Springs, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$66,560.00 - $70,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "As a company, we promote a culture of honesty and integrity, and value the trust it allows us to build with customers and employees alike. Our focus on our people is what sets us apart and keeps our customers coming back to work with us!<br/><br/>If you are seeking to be a part of a family, this is the place for you!<br/><br/>Maersk Warehousing and Distribution USA LLC handles end-to-end warehousing and distribution logistics needs utilizing our strategic network of storage facilities. Our facilities are capable of receiving, storing, processing and dispatching cargo, so we can build flexibility and resilience into the supply chain process. Our integrated solutions allow us to be prepared for supply chain risks, so we can plan distribution to better achieve lead time and goals despite unexpected conditions. Our extensive experience, connections, and deep expertise across different sectors, industries, and transportation modes, means we can be counted on for process excellence that will save time and money.<br/><br/><strong>Summary<br/><br/></strong>Supervises and coordinates activities of workers concerned with ordering, receiving, storing, inventorying, issuing, and shipping materials, supplies, tools, equipment, and parts, in stockroom, warehouse, or yard by performing the following duties.<br/><br/><strong>Essential Duties and Responsibilities:<br/><br/></strong><ul><li>Reviews inbound appointment log and open order report each day in order to plan work activities.</li><li>Plans inbound and out bound schedules accordingly to meet customer metrics.</li><li>Determines staffing needs based on work load and schedules staff accordingly.</li><li>Assigns workers to specific duties based on work load and shipping schedules.</li><li>Reviews and updates operational procedures as necessary and ensures they are communicated to and understood by the warehouse associates.</li><li>Tracks productivity and qualifies performance by individual, function, and department.</li><li>Works with Inventory Control to ensure the highest level of inventory accuracy possible.</li><li>Manages payroll of department.</li><li>Advises employees on handling of items received, stored, and shipped; methods and use of equipment in handling, storing, maintaining, and shipping stock; and related problems.</li><li>Traces history of items to determine reasons for discrepancies between inventory and stock control records and recommends remedial actions to resolve discrepancies.</li><li>Determines work procedures, prepares work schedules, and expedites workflow.</li><li>Issues written and oral instructions.</li><li>Ensures that proper safety procedures are followed.</li><li>Maintains harmony among workers and resolves grievances.</li><li>Position is full-time and on-site.<br/><br/></li></ul><strong>Supervisory Responsibilities:<br/><br/></strong>Directly supervises 20+ employees in the area of Operations. Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws. Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems.<br/><br/><strong>Education and/or Experience: <br/><br/></strong>High school diploma or general education degree (GED); or one to three months related experience and/or training; or equivalent combination of education and experience.<br/><br/><strong>Company Benefits:<br/><br/></strong><ul><li>Medical</li><li>Dental</li><li>Vision</li><li>401k + Company Match </li><li>Employee Assistance Program</li><li>Paid Time Off</li><li>Flexible Work Schedules (when possible)</li><li>And more!<br/><br/></li></ul><strong>Pay Range:<br/><br/></strong>$$66,560 - $70K*<br/><br/><ul><li>The above stated pay range is the anticipated starting salary range for the position. The Company may adjust this range in light of prevailing market conditions and other factors such as location. The Company will work directly with the selected candidate(s) on the final starting salary in accordance with all applicable laws.<br/><br/></li></ul>Maersk is committed to a diverse and inclusive workplace, and we embrace different styles of thinking. Maersk is an equal opportunities employer and welcomes applicants without regard to race, colour, gender, sex, age, religion, creed, national origin, ancestry, citizenship, marital status, sexual orientation, physical or mental disability, medical condition, pregnancy or parental leave, veteran status, gender identity, genetic information, or any other characteristic protected by applicable law. We will consider qualified applicants with criminal histories in a manner consistent with all legal requirements.<br/><br/>We are happy to support your need for any adjustments during the application and hiring process. If you need special assistance or an accommodation to use our website, apply for a position, or to perform a job, please contact us by emailing accommodationrequests@maersk.com.", "responsibilities": "Supervises and coordinates activities of workers concerned with ordering, receiving, storing, inventorying, issuing, and shipping materials, supplies, tools, equipment, and parts, in stockroom, warehouse, or yard by performing the following duties.<br/><br/><strong>Essential Duties and Responsibilities:<br/><br/></strong><ul><li>Reviews inbound appointment log and open order report each day in order to plan work activities.</li><li>Plans inbound and out bound schedules accordingly to meet customer metrics.</li><li>Determines staffing needs based on work load and schedules staff accordingly.</li><li>Assigns workers to specific duties based on work load and shipping schedules.</li><li>Reviews and updates operational procedures as necessary and ensures they are communicated to and understood by the warehouse associates.</li><li>Tracks productivity and qualifies performance by individual, function, and department.</li><li>Works with Inventory Control to ensure the highest level of inventory accuracy possible.</li><li>Manages payroll of department.</li><li>Advises employees on handling of items received, stored, and shipped; methods and use of equipment in handling, storing, maintaining, and shipping stock; and related problems.</li><li>Traces history of items to determine reasons for discrepancies between inventory and stock control records and recommends remedial actions to resolve discrepancies.</li><li>Determines work procedures, prepares work schedules, and expedites workflow.</li><li>Issues written and oral instructions.</li><li>Ensures that proper safety procedures are followed.</li><li>Maintains harmony among workers and resolves grievances.</li><li>Position is full-time and on-site.<br/><br/></li></ul><strong>Supervisory Responsibilities:<br/><br/></strong>Directly supervises 20+ employees in the area of Operations. Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws. Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems.", "qualifications": {"required": "High school diploma or general education degree (GED); or one to three months related experience and/or training; or equivalent combination of education and experience."}, "skills": [], "postedDate": "1 week ago", "benefits": "Medical, Dental, Vision, 401k + Company Match, Employee Assistance Program, Paid Time Off, Flexible Work Schedules (when possible), And more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001799588"}