{"jobTitle": "Restaurant General Manager | Fresh, Fast Casual Concept! Positive Culture!", "company": {"name": "Superior Talent Source", "industry": "Staffing and Recruiting", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Fresh, fast-casual restaurant seeking an experienced and motivated Restaurant General Manager. As the Restaurant General Manager, you will play a vital role in supporting the restaurant's operations, delivering exceptional service, and ensuring an outstanding dining experience for our guests.<br/><br/><strong><em>What's In It For You!:<br/><br/></em></strong><ul><li> Competitive salary</li><li> Direct Deposit</li><li> 401K</li><li> Comprehensive Health benefits</li><li> Paid time off (PTO)</li><li> Excellent room for growth and advancement</li><li> Employee Discounts<br/><br/></li></ul><strong><em>Responsibilities:<br/><br/></em></strong><ul><li> Guest Experience: Provide exceptional customer service, ensuring that every guest has a positive and memorable dining experience. Respond to customer inquiries, concerns, and feedback in a professional and timely manner. </li><li> Operational Support: Overseeing daily operations, including opening and closing procedures, staff scheduling, and maintaining cleanliness and organization throughout the establishment. </li><li> Team Leadership: Support and motivate the front-of-house and back-of-house teams, including hosts/hostesses, servers, bartenders, and kitchen staff. Foster a positive work environment, promote teamwork, and provide ongoing training and development. </li><li> Staff Supervision: Assist in supervising and coordinating the activities of restaurant staff to ensure efficient workflow and adherence to quality and service standards. Provide guidance and coaching to enhance performance and address any issues or concerns. </li><li> Inventory and Ordering: Monitor inventory levels, conduct regular inventory counts, and place orders with suppliers as needed. Ensure proper storage and rotation of food and beverage items. </li><li> Quality Control: Maintain high standards of food quality, presentation, and service. Conduct regular inspections to ensure adherence to health and safety regulations, cleanliness, and compliance with established procedures. </li><li> Sales and Revenue Generation: Support initiatives to drive sales and upsell menu items. </li><li> Cash Handling and Financial Management: Assist in cash handling procedures, including reconciling sales, and preparing daily deposits. Contribute to monitoring and controlling expenses to meet financial targets. </li><li> Health and Safety Compliance: Ensure compliance with health and safety regulations, including food handling, sanitation, and workplace safety procedures. Maintain accurate and up-to-date records and documentation. <br/><br/></li></ul><strong><em>Qualifications:<br/><br/></em></strong><ul><li> Minimum of 2 years experience as a Restaurant General Manager. </li><li> Excellent customer service and interpersonal skills. </li><li> Strong organizational and multitasking abilities. </li><li> Leadership qualities with the ability to motivate and inspire a team. </li><li> Solid understanding of restaurant operations and service standards. </li><li> Proficiency in using POS systems and restaurant management software. </li><li> Basic knowledge of inventory management and cost control practices. </li><li> Ability to work in a fast-paced environment and handle pressure. </li><li> Flexibility to work evenings, weekends, and holidays as required. <br/><br/></li></ul><strong><em>If you are a detail-oriented and customer-focused professional with a passion for delivering exceptional service, we want to hear from you.<br/><br/></em></strong><strong><em>As part of our recruiting process, we may contact you regarding positions we feel are a good fit or engage with you via SMS text message. By clicking to submit your application, Superior Talent Source has your consent to communicate via SMS text message moving forward.<br/><br/></em></strong>#STS<br/><br/><strong>Company Description<br/><br/></strong>Superior Talent Source is a niche search agency specializing in executive placement nationwide with leading restaurants, hotels country clubs and resorts across the United States.<br/><br/>Our recruiters have decades of experience in recruiting for the Hospitality industry, and they have built up an excellent network of relationships as well as a deep understanding of the marketplace.<br/><br/>Our recruiter's expertise together with our approach is focused on finding the right fit for both candidate and client, whilst delivering a quality service.<br/><br/>Our success is built on investing in relationships and doing it the right way. Going beyond phone calls and e-mails, taking the time to attend conferences, being active members of professional groups and social media. Getting to know clients and candidates on a personal level and supporting and nurturing the relationships we establish.<br/><br/>Lastly, we know what it takes and how to match the right candidate to the right client.<br/><br/>Superior Talent Source is a niche search agency specializing in executive placement nationwide with leading restaurants, hotels country clubs and resorts across the United States. Our recruiters have decades of experience in recruiting for the Hospitality industry, and they have built up an excellent network of relationships as well as a deep understanding of the marketplace. Our recruiter's expertise together with our approach is focused on finding the right fit for both candidate and client, whilst delivering a quality service. Our success is built on investing in relationships and doing it the right way. Going beyond phone calls and e-mails, taking the time to attend conferences, being active members of professional groups and social media. Getting to know clients and candidates on a personal level and supporting and nurturing the relationships we establish. Lastly, we know what it takes and how to match the right candidate to the right client.", "responsibilities": "Guest Experience: Provide exceptional customer service, ensuring that every guest has a positive and memorable dining experience. Respond to customer inquiries, concerns, and feedback in a professional and timely manner. \nOperational Support: Overseeing daily operations, including opening and closing procedures, staff scheduling, and maintaining cleanliness and organization throughout the establishment. \nTeam Leadership: Support and motivate the front-of-house and back-of-house teams, including hosts/hostesses, servers, bartenders, and kitchen staff. Foster a positive work environment, promote teamwork, and provide ongoing training and development. \nStaff Supervision: Assist in supervising and coordinating the activities of restaurant staff to ensure efficient workflow and adherence to quality and service standards. Provide guidance and coaching to enhance performance and address any issues or concerns. \nInventory and Ordering: Monitor inventory levels, conduct regular inventory counts, and place orders with suppliers as needed. Ensure proper storage and rotation of food and beverage items. \nQuality Control: Maintain high standards of food quality, presentation, and service. Conduct regular inspections to ensure adherence to health and safety regulations, cleanliness, and compliance with established procedures. \nSales and Revenue Generation: Support initiatives to drive sales and upsell menu items. \nCash Handling and Financial Management: Assist in cash handling procedures, including reconciling sales, and preparing daily deposits. Contribute to monitoring and controlling expenses to meet financial targets. \nHealth and Safety Compliance: Ensure compliance with health and safety regulations, including food handling, sanitation, and workplace safety procedures. Maintain accurate and up-to-date records and documentation.", "qualifications": {"required": "Minimum of 2 years experience as a Restaurant General Manager. \nExcellent customer service and interpersonal skills. \nStrong organizational and multitasking abilities. \nLeadership qualities with the ability to motivate and inspire a team. \nSolid understanding of restaurant operations and service standards. \nProficiency in using POS systems and restaurant management software. \nBasic knowledge of inventory management and cost control practices. \nAbility to work in a fast-paced environment and handle pressure. \nFlexibility to work evenings, weekends, and holidays as required.", "preferred": ""}, "skills": ["Customer Service", "Team Leadership", "Inventory Management", "Restaurant Management", "POS Systems"], "postedDate": "1 week ago", "benefits": "Competitive salary\nDirect Deposit\n401K\nComprehensive Health benefits\nPaid time off (PTO)\nExcellent room for growth and advancement\nEmployee Discounts", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001573999"}