{"jobTitle": "Manager, OOH Media Buying", "company": {"name": "dentsu", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "51,000.00/yr - 83,375.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Advertising Services", "description": "<strong>Job Description<br/><br/></strong>The Manager, OOH Media Buying is a remote role in the LA area reporting to the Director, OOH. This position is a senior planning/buying role with responsibility to negotiate cost efficient media recommendations on behalf of the clients. You will be supported by the Associate and/or Sr. Associate media buyers, and coordinate all aspects of the planning and buying process. Our mission is to grow our talent and train them for their next step up, which is a Senior Manager, OOH. We have an awesome training and onboarding program!<br/><br/>As the Manager, OOH, your responsibilities will include:<br/><br/><ul><li>You will negotiate cost efficient schedules on behalf of the clients and coordinate all aspects of the planning and buying process</li><li>You will be responsible for campaign maintenance by creating production grids, posting instructions, trafficking, creative and putting together POP decks</li><li>You will work within our proprietary tool; enter in authorizations, contracts and mapping</li><li>You will manage all discrepancy/billing resolution and keep Managers informed of workload</li><li>You will participate and contribute in face-to-face client or vendor meetings</li><li>You will ensure key information is provided to team regarding client/vendor issues, market landscape changes, internal agency issues, changes in account status, etc. </li><li>You will provide guidance to team members to nurture/promote a strong team environment</li><li>You will remain curious on the strategic importance of OOH and how it impacts the wider media mix</li><li>You will be responsible for constructing and delivering accurate and honest post performance management documents</li><li>You will work with the team to develop strategies for media buys</li><li>You will organize ideas and information logically and sequentially</li><li>You will assist in the development of media presentations and tactical POVs</li><li>You will develop client reports that are clear and compelling</li><li>You will ensure key information is provided to team regarding client issues, internal agency issues, changes in account status, etc. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>3+ years of industry experience</li><li>You have media vendor negotiation experience</li><li>You have knowledge of standard OOH concepts and formats</li><li>You keep current with market research (industry periodicals, email newsletters, websites)</li><li>You write in a clear, compelling, and concise manner</li><li>You express yourself clearly and concisely in oral communications<br/><br/></li></ul><strong>Additional Information<br/><br/></strong>The anticipated salary range for this position is $51,000-$83,375. Actual salary will be based on a variety of factors including relevant experience, knowledge, skills and other factors permitted by law. A range of medical, dental, vision, 401(k) matching, paid time off, and/or other benefits also are available. For more information regarding dentsu benefits, please visit dentsubenefitsplus.com<br/><br/><strong>About Dentsu<br/><br/></strong>Dentsu is an integrated growth and transformation partner to the world’s leading organizations. Founded in 1901 in Tokyo, Japan, and now present in more than 110 markets, it has a proven track record of nurturing and developing innovations, combining the talents of its global network of leadership brands to develop impactful and integrated growth solutions for clients. Dentsu delivers end-to-end experience transformation (EX) by integrating its services across Media, CXM and Creative, while its business transformation (BX) mindset pushes the boundaries of transformation and sustainable growth for brands, people and society.<br/><br/>Dentsu, Innovating to Impact.<br/><br/>Find out more:<br/><br/>https://www.dentsu.com/<br/><br/>https://www.group.dentsu.com/en/<br/><br/>We are champions for meaningful progress and we strive to be a force for good—for our people, for our clients, for the industry and for our society. We keep our people at the center, creating space for growth, understanding and learning so they can thrive. We embed diversity, in our mindset, in our solutions and in our teams to empower an inclusive, equitable and culturally fluent environment. Building this culture within our teams makes us better collaborators with each other and with our clients, driving better outcomes for all.<br/><br/>Dentsu (the \"Company\") is committed to a policy of Equal Employment Opportunity and will not discriminate against an applicant or employee of the Company, on the basis of age, sex, sexual orientation, race, color, creed, religion, ethnicity, national origin, alienage or citizenship, disability, marital status, veteran or military status, genetic information, or any other legally-recognized protected basis under federal, state or local laws, regulations or ordinances. Applicants with disabilities may be entitled to reasonable accommodation under the terms of the Americans with Disabilities Act and/or certain state or local laws. A reasonable accommodation is a change in the way things are normally done that will ensure an equal employment opportunity without imposing an undue hardship on the Company. Please contact your recruiter if you need assistance completing any forms or to otherwise participate in the application process or to request or discuss an accommodation in connection with a job at the Company to which you are applying.<br/><br/>", "responsibilities": "You will negotiate cost efficient schedules on behalf of the clients and coordinate all aspects of the planning and buying process\nYou will be responsible for campaign maintenance by creating production grids, posting instructions, trafficking, creative and putting together POP decks\nYou will work within our proprietary tool; enter in authorizations, contracts and mapping\nYou will manage all discrepancy/billing resolution and keep Managers informed of workload\nYou will participate and contribute in face-to-face client or vendor meetings\nYou will ensure key information is provided to team regarding client/vendor issues, market landscape changes, internal agency issues, changes in account status, etc. \nYou will provide guidance to team members to nurture/promote a strong team environment\nYou will remain curious on the strategic importance of OOH and how it impacts the wider media mix\nYou will be responsible for constructing and delivering accurate and honest post performance management documents\nYou will work with the team to develop strategies for media buys\nYou will organize ideas and information logically and sequentially\nYou will assist in the development of media presentations and tactical POVs\nYou will develop client reports that are clear and compelling\nYou will ensure key information is provided to team regarding client issues, internal agency issues, changes in account status, etc. <br/><br/>", "qualifications": {"required": "3+ years of industry experience\nYou have media vendor negotiation experience\nYou have knowledge of standard OOH concepts and formats\nYou keep current with market research (industry periodicals, email newsletters, websites)\nYou write in a clear, compelling, and concise manner\nYou express yourself clearly and concisely in oral communications<br/><br/>"}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "A range of medical, dental, vision, 401(k) matching, paid time off, and/or other benefits also are available. For more information regarding dentsu benefits, please visit dentsubenefitsplus.com", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001770576"}