{"jobTitle": "Creator Network Growth Manager Graduate (TikTok LIVE-AMS) - 2025 Start (BS/MS)", "company": {"name": "TikTok", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "67725 - 101333", "currency": "USD"}, "jobFunction": "Administrative and Product Management", "industry": "Entertainment Providers", "description": "Responsibilities<br/><br/>TikTok is the leading destination for short-form mobile video. At TikTok, our mission is to inspire creativity and bring joy. TikTok's global headquarters are in Los Angeles and Singapore, and its offices include New York, London, Dublin, Paris, Berlin, Dubai, Jakarta, Seoul, and Tokyo. <br/><br/>Why Join Us<br/>Creation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible. <br/>Together, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day. <br/>To us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. <br/>At TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve. <br/>Join us.<br/><br/>Team Introduction <br/>The US TikTok LIVE Partnerships Operations team is dedicated to managing and enhancing the operations of TikTok's LIVE business across the US and CA markets. We collaborate closely with both Creators and Creator Network partners to achieve our mission. Our commitments include:<br/>- Delivering Interactive Experiences: Providing users with engaging and interactive live experiences on TikTok.<br/>- Supporting Creators: Assisting creators in delivering captivating live content and helping them monetize their efforts through live streaming.<br/>- Fostering Partnerships: Working with Creator Network partners to develop mutually beneficial business opportunities and partnerships.<br/>By focusing on these areas, we aim to elevate the overall live experience for users, empower creators, and build strong, sustainable partnerships within the creator community.<br/><br/>We are looking for talented individuals to join our team in 2025. As a graduate, you will get unparalleled opportunities for you to kickstart your career, pursue bold ideas and explore limitless growth opportunities. Co-create a future driven by your inspiration with TikTok.<br/><br/>Successful candidates must be able to commit to an onboarding date by end of year 2025.<br/><br/>Applications will be reviewed on a rolling basis. We encourage you to apply as early as possible.<br/><br/>Candidates can apply to a maximum of two positions and will be considered for jobs in the order you apply. The application limit is applicable to TikTok and its affiliates' jobs globally. Applications will be reviewed on a rolling basis - we encourage you to apply early.<br/><br/>Responsibilities:<br/>- Source, filter and onboard Creator Network Partners<br/>- Organize training sessions for agencies under management to improve creator under management's engagement, community, monetization, etc.<br/>- Troubleshoot LIVE challenges and community violations in real time, and problem solve on the fly.<br/>- Support partners in running large scale LIVE events on TikTok as their primary POC.<br/>- Ability to R&amp;D requirements to provide product feedback to product teams.<br/>- Generate revenue and increase customer retention by conducting optimization and performance analysis.<br/>- Develop negotiation strategies by studying the integration of new ventures within the company's strategy and operation, examining risks and potentials, estimating partners' needs and goals, and aligning with business goals <br/><br/>Qualifications<br/><br/>Minimum Qualifications:<br/>- Bachelor's degree or above<br/>- Good teamwork spirit, priority awareness, passion, and a sense of responsibility.<br/>- Good data interpretation and logic capability, explorative, and self-motivated.<br/>- Experience in content strategy operations and talent management.<br/>- Ability to perform professionally with high level brands, agencies, and creators.<br/><br/>Preferred Qualifications:<br/>- Experience in e-commerce agency or social influencer agency, will be a plus<br/>- Experience working in a partnership role within technology industry<br/>- Deep passion for TikTok, mobile entertainment, social media, and popular culture<br/>- Creative mindset and thought process that's focused on driving business parameters forward<br/>- Experience in the live streaming space and understanding of live streaming trends<br/><br/>TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.<br/><br/>TikTok is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at https://shorturl.at/cdpT2 <br/><br/>Job Information:<br/><br/>【For Pay Transparency】Compensation Description (annually) <p>The base salary range for this position in the selected city is $67725 - $101333 annually.<span>​</span></p><p>Compensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of the Total Package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses/incentives, and restricted stock units.<span>​</span></p><p>Our company benefits are designed to convey company culture and values, to create an efficient and inspiring work environment, and to support our employees to give their best in both work and life. We offer the following benefits to eligible employees: <span>​</span></p><p>We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. <span>​</span></p><p>Our time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. <span>​</span></p><p>We also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.<span>​</span></p><p>For Los Angeles County (unincorporated) Candidates:<span>​</span></p><p>Qualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state, and local laws including the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Our company believes that criminal history may have a direct, adverse and negative relationship on the following job duties, potentially resulting in the withdrawal of the conditional offer of employment:<span>​</span></p><p>1. Interacting and occasionally having unsupervised contact with internal/external clients and/or colleagues;<span>​</span></p><p>2. Appropriately handling and managing confidential information including proprietary and trade secret information and access to information technology systems; and<span>​</span></p><p>3. Exercising sound judgment.<span>​</span></p>", "responsibilities": "- Source, filter and onboard Creator Network Partners\n- Organize training sessions for agencies under management to improve creator under management's engagement, community, monetization, etc.\n- Troubleshoot LIVE challenges and community violations in real time, and problem solve on the fly.\n- Support partners in running large scale LIVE events on TikTok as their primary POC.\n- Ability to R&amp;D requirements to provide product feedback to product teams.\n- Generate revenue and increase customer retention by conducting optimization and performance analysis.\n- Develop negotiation strategies by studying the integration of new ventures within the company's strategy and operation, examining risks and potentials, estimating partners' needs and goals, and aligning with business goals ", "qualifications": {"required": "- Bachelor's degree or above\n- Good teamwork spirit, priority awareness, passion, and a sense of responsibility.\n- Good data interpretation and logic capability, explorative, and self-motivated.\n- Experience in content strategy operations and talent management.\n- Ability to perform professionally with high level brands, agencies, and creators.", "preferred": "- Experience in e-commerce agency or social influencer agency, will be a plus\n- Experience working in a partnership role within technology industry\n- Deep passion for TikTok, mobile entertainment, social media, and popular culture\n- Creative mindset and thought process that's focused on driving business parameters forward\n- Experience in the live streaming space and understanding of live streaming trends"}, "skills": [], "postedDate": "1 week ago", "benefits": "We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. \nOur time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. \nWe also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001897414"}