{"jobTitle": "Business Analyst, Starlink Growth", "company": {"name": "SpaceX", "location": "Hawthorne, CA"}, "location": "Hawthorne, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "75,000.00 - 95,000.00", "currency": "USD"}, "jobFunction": "Research, Analyst, and Information Technology", "industry": "Aviation and Aerospace Component Manufacturing", "description": "SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Today SpaceX is actively developing the technologies to make this possible, with the ultimate goal of enabling human life on Mars.<br/><br/><strong>BUSINESS ANALYST, STARLINK GROWTH<br/><br/></strong>At SpaceX, we are leveraging our experience in building rockets and spacecraft to deploy Starlink, the world’s most advanced broadband internet system. Starlink is the world’s largest satellite constellation and is providing fast, reliable internet to 3M+ users worldwide. We design, build, test, and operate all parts of the system – thousands of satellites, consumer receivers that allow users to connect within minutes of unboxing, and the software that brings it all together. We’ve only begun to scratch the surface of Starlink’s potential global impact and are looking for best-in-class engineers and analysts to rapidly accelerate our growth around the globe.<br/><br/>As a Business Analyst on the Growth Analytics &amp; Automation team, you will be responsible for developing the strategy, key metrics, and processes for assessing the health of Starlink business. You will extract valuable insights from data across all business units and the Starlink network itself. You will work closely with technical and business teams to make customer acquisition as efficient as possible. You will create robust, business-critical automation and take responsibility for metrics that drive program-level decision-making.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Define and develop department-level metrics and associated dashboards that quantify the health of our operation and influence change</li><li>Support new market launches, sales &amp; operations planning, product &amp; feature roll-outs, demand generation, and larger cross-functional strategic initiatives Conduct analyses that identify issues and opportunities impacting growth, and lead scoping, and manage implementation of changes</li><li>Collaborate effectively across many departments, including Network, Finance, Legal, Production, Supply Chain, Customer Operations to ensure data integrity and accurate reporting</li><li>Document and train internal users and leaders on dashboard and tool usage, assists in troubleshooting</li><li>Engage the SpaceX leadership team with quantitative and qualitative updates on performance and opportunities<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>Bachelor's degree in business, supply chain, management information systems, computer science, engineering, or economics discipline</li><li>Professional or internship experience within growth strategy, business operations, finance, consulting, or go-to-market planning </li><li>Experience with SQL<br/><br/></li></ul><strong>Preferred Skills &amp; Experience<br/><br/></strong><ul><li>1+ years of experience within growth strategy, business operations, finance, consulting, or go-to-market planning</li><li>Start-up, consulting, or other demonstrated experience in high-growth, fast-paced, rapidly changing environment</li><li>Experience with SQL (e.g., advanced joins and basic query optimizations) and creating and managing dashboards using data visualization tools (e.g. Tableau, Power BI, Looker)</li><li>Strong project management and self-directed prioritization skills</li><li>Exceptional ability to communicate technical concepts to non-technical audiences at all organizational levels</li><li>Ability to develop and maintain strong relationships across disciplines and with multiple levels of management</li><li>Experience in at least one analytics language (ex. Python, R)</li><li>Advanced understanding of database structures, query optimizations</li><li>Experience working in broadband internet or other consumer product industries<br/><br/></li></ul><strong>Additional Requirements<br/><br/></strong><ul><li>Must be available to work extended hours and weekends as needed</li><li>Willingness to travel to customer sites, other SpaceX locations, and events as needed<br/><br/></li></ul><strong>Pay Range<br/><br/></strong><strong>COMPENSATION AND BENEFITS: <br/><br/></strong>Business Analyst/Level 1: $75,000.00 - $95,000.00/per year<br/><br/>Your actual level and base salary will be determined on a case-by-case basis and may vary based on the following considerations: job-related knowledge and skills, education, and experience.<br/><br/>Base salary is just one part of your total rewards package at SpaceX. You may also be eligible for long-term incentives, in the form of company stock, stock options, or long-term cash awards, as well as potential discretionary bonuses and the ability to purchase additional stock at a discount through an Employee Stock Purchase Plan. You will also receive access to comprehensive medical, vision, and dental coverage, access to a 401(k) retirement plan, short and long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation and will be eligible for 10 or more paid holidays per year. Exempt employees are eligible for 5 days of sick leave per year.<br/><br/><strong>Itar Requirements<br/><br/></strong><ul><li>To conform to U.S. Government export regulations, applicant must be a (i) U.S. citizen or national, (ii) U.S. lawful, permanent resident (aka green card holder), (iii) Refugee under 8 U.S.C.</li><li>1157, or (iv) Asylee under 8 U.S.C.</li><li>1158, or be eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR here. <br/><br/></li></ul>SpaceX is an Equal Opportunity Employer; employment with SpaceX is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.<br/><br/>Applicants wishing to view a copy of SpaceX’s Affirmative Action Plan for veterans and individuals with disabilities, or applicants requiring reasonable accommodation to the application/interview process should notify the Human Resources Department at (310) 363-6000.", "responsibilities": "Define and develop department-level metrics and associated dashboards that quantify the health of our operation and influence change\nSupport new market launches, sales & operations planning, product & feature roll-outs, demand generation, and larger cross-functional strategic initiatives Conduct analyses that identify issues and opportunities impacting growth, and lead scoping, and manage implementation of changes\nCollaborate effectively across many departments, including Network, Finance, Legal, Production, Supply Chain, Customer Operations to ensure data integrity and accurate reporting\nDocument and train internal users and leaders on dashboard and tool usage, assists in troubleshooting\nEngage the SpaceX leadership team with quantitative and qualitative updates on performance and opportunities", "qualifications": {"required": "Bachelor's degree in business, supply chain, management information systems, computer science, engineering, or economics discipline\nProfessional or internship experience within growth strategy, business operations, finance, consulting, or go-to-market planning \nExperience with SQL", "preferred": "1+ years of experience within growth strategy, business operations, finance, consulting, or go-to-market planning\nStart-up, consulting, or other demonstrated experience in high-growth, fast-paced, rapidly changing environment\nExperience with SQL (e.g., advanced joins and basic query optimizations) and creating and managing dashboards using data visualization tools (e.g. Tableau, Power BI, Looker)\nStrong project management and self-directed prioritization skills\nExceptional ability to communicate technical concepts to non-technical audiences at all organizational levels\nAbility to develop and maintain strong relationships across disciplines and with multiple levels of management\nExperience in at least one analytics language (ex. Python, R)\nAdvanced understanding of database structures, query optimizations\nExperience working in broadband internet or other consumer product industries"}, "skills": ["SQL", "Tableau", "Power BI", "Looker", "Python", "R"], "postedDate": "1 week ago", "benefits": "Base salary is just one part of your total rewards package at SpaceX. You may also be eligible for long-term incentives, in the form of company stock, stock options, or long-term cash awards, as well as potential discretionary bonuses and the ability to purchase additional stock at a discount through an Employee Stock Purchase Plan. You will also receive access to comprehensive medical, vision, and dental coverage, access to a 401(k) retirement plan, short and long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation and will be eligible for 10 or more paid holidays per year. Exempt employees are eligible for 5 days of sick leave per year.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001758791"}