{"jobTitle": "Retail Merchandiser California", "company": {"name": "SPAR Group", "location": "Thousand Oaks, CA"}, "location": "Thousand Oaks, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Retail", "description": "SPAR is growing and we are expanding our Part Time Retail Merchandiser team in your area. As a SPAR Merchandiser, know that you are with the leaders in the business that provides the best support in the industry. Most of the merchandising work performed for our clients is set around a client’s window of time rather than specific hours, allowing you enjoy a flexible schedule. As a Merchandiser, you can service various products, conduct resets, product cut-ins, returns, POP placement and other general merchandising activities. We have available part-time, on-going work servicing a wide-variety of clients/retailers for weekly, bi-weekly, and monthly visits.<br/><br/>Come join the best in the merchandising business, APPLY TODAY!<br/><br/><strong>What We Offer<br/><br/></strong><ul><li>Competitive Pay</li><li>DailyPay – work today get paid tomorrow</li><li>Flexible work hours</li><li>Training and Career Advancement</li><li>Ability to increase hours if available<br/><br/><br/></li></ul><strong>What You’ll Do <br/><br/></strong><ul><li>Meet with Site or Department Manager (as applicable) to review the objectives of your service call</li><li>Locate the displays </li><li>Remove old product from displays</li><li>Complete Full Inventory/scanning</li><li>Validate the product stocking, merchandising and display systems using planograms. </li><li>Maintain quality results by following and enforcing standards. </li><li>Possibly Traveling from store to store, managing setup, display of Merchandise, or current promotions.</li><li>Complete call form and upload photos taken <br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Merchandising and/or retail experience</li><li>Available weekday daytime hours</li><li>Able to understand plan-o-grams</li><li>Able to carry and lift up to 40 lbs. repeatedly</li><li>Able to bend, stoop and stand for extended periods</li><li>Internet access with an active email address</li><li>Android or iOS smart phone and/or tablet for wireless reporting</li><li>Report client work completions on the same day as service</li><li>Reliable transportation, some travel involved<br/><br/><br/></li></ul>SPAR has more than 50 years of experience in retail and consumer goods serving some of the world’s best companies. We offer end-to-end services to make sure our client’s product is available and presented in the most compelling way. We focus on our client’s return on investment (ROI) by applying our unique software solutions, experienced resources and a passion for results.<br/><br/>SPAR provides Equal Employment Opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, SPAR complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. SPAR expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status. Improper interference with the ability of SPAR’s employees to perform their job duties may result in discipline up to and including discharge.", "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001975461"}