{"jobTitle": "Supply Chain Coordinator", "company": {"name": "Rare Beauty", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Supply Chain", "industry": "Personal Care Product Manufacturing", "description": "<strong><u>COMPANY OVERVIEW</u></strong>\n<p>Rare Beauty, based in El Segundo, aims to break down unrealistic standards of perfection. Here at Rare Beauty, we place purpose and social impact at the heart of everything we do—from the products we make to the community we create. We empower our team and our community to challenge beauty norms by shaping positive conversations about self-acceptance and mental health. We promote self-acceptance and give people the tools they need to feel less alone in the world. Our mission is to help everyone celebrate their individuality by redefining what beautiful means. We take pride in offering best-in-class benefits, with medical monthly premiums covered by the Company at 100%, employee certification in mental health first aid at work, regular wellness activities, a quarterly makeup stipend, and much more!</p>\n<p><br/></p>\n<strong><u>POSITION SUMMARY</u></strong>\n<p>The Rare Beauty, Supply Chain Coordinator is responsible for the data accuracy across Rare Beauty and its partners systems. The person in this role owns the creation and maintenance of product with correct information, and is responsible for BOM management, Inventory Accuracy and special product setup. They will also be responsible for resolving system and product issues as they arise. </p>\n<p><br/></p>\n<strong><u>RESPONSIBILITIES</u></strong>\n<ul><li>Create and maintain Supply Chain and Retailer related master data </li><li>Key resource for the business for master data support for Rare Beauty </li><li>Ensure data accuracy, perform, and report on periodic audits and data integrity checks </li><li>Perform master data transaction processing responsibilities in a timely and accurate manner, in accordance with defined operating procedures </li><li>Support Department in developing, set-up, and training for product processing through the system</li><li>Analyze the ERP system master data related issues to understand root cause</li><li>Work with Supply Chain and Finance data owners to fix data issues</li><li>Self-motivated and proactive to ensure that Master Data issues cause minimum impact to end user communities</li><li>Perform Weekly/ Monthly Inventory reconciliations as required, to ensure system accuracy</li><li>Support Logistics Manager to ensure system data accurately reflects supply flow of materials </li><li>Additional responsibilities as assigned/required</li></ul>\n<p><br/></p>\n<strong><u>REQUIREMENTS</u></strong>\n<ul><li>Bachelor’s degree or better in supply chain, economics</li><li>Strong analytical skills</li><li>Strong communication and presentation skills</li><li>Ability to work with agility and adjust to constantly evolvingenvironment</li><li>Microsoft Office - advanced skills </li><li>Netsuite Experience preferred</li><li>Exceptional organization skills and ability to put order into files, procedures, processes, etc.</li><li>Excellent spoken &amp; written communication skills</li><li>Strong problem solving &amp; numeracy skills</li><li>Excellent attention to detail and extreme accuracy skills</li><li>Ability to take a proactive attitude and work under pressure to tight deadlines</li><li>Ability to leverage technology and improve processes to drive better outcomes</li></ul>\n<p><br/></p>\n<strong><u>PHYSICAL DEMANDS</u></strong>\n<ul><li>Prolonged periods sitting at a desk and working on a computer.</li></ul>", "responsibilities": "Create and maintain Supply Chain and Retailer related master data Key resource for the business for master data support for Rare Beauty Ensure data accuracy, perform, and report on periodic audits and data integrity checks Perform master data transaction processing responsibilities in a timely and accurate manner, in accordance with defined operating procedures Support Department in developing, set-up, and training for product processing through the system Analyze the ERP system master data related issues to understand root cause Work with Supply Chain and Finance data owners to fix data issues Self-motivated and proactive to ensure that Master Data issues cause minimum impact to end user communities Perform Weekly/ Monthly Inventory reconciliations as required, to ensure system accuracy Support Logistics Manager to ensure system data accurately reflects supply flow of materials Additional responsibilities as assigned/required", "qualifications": {"required": "Bachelor’s degree or better in supply chain, economics Strong analytical skills Strong communication and presentation skills Ability to work with agility and adjust to constantly evolvingenvironment Microsoft Office - advanced skills Exceptional organization skills and ability to put order into files, procedures, processes, etc. Excellent spoken & written communication skills Strong problem solving & numeracy skills Excellent attention to detail and extreme accuracy skills Ability to take a proactive attitude and work under pressure to tight deadlines Ability to leverage technology and improve processes to drive better outcomes", "preferred": "Netsuite Experience preferred"}, "skills": ["Supply Chain", "Data Analysis", "Communication", "Presentation Skills", "Microsoft Office", "Netsuite"], "postedDate": "6 days ago", "benefits": "medical monthly premiums covered by the Company at 100%, employee certification in mental health first aid at work, regular wellness activities, a quarterly makeup stipend", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001223623"}