{"jobTitle": "Regional Product Manager (Hybrid - El Segundo, CA)", "company": {"name": "Belkin", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Product Management and Marketing", "industry": "Computers and Electronics Manufacturing", "description": "Job Description<br/><br/>Job Summary (General Responsibilities): <br/><br/>The Regional Product Manager is responsible for management of the designated product lines, including the specific product mix, product families, pricing, and promotional strategy. They will also be responsible for increasing sales, market share, and profitability through channel sell through initiatives and marketing activities. The Regional Product Manager must drive new product introductions, including sell-in, part setup, execution of POS and merchandising materials, and SKU management. The Regional Product Manager serves as the subject matter expert for designated product lines and category. He/she is tasked with developing analysis and presentation materials for all major customer meetings. They are responsible for setting both tactical and strategic priorities for the product line within designated region. This role will have frequent interaction with both internal and external parties, including major customers and cross functional leads across several departments, which will require excellent communication, presentation, and collaboration skills.<br/><br/>Specific Responsibilities Include<br/><br/><ul><li>Own the regional P&amp;L for designated product line and/or product categories</li><li>Deep understanding of the product category, including technical specifications, market conditions, and consumer behavior</li><li>Develop business models and analysis to drive market share growth in key channels while meeting corporate profit objectives</li><li>Daily collaboration with Sales, Global Product Management, Marketing, and Demand Planning to deliver on product pricing, product positioning, product placement, and product sell through</li><li>Effectively prepare and execute New Product Introductions (NPI)</li><li>Provide regional insights into the Global go-to-market process</li><li>Track and monitor market conditions, including competitive pricing movements and assortment portfolio</li><li>Support the sales organization to deliver best-in-class field execution, helping them to clearly explain our vision for the product line to retail and commercial partners</li><li>Develop innovative, thoughtful online and in-store messaging, promotions, and activities to drive mind share and sell through</li><li>Provide sustainable, reliable inventory management guidance to meet and exceed inventory and asset management goals</li><li>Lead the Product Life Cycle Management aspect of product line for designated region, including defining new SKU definition, activation, and end-of-life<br/><br/></li></ul>Required Skills<br/><br/><ul><li>Technically savvy with a high level of interest and awareness in consumer electronics, mobile ecosystem, and wireless networking</li><li>Proven capability to deliver share acquisition and exceed revenue targets while maintaining expected profitability</li><li>An energetic individual who has demonstrated an ability to energize others as around difficult goals and objectives</li><li>A visionary who has created and articulated strategies for their business that have resulted in significant business improvements</li><li>Decision-making experiences demonstrate appropriate balance between thoughtful channel initiatives and the need for timeliness</li><li>High energy, charismatic individual with a passion for winning<br/><br/></li></ul>Education And Experience Requirements<br/><br/><ul><li>Four-year college degree in Business Administration, Marketing, Engineering or relevant field.</li><li>5+ years of related work experience within the consumer electronics industry or similar field</li><li>Domestic and international travel may be required<br/><br/></li></ul>What You’re Getting Into<br/><br/>We’ve got big collaborative spaces for your big ideas, so bring an open mind and leave your suit in the closet. We all are committed to creating unique and rewarding consumer experiences. Everyone is interested in succeeding – for the team, for themselves and for the business. Cross-functionally and across the company, everyone has common goals and aspires to be their best.<br/><br/>You will learn something new or at least look at things differently every day. There are so many smart and creative people around that you’ll be motivated to pursue the ideal.<br/><br/>Team spirit is infectious. Belkin is an extremely open workplace, where communication is essential. Not every idea will be accepted, but you’ll be asked for your point of view. Innovation thrives on multiple and varied levels. At Belkin we challenge conventional wisdom and refuse to accept that something cannot be done.<br/><br/>We are committed to diversity. Belkin is an Equal Opportunity and Affirmative Action Employer M/F/D/V. We maintain a drug-free workplace.<br/><br/>All candidates applying for a job in the EMEA region, please review the Applicant Privacy notice HERE<br/><br/>Location:<br/><br/>El Segundo, California<br/><br/>Range For This Position<br/><br/>$80,000 - $110,000<br/><br/>Factors such as geographic location, academic credentials, relevant experience, and specific knowledge, skills and abilities will influence the actual salary offered. In addition to a competitive market-based salary, compensation also includes a performance-based bonus, and in addition to a full range of medical, financial, and/or other benefits. Further details can be found here.", "postedDate": "6 days ago", "salary": {"amount": "$80,000 - $110,000", "currency": "USD"}, "skills": ["Consumer Electronics", "Mobile Ecosystem", "Wireless Networking", "Business Administration", "Marketing", "Engineering", "Sales", "Product Management", "Demand Planning", "New Product Introductions", "Market Research", "Competitive Analysis", "Inventory Management", "Product Life Cycle Management", "Communication", "Presentation", "Collaboration"], "url": "https://www.linkedin.com/jobs/view/4001960309"}