{"jobTitle": "Data Analyst", "company": {"name": "Meta", "location": "Menlo Park, CA"}, "location": "Menlo Park, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "124,000.00/yr - 176,000.00/yr", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Technology, Information and Internet", "description": "The Creative Audio Data Analyst will be responsible for designing, building, and measuring CA data dashboards to assist Creative Audio Leadership in driving strategy, performance and impact through key data insights.<br/><br/>Data Analyst Responsibilities:<br/><br/><ul><li>Work as part of a project team to coordinate database development and determine project scope and limitations.</li><li>Design, build, and launch reliable data pipelines to move data across different platforms</li><li>Build dynamic dashboards to measure our impact and provide ongoing insight to support leadership in making effective, analytically driven, strategic decisions</li><li>Explore and recommend emerging technologies and data sources to support/enhance data solutions</li><li>Collaborate with creative + business leads, engineers, product managers, and data scientists to understand data needs, representing key data insights in a meaningful way</li><li>Influence product and cross-functional teams to identify data opportunities to drive impact</li><li>Use broad range of technical and soft skills to build productive relationships with our partners</li><li>Automate reporting via SQL and python based ETL framework</li><li>Upkeep and maintain data quality and integrity and accuracy of data solutions<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>Experience with data querying languages (e.g. SQL)</li><li>Experience with open source languages such as Python, Java, PHP, or JavaScript Frameworks</li><li>Experience with data visualization tools such as Tableau</li><li>Experience with REST APIs, Authentication, and Authorization</li><li>Proven experience effectively collaborating across a variety of technical and non-technical functions to drive towards common objectives</li><li>Demonstrated communication skills</li><li>Effective organizational skills and experience working independently</li><li>Experience multitasking and prioritizing in a fluid, fast-paced environment</li><li>Demonstrated computer skills (Including MS Outlook, Google Workspace, Word, Excel, Dropbox, Cortex, Tableau, Python)</li><li>Experience communicating and working well with artists and creatives, and to thrive in a team environment.<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Music knowledge a plus<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$124,000/year to $176,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "The Creative Audio Data Analyst will be responsible for designing, building, and measuring CA data dashboards to assist Creative Audio Leadership in driving strategy, performance and impact through key data insights.", "qualifications": {"required": "Experience with data querying languages (e.g. SQL), Experience with open source languages such as Python, Java, PHP, or JavaScript Frameworks, Experience with data visualization tools such as Tableau, Experience with REST APIs, Authentication, and Authorization, Proven experience effectively collaborating across a variety of technical and non-technical functions to drive towards common objectives, Demonstrated communication skills, Effective organizational skills and experience working independently, Experience multitasking and prioritizing in a fluid, fast-paced environment, Demonstrated computer skills (Including MS Outlook, Google Workspace, Word, Excel, Dropbox, Cortex, Tableau, Python), Experience communicating and working well with artists and creatives, and to thrive in a team environment.", "preferred": "Music knowledge a plus"}, "skills": ["SQL", "Python", "Tableau", "REST APIs", "Authentication", "Authorization", "Communication", "Organization", "Multitasking", "Prioritization", "MS Outlook", "Google Workspace", "Word", "Excel", "Dropbox", "Cortex"], "postedDate": "6 days ago", "benefits": "$124,000/year to $176,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4001547165"}