{"jobTitle": "Visual Designer, Amazon Go", "company": {"name": "Amazon", "location": "Seattle, WA"}, "location": "Seattle, WA", "jobType": "Full-time", "employmentType": "Full-time", "description": "Amazon Go is seeking a passionate, customer-obsessed Visual Designer to join our Amazon Go Creative Studio team. We are looking for someone with retail brand experience (preferably food and beverage), strong systems thinking, and a fluid understanding of design across multiple brand and marketing channels; from the in-store experience and across, multiple out-of-store marketing channels.\n\nYou are motivated to develop the best solution for every design challenge regardless of scope. You readily dive deep to understand the objectives of your business partners and the mind-set of the end customer. You think spatially, understanding how a brand is consistently expressed and maintained in physical and digital environments. You have experience working on seasonal campaigns and in-store product launches. You are an excellent presenter who thinks through each presentation strategically and with a sense of story-telling. You thrive with ambiguity, bringing order and clarity if your ability to synthesize design solutions while factoring in the implications of growing &amp; scaling a brand.\n\nIf you are full of initiative, regularly pushing your comfort zone, if you love to collaborate with a team of talented creatives, if you have a proven track record of bringing great ideas to life: we are looking for you.\n\nAbout The Team\n\nThe Amazon Go Creative Studio sets and upholds brand standards across all customer touchpoints. We create strategy and content for advertising campaigns, engagement programs, and in-store experiences. We collaborate closely with marketing, store design, category leaders, and business stakeholders with the primary objective of creating bar-raising design solutions that deliver results, express our core brand attributes, build our brand, and delight our customers.\n\nBasic Qualifications\n\n<ul><li> 3+ years of design experience</li><li> Portfolio demonstrating understanding and development of brand guidelines</li><li> Portfolio demonstrating seasonal and/or brand campaigns that scale across multiple channels and touch points</li><li> Strong grasp of the creative process; from ideation through implementation</li><li> Strong understanding of typography, design principles, color, trends and best practices across digital and print</li><li> Understanding of production best practices for print and digital mediums</li><li> Familiarity with brand strategy and working from briefs</li><li> Exceptional attention to detail with relentlessly high-quality standards.</li><li> Ability to share ideas and receive feedback from business partners and stakeholders through presentations and writing.</li><li> Experience presenting work to senior creative leadership and customers</li><li> Bachelor's degree in Design or equivalent professional experience</li><li> Proficiency in InDesign, Photoshop, Illustrator, After Effects and Figma<br/><br/></li></ul>Preferred Qualifications\n\n<ul><li> Experience with motion design and video editing is a bonus</li><li> Experience with retail brand development, including identity development and in-store campaigns</li><li> Motion graphics experience</li><li> A passion for food, and experience designing for food brands.<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $108,400/year in our lowest geographic market up to $185,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/>Company - Amazon.com Services LLC<br/><br/>Job ID: A2674284", "jobFunction": "Art/Creative and Design", "industry": "Software Development", "salary": {"amount": "108,400.00/year - 185,000.00/year", "currency": "USD"}, "skills": ["InDesign", "Photoshop", "Illustrator", "After Effects", "Figma"], "postedDate": "1 week ago", "url": "https://www.linkedin.com/jobs/view/4001828360"}