{"jobTitle": "Nursing Manager of Care Coordination", "company": {"name": "Clinical Management Consultants", "industry": "Human Resources Services", "size": "150+ employees", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "Competitive", "currency": "USD"}, "jobFunction": "Health Care Provider and Management", "industry": "Human Resources Services", "description": "A new and exciting opportunity for a Manager of Care Coordination has just become available at a 150+ bed, highly awarded hospital in Southern California! Come join a leading healthcare organization committed to providing exceptional patient care and fostering a collaborative and supportive work environment. This Joint Commissioned, Magnet Accredited medical center has been serving the residents of Southern California for the last 70 years. You will be joining not only a dynamic team, but a widely recognized Hospital to strengthen your skills. The Manager of Care Coordination will play a key role in overseeing and enhancing the case management and social services program, lead a team of skilled professionals, implement effective case management strategies and work in collaboration with various healthcare professionals to ensure quality patient care. The Manager will report to a tenured Vice President of Case Management and work in collaboration to identify areas of improvement for the unit. As the Manager, it will be expected to provide strategic direction and leadership to the case management team while fostering a positive and collaborative work environment. Responsibilities will also include developing and implementing quality assurance measures to ensure compliance with regulatory standards and the monitoring and analysis of data to identify opportunities for improvement in patient care processes. Due to the Hospitals Magnet status, a candidate with extensive Hospital Case Management Leadership experience with their MSN and an active California license will surely make for a quick interview. The Manager of Care Coordination will not only be working with a dynamic team of professionals in a state of the art facility, but the ability to take in all of the natural wonders Southern California has to offer. This location experiences beauty at every angle. There is plenty to do to enjoy the temperate climate including nearby parks, hikes and scenic landscapes. The choices of delicious restaurants, cafes and shopping are endless. This area has it all and more. This Hospital is offering a competitive salary and benefits package, including healthcare coverage, retirement plans, and professional development opportunities. Don’t hesitate, apply today!", "responsibilities": "Overseeing and enhancing the case management and social services program, leading a team of skilled professionals, implementing effective case management strategies, collaborating with various healthcare professionals to ensure quality patient care, providing strategic direction and leadership to the case management team, developing and implementing quality assurance measures, monitoring and analyzing data to identify opportunities for improvement in patient care processes.", "qualifications": {"required": "MSN and an active California license", "preferred": "Extensive Hospital Case Management Leadership experience."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Healthcare coverage, retirement plans, and professional development opportunities.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001853310"}