{"jobTitle": "Senior Global Business Development Manager", "company": {"name": "Randstad USA", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$110,000.00/yr - $130,000.00/yr", "currency": "USD"}, "jobFunction": "Sales", "industry": "Freight and Package Transportation", "description": "We are actively looking for an aggressive self-starter who is a strong relationship builder, and, who understands the value of building long-lasting business relationships. This role will have Direct Sales and Account Management responsibilities. The Senior Global Business Development Manager role will be based in Los Angeles and will focus on the High Tech and Luxury Goods Sectors. Experience selling global forwarding solutions including international air, ocean, and customs house brokerage is required for this role.  RESPONSIBILITIES:  Manage and grow a significant portfolio of existing business Identify potential customers nationwide requiring white glove/critical logistics solutions Leverage company resources to create custom solutions that deliver value to new prospects Understand the customer's buying process and identify all influences Provide timely and accurate revenue and profitability forecasts Drive revenue in target accounts   QUALIFICATIONS Bachelor's Degree preferred coupled with strong problem solving and analytical skills related to global forwarding and logistics Ten years of experience in global freight forwarding sales. Experience selling Critical Logistics solutions would be a plus. Excellent Sales Presentation skills and the ability to development strong relationships at all levels or an organiztion Strong team collaboration skills Strong interpersonal skills, excellent verbal, written, and presentation skills and the ability to deliver a compelling value proposition Excellent compensation including generous base, uncapped commission, Medical/Dental/Vision inusrance. 401K with company match. Paid vacation, National Holidays, and more!!", "responsibilities": "Manage and grow a significant portfolio of existing business Identify potential customers nationwide requiring white glove/critical logistics solutions Leverage company resources to create custom solutions that deliver value to new prospects Understand the customer's buying process and identify all influences Provide timely and accurate revenue and profitability forecasts Drive revenue in target accounts ", "qualifications": {"required": "Ten years of experience in global freight forwarding sales. Experience selling Critical Logistics solutions would be a plus. Excellent Sales Presentation skills and the ability to development strong relationships at all levels or an organiztion Strong team collaboration skills Strong interpersonal skills, excellent verbal, written, and presentation skills and the ability to deliver a compelling value proposition", "preferred": "Bachelor's Degree preferred coupled with strong problem solving and analytical skills related to global forwarding and logistics"}, "skills": ["Sales", "Business Development", "Account Management", "Relationship Building", "Global Forwarding", "Logistics", "International Air", "Ocean", "Customs House Brokerage", "Sales Presentation", "Team Collaboration", "Interpersonal Skills", "Verbal Communication", "Written Communication", "Presentation Skills"], "postedDate": "6 days ago", "benefits": "Excellent compensation including generous base, uncapped commission, Medical/Dental/Vision inusrance. 401K with company match. Paid vacation, National Holidays, and more!!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001284392"}