{"jobTitle": "Vice President of Human Resources and Strategic Workforce Development", "company": {"name": "Get It Recruit - Executive", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Human Resources", "industry": "Staffing and Recruiting", "description": "Why Join Us?**<br/><br/></li></ul>At our organization, we prioritize excellence and growth within a supportive community. We are looking for a strategic leader who is also a hands-on professional dedicated to executing HR initiatives that align with our mission to empower our employees, ensure quality delivery, and enhance productivity. Our values shape every aspect of our work, driving our commitment to high performance.<br/><br/>**About the Opportunity**<br/><br/>This role is instrumental in shaping and executing our human capital strategy in response to the evolving needs of our industry. You will be actively involved in all HR functions, from strategy formulation to implementation, while leading a dedicated HR team. Reporting to the Chief Administrative Officer and being part of the senior leadership team, your responsibilities will encompass various critical areas including talent acquisition, performance management, compensation, employee relations, and compliance.<br/><br/>**Key Responsibilities**<br/><br/><ul><li> Oversee HR operations with direct involvement in talent management and operational efficiency.</li><li> Serve as a strategic and operational advisor to senior management on HR-related matters.</li><li> Manage recruitment processes and implement talent management strategies, including succession planning and career development.</li><li> Develop and oversee compensation and benefits programs designed to attract and retain top talent.</li><li> Ensure adherence to all applicable employment laws, with a focus on the local market.</li><li> Administer benefits and retirement plans, ensuring effective cost management.</li><li> Leverage HR technology and analytics to enhance process efficiency and support data-driven decision-making.<br/><br/></li></ul>**Qualifications**<br/><br/><ul><li> Bachelor's degree in Human Resources or a related field.</li><li> At least 10 years of HR leadership experience with a hands-on approach to managing HR functions.</li><li> Proven track record in strategic HR management, preferably within the financial services sector.</li><li> Strong understanding of HR laws, regulations, and best practices.</li><li> Excellent interpersonal, communication, and leadership skills.</li><li> Preferred HR certifications include SHRM-SCP, SPHR, or similar.<br/><br/></li></ul>**Join Us and Make an Impact**<br/><br/>This is a unique opportunity to lead and influence a workplace that values collaboration, innovation, and work-life balance. If you are eager to shape the HR landscape and propel our mission forward, we invite you to connect with us today!<br/><br/>Employment Type: Full-Time", "postedDate": "6 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4001962442"}