{"jobTitle": "Associate Manager, Sales Strategy & Operations", "company": {"name": "DoorDash", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "About The Team<br/><br/>Our sales and partner management teams are the heart and soul of DoorDash, helping us partner with top merchants (think restaurants, grocers, convenience stores, retailers) across the country to grow their revenue and help them operate even better. As DoorDash grows both in scale and scope of offering, the strength of our sales engine and organizational structure must grow with it.<br/><br/>We are looking for an Associate Manager level in Sales Strategy and Operations to accomplish strategic plans that enhance sales productivity by helping our teams be more impactful in targeting and closing the most valuable partnerships at scale. You'll work between our sales, partner management, operations, product, and analytics teams to build the merchant foundation<br/><br/>About The Role<br/><br/>Within this job posting, we’re hiring for roles on the following team(s):<br/><br/>Pre-Sales<br/><br/><ul><li>The US Pre-Sales S&amp;O team enables DoorDash to scale its core business and execute a go-to-market strategy to acquire every merchant that customers want.</li><ul><li>About the Role</li><ul><li>We are looking for a Sales Strategy &amp; Operations Associate Manager to evolve and scale our GTM strategy US Pre-Sales. This will include developing go-to-market playbooks, revenue optimization, strategic plans to enhance productivity, process redesign, product roadmap and launches, resource allocation and pipeline analytics. You will sit at the center of our revenue generation engine - this will require prioritization and data-driven insights to ensure our teams are working against the right goals and have the tools needed to achieve them.<br/></li></ul></ul></ul>You’re Excited About This Opportunity Because You Will…<br/><br/><ul><li>Build – develop and drive the future of US Pre-Sales Restaurant Acquisition</li><li>Experiment – scope tests and experiments on everything from adoption to optimization</li><li>Implement – drive tactical day to day operations and implement efficient improvements to optimize business impact</li><li>Influence – work with our Merchant, Product, Engineering, Operations and Sales teams to scale business impact<br/><br/></li></ul>Vendor<br/><br/><ul><li>We are looking for a Sales Strategy Associate Manager to build and execute the Vendor strategy for our Global Sales organization. You will work closely with global external partners (Vendor partners) and internal stakeholders (Sales, Sales S&amp;O, Finance, and more!). You will report into the Senior Manager of Revenue Strategy and Operations in our Merchant organization. </li><ul><li>The GTM Vendor S&amp;O team enables DoorDash in scaling our core businesses and testing our big bets by 1) establishing a Vendor network that can i) meet DoorDash’s GTM needs and ii) expand DoorDash’s GTM reach and capabilities, 2) owning and/or enabling GTM Vendor programs in meeting goals, and 3) identifying and implementing optimization efficiency improvements<br/></li></ul></ul>We’re Excited About You Because…<br/><br/><ul><li>You have 5+ years of experience in consulting, strategy, business development, operations, technology, banking, analytics or related experience with a track record of leading initiatives and hitting goals</li><li>You have strong cross functional business experience, project management, and communication skills</li><li>You are comfortable solving ambiguous problems and working with large data sets within Excel / Google sheets</li><li>You have experience managing external B2B Partnerships</li><li>You are willing to roll up their sleeves and flex up or down as needed - “humble doer”<br/><br/></li></ul>Applications for this position are accepted on an ongoing basis<br/><br/>We use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on June 20, 2024.<br/><br/>Please see the independent bias audit report covering our use of Covey here.<br/><br/>Compensation<br/><br/>The successful candidate's starting pay will fall within the pay range listed below and is determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions. Base salary is localized according to an employee’s work location. Ranges are market-dependent and may be modified in the future.<br/><br/>In addition to base salary, the compensation for this role includes opportunities for equity grants. Talk to your recruiter for more information.<br/><br/>DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.<br/><br/>To learn more about our benefits, visit our careers page here.<br/><br/>The base pay for this position ranges from our lowest geographical market up to our highest geographical market within California, Colorado, District of Columbia, Hawaii, New Jersey, New York and Washington.<br/><br/>$93,800—$138,000 USD<br/><br/>About DoorDash<br/><br/>At DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users—from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods.<br/><br/>DoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees’ happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.<br/><br/>Our Commitment to Diversity and Inclusion<br/><br/>We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.<br/><br/>Statement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on “protected categories,” we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce – people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.<br/><br/>If you need any accommodations, please inform your recruiting contact upon initial connection.", "responsibilities": "Build – develop and drive the future of US Pre-Sales Restaurant Acquisition\nExperiment – scope tests and experiments on everything from adoption to optimization\nImplement – drive tactical day to day operations and implement efficient improvements to optimize business impact\nInfluence – work with our Merchant, Product, Engineering, Operations and Sales teams to scale business impact", "qualifications": {"required": "You have 5+ years of experience in consulting, strategy, business development, operations, technology, banking, analytics or related experience with a track record of leading initiatives and hitting goals\nYou have strong cross functional business experience, project management, and communication skills\nYou are comfortable solving ambiguous problems and working with large data sets within Excel / Google sheets\nYou have experience managing external B2B Partnerships\nYou are willing to roll up their sleeves and flex up or down as needed - “humble doer”", "preferred": ""}, "skills": ["Sales", "Business Development", "Operations", "Technology", "Banking", "Analytics", "Project Management", "Communication", "Excel", "Google Sheets", "B2B Partnerships"], "postedDate": "6 days ago", "benefits": "DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.", "remoteWork": "No", "salary": {"amount": "93,800—$138,000", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4001926336"}