{"jobTitle": "Enterprise Data Governance Analyst", "company": {"name": "EDI Staffing, an EDI Specialists Company", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Information Technology", "industry": "Retail and Retail Health and Personal Care Products", "description": "<u><strong>This is an onsite role located in City of Industry, CA.<br/></strong></u>This is a high-impact, high-visibility role responsible for ensuring all master data is accurate, complete, and consistent across the enterprise. The EDG Analyst will drive the development of policies and procedures in concert with our process owners and governance teams. The team will conduct audits, perform analysis, and recommend and implement improvements. The EDG Analyst will support new product development projects and perform ongoing guidance throughout the master data lifecycle.<br/><br/><strong>Education &amp; Experience</strong><ul><li>BS degree in Computer Science such as Information Technology, Information Systems, or similar</li><li>5+ years' experience in data governance or applicable area of expertise</li><li>Effective collaborator with BI team, extended IT team, and cross-functional data domain stakeholders</li><li>Ability to influence others and champion Data Governance best practices.</li><li>Excellent oral and written communication skills.</li><li>Driven and confident self-starter who can take the initiative.</li><li>Matrix management skills with the ability to work with all levels of management.</li><li>Foster a team-oriented environment</li></ul><strong> Knowledge, Skills, &amp; Abilities</strong><ul><li>Strong project management leadership, and ability to prioritize projects.</li><li>Ability to translate business requirements into technical requirements.</li><li>Experience with ERP, CRM, and/or core systems master data management.</li><li>Item UOM conversions and attribute data experience required.</li><li>UPC, GS1 data loads, and relevant industry knowledge.</li><li>Process mapping and analysis.</li><li>Familiarity with SQL, ETL, SSIS, SSRS, business intelligence, databases, BI reporting tools, and processes).</li><li>Basic data analytics skills: data cleansing strategies, data mining, conversions, and delivery.</li><li>Ability to access, navigate, export, and wrangle data for simple analysis &amp; review (Excel, Power BI, reporting portals).</li></ul>", "postedDate": "1 month ago", "skills": ["Data Governance", "SQL", "ETL", "SSIS", "SSRS", "Business Intelligence", "Databases", "BI Reporting Tools", "Data Analytics", "Excel", "Power BI", "Project Management", "ERP", "CRM", "UPC", "GS1", "Process Mapping", "Analysis"], "url": "https://www.linkedin.com/jobs/view/4001749722"}