{"jobTitle": "Department Manager", "company": {"name": "REI", "industry": "Retail", "size": "Not specified", "location": "Marina del Rey, CA"}, "location": "Marina del Rey, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$30.67 - $38.36", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "REI Co-op is united around discovering, building and celebrating better ways of working in this world, all so that folks can find and pursue a love of the outdoors. When you work for the co-op, you do your best work with the support to live your best life. And you play a part in shaping the future of the outdoors, for people and our planet.", "responsibilities": "Plans, identifies, communicates, and delegates responsibilities to team. Handle training, coaching, recognition, and performance management. Direct the execution of our core standards and overall visual direction. Drive sales through all channels by maximizing selling behaviors. Make business adaptations to increase sales and service. Communicate key company strategies and changes to teams as needed. Recruits and develops diverse talent from within and outside the organization. Inspire a customer-centric culture by recognizing and rewarding team. Develop top performers and evaluate performance, give coaching and appropriate level of feedback. Builds teams through effective employee development, involvement, and communication.", "qualifications": {"required": "3+ years of successful retail management experience (preferred)", "preferred": "Enjoys communicating and building relationships, both inside and outside the organization. Open to feedback and other viewpoints in the spirit of supporting the business. Uses business understanding, innovative thinking, and sound judgment to solve problems. Makes solid recommendations by combining information from various sources. Produces quality work by setting effective goals and establishing priorities. Organizes and uses resources to meet deadlines, keeps others in the loop about plans and progress. Engages and influences others to accomplish worthwhile organizational goals."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "REI offers all regular employees a generous employee discount, access to health benefits, a retirement savings plan and accrued time off.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4001771480"}