{"jobTitle": "Manufacturing Admin Assistant", "company": {"name": "Ultimate Staffing", "location": "Brea, CA"}, "location": "Brea, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "24.00/hr - 25.00/hr", "currency": "USD"}, "jobFunction": "Manufacturing", "industry": "Manufacturing", "description": "<strong>Position: Program Manager Assistant / Manufacturing Admin </strong><ul><li>Location: Brea</li><li>Schedule: Monday - Friday (6:00am - 2:30pm)</li><li>Pay Rate: $24-$25/hr</li><li>Temp to Hire</li></ul><p><strong>Responsibilities of the Program Manager Assistant:<br/></strong></p><ul><li>Data Entry: Performs data entry using Microsoft Office tools. Performs Sales Order entry, RMA, Quote Proposals in the MRP system and Quoting software.</li><li>Resource Coordination: Manages resources and tracks task assignments through Asana (task workflow system).</li><li>Administrative Support: Assists the Program Managers with scheduling meetings, preparing agendas, and coordinating logistics. Handles correspondence and maintains program-related documentation.</li><li>Meeting Coordination: Attends production and customer backlog meetings, takes accurate meeting minutes, and distributes minutes to relevant parties. Tracks action items and follows up on outstanding tasks.</li><li>Project Tracking: Monitors program progress and performance metrics. Updates and maintains project plans, schedules, and reports.</li><li>Communication: Serves as a point of contact between the Program Managers and stakeholders. Facilitates effective communication and ensure timely dissemination of information. This also includes regular communication with customers and provides overall program status.</li><li>Documentation Management: Organizes and maintain program documentation, including reports, presentations, and records. Ensures all documents are up-to-date and accessible.</li></ul><p><br/><strong>Qualifications of the Program Manager Assistant:</strong></p><ul><li>Bachelor's degree in business administration or a related field and career experience.</li><li>At least two years of related experience required. Experience in Electronics Manufacturing Industry is preferred.</li><li>Excellent organizational skills and attention to detail.</li><li>Excellent time management skills with a proven ability to meet deadlines.</li><li>Strong analytical and problem-solving skills.</li><li>Ability to function well in a high-paced and at times stressful environment.</li><li>Proficient with Microsoft Office Suite or related software.</li></ul><p><strong>Benefits of the Job:</strong></p><ul><li>Competitive medical, dental, and vision benefits.</li><li>Health Savings Account/Flexible Spending Account</li><li>401K and company matching with no vesting period</li><li>PTO</li><li>Gym reimbursement (through Anthem)</li><li>Employee Assistance Program</li><li>A safe and inclusive work environment with team and management support</li><li>Employee training and development</li><li>Community service and philanthropic initiatives</li><li>Employee appreciation and events</li><li>Career advancement opportunities</li></ul><p> <br/></p><p><em><span class=\"TextRun SCXW202920741 BCX0\"><span class=\"NormalTextRun SCXW202920741 BCX0\">All qualified applicants will receive consideration for employment without regard to race, color, national origin, age, ancestry, religion, sex, sexual orientation, gender identity, gender expression, marital status, disability, medical condition, genetic information, pregnancy, or military or veteran status. We consider all qualified applicants, including those with criminal histories, in a manner consistent with state and local laws, including the California Fair Chance Act, City of Los Angeles' Fair Chance Initiative for Hiring Ordinance, and Los Angeles County Fair Chance Ordinance. To the extent our customers </span><span class=\"NormalTextRun SCXW202920741 BCX0\">require</span><span class=\"NormalTextRun SCXW202920741 BCX0\"> a background check for certain positions, the Company faces a significant risk to its business operations and business reputation unless a review of criminal history is conducted for those specific job positions.</span></span></em></p>", "responsibilities": "Performs data entry using Microsoft Office tools. Performs Sales Order entry, RMA, Quote Proposals in the MRP system and Quoting software. Manages resources and tracks task assignments through Asana (task workflow system). Assists the Program Managers with scheduling meetings, preparing agendas, and coordinating logistics. Handles correspondence and maintains program-related documentation. Attends production and customer backlog meetings, takes accurate meeting minutes, and distributes minutes to relevant parties. Tracks action items and follows up on outstanding tasks. Monitors program progress and performance metrics. Updates and maintains project plans, schedules, and reports. Serves as a point of contact between the Program Managers and stakeholders. Facilitates effective communication and ensure timely dissemination of information. This also includes regular communication with customers and provides overall program status. Organizes and maintain program documentation, including reports, presentations, and records. Ensures all documents are up-to-date and accessible.", "qualifications": {"required": "Bachelor's degree in business administration or a related field and career experience. At least two years of related experience required. Experience in Electronics Manufacturing Industry is preferred. Excellent organizational skills and attention to detail. Excellent time management skills with a proven ability to meet deadlines. Strong analytical and problem-solving skills. Ability to function well in a high-paced and at times stressful environment. Proficient with Microsoft Office Suite or related software.", "preferred": ""}, "skills": ["Microsoft Office", "Data Entry", "Sales Order Entry", "RMA", "Quote Proposals", "MRP System", "Quoting Software", "Resource Coordination", "Asana", "Administrative Support", "Meeting Coordination", "Project Tracking", "Communication", "Documentation Management"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Competitive medical, dental, and vision benefits. Health Savings Account/Flexible Spending Account 401K and company matching with no vesting period PTO Gym reimbursement (through Anthem) Employee Assistance Program A safe and inclusive work environment with team and management support Employee training and development Community service and philanthropic initiatives Employee appreciation and events Career advancement opportunities", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001918867"}