{"jobTitle": "Media Planning Coordinator", "company": {"name": "Meta", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "35.58/yr - $113,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "Role Description: We are hiring a US Media Planning Coordinator to join the Global Media Team, part of Meta’s Marketing organization. The team is responsible for delivery of media planning and execution stewardship for all consumer-facing campaigns across the Meta portfolio which includes but is not limited to; targeting approaches, measurement approaches, partner/program selection, campaign setup and follow through, optimization, reporting/campaign results, financial oversight. This role will be responsible for delivery of US media plans across the Meta portfolio. They will partner with the US media planning team and XFNs to oversee and steward all aspects of plan coordination and execution.<br/><br/>Media Planning Coordinator Responsibilities:<br/><br/><ul><li>Create and oversee the day-to-day stewardship of Meta’s media campaigns and supporting elements such as flowcharts, budget summaries, plan summaries, status reports, pacing reports, and digital performance reports.</li><li>Prepare media campaign reporting working closely with media agency and internal teams to communicate key metrics, goal attainment and opportunity identification.</li><li>Manage the delivery of authorizations to buy, purchase orders, creative specs and assets, campaign artifacts and all relevant campaign documentation in preparation for campaign launch</li><li>Participating in the campaign QA process with media agency to ensure accurate campaign implementation, pacing and performance</li><li>Oversee US media portfolio budget working closely with Strategy, Planning, Operations, Finance and SP&amp;O teams.</li><li>Maintain and organize campaign-specific materials in team’s shared document repository<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>3+ years of media agency or client side media planning experience</li><li>Understanding of traditional and interactive media planning channels</li><li>Experience in planning and executing multi-channel media campaigns and working in data-driven environments</li><li>Resourceful, curious, and motivated individual that can work independently as well as in a team setting</li><li>Proven analytics, organizational, communication and presentation skills</li><li>Proven multitasking skill with a keen attention to detail</li><li>Knowledge and understanding of the trends impacting media, measurement and analytics</li><li>Proficiency in Google Suite, Lumina/Guideline or other media planning software, Microsoft Office Suite<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$35.58/hour to $113,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "Create and oversee the day-to-day stewardship of Meta’s media campaigns and supporting elements such as flowcharts, budget summaries, plan summaries, status reports, pacing reports, and digital performance reports.\nPrepare media campaign reporting working closely with media agency and internal teams to communicate key metrics, goal attainment and opportunity identification.\nManage the delivery of authorizations to buy, purchase orders, creative specs and assets, campaign artifacts and all relevant campaign documentation in preparation for campaign launch\nParticipating in the campaign QA process with media agency to ensure accurate campaign implementation, pacing and performance\nOversee US media portfolio budget working closely with Strategy, Planning, Operations, Finance and SP&amp;O teams.\nMaintain and organize campaign-specific materials in team’s shared document repository", "qualifications": {"required": "3+ years of media agency or client side media planning experience\nUnderstanding of traditional and interactive media planning channels\nExperience in planning and executing multi-channel media campaigns and working in data-driven environments\nResourceful, curious, and motivated individual that can work independently as well as in a team setting\nProven analytics, organizational, communication and presentation skills\nProven multitasking skill with a keen attention to detail\nKnowledge and understanding of the trends impacting media, measurement and analytics\nProficiency in Google Suite, Lumina/Guideline or other media planning software, Microsoft Office Suite"}, "skills": ["Media Planning", "Campaign Management", "Media Buying", "Media Optimization", "Media Analytics", "Google Suite", "Lumina", "Guideline", "Microsoft Office Suite"], "postedDate": "1 week ago", "benefits": "$35.58/hour to $113,000/year + bonus + equity + benefits\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4001290259"}