{"jobTitle": "Strategic Sourcing Professional 4 - Procurement & Contracting - FT - Day", "company": {"name": "UCI Health", "industry": "Hospitals and Health Care", "location": "Fullerton, CA"}, "location": "Fullerton, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing and Supply Chain", "industry": "Hospitals and Health Care", "description": "<strong>Who We Are<br/><br/></strong><strong>UCI Health</strong> is the clinical enterprise of the University of California, Irvine, and the only academic health system based in Orange County. UCI Health is comprised of its main campus, UCI Medical Center, a 459-bed, acute care hospital in in Orange, Calif., four hospitals and affiliated physicians of the UCI Health Community Network in Orange and Los Angeles counties and ambulatory care centers across the region. Listed among America’s Best Hospitals by U.S. News &amp; World Report for 23 consecutive years, UCI Medical Center provides tertiary and quaternary care and is home to Orange County’s only National Cancer Institute-designated comprehensive cancer center, high-risk perinatal/neonatal program and American College of Surgeons-verified Level I adult and Level II pediatric trauma center, gold level 1 geriatric emergency department and regional burn center. UCI Health serves a region of nearly 4 million people in Orange County, western Riverside County and southeast Los Angeles County.<br/><br/>To learn more about UCI Health, visit www.ucihealth.org.<br/><br/><strong>Your Role on the Team<br/><br/></strong><strong>Position Summary<br/><br/></strong>Incumbent is responsible for using expert contract administration skills and soliciting quotations and requests for proposals for highly specialized and complex transactions. Develops strategies that result in best-in-class strategic sourcing practices and supplier relationships. Identifies projects to apply sourcing and purchasing / procurement methodology to leverage annual purchase volume and rationalize supplier base to ensure benefits / savings to University. Partners with internal clients and stakeholders to identify sourcing needs; conduct buyer / market profiles; share marketplace trends; develop sourcing strategies; share best practices and define acceptable service levels.<br/><br/><strong>Total Compensation<br/><br/></strong><strong>What It Takes to be Successful<br/><br/></strong>We offer a wealth of benefits to make working at UCI even more rewarding. These benefits may include medical insurance, sick and vacation time, retirement savings plans, and access to a number of discounts and perks. Please utilize the links listed here to learn more about our compensation practices and benefits.<br/><br/><strong>Required Qualifications<br/><br/></strong><ul><li>Thorough knowledge of strategic sourcing policies, practices and systems.</li><li>Strong ability to independently gather, organize, and perform analytical or sourcing assignments.</li><li>Advanced knowledge of Word, Excel, Project, PowerPoint, and other tools in the Microsoft Office<br/><br/></li></ul><strong>Conditions Of Employment<br/><br/></strong>The University of California, Irvine (UCI) seeks to provide a safe and healthy environment for the entire UCI community. As part of this commitment, all applicants who accept an offer of employment must comply with the following conditions of employment:<br/><br/><ul><li>Background Check and Live Scan</li><li>Legal Right to Work in the United States</li><li>Vaccination Policies</li><li>Smoking and Tobacco Policy</li><li>Drug Free Environment<br/><br/></li></ul>The following additional conditions may apply, some of which are dependent upon business unit or job specific requirements.<br/><br/><ul><li>California Child Abuse and Neglect Reporting Act</li><li>E-Verify</li><li>Pre-Placement Health Evaluation<br/><br/></li></ul>Details of each policy may be reviewed by visiting the following page: https://hr.uci.edu/new-hire/conditions-of-employment.php<br/><br/><strong>Closing Statement<br/><br/></strong>The University of California, Irvine is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, protected veteran status, or other protected categories covered by the UC nondiscrimination policy.<br/><br/>We are committed to attracting and retaining a diverse workforce along with honoring unique experiences, perspectives, and identities. Together, our community strives to create and maintain working and learning environments that are inclusive, equitable, and welcoming.<br/><br/>UCI provides reasonable accommodations for applicants with disabilities upon request. For more information, please contact UCI's Employee Experience Center (EEC) at eec@uci.edu or at (949) 824-0500, Monday - Friday from 8:30 a.m. - 5:00 p.m.<br/><br/><strong>Consideration for Work Authorization Sponsorship<br/><br/></strong>Must be able to provide proof of work authorization", "responsibilities": "Incumbent is responsible for using expert contract administration skills and soliciting quotations and requests for proposals for highly specialized and complex transactions. Develops strategies that result in best-in-class strategic sourcing practices and supplier relationships. Identifies projects to apply sourcing and purchasing / procurement methodology to leverage annual purchase volume and rationalize supplier base to ensure benefits / savings to University. Partners with internal clients and stakeholders to identify sourcing needs; conduct buyer / market profiles; share marketplace trends; develop sourcing strategies; share best practices and define acceptable service levels.", "qualifications": {"required": "Thorough knowledge of strategic sourcing policies, practices and systems. Strong ability to independently gather, organize, and perform analytical or sourcing assignments. Advanced knowledge of Word, Excel, Project, PowerPoint, and other tools in the Microsoft Office"}, "skills": ["Strategic Sourcing", "Contract Administration", "Supplier Relationship Management", "Procurement", "Purchasing", "Microsoft Office", "Analytical Skills"], "postedDate": "1 week ago", "url": "https://www.linkedin.com/jobs/view/4001793095"}