{"jobTitle": "Showroom Sales Consultant", "company": {"name": "Ferguson", "industry": "Wholesale Building Materials, Design Services, and Retail", "size": "36,000 associates across 1,700 locations", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$16.00/hr - $20.00/hr", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Wholesale Building Materials, Design Services, and Retail", "description": "Since 1953, Ferguson has been a source of quality supplies for a variety of industries. Together We Build Better infrastructure, better homes and better businesses. We exist to make our customers’ complex projects simple, successful, and sustainable. We proactively solve problems, adapt and grow to continuously serve our customers, communities and each other. Ferguson is proud to provide best-in-class products, service and capabilities across the following industries: Commercial/Mechanical, Facilities Supply, Fire and Fabrication, HVAC, Industrial, Residential Trade, Residential Building and Remodel, Waterworks and Residential Digital Commerce. Ferguson has approximately 36,000 associates across 1,700 locations. Ferguson is a community of proud associates who operate with the shared purpose of building something meaningful. You will build a career that you are proud of, at a company you can believe in.\n\nFerguson is currently seeking the right individual to fill an immediate need for a Showroom Sales Consultant.\n\nSchedule between M – F 9 am – 5 pm Saturday 10 am – 5 pm\n\nPay Rate Range: $16 - $20 an hour based on experience.\n\nThis is a commission-eligible role. The estimated total compensation range is $80,000 - $125,000 annually.", "responsibilities": "Work with customers, including builders, designers, and homeowners, to sell a wide range of products, which may include lighting, appliances, high end fixtures and cabinetry. Respond to inquiries with accurate pricing, inventory and delivery information. Greet guests upon arriving in our retail showroom, learn their motivation for their visit and developing a lasting customer relationship. Prepare job quotations and submittals. Assist customers, both by appointment and walk-ins, while utilizing suggestive sales techniques and handling complaints timely and accurately. Continually improve sales skills and product knowledge to promote a professional image in the field.", "qualifications": {"required": "Prior sales experience in plumbing fixtures, lighting, and/or cabinetry preferred. Problem solving, leadership, listening and interpersonal skills. Organizational and time management skills. The ability to deal with a vast array of customers with varying levels of product knowledge. Understand the basics of design and interior decorating. Able to engage in a consultative sales approach to recommend solutions for the varying needs of the customer.", "preferred": ""}, "skills": ["Sales", "Customer Service", "Problem Solving", "Interpersonal Skills", "Organizational Skills"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Health, dental, vision, paid time off, life insurance, 401(k) with a company match, mental health coverage, gender affirming and family building benefits, paid parental leave, associate discounts, community involvement opportunities.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001823985"}