{"jobTitle": "Administrative Supervisor - Oncology, Beverly Hills", "company": {"name": "UCLA Health", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management and Information Technology", "industry": "Hospitals and Health Care", "description": "<strong>Qualifications<br/><br/></strong><strong>Required:<br/><br/></strong><ul><li>Skill in analyzing information, problems, situations and procedure to define objectives, identify patterns and formulate conclusions</li><li>Demonstrate ability to interact diplomatically and sympathetically with a patient population in varying degrees of health</li><li>Ability to make independent judgments and to evaluate complex issues</li><li>Administrative abilities to resolve complex issues to implement long-range plans</li><li>Skill in working independently and following through on assignments with minimal direction</li><li>Skill in setting priorities when there are deadline pressures, competing requirements, and a heavy workload</li><li>Skill in writing grammatically correct letters, reports, memos and minutes.</li><li>Skill in editing and proofreading correspondence for correct grammar, spelling and punctuation.</li><li>Ability to speak to individuals using appropriate grammar and vocabulary to obtain information, explain policies and procedures</li><li>Knowledge of/ability to learn contact persons for information on appropriate patient-related and office-related issues</li><li>Working knowledge of medical oncology terminology</li><li>Skill in performing duties changing from one duty/task to another of a different nature</li><li>Skill in performing duties with frequent interruptions and/or distractions</li><li>Ability to work cooperatively with other staff members, faculty, patients, nursing staff and others<br/><br/></li></ul><strong>Preferred<br/><br/></strong><ul><li>Ability to speak persuasively to individuals and to a large and small group</li><li>Skill in the use of personal computers and computer software. Working knowledge of Microsoft Word, Excel, and Outlook as well as CareConnect</li><li>Team building skills to include prior supervisory experience</li><li>Previous supervisory experience</li></ul>", "postedDate": "1 week ago", "skills": ["Microsoft Word", "Excel", "Outlook", "CareConnect"], "url": "https://www.linkedin.com/jobs/view/4001725589"}