{"jobTitle": "HR Coordinator", "company": {"name": "Maverick Payments", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Internet Publishing", "description": "Exciting Opportunities at Maverick Payments!<br/><br/>Join our fast-paced, growing company and further your career with Maverick Payments, where you can thrive, your ideas are valued, and your colleagues feel more like family than coworkers!<br/><br/>About Us:<br/><br/>Maverick Payments is a family-owned and privately held full-service payment provider. Located in Calabasas, California, Maverick has created innovative technology designed for sales organizations, such as ISO’s and ISV’s, looking to monetize payments by reselling our white-labeled payments stack. Our payment products include merchant acquiring services, a proprietary gateway, ACH processing, fraud &amp; chargeback tools, analytics, and other value-add services. Maverick’s team includes underwriting, risk management, compliance &amp; legal, technology &amp; product development, on-boarding, customer support, information technology, and more.<br/><br/>About the Position:<br/><br/>The Human Resources Coordinator is responsible in supporting the HR department by performing administrative tasks, including employee files, benefits, and recognition programs.<br/><br/><ul><li>Responsible for all administrative tasks, including scanning, emails, and documenting</li><li>Organize, maintain, and update employee information in the HRIS system</li><li>Maintain employee files and records in electronic and paper form as required</li><li>Understands the HRIS system of Paylocity, developing workflows within the system</li><li>Familiar with Leave of Absences such as, FMLA, CFRA, PFL etc... As well as tracking LOA in Paylocity system</li><li>Answer employee inquiriesrelated to PTO &amp; Sick benefits, as well as general matters</li><li>Assists with benefits administration, open enrollment, and benefit information needs</li><li>Maintains confidentiality of HR information and records</li><li>Be familiar with current HR company policy's, state &amp; federal regulations, trends, and practices to ensure compliance, especially CA</li><li>Assist employees by answering questions regarding policies, procedures and other matters as needed</li><li>Support HR leadership in educating employees on and enforcing company policies</li><li>Helping management track employee training and support as needed</li><li>Foster positive employee relations and work to solve any employee issues that surface</li><li>Support any HR special projects, including the safety committee</li><li>Assist in preparing or prepares correspondence as requested</li><li>Supports Talent Acquisition with new hire tasks such as background checks and orientation</li><li>Support HR in arranging travel and accommodation for out-of-town employees</li><li>Performs other related duties as assigned<br/><br/></li></ul>Qualifications<br/><br/><ul><li>BA Degree or SHRM (Society for Human Resource Management) or PHR Certification is preferred, PLUS</li><li>2-3 years related experience and/or training; or equivalent combination of education and experience</li><li>Experience providing Human Resources related administrative and operational support to an organization</li><li>Experience and knowledge supporting bothHuman Resources and Recruitment functions highly desired</li><li>Proficient in Microsoft Office365 Suite and computer applications</li><li>Knowledge of Human Resource Information systems (HRIS) specifically Paylocity</li><li>Attention to detail and organizational skills</li><li>Effective at managing time and multiple tasks concurrently</li><li>Ability to maintain confidential information with discretion</li><li>Ability to report onsite daily in Calabasas<br/><br/></li></ul>What We Offer:<br/><br/><ul><li>Competitive Salary, Bonuses and Incentives</li><li>Comprehensive employer sponsored health, vision, and dental insurance programs</li><li>Paid time off, Paid Sick and Paid Holidays</li><li>401K plan with up to a 3% matching contribution</li><li>Commitment to Career Development and Advancement</li><li>Employee Recognition Programs</li><li>Vibrant Office Culture, Team Building, Birthdays, Work Anniversaries, Snacks, and more!<br/><br/></li></ul>Pay Range: $70K-80K<br/><br/>Maverick Payments is an Equal Opportunity Employer.<br/><br/>Pay Transparency Notice: At Maverick Payments, we believe in openness, honesty, and empowering our candidates to make informed career choices. As part of our commitment to transparency, we disclose the salary range for our positions. These ranges reflect our dedication to fair compensation practices and recognize the value that each team member brings to our organization. The final salary offer will be based on factors such as your experience, skills, and qualifications.<br/><br/>Non-Solicitation from Third Parties: Do not contact Maverick Payments about this position unless you are a job seeker and potential applicant for this position. Do not contact Maverick Payments about other services, products or commercial interests.<br/><br/>Notice to Agency and Search Firm Representatives: Maverick Payments is not accepting unsolicited resumes from agencies and/or search firms for this or other job postings. Resumes submitted to any Maverick Payments employee by a third-party agency and/or search firm without a valid written and signed search agreement, will become the sole property of Maverick Payments. No fee will be paid if a candidate is hired for this position as a result of an unsolicited agency or search firm referral.<br/><br/>Fair Chance Ordinance: Maverick will consider qualified applicants with criminal histories in a consistent manner with the Los Angeles Fair Chance Initiative for Hiring.<br/><br/>Powered by JazzHR<br/><br/>rGViqzXBNw", "responsibilities": "<ul><li>Responsible for all administrative tasks, including scanning, emails, and documenting</li><li>Organize, maintain, and update employee information in the HRIS system</li><li>Maintain employee files and records in electronic and paper form as required</li><li>Understands the HRIS system of Paylocity, developing workflows within the system</li><li>Familiar with Leave of Absences such as, FMLA, CFRA, PFL etc... As well as tracking LOA in Paylocity system</li><li>Answer employee inquiriesrelated to PTO &amp; Sick benefits, as well as general matters</li><li>Assists with benefits administration, open enrollment, and benefit information needs</li><li>Maintains confidentiality of HR information and records</li><li>Be familiar with current HR company policy's, state &amp; federal regulations, trends, and practices to ensure compliance, especially CA</li><li>Assist employees by answering questions regarding policies, procedures and other matters as needed</li><li>Support HR leadership in educating employees on and enforcing company policies</li><li>Helping management track employee training and support as needed</li><li>Foster positive employee relations and work to solve any employee issues that surface</li><li>Support any HR special projects, including the safety committee</li><li>Assist in preparing or prepares correspondence as requested</li><li>Supports Talent Acquisition with new hire tasks such as background checks and orientation</li><li>Support HR in arranging travel and accommodation for out-of-town employees</li><li>Performs other related duties as assigned<br/><br/></li></ul>", "qualifications": {"required": "2-3 years related experience and/or training; or equivalent combination of education and experience\nExperience providing Human Resources related administrative and operational support to an organization\nExperience and knowledge supporting bothHuman Resources and Recruitment functions highly desired\nProficient in Microsoft Office365 Suite and computer applications\nKnowledge of Human Resource Information systems (HRIS) specifically Paylocity\nAttention to detail and organizational skills\nEffective at managing time and multiple tasks concurrently\nAbility to maintain confidential information with discretion\nAbility to report onsite daily in Calabasas<br/><br/>", "preferred": "BA Degree or SHRM (Society for Human Resource Management) or PHR Certification is preferred, PLUS"}, "skills": ["HRIS", "Paylocity", "Microsoft Office 365", "Benefits Administration", "Employee Relations", "HR Policies", "Talent Acquisition", "Onboarding", "Compliance", "Administrative Support"], "postedDate": "1 week ago", "benefits": "<ul><li>Competitive Salary, Bonuses and Incentives</li><li>Comprehensive employer sponsored health, vision, and dental insurance programs</li><li>Paid time off, Paid Sick and Paid Holidays</li><li>401K plan with up to a 3% matching contribution</li><li>Commitment to Career Development and Advancement</li><li>Employee Recognition Programs</li><li>Vibrant Office Culture, Team Building, Birthdays, Work Anniversaries, Snacks, and more!<br/><br/></li></ul>", "remoteWork": "No", "salary": {"amount": "70K-80K", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4001839560"}