{"jobTitle": "Post-Production Coordinator", "company": {"name": "Impact Theory", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "68,000 to 78,000", "currency": "USD"}, "jobFunction": "Production", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "About Impact Theory<br/><br/>Impact Theory is a mission-driven modern media company designed to create positive change in people's lives through the creation of entertaining and empowering content. Designed as an integrated studio, Impact Theory develops and produces video games, webcomics, film &amp; TV, as well as world-class YouTube and podcast content that has garnered half a billion+ views on YouTube alone. Regardless of type, Impact Theory's content underscores the company's mission to ensure the global spread of a growth mindset through ideas and entertainment.<br/><br/>About The Post Production Coordinator Role<br/><br/>Reporting to the Production Manager, you as the Post-Production Coordinator will be responsible for bringing all video assets to completion by delivering content to various platforms on time, and ensuring the assets are error-free. As the central point in the post-production workflow, you'll be responsible for fielding post requests with other departments and communicating timelines, including ads.<br/><br/>You'll work in collaboration with Producers, the Marketing department, and Project Leads to execute the overall post strategy for each piece of content. Organize and update the back catalog of the content backup system so editors/producers can locate old footage quickly and efficiently.<br/><br/>Your Responsibilities<br/><br/><ul><li>Oversee the daily needs of the post-production function </li><li>Quality Control (QC); schedule to YouTube, and Release Checking every new episode </li><li>Strategic YouTube and Podcast Ad Placement to maximize revenue and optimize listener experience </li><li>YouTube and Podcast admin and backlog initiatives</li><li>Oversee all YouTube-related activity, including but not limited to posting, comment sentiment, monetization flags, and error resolution</li><li>Assist with shoots on set and Instagram (IG) Live shoots as needed</li><li>Oversee and assist the Media Manager to ensure footage is following proper ingesting and backup protocols</li><li>Communicate any field, footage, or project updates to the Producing and Post teams</li><li>Organize Deliverables and delivery of episode masters</li><li>Help troubleshoot/investigate recurring tech issues with the help of our Post-Tech team</li><li>Work with the Production Manager to oversee the final finishing of episodes and additional content; screen and give QC notes during the finishing stage</li><li>Coordinate Podcast Script reviews and recording sessions</li><li>Additional Production and Post-Production duties and responsibilities as assigned</li><li>The compensation range for this position is $68,000 to $78,000 annually, depending on experience<br/><br/><br/></li></ul>Requirements<br/><br/><ul><li>2+ years experience in a Post Coordinator or Assistant Editor role within a studio or agency environment</li><li>Prior experience at a major YouTube or Podcast channel is strongly preferred</li><li>Must be proficient in Premiere Pro, and preferable knowledge in Final Cut X</li><li>Technical knowledge and application of video editing skills </li><li>Experience with Monday.com, Google Suite, Frame.io, and similar organizational platforms</li><li>Overall understanding and knowledge of studio production. </li><li>Ability to work in a fast-paced, team-oriented environment and can manage multiple tasks simultaneously. </li><li>Skilled in researching new ways to improve Post-Production overall workflow and backup systems - You stay up to date on emerging trends</li><li>Ability to work at our office/studio, Monday through Friday, in West Hollywood, CA<br/><br/><br/></li></ul>Benefits<br/><br/><ul><li>Medical/Dental/Vision Insurance Plans</li><li>Life Insurance</li><li>401k</li><li>Flexible, \"Unlimited\" PTO Policy</li><li>1-year subscription to Audible</li><li>Full employee access to Impact Theory University</li><li>2 Complimentary Books (Radical Confidence by Lisa Bilyeu and Principles by Ray Dalio)<br/><br/><br/></li></ul>FRAUD/SCAM NOTICE<br/><br/>Please note that Impact Theory interview requests and job offers only originate from an @impacttheory.com email address. We have a robust interview process that includes phone, video Google Meets calls, and in-person interviews prior to any person receiving an offer of employment. Impact Theory will never ask for bank account information (including routing or account numbers), social security numbers, passwords or any other sensitive information to be delivered over email or phone. Always reference our career site, Impact Theory Careers, to see if the position that you are applying to is legitimate. If you receive a scam issue or a security issue involving Impact Theory, please notify us at hr@impacttheory.com.<br/><br/>EQUAL EMPLOYMENT OPPORTUNITY &amp; FAIR CHANCE HIRING<br/><br/>Impact Theory is an Equal Opportunity employer. We celebrate and embrace diversity, and believe the strongest teams are from a broad tapestry of backgrounds, perspectives, and skills. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected veteran status, or any other characteristics protected by applicable federal, state, or local law. We will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance.", "responsibilities": "Oversee the daily needs of the post-production function \nQuality Control (QC); schedule to YouTube, and Release Checking every new episode \nStrategic YouTube and Podcast Ad Placement to maximize revenue and optimize listener experience \nYouTube and Podcast admin and backlog initiatives\nOversee all YouTube-related activity, including but not limited to posting, comment sentiment, monetization flags, and error resolution\nAssist with shoots on set and Instagram (IG) Live shoots as needed\nOversee and assist the Media Manager to ensure footage is following proper ingesting and backup protocols\nCommunicate any field, footage, or project updates to the Producing and Post teams\nOrganize Deliverables and delivery of episode masters\nHelp troubleshoot/investigate recurring tech issues with the help of our Post-Tech team\nWork with the Production Manager to oversee the final finishing of episodes and additional content; screen and give QC notes during the finishing stage\nCoordinate Podcast Script reviews and recording sessions\nAdditional Production and Post-Production duties and responsibilities as assigned", "qualifications": {"required": "2+ years experience in a Post Coordinator or Assistant Editor role within a studio or agency environment\nPrior experience at a major YouTube or Podcast channel is strongly preferred\nMust be proficient in Premiere Pro, and preferable knowledge in Final Cut X\nTechnical knowledge and application of video editing skills \nExperience with Monday.com, Google Suite, Frame.io, and similar organizational platforms\nOverall understanding and knowledge of studio production. \nAbility to work in a fast-paced, team-oriented environment and can manage multiple tasks simultaneously. \nSkilled in researching new ways to improve Post-Production overall workflow and backup systems - You stay up to date on emerging trends\nAbility to work at our office/studio, Monday through Friday, in West Hollywood, CA", "preferred": ""}, "skills": ["Premiere Pro", "Final Cut X", "Monday.com", "Google Suite", "Frame.io"], "postedDate": "1 month ago", "benefits": "Medical/Dental/Vision Insurance Plans\nLife Insurance\n401k\nFlexible, \"Unlimited\" PTO Policy\n1-year subscription to Audible\nFull employee access to Impact Theory University\n2 Complimentary Books (Radical Confidence by Lisa Bilyeu and Principles by Ray Dalio)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001747526"}