{"jobTitle": "New Business Account Executive", "company": {"name": "Google", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "85,500.00/yr - 125,000.00/yr", "currency": "USD"}, "jobFunction": "Sales, General Business, and Customer Service", "industry": "Information Services and Technology, Information and Internet", "description": "<strong>Minimum qualifications:<br/><br/></strong><ul><li>Bachelor's degree or equivalent practical experience.</li><li>2 years of experience in full life-cycle sales.</li><li>Experience in developing relationships with new customers and serving as a consultant.</li><li>Experience in sales development.<br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>Experience in building a book of business, ensuring the management and fulfillment of strategic goals, and developing associated agreements.</li><li>Experience in educating new advertisers on the benefits of transitioning from traditional media to digital marketing strategies.</li><li>Experience in exceeding quota attainment.</li><li>Knowledge of the online advertising industry.</li><li>Ability to work in an ambiguous team environment.</li><li>Excellent written and verbal communication skills, with the ability to provide comprehensive advertising solutions to prospective clients.<br/><br/></li></ul><strong>About The Job<br/><br/></strong>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.<br/><br/>Google’s New Business Sales team is a group of professionals whose focus is on engaging and obtaining advertisers, and subsequently persuading them to incorporate Google's range of marketing products (e.g., YouTube, Google Ads, and the Google Display Network) into their current Marketing strategies. This global and dedicated team is the engine behind Google’s continued growth.<br/><br/>Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow. Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.<br/><br/>The US base salary range for this full-time position is $85,500-$125,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Manage the business pipeline and develop a strategy for long-term sustained success.</li><li>Secure new Google Ads clients by presenting marketing solutions, and create relevant ad campaigns that maximize their returns.</li><li>Develop business strategies that optimize the market potential.</li><li>Understand customer needs and requirements.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Manage the business pipeline and develop a strategy for long-term sustained success.</li><li>Secure new Google Ads clients by presenting marketing solutions, and create relevant ad campaigns that maximize their returns.</li><li>Develop business strategies that optimize the market potential.</li><li>Understand customer needs and requirements.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience.\n2 years of experience in full life-cycle sales.\nExperience in developing relationships with new customers and serving as a consultant.\nExperience in sales development.", "preferred": "Experience in building a book of business, ensuring the management and fulfillment of strategic goals, and developing associated agreements.\nExperience in educating new advertisers on the benefits of transitioning from traditional media to digital marketing strategies.\nExperience in exceeding quota attainment.\nKnowledge of the online advertising industry.\nAbility to work in an ambiguous team environment.\nExcellent written and verbal communication skills, with the ability to provide comprehensive advertising solutions to prospective clients."}, "skills": [], "postedDate": "3 days ago", "applicationDeadline": "", "benefits": "bonus + equity + benefits", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4001679172"}