{"jobTitle": "Bilingual Plant Manager", "company": {"name": "Mission Foods", "location": "Commerce, CA"}, "location": "Commerce, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "$150,000.00/yr - $165,000.00/yr", "currency": "USD"}, "jobFunction": "Manufacturing, Production, and Product Management", "industry": "Food Production, Industrial Machinery Manufacturing, and Manufacturing", "description": "Mission Foods is looking for a talented Plant Manager to run its location in Commerce, California. The Plant Manager manages and directs the Production, Maintenance and Production Administration functions of the plant. He/she ensures that operations are conducted within the guidelines established by GMP’s, producing products which meet or exceed customer and company quality expectations in a safe environment and that costs, efficiencies and volume targets are maintained at or better than budgeted or standard levels.", "responsibilities": "Directs the coordination of all manufacturing departments’ functions to ensure compliance with Company objectives, Quality Systems, and Customer Satisfaction. Assists in establishing quality specifications and ensure specifications are met by plant employees. Promotes plant safety through education of employees, directing safety committee, creation of safety programs and incentive. Services sales at 100% service goal. Establishes, maintains, and strives to improve productivity standards. Prepares annual manufacturing budget. Analyzes costs of plant improvements Actively participates in preparing the plant’s strategic operating plan. Serves as communication conduit between upper management and plant. Executes projects as directed by Vice-President of Manufacturing. Ensures compliance with regulatory agencies. Provides suggestions to improve process, procedures, and department in support of company goals. Verifies GMP’s and Safety standards. Ensures compliance with the HACCP program and AIB gold standard. Performs other duties as assigned.", "qualifications": {"required": "10 years of increasing responsibility in a high-speed food/beverage manufacturing or packaging environment with a high number of SKUs. With a minimum of 5 years of experience in a plant management role or equivalent management position. With a minimum of 5 years of experience in a managerial capacity in a manufacturing environment required. *Any equivalent combination of related education and/or experience may be considered for the above.", "preferred": "Extensive experience in manufacturing management roles gained within consumer food production environments, with proven track record in leading manufacturing teams to improve continuously the efficiency of production methods and, ultimately, the quality of products. Experience operating within relevant regulatory requirements, e.g., FDA, OSHA, EPA, USDA, EEO, etc., Broader experience in operation roles with functional oversight experience of manufacturing, engineering/maintenance, supply chain and quality are highly desirable. Experience with manufacturing safety concepts, applications, and committees. Extensive experience with and commitment to LEAN Manufacturing in a large-scale complex environment, having successfully applied lean expertise to champion process improvement and cost reduction initiatives across diverse teams. Team management/leadership/development skills, including the ability to manage people in an organization matrix and get the best out of them, successful in building and mentoring high performance teams. Maturity, self-confidence, and strong communication skills will be critical for this role. A multicultural approach to operating in a diverse business environment. Comfortable communicating and operating within an internationally matrixed environment. Experience in financial management to include budget and analysis of projects and programs to ensure an acceptable return on investment is achieved. SAP knowledge preferred. Effectively communicate in Spanish and English both verbal and written (desirable) Be able to walk long distances and to be on his/her feet for long periods of time. Able to work in dusty, noisy, hot, cold, and small areas. Ability to work flexible hours to manage a 3-shift operation required."}, "skills": ["GMP", "HACCP", "LEAN Manufacturing", "FDA", "OSHA", "EPA", "USDA", "EEO", "SAP", "Spanish", "English"], "postedDate": "1 week ago", "benefits": "Salary Range: $150,000- $165,000 annually plus 25% Bonus and Full Benefits Packet including: Health, Vision and Dental insurance, Life insurance, Paid time off, 401(k) matching, & Flexible spending accounts, Dependent Care FSA and Health Care FSA.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001956851"}