{"jobTitle": "HR Assistant", "company": {"name": "Unio Health Partners", "location": "Torrance, CA", "industry": "Medical Practices"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "20.00/hr - 25.00/hr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Medical Practices", "description": "Unio Health Partners (UHP) is a highly differentiated physician practice management platform with the goal of transforming care delivery across the Western United States. UHP partners with leading physician practices, creating a cohesive, quality-oriented clinical culture and facilitating best practice sharing across the platform. Our affiliated practices gain access to a broader suite of services, providing a meaningful benefit to both physicians and patients. UHP's best-in-class clinical program covers three sub-specialties (urology, gastroenterology, and radiation oncology) and offers numerous ancillary services, including pathology lab, in-office dispensing, and chronic care management. We are led by a highly accomplished management team and provide a full suite of management services to its affiliated practices. UHP is currently affiliated with 154 providers consisting of 110 physicians and 44 advanced practice providers operating out of 50 locations across Southern, Central, and Northern California.<br/><br/><strong>Position Summary<br/><br/></strong>The HR Assistant works as part of the HR team and is responsible for various administrative duties across the entire employee lifecycle. It also coordinates information flows for all people processes, contributing to the delivery of effective and efficient HR activities and programs. The candidate must be dependable, with high professionalism concerning highly sensitive, confidential information related to Human Resources and Payroll.<br/><br/><strong>What You Will Be Doing<br/><br/></strong><ul><li>Provide comprehensive administration support to HR, assisting each team area as needed.</li><li>Respond to basic HR queries from employees, directing complex issues to appropriate experts.</li><li>Assist in creating offer letters, conducting background checks, and collecting necessary documents for employment clearance.</li><li>Support new hire orientation and onboarding process, ensuring correct setup in HRIS for payments and compliance with policies.</li><li>Maintain employee HR records, including hiring, transfers, terminations, and merit increases, and track vacation, sick, and personal time.</li><li>Administer, audit, and organize employee personnel and benefit files in compliance with legal requirements.</li><li>Document HR actions through forms, reports, logs, and records.</li><li>Support the payroll department by providing employee information.</li><li>Coordinate ergonomic/workstation evaluations and equipment purchasing/installation.</li><li>Participate in Special Projects and team initiatives (Recognition program, Monthly Birthdates, anniversaries).</li><li>Perform other duties or work schedules as assigned based on business needs.<br/><br/><br/></li></ul><strong>What You Will Bring To The Team<br/><br/></strong><ul><li>Strong interpersonal and customer service skills.</li><li>Strong verbal and written communication.</li><li>Strong organizational skills and attention to detail.</li><li>Strong analytical and problem-solving skills.</li><li>Ability to comprehend, interpret, and apply the appropriate sections of applicable laws, guidelines, regulations, ordinances, and policies.</li><li>Excellent time management skills and proven ability to meet deadlines.</li><li>Ability to work independently and to collaborate with team members as necessary.</li><li>Strong technical skills in Microsoft Suite, Teams, HRIS, or related software.<br/><br/><br/></li></ul><strong>What We Can Offer You<br/><br/></strong><ul><li>Competitive Salary and Health Benefits (Medical, Dental, Vision)</li><li>Generous time off (start accruing on your first day - no waiting period)</li><li>Paid Holidays</li><li>401(k)</li><li>Company Discounts</li><li>Collaborative work environment - we want our employees to have a say in how we run our office.</li><li>Employee Recognition - we encourage employee recognition through our GEMS program.<br/><br/><br/></li></ul>Please note that actual pay will be determined based on the relevant experience and internal equity within the pay range.", "responsibilities": "The HR Assistant works as part of the HR team and is responsible for various administrative duties across the entire employee lifecycle. It also coordinates information flows for all people processes, contributing to the delivery of effective and efficient HR activities and programs. The candidate must be dependable, with high professionalism concerning highly sensitive, confidential information related to Human Resources and Payroll.", "qualifications": {"required": "Strong interpersonal and customer service skills. Strong verbal and written communication. Strong organizational skills and attention to detail. Strong analytical and problem-solving skills. Ability to comprehend, interpret, and apply the appropriate sections of applicable laws, guidelines, regulations, ordinances, and policies. Excellent time management skills and proven ability to meet deadlines. Ability to work independently and to collaborate with team members as necessary. Strong technical skills in Microsoft Suite, Teams, HRIS, or related software."}, "skills": ["HRIS", "Microsoft Suite", "Teams", "Customer Service", "Communication", "Organization", "Problem Solving"], "postedDate": "1 month ago", "benefits": "Competitive Salary and Health Benefits (Medical, Dental, Vision) Generous time off (start accruing on your first day - no waiting period) Paid Holidays 401(k) Company Discounts Collaborative work environment - we want our employees to have a say in how we run our office. Employee Recognition - we encourage employee recognition through our GEMS program.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001825874"}