{"jobTitle": "Retail Sales Representative", "company": {"name": "MarketSource Inc.", "industry": "Advertising Services", "location": "Aliso Viejo, CA"}, "location": "Aliso Viejo, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Advertising Services", "description": "MarketSource, Inc. is a premier provider of integrated sales & marketing solutions to Fortune 500 companies. We offer a dynamic environment that fosters creativity and provides unlimited opportunities for personal and professional growth.<br/><br/>MarketSource is currently searching for a part-time Retail Sales Representative to work at major retailer locations. This position is designed to increase sales and revenue within the wireless ecosystem: electronics, mobile phones, accessories, and digital service. As a full-time sales representative you will be responsible for proactively approaching customers within retailer and assisting in various wireless products and accessory sales while providing extraordinary customer service.<br/><br/><strong>Sales<br/><br/></strong>Key Responsibilities:<br/><br/><ul><li> Driving sales productivity and customer satisfaction within retail locations on various Wireless products, accessories and services to customers</li><li> Engaging in side-by-side selling with retail associates</li><li> Participating in in-store promotions, and coordinating with appropriate personnel</li><li> Participating in wireless sales events in retailer locations<br/><br/></li></ul> <br/><br/><strong>Training<br/><br/></strong><ul><li> Maintaining sound knowledge of multiple carriers wireless products and services</li><li> Attending requested training sessions and conference calls</li><li> Reviewing new product and service offerings from our client retailer<br/><br/></li></ul> <br/><br/><strong>Relationship Development<br/><br/></strong><ul><li> Establishing and managing critical relationships within program</li><li> Developing and managing positive business relationships with retail store management and employees<br/><br/></li></ul><strong>Additional Job Requirements<br/><br/></strong>Physical ability to perform tasks that may require prolonged bending, stooping, reaching, twisting, lifting, pushing, pulling, walking, standing and moving items<br/><br/>Requires the ability to move around the store, assist customers and maneuver merchandise when necessary<br/><br/>Performs additional duties as assigned<br/><br/>MarketSource is an equal opportunity employer.", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4001764179"}