{"jobTitle": "Client Solutions Manager, Amazon", "company": {"name": "Meta", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "85,000.00/yr - 126,000.00/yr", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Technology, Information and Internet", "description": "The Client Solutions Manager for Meta's Global Business Group is a strategic and enthusiastic solution-driver who puts our customers at the core of everything we do. This is an outstanding opportunity to build and manage key client relationships, leverage strong analytical skills, and develop platform and product expertise to become a trusted consultant in media planning, strategy, and measurement to our Fortune 1000, multi-channel advertisers. With proven understanding of performance marketing, this role is responsible for partnering with the sales team to develop trusted relationships, drive revenue by negotiating and optimizing complex opportunities. Success in this position requires strong data and analytical skills that allows the individual to translate a business objective into an analysis framework, in order to to provide best in class data-driven consultative sales approach, and the ability to thrive in a dynamic, team-focused environment delivering against tight deadlines.<br/><br/>Client Solutions Manager, Amazon Responsibilities:<br/><br/><ul><li>Act as a product &amp; insights expert, in partnership with Client Partner, to identify and implement marketing solutions that drive measurable business results for our partners</li><li>Build and manage relationships with key clients (marketing, analytics, product etc.)</li><li>Craft narratives and recommendations from custom analyses, build presentations, and present findings to business stakeholders</li><li>Design experimentation initiatives, develop experiment tracking, analyze results and present recommendations</li><li>Serve as external product consultant educating clients and agencies on product solutions and best practices, and ultimately grow existing business partnership</li><li>Drive proactive media &amp; measurement strategy, implementation, and optimizations to increase performance and investments</li><li>Oversee account operations (e.g. troubleshooting issues, account set up, etc.)</li><li>Work and collaborate with diverse group of internal cross-functional teams to project manage complex workstreams</li><li>Ability to travel as needed<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>5+ years of experience in performance marketing, digital marketing, or client-facing strategy and analytical consulting roles</li><li>Advanced experience structuring and manipulating raw data into datasets for analysis</li><li>Expertise analyzing data from a variety of different sources (quantitative and qualitative), and presenting the data in a clear and concise manner, and developing actionable insights</li><li>Proven track record in leveraging data, developing insight-backed hypotheses and driving learning plans to build compelling business cases</li><li>Experience confidently delivering insights to both technical and non-technical audiences</li><li>Experience working with diverse set of cross-functional teams</li><li>Experience influencing senior level executives and clients<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Knowledge of statistics and experience with statistical packages as as R, SAS, SPSS</li><li>Knowledge and experience with data querying (e.g., SQL)</li><li>Experience with business case modeling and market/opportunity sizing</li><li>Experience with Meta’s full suite of advertising solutions</li><li>Experience working cross-functionally with Product teams to improve products features and functionalities<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$85,000/year to $126,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "The Client Solutions Manager for Meta's Global Business Group is a strategic and enthusiastic solution-driver who puts our customers at the core of everything we do. This is an outstanding opportunity to build and manage key client relationships, leverage strong analytical skills, and develop platform and product expertise to become a trusted consultant in media planning, strategy, and measurement to our Fortune 1000, multi-channel advertisers. With proven understanding of performance marketing, this role is responsible for partnering with the sales team to develop trusted relationships, drive revenue by negotiating and optimizing complex opportunities. Success in this position requires strong data and analytical skills that allows the individual to translate a business objective into an analysis framework, in order to to provide best in class data-driven consultative sales approach, and the ability to thrive in a dynamic, team-focused environment delivering against tight deadlines.<br/><br/>Client Solutions Manager, Amazon Responsibilities:<br/><br/><ul><li>Act as a product &amp; insights expert, in partnership with Client Partner, to identify and implement marketing solutions that drive measurable business results for our partners</li><li>Build and manage relationships with key clients (marketing, analytics, product etc.)</li><li>Craft narratives and recommendations from custom analyses, build presentations, and present findings to business stakeholders</li><li>Design experimentation initiatives, develop experiment tracking, analyze results and present recommendations</li><li>Serve as external product consultant educating clients and agencies on product solutions and best practices, and ultimately grow existing business partnership</li><li>Drive proactive media &amp; measurement strategy, implementation, and optimizations to increase performance and investments</li><li>Oversee account operations (e.g. troubleshooting issues, account set up, etc.)</li><li>Work and collaborate with diverse group of internal cross-functional teams to project manage complex workstreams</li><li>Ability to travel as needed<br/><br/></li></ul>", "qualifications": {"required": "5+ years of experience in performance marketing, digital marketing, or client-facing strategy and analytical consulting roles, Advanced experience structuring and manipulating raw data into datasets for analysis, Expertise analyzing data from a variety of different sources (quantitative and qualitative), and presenting the data in a clear and concise manner, and developing actionable insights, Proven track record in leveraging data, developing insight-backed hypotheses and driving learning plans to build compelling business cases, Experience confidently delivering insights to both technical and non-technical audiences, Experience working with diverse set of cross-functional teams, Experience influencing senior level executives and clients", "preferred": "Knowledge of statistics and experience with statistical packages as as R, SAS, SPSS, Knowledge and experience with data querying (e.g., SQL), Experience with business case modeling and market/opportunity sizing, Experience with Meta’s full suite of advertising solutions, Experience working cross-functionally with Product teams to improve products features and functionalities"}, "skills": ["Performance Marketing", "Digital Marketing", "Client-facing Strategy", "Analytical Consulting", "Data Analysis", "Data Manipulation", "Data Presentation", "Actionable Insights", "Data-driven", "Consultative Sales", "Business Case Modeling", "Market Sizing", "Meta Advertising Solutions", "Product Management", "Cross-functional Collaboration", "Executive Influence", "Client Relationship Management", "Product Expertise", "Media Planning", "Strategy", "Measurement", "Statistics", "R", "SAS", "SPSS", "SQL", "Data Querying"], "postedDate": "6 days ago", "benefits": "$85,000/year to $126,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4001542938"}