{"jobTitle": "Logistics Clerk", "company": {"name": "Walker SCM LLC", "location": "West Rancho Dominguez, CA"}, "location": "West Rancho Dominguez, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "USD $22.00 - USD $24.00 /Yr.", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Walker SCM, LLC company, brings an experienced team approach to multi-national logistics service. We provide superior products without sacrificing the small firm attributes that have distinguished our firm since its inception - personal attention, expertise, and reliability. We are a 3PL provider of assembly and contract packaging services and the associated warehousing, distribution, procurement, and transportation services.<br/><br/>The Logistics Clerk is responsible for helping to receive and ship material at the warehouse. Primary job duties include preparing &amp; executing all shipping documents and system transactions for each truck that is shipped. Also involved is producing a variety of daily reports from the warehouse management system and using Excel to prepare them for publishing.<br/><br/>The Logistics Clerk will be working with a group of people at the warehouse but will also be responsible for interacting with remote clients from all over the world to support a variety of ship to’s here in the Kentuckian region to include Ford and GM.<br/><br/><strong><em>Operations<br/><br/></em></strong><ul><li>Assigns dock doors to drivers and tracks carriers as they arrive to the facility.</li><li>Tracks hot shipments as they are in transit to the facility.</li><li>Responsible for data entry/manipulation to publish a variety of reports.</li><li>Monitors receipts to ensure they are closed accurately.</li><li>Ensures the timeliness and accuracy of ASN’s for outgoing shipments.</li><li>Review client web portal for updated information and input data into the client web portal.</li><li>Transfer damaged or obsolete material to quarantine daily for accurate shortage reporting.</li><li>Assists with cycle counts and inventory discrepancy investigation.</li><li>Prepare and make shipments – produce accurate BOL’s, close all ASN in the system promptly, ensure that ASN’s post in customer portal.<br/><br/><br/></li></ul><strong><em>Documentation<br/><br/></em></strong><ul><li>Maintains records as assigned.</li><li>Responsible for ensuring all necessary paperwork is sent to the customer on a daily basis.</li><li>Gather and organize all paperwork generated by the floor team and archive it.<br/><br/><br/></li></ul><strong><em>Quality<br/><br/></em></strong><ul><li>Participates in root cause analysis and corrective action preparation.</li><li>Follows all company policies and procedures</li><li>Understands customer requirements and how their job impacts the company’s ability to meet them.</li><li>Communicate continuous improvement suggestions to management.<br/><br/><br/></li></ul><strong><em>Communication<br/><br/></em></strong><ul><li>Communicates late deliveries, order changes, missed information and tracking numbers to customers as needed.</li><li>Provides responses and/or details on shipments/receipts in customer’s systems, and reports as required.</li><li>Provides responsive communication with customers as needed.</li><li>Sends daily reports out as required.</li><li>Answers incoming calls/emails into the facility</li><li>Monitors MS Teams and responds to client and internal messages promptly.</li><li>Attends QOS meetings as required</li><li>Other duties as assigned</li><li>High School Diploma or equivalent with at least 2 years of related experience and/or training; or equivalent combination of education and experience</li><li>Must be able to read, write and comprehend English</li><li>Bi-lingual (Spanish) helpful but not required<br/><br/><br/></li></ul>", "responsibilities": "The Logistics Clerk is responsible for helping to receive and ship material at the warehouse. Primary job duties include preparing &amp; executing all shipping documents and system transactions for each truck that is shipped. Also involved is producing a variety of daily reports from the warehouse management system and using Excel to prepare them for publishing.<br/><br/>The Logistics Clerk will be working with a group of people at the warehouse but will also be responsible for interacting with remote clients from all over the world to support a variety of ship to’s here in the Kentuckian region to include Ford and GM.", "qualifications": {"required": "High School Diploma or equivalent with at least 2 years of related experience and/or training; or equivalent combination of education and experience\nMust be able to read, write and comprehend English\nBi-lingual (Spanish) helpful but not required"}, "skills": ["Excel"], "postedDate": "6 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001262022"}