{"jobTitle": "Technology Sourcing Specialist", "company": {"name": "Netflix", "location": "Los Gatos, CA"}, "location": "Los Gatos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$100,000 - $700,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>As Netflix grows, the Technology Sourcing team is building for scale. Netflix is on the hunt for a smart, motivated, and organized individual to join the team. The ideal candidate thrives on learning new technology, leads with a customer-first focus, and is committed to optimizing technology investments on behalf of Netflix.<br/><br/>As a Technology Sourcing Specialist, you’ll be a part of the team responsible for driving the centralization of our software spend across Netflix, managing existing and new vendor relationships, and ensuring Netflix is reaping optimal value from its technology investments.<br/><br/><strong><strong>Your Expected Impact<br/><br/></strong></strong><ul><li> Establish strong communication and collaboration across multiple internal and external customers to provide data-driven insights and recommendations for sourcing deals</li><li>Become a trusted partner across teams and drive effective communication to ensure the best terms for Netflix</li><li>Develop and maintain product knowledge on software relevant to both Studio and Corporate stakeholders</li><li>Support project management and contract execution for sourcing negotiations ensuring alignment with procurement practices including supplier identification, request for proposal (RFP) development, and supplier evaluation </li><li>Execute on the vision for the future state of tech sourcing and contribute to product and service roadmaps in pursuit of those goals</li><li>Foster highly-aligned cross-functional partnerships with our partner support teams across Infosec, Finance, and Legal</li><li>Solicit product and service proposals and conduct deal negotiations on behalf of our customers</li><li>Support team processes including contract management and data analysis needs</li><li>Maintain accurate contracting data, vendor records, and transaction information<br/><br/></li></ul><strong>Your Skills &amp; Experience<br/><br/></strong><ul><li>At least 3 years of experience contributing to a technology sourcing and procurement team (preferably within a multinational context)</li><li>Comfortable working in self-directed and ambiguous environments</li><li>Excellent vendor management skills</li><li>World-class negotiating skills with the ability to challenge the status quo</li><li>Great interpersonal and communication skills</li><li>BA in Supply Chain Management, Finance, or similar relevant field</li><li>Media and Entertainment experience preferred<br/><br/></li></ul>Generally, our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $700,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.<br/><br/>Job is open for no less than 7 days and will be removed when the position is filled.", "responsibilities": "As a Technology Sourcing Specialist, you’ll be a part of the team responsible for driving the centralization of our software spend across Netflix, managing existing and new vendor relationships, and ensuring Netflix is reaping optimal value from its technology investments.", "qualifications": {"required": "At least 3 years of experience contributing to a technology sourcing and procurement team (preferably within a multinational context), Comfortable working in self-directed and ambiguous environments, Excellent vendor management skills, World-class negotiating skills with the ability to challenge the status quo, Great interpersonal and communication skills, BA in Supply Chain Management, Finance, or similar relevant field, Media and Entertainment experience preferred", "preferred": ""}, "skills": ["Technology Sourcing", "Procurement", "Vendor Management", "Negotiation", "Communication"], "postedDate": "6 days ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4001264018"}