{"jobTitle": "Automotive Sales Associate", "company": {"name": "New Century Volkswagen", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Motor Vehicle Manufacturing", "description": "LAUNCH YOUR SALES CAREER WITH NEW CENTURY VOLKSWAGEN!<br/><br/>Have you been considering the automotive industry and wondering how to break in? Do you have prior experience working in a fast-paced retail environment? Are you passionate about delivering a unique customer experience? Are you driven to succeed? If you answered yes, we want to talk to you!<br/><br/>We are searching for individuals with drive and a collaborative mindset. We are searching for Client Advisors to join our team! The ideal person will be self-motivated and have a history of satisfying customers while paying close attention to detail. Our employees are our strongest asset and have contributed to the continued success of our organization. If you are ambitious, have excellent interpersonal skills, and have the ability to meet and exceed goals, we would love to meet you!<br/><br/>Daily responsibilities include developing relationships with clients and suggesting product solutions to meet their needs.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Nurture enriching relationships to build a clientele for life</li><li> Exhibit consultative selling skills. Assist customers in selecting a vehicle based on their needs.</li><li> Continuously develop product and sales acumen to become the vehicle authority. Know the ins and the outs of product offerings, optional packages, and the latest technology.</li><li> Perform high-quality, professional demonstrations of new/used vehicles</li><li> Follow-up with buyers to leverage successful referral business</li><li> Learn to overcome objections and thrive in sales situations</li><li> Report directly to the Sales Manager for direction</li><li> Bring your “A” game to work every day.<br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Available to work flexible hours and weekends</li><li> Self-starter mentality and ambitious spirit preferred</li><li> Ready to waste no time learning new product knowledge</li><li> Phenomenal communication skills with customers and team members</li><li> Professional, well-groomed personal appearance</li><li> Clean driving record and valid driver’s license<br/><br/><br/></li></ul>We are an equal opportunity employer and prohibit discrimination/harassment without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4001394046"}