{"jobTitle": "Manager, Internal Communications - Advertising", "company": {"name": "Netflix", "location": "New York, United States"}, "location": "New York, United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$160,000 - $320,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>The internal communications team at Netflix seeks to inspire employees, increase understanding of our business strategy, and support our culture of transparency. We’re hiring a manager to partner with our Ads organization — a newly established and growing team at Netflix.<br/><br/>We introduced our Ads plan on Netflix nearly two years ago to: 1) provide consumers with a lower cost option, and 2) help drive revenue for the business. Our Ads team is focused on bringing our ads plan to more members around the world, working with advertisers to connect their brands to our broad and highly engaged audience, and improving our ads experience (for both members and advertisers alike).<br/><br/><strong>Role<br/><br/></strong>Our ideal candidate will be a strategic thinker, strong communicator, and a relationship builder, who can be a trusted partner and adviser to teams across multiple disciplines. This role will create and lead global communications strategies, including executive comms (closely partnering with our President of Ads and senior leaders) and key channels (e.g. organizing town halls). Key to this role is ensuring that:<br/><br/><ul><li>There is more proactive communication across the organization, including what the strategic priorities are and how employees’ work is contributing toward progress;</li><li>Important updates are communicated in a consistent and organized way across the org and with cross-functional partners;</li><li>Leaders have the support they need in communicating with employees; and</li><li>Our comm strategy is able to evolve with the needs of a rapidly growing organization.<br/><br/></li></ul><strong>To Succeed In This Role You Will Need<br/><br/></strong><ul><li>7+ years of experience in communications, preferably within media, advertising, entertainment and/or technology industries;</li><li>To be scrappy and entrepreneurial — eager to roll-up your sleeves and get work done;</li><li>Meticulous organizational skills, good judgment, and effective time management</li><li>Excellent written and oral communication skills — an expert simplifier;</li><li>Experience working across a variety of channels and tools (including town halls, newsletters, etc.);</li><li>The ability to thrive in a fast-paced environment and work with a wide variety of internal partners;</li><li>To be a trusted partner and adviser to disparate teams across multiple disciplines, including senior leaders;</li><li>A passion for helping people and a curiosity about different cultures;</li><li>The ability to challenge established wisdom and work well cross-functionally; and </li><li>A dislike of hierarchy and bureaucracy but also an understanding that some structure - as well as the ability to plan - is needed to effect change. <br/><br/></li></ul>This role is based out of Netflix’s New York office, reporting to the Senior Director of Internal Communications.<br/><br/>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $160,000 - $320,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "The internal communications team at Netflix seeks to inspire employees, increase understanding of our business strategy, and support our culture of transparency. We’re hiring a manager to partner with our Ads organization — a newly established and growing team at Netflix.<br/><br/>We introduced our Ads plan on Netflix nearly two years ago to: 1) provide consumers with a lower cost option, and 2) help drive revenue for the business. Our Ads team is focused on bringing our ads plan to more members around the world, working with advertisers to connect their brands to our broad and highly engaged audience, and improving our ads experience (for both members and advertisers alike).<br/><br/><strong>Role<br/><br/></strong>Our ideal candidate will be a strategic thinker, strong communicator, and a relationship builder, who can be a trusted partner and adviser to teams across multiple disciplines. This role will create and lead global communications strategies, including executive comms (closely partnering with our President of Ads and senior leaders) and key channels (e.g. organizing town halls). Key to this role is ensuring that:<br/><br/><ul><li>There is more proactive communication across the organization, including what the strategic priorities are and how employees’ work is contributing toward progress;</li><li>Important updates are communicated in a consistent and organized way across the org and with cross-functional partners;</li><li>Leaders have the support they need in communicating with employees; and</li><li>Our comm strategy is able to evolve with the needs of a rapidly growing organization.<br/><br/></li></ul>", "qualifications": {"required": "7+ years of experience in communications, preferably within media, advertising, entertainment and/or technology industries; To be scrappy and entrepreneurial — eager to roll-up your sleeves and get work done; Meticulous organizational skills, good judgment, and effective time management Excellent written and oral communication skills — an expert simplifier; Experience working across a variety of channels and tools (including town halls, newsletters, etc.); The ability to thrive in a fast-paced environment and work with a wide variety of internal partners; To be a trusted partner and adviser to disparate teams across multiple disciplines, including senior leaders; A passion for helping people and a curiosity about different cultures; The ability to challenge established wisdom and work well cross-functionally; and A dislike of hierarchy and bureaucracy but also an understanding that some structure - as well as the ability to plan - is needed to effect change.", "preferred": ""}, "skills": ["Communications", "Media", "Advertising", "Entertainment", "Technology", "Organizational Skills", "Time Management", "Communication Skills", "Channel Management", "Tools", "Leadership", "Relationship Building", "Strategic Thinking", "Cross-Functional Collaboration", "Executive Communication", "Town Halls", "Newsletters", "Culture of Transparency", "Business Strategy", "Compensation Structure", "Stock Options", "Benefits", "Health Plans", "Mental Health Support", "401(k) Retirement Plan", "Disability Programs", "Health Savings", "Flexible Spending Accounts", "Family-forming Benefits", "Life and Serious Injury Benefits", "Paid Leave of Absence Programs", "Paid Time Off", "Vacation", "Holidays", "Sick Paid Time Off", "Flexible Time Off", "Diversity", "Inclusion", "Equal Opportunity Employer"], "postedDate": "6 days ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4001977655"}