{"jobTitle": "Technical Design Manager - Dresses", "company": {"name": "Reformation", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Product Management and Marketing", "industry": "Technology, Information and Internet", "description": "Founded in 2009, Reformation is a revolutionary lifestyle brand that proves fashion and sustainability can coexist. We combine stylish, vintage-inspired designs with sustainable practices, releasing limited-edition collections for individuals who want to look beautiful and live sustainably. Setting an example for the industry, Reformation remains at the forefront of innovation in sustainable fashion—running the first sustainable factory in Los Angeles, using deadstock and eco fabrics, tracking and sharing the environmental impact of every product, and investing in the people who make this revolution possible. The brand has also established itself as a pioneer in retail innovation, developing an in-store tech concept that brings the best of its online experience to its physical doors.<br/><br/>We are a future focused organization committed to the belief that the problems facing our planet and society can be solved through innovation, common sense and education. Being naked is the #1 most sustainable option. We're #2.<br/><br/>Here at Ref, we put people first. We know that you can't innovate and do cool stuff without having everyone on board. So we work to create a culture where everyone feels like they belong and where their voices are truly valued. We build an inclusive culture together and make a real impact along the way.<br/><br/><strong>Technical Design Manager - Dresses<br/><br/></strong>Reformation is looking for an awesome Technical Design Manager who will link the design department and production to ensure that all designs translate to amazing garments. The role reports to the Director of Technical Design &amp; Quality and has 1 direct report. The role includes overseeing the dress product category, leading the fit process from design to production, establishing and maintaining fit standards, generating clear detailed fit comments to vendors, managing the technical design workflow for the category, and mentoring assisting staff. You will be working closely with our design, product development, and production departments.<br/><br/>We are looking for a full-time, super-efficient, hard-working, seasoned Technical Design Manager who will make sure our clothes look and fit great and are made at the highest level of quality standards.<br/><br/><strong>What You'll Do:</strong> <br/><br/><ul><li>Work closely with design and product development to ensure that designs are translated correctly, keeping size and fit consistent.</li><li>Manage team in fit sessions by fitting samples on live model, recording comments, and communicating with team and partners</li><li>Analyze garments and patterns to determine compliance of spec, construction, and fit intent.</li><li>Create technical fit comments, advise construction details, and clearly communicate the status and direction of each style to vendors</li><li>Review production, quality, and cost issues: problem solve and make recommendations that help maintain brand integrity.</li><li>Maintain WIP report and workflow tracking.</li><li>Maintain a working knowledge of appropriate fit aesthetic for the Reformation customer.</li><li>Collaborate with the Technical Design Director to create and carry out new processes to improve product workflow<br/><br/></li></ul>Work closely with the Technical Design Director to develop and maintain standards and grade rules.<br/><br/><ul><li>Develop collaborative relationships with cross functional teams.</li><li>Develop partnerships with all vendors helping to create successful relationships.</li><li>Onboard, train, and supervise assisting staff.<br/><br/></li></ul><strong>What You'll Need: <br/><br/></strong><ul><li>Bachelor's Degree</li><li>6-10+ years experience in apparel technical design</li><li>Extreme attention to detail and accuracy, as well as ability to prioritize and make quick decisions</li><li>Superior organizational skills and excellent communication skills; team oriented; highly detail oriented and meticulous</li><li>Thrive in a fast-paced, team-oriented environment</li><li>Extremely honest and trustworthy with highest integrity</li><li>Ability to multi-task and meet deadlines, balance creativity with technical capability, and interpret design sketches for tech packs</li><li>Knowledge of garment construction, pattern making, silhouettes, color ways, sewing techniques, fabrication and trim; familiarity with print design and manufacturing</li><li>Experience working with overseas factories<br/><br/></li></ul><strong>Who You Are:</strong> <br/><br/><ul><li>Very skilled at full package who wants to excel into a better quality apparel collection</li><li>Desire to grow and continue a career in full package for an established and high growth company<br/><br/></li></ul><strong>Benefits &amp; Perks:<br/><br/></strong><ul><li>Health, vision, and dental insurance for eligible employees</li><li>Paid vacation, sick, holidays &amp; volunteer time-off for eligible employees</li><li>Mission based company + casual and entrepreneurial work environment </li><li>Clothing discount, dog-friendly office, company events + parties and much more </li><li>401K with company match <br/><br/></li></ul><em>The Reformation is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, disability, or protected veteran status<br/><br/></em><em>Notice at Collection- Privacy Notice for California Candidates</em>", "responsibilities": "Work closely with design and product development to ensure that designs are translated correctly, keeping size and fit consistent. Manage team in fit sessions by fitting samples on live model, recording comments, and communicating with team and partners Analyze garments and patterns to determine compliance of spec, construction, and fit intent. Create technical fit comments, advise construction details, and clearly communicate the status and direction of each style to vendors Review production, quality, and cost issues: problem solve and make recommendations that help maintain brand integrity. Maintain WIP report and workflow tracking. Maintain a working knowledge of appropriate fit aesthetic for the Reformation customer. Collaborate with the Technical Design Director to create and carry out new processes to improve product workflow Work closely with the Technical Design Director to develop and maintain standards and grade rules. Develop collaborative relationships with cross functional teams. Develop partnerships with all vendors helping to create successful relationships. Onboard, train, and supervise assisting staff.", "qualifications": {"required": "Bachelor's Degree 6-10+ years experience in apparel technical design Extreme attention to detail and accuracy, as well as ability to prioritize and make quick decisions Superior organizational skills and excellent communication skills; team oriented; highly detail oriented and meticulous Thrive in a fast-paced, team-oriented environment Extremely honest and trustworthy with highest integrity Ability to multi-task and meet deadlines, balance creativity with technical capability, and interpret design sketches for tech packs Knowledge of garment construction, pattern making, silhouettes, color ways, sewing techniques, fabrication and trim; familiarity with print design and manufacturing Experience working with overseas factories", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "benefits": "Health, vision, and dental insurance for eligible employees Paid vacation, sick, holidays &amp; volunteer time-off for eligible employees Mission based company + casual and entrepreneurial work environment  Clothing discount, dog-friendly office, company events + parties and much more  401K with company match ", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4001824004"}