{"jobTitle": "Senior Data Analyst", "company": {"name": "Solugenix", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$50.00/hr - $75.00/hr", "currency": "USD"}, "jobFunction": "Other", "industry": "IT Services and IT Consulting", "description": "Remote (EST work hours, travel to NJ once or twice a quarter for meetings (all expenses paid) <br/><br/><strong> Contract to hire<br/><br/>Job ID 24-08808<br/><br/></strong>Solugenix is assisting a healthcare client in their search for a <strong> Senior Data Analyst. <br/><br/></strong><strong> Qualifications </strong> :<br/><br/><ul><li> Bachelor's degree or equivalent experience. </li><li> Minimum 7 years of experience with large SQL data marts. </li><li> Strong data analysis skills. </li><li> Marketing Analytics background. </li><li> Must be able to quickly understand data sets and help provide insights. </li><li> Experience in SQL (SQL queries), Tableau, and Data Bricks is a must. </li><li> The ability to research issues to resolution and attention to detail are essential. </li><li> Healthcare or recruiting analytics experience is nice to have. </li><li> Strong verbal and written communication skills. <br/><br/></li></ul><strong> Responsibilities </strong> :<br/><br/><ul><li> Collaborate with implementation and product teams to work on in-house built platforms. </li><li> Interfacing with internal/external business SMEs. </li><li> Support the integration of new data sources and analyze and confirm the overall quality and integrity of source data. </li><li> Isolate and resolve data source issues. <br/><br/></li></ul><strong> Pay Range for CA, CO, IL, NJ, NY, WA, and DC: $50/hour to $75/hour. Starting rate of pay offered may vary depending on factors including but not limited to, position offered, location, education, training, and/or experience.<br/><br/>About the Client: <br/><br/></strong>Our client is a home healthcare company.<br/><br/><strong>About Solugenix<br/><br/></strong>Solugenix is an information technology services company known for its deep experience and knowledge in providing comprehensive technology services, solutions, and talent support for companies around the world. The company offers a variety of cutting edge and talent support solutions to promote growth and cutting-edge advancement to our esteemed clients and candidates. We provide these talent support solutions on a contract, contract-to-hire, and direct hire basis. We also have additional resources from our staffing partners to ensure the right match and expertise for the best result.<br/><br/>For over 50 years, global and local brands have trusted Solugenix as an added resource and partner in taking steps to ensure their immediate and future success. In addition to generating ground-breaking, industry-defining solutions, Solugenix has been delivering the talent and support needed to make it happen. We are dedicated to partnering with clients and candidates whose core values also foster a culture of professionalism, teamwork, and integrity.", "responsibilities": "Collaborate with implementation and product teams to work on in-house built platforms. Interfacing with internal/external business SMEs. Support the integration of new data sources and analyze and confirm the overall quality and integrity of source data. Isolate and resolve data source issues.", "qualifications": {"required": "Bachelor's degree or equivalent experience. Minimum 7 years of experience with large SQL data marts. Strong data analysis skills. Marketing Analytics background. Must be able to quickly understand data sets and help provide insights. Experience in SQL (SQL queries), Tableau, and Data Bricks is a must. The ability to research issues to resolution and attention to detail are essential. Healthcare or recruiting analytics experience is nice to have. Strong verbal and written communication skills."}, "skills": ["SQL", "Tableau", "Data Bricks", "Data Analysis", "Marketing Analytics"], "postedDate": "1 month ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4001747474"}