{"jobTitle": "Manager, Strategic Initiatives and Operations", "company": {"name": "Live Nation Entertainment", "industry": "Entertainment Providers", "size": "Large", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$120,000.00 - $150,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Entertainment Providers", "description": "Job Summary: WHO ARE WE? Live Nation Entertainment is the world’s leading live entertainment and eCommerce company, comprised of four market leaders: Ticketmaster.com, Live Nation Concerts, Front Line Management Group and Live Nation Network. Ticketmaster.com is the global event ticketing leader and one of the world’s top five eCommerce sites, with over 26 million monthly unique visitors. Live Nation Concerts produces over 20,000 shows annually for more than 2,000 artists globally. Front Line is the world’s top artist management company, representing over 250 artists. These businesses power Live Nation Network, the leading provider of entertainment marketing solutions, enabling over 800 advertisers to tap into the 200 million consumers Live Nation delivers annually through its live event and digital platforms. For additional information, visit www.livenation.com/investors. WHO ARE YOU? Passionate and motivated. Driven, with an entrepreneurial spirit. Resourceful, innovative, forward thinking and committed. At Live Nation Entertainment, our people embrace these qualities, so if this sounds like you then please read on! THE ROLE The contract Strategic Initiatives & Operations Manager position will be dedicated to enterprise-wide financial systems transformation - supporting change management, training, and communications for the first go live date for the transformation in February 2025, when all of Live Nation will transition to a new FP&A system; and the US and Canada which will also transition to a new Accounting system (continued support through April 2025). On this project, you will partner with the US-based Live Nation employees who are supporting change management, the project management team, and the heads of accounting and financial planning, as well as collaborate with Los Angeles-based employees leading training and communications for the systems transformation. WHAT THIS PERSON WILL DO: Collectively, you and the employees leading training and communications will be responsible for: Manage the creation and revision of training materials, including working with vendors and subject matter experts within the business Creating the schedule and materials for live Zoom and in-person trainings on various accounting and financial planning topics, leveraging input from subject matter experts Provide training and support for a group of 150+ superusers across the company (divisional users who will support end users at Go Live), including scheduling Q&A sessions with process experts and collecting and executing on feedback Stakeholder management with senior finance leaders across Live Nation Potential additional change management responsibilities, such as process improvement discussions with finance leaders WHAT THIS PERSON WILL BRING: Bachelor's Degree required; MBA (or equivalent graduate degree) preferred 4-7 years of experience with 2+ years in management consulting, preferably in large-scale operational transformations or large-scale financial systems transformation Prior experience with accounting or finance functions Excellent written and verbal communication skills, with the ability to formulate and articulate viewpoints in a clear, succinct manner Detail-oriented, organized and able to work efficiently and independently in a fast-paced environment Exceptional teamwork and collaboration skills Live Nation’s policy regarding vaccinations and masking related to a pandemic or other infectious disease control measures, acts of God, health and safety mandates and/or restrictions imposed by applicable local, state or federal governments has evolved over time. Currently, we strongly encourage employees to be fully vaccinated from such infectious diseases for which vaccinations are available. You are expected to follow Live Nation’s health and safety protocols and policies as they change from time to time. EQUAL EMPLOYMENT OPPORTUNITY We are passionate and committed to our people and go beyond the rhetoric of diversity and inclusion. You will be working in an inclusive environment and be encouraged to bring your whole self to work. We will do all that we can to help you successfully balance your work and homelife. As a growing business we will encourage you to develop your professional and personal aspirations, enjoy new experiences, and learn from the talented people you will be working with. It’s talent that matters to us and we encourage applications from people irrespective of their gender, race, sexual orientation, religion, age, disability status or caring responsibilities. Live Nation strongly supports equal employment opportunity for all applicants regardless of age (40 and over), ancestry, color, religious creed (including religious dress and grooming practices), family and medical care leave or the denial of family and medical care leave, mental or physical disability (including HIV and AIDS), marital status, domestic partner status, medical condition (including cancer and genetic characteristics), genetic information, military and veteran status, political affiliation, national origin (including language use restrictions), citizenship, race, sex (including pregnancy, childbirth, breastfeeding and medical conditions related to pregnancy, childbirth or breastfeeding), gender, gender identity, and gender expression, sexual orientation, or any other basis protected by applicable federal, state or local law, rule, ordinance or regulation. We will consider qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Ordinance, San Francisco Fair Chance Ordinance and the California Fair Chance Act and consistent with other similar and / or applicable laws in other areas. We also afford equal employment opportunities to qualified individuals with a disability. For this reason, Live Nation will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant consistent with its legal obligations to do so, including reasonable accommodations related to pregnancy in accordance with applicable local, state and / or federal law. As part of its commitment to make reasonable accommodations, Live Nation also wishes to participate in a timely, good faith, interactive process with a disabled applicant to determine effective reasonable accommodations, if any, which can be made in response to a request for accommodations. Applicants are invited to identify reasonable accommodations that can be made to assist them to perform the essential functions of the position they seek. Any applicant who requires an accommodation in order to perform the essential functions of the job should contact a Human Resources Representative to request the opportunity to participate in a timely interactive process. Live Nation will also provide reasonable religious accommodations on a case by case basis. HIRING PRACTICES The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job. Live Nation recruitment policies are designed to place the most highly qualified persons available in a timely and efficient manner. Live Nation may pursue all avenues available, including promotion from within, employee referrals, outside advertising, employment agencies, internet recruiting, job fairs, college recruiting and search firms.", "responsibilities": "Manage the creation and revision of training materials, including working with vendors and subject matter experts within the business. Creating the schedule and materials for live Zoom and in-person trainings on various accounting and financial planning topics, leveraging input from subject matter experts. Provide training and support for a group of 150+ superusers across the company (divisional users who will support end users at Go Live), including scheduling Q&A sessions with process experts and collecting and executing on feedback. Stakeholder management with senior finance leaders across Live Nation. Potential additional change management responsibilities, such as process improvement discussions with finance leaders.", "qualifications": {"required": "Bachelor's Degree required; MBA (or equivalent graduate degree) preferred. 4-7 years of experience with 2+ years in management consulting, preferably in large-scale operational transformations or large-scale financial systems transformation. Prior experience with accounting or finance functions. Excellent written and verbal communication skills, with the ability to formulate and articulate viewpoints in a clear, succinct manner. Detail-oriented, organized and able to work efficiently and independently in a fast-paced environment. Exceptional teamwork and collaboration skills.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4001268798"}