{"jobTitle": "HR Manager | Restaurant/Hospitality/Concessions", "company": {"name": "eLink Recruiting Solutions", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Staffing and Recruiting", "description": "Seeking a Human Resources Manager with strong recruitment experience to provide support for a hospitality company specializing in retail and hospitality in the Los Angeles area.<br/><br/>Human Resources Manager will be responsible for implementing human resource strategies to support the company’s business objectives. Responsible for handling the day to day human resources function to include; benefits, training, orientation, employee relations, recruiting, safety, etc. Monitor and ensure positive employee relations throughout the company creating a work environment conducive to high productivity, retention, and the attraction of high caliber talent.<br/><br/><ul><li>Helps drive division-wide human resource strategies, programs, and processes throughout the company. </li><li>Coach and provide direction to the management team and to employees. </li><li>Partners with operations and training functions to identify training needs, develop, and implement programs. </li><li>Oversee the recruiting functions to identify and understand workforce needs; actively participates in implementing recruiting strategy and process; supervises applicant intake process for union hourly positions. </li><li>Provides policy interpretation and ensures accurate and consistent application of all company policies and procedures, and related local, state and federal laws, and applicable collective bargaining agreement(s). </li><li>Provides counseling/training for mid managers in the areas of labor/employee relations, EEO, affirmative action, and discrimination. </li><li>Accomplishes human resources and organization mission by completing related results as needed. <br/><br/></li></ul><strong>Education:<br/><br/></strong><ul><li>Bachelor's degree in Human Resources or related field. <br/><br/></li></ul><strong>Work Experience:<br/><br/></strong><ul><li>At least 7 years experience in progressively responsible human resource roles, with at least 2 years of experience in Union Labor Relations and Employee Relations; and at least 2 years in a supervisory role. </li><li>Experience working in restaurant, hospitality, and or retail environment highly desirable. <br/><br/></li></ul><strong>Company Description<br/><br/></strong>eLink Recruiting Solutions, Inc., is an Atlanta based recruiting firm specializing in linking high quality talent to career opportunities in the Restaurant Industry within the US. Our talented team of Recruiters work hard to enhance our candidates experience by identifying high level career opportunities that compliment the talent, skills and abilities presented to our clients. Our goal is to maximize a successful hiring experience for both our clients and our candidates. For more information visit us at www.elinkrecruiting.com<br/><br/>eLink Recruiting Solutions, Inc., is an Atlanta based recruiting firm specializing in linking high quality talent to career opportunities in the Restaurant Industry within the US. Our talented team of Recruiters work hard to enhance our candidates experience by identifying high level career opportunities that compliment the talent, skills and abilities presented to our clients. Our goal is to maximize a successful hiring experience for both our clients and our candidates. For more information visit us at www.elinkrecruiting.com", "postedDate": "6 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002516519"}