{"jobTitle": "Movies Events Lead", "company": {"name": "Amazon", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "114,000.00/year - 188,500.00/year", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Software Development", "description": "Amazon Studios is seeking an experienced Events Lead to be a part of a team that strategizes, executes and manages events and experiences on behalf of the Prime Video movies team.\n\nYou will support the PR team dedicated to Prime Video Movies, producing in-person and virtual events from start to finish, managing elements including: concept and ideation, budgeting and oversight, onsite logistics, talent and guest experience, timelines, vendor procurement and management and communication with internal and external partners.\n\nThe ideal candidate has a minimum of 8 years of experience and has worked on events for studios, brands or agencies that are experts in the entertainment industry. They are experienced in communicating with content creators, talent representatives, agencies, executives and production partners. They can formulate and manage a budget, and give visibility into their process successfully. They are organized, thorough and are eager to contribute all that is necessary to making an event successful – including tasks that range from hiring an agency to plan an event, to maintaining and updating guest lists, to booking a venue themselves for an event to working a check-in table. They collaborate well with partners and other teams and come ready to contribute new and innovative event ideas. A good fit for the role has a candid and direct communication style, exceptionally high standards, a bias for action and extraordinary attention to detail. The Role will be based in Culver City.\n\nDuties & Responsibilities Will Include\n\nEvent Management: Aid in planning and execution of events both in-person and virtual. Manage vendors, timelines and budgets that often overlap. Work closely with publicity team to plan and execute assigned movies participation in major promotional and publicity events and special projects, including but not limited to domestic and international festivals, Venice, TIFF, SXSW, etc. Work closely with the events team to ensure coordinated and strategic plans for covering special events (premiere parties, stunts, etc.) for assigned movies.\n\nInternational and Amazon Liaison: Provide support for department-wide event requests from International Territories.\n\nSocial Media: Work closely with social media team to ensure coordinated outreach for events, stunts and mailers.\n\nOther job-related duties as assigned. Domestic and International travel is required in this role.\n\nBasic Qualifications\n\n* 8+ years of event/industry experience\n* Bachelor’s Degree\n* Experience organizing, planning, executing and staffing events at a studio or agency in the entertainment industry\n\nPreferred Qualifications\n\n* Demonstrated attention to detail\n* A passion for verbal and written communication\n* Excellent judgment, particularly in narrow timeframes\n* A passion for pop culture and entertainment\n* Experience producing events both in the US as well as in other countries\n* Willingness to work hard and roll up sleeves to get work done, even when at times it is outside the scope of the job\n\nBasic Qualifications\n\n* 7+ years of recent professional communications or public relations experience\n* Bachelor's degree in communications, public relations, or a related field\n\nPreferred Qualifications\n\n* Demonstrated attention to detail\n* A passion for verbal and written communication\n* Excellent judgment, particularly in narrow timeframes\n* A passion for pop culture and entertainment\n* Experience producing events both in the US as well as in other countries\n* Willingness to work hard and roll up sleeves to get work done, even when at times it is outside the scope of the job\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $114,000/year in our lowest geographic market up to $188,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.\n\n\nCompany - Amazon.com Services LLC\n\nJob ID: A2734744", "responsibilities": "Event Management: Aid in planning and execution of events both in-person and virtual. Manage vendors, timelines and budgets that often overlap. Work closely with publicity team to plan and execute assigned movies participation in major promotional and publicity events and special projects, including but not limited to domestic and international festivals, Venice, TIFF, SXSW, etc. Work closely with the events team to ensure coordinated and strategic plans for covering special events (premiere parties, stunts, etc.) for assigned movies.\n\nInternational and Amazon Liaison: Provide support for department-wide event requests from International Territories.\n\nSocial Media: Work closely with social media team to ensure coordinated outreach for events, stunts and mailers.\n\nOther job-related duties as assigned. Domestic and International travel is required in this role.", "qualifications": {"required": "8+ years of event/industry experience\nBachelor’s Degree\nExperience organizing, planning, executing and staffing events at a studio or agency in the entertainment industry", "preferred": "Demonstrated attention to detail\nA passion for verbal and written communication\nExcellent judgment, particularly in narrow timeframes\nA passion for pop culture and entertainment\nExperience producing events both in the US as well as in other countries\nWillingness to work hard and roll up sleeves to get work done, even when at times it is outside the scope of the job"}, "skills": ["Event Management", "Public Relations", "Communication", "Budgeting", "Vendor Management", "Talent Relations", "Event Planning", "Social Media", "International Relations", "Travel"], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002277727"}