{"jobTitle": "Sports-Minded Marketing Assistant", "company": {"name": "Eclipse California", "location": "Fullerton, CA"}, "location": "Fullerton, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "We are hiring for an entry-level full-time Marketing Assistant position. We feel sales and marketing is a critical part of how to exist in the world. We successfully analyze, adapt, and improve marketing and sales solutions for our clients. Many of our current clients are long-term partners, trusting us to understand the market and telecommunications industry to provide them with the engagement and results they seek.<br/><br/><strong>Marketing Assistant Responsibilities:<br/><br/></strong><ul><li>Introduce client products or services to potential consumers through direct communication and education</li><li>Expedite sales by providing knowledgeable insight and service solutions regarding the client's products, industry standards, benefits and discounts</li><li>Develop a strong understanding of the client's expectations through entry-level training and exposure to the local community's experience</li><li>Become efficient in utilizing client-provided technology devices to assist in providing efficient customer service</li><li>Regularly collaborate with the Director, Chief of Staff,and other Marketing Assistants to review metrics, sales goals, and ensure that client expectations are being met<br/><br/></li></ul><strong>Eclipse California cross-trains all Marketing Assistants within leadership development which includes:<br/><br/></strong><ul><li>Interviewing</li><li>Sales and marketing training fundamentals</li><li>Team building and mentoring</li><li>Entry-level marketing and sales consulting<br/><br/></li></ul><strong>Qualified Marketing Assistant candidates:<br/><br/></strong><ul><li>Must possess excellent interpersonal communication skills</li><li>Maintain a high level of professionalism &amp; integrity</li><li>Experience with public speaking for presenting to groups a plus</li><li>4-year degree preferred, not required</li><li>1-2 years of customer service</li><li>Demonstrated leadership ability</li><li>Demonstrated critical thinking and problem-solving skills<br/><br/></li></ul>Our team looks forward to welcoming a new Marketing Assistant with the drive to help others and succeed within the business!<br/><br/>Powered by JazzHR<br/><br/>UaSqtWMkJ2<br/><br/>", "jobFunction": "Marketing and Sales", "industry": "Internet Publishing", "postedDate": "2 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002896355"}