{"jobTitle": "Operations Assistant", "company": {"name": "APR Consulting", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "27.00/hr - 27.00/hr", "currency": "USD"}, "jobFunction": "Administrative, Manufacturing, and Production", "industry": "Administrative and Support Services, Manufacturing, and Office Administration", "description": "An aerospace client is looking for an Operations Assistant who will support the tooling manufacturing team in an admin role managing schedules, meetings, data analysis, presentations, and other similar tasks<br/>Location: El Segundo, CA 90245 (Onsite)<br/>Position: Operations Assistant<br/>Pay Rate: $27/hr. on W2<br/>Duration: 12 months or longer<br/>Responsibilities:<ul><li>Performs normal office functions such as setting up and maintaining files; interviewing callers and making proper referrals; arranging meetings and conferences; and receiving, referring, or answering mail.</li><li>Review drafts and finished documents for appropriate grammatical usage; answer questions relating to office operations and established policies and procedures.</li><li>Gathers, compiles, and reports on information relevant to supervisor's assignments.</li><li>May take and transcribe dictation.</li></ul><br/>What does a typical day look like?<ul><li>Project scheduling, status meetings, coordination with in-house and outside fabrication, design review status checks</li></ul><br/>Requirements:<ul><li>U.S. Citizenship required.</li><li>Minimum High School Diploma</li><li>2-5 years of experience in a Production administrative role</li><li>Proficient with PowerPoint and Excel.</li><li>General manufacturing knowledge</li><li>Detail-oriented and organization-focused</li><li>Problem-solving, good communication, ability to run meetings, and take good notes.</li></ul><br/>About our client:Our client is a world leader and premier innovator in aerospace, with over 100,000 top talent employees providing the most advanced products and technologies in the industry. With numerous awards and recognitions, they offer continuous growth, learning, and development for their employees.<br/>About APR:Since 1980 APR Consulting, Inc. has provided professional recruiting and contingent workforce solutions to a diverse mix of clients, industries, and skill sets nationwide.<br/>We are an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, age, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law.<br/>Don't miss out on this amazing opportunity! If you feel your experience is the match for this position please apply today and join our team. We look forward to working with you!", "responsibilities": "Performs normal office functions such as setting up and maintaining files; interviewing callers and making proper referrals; arranging meetings and conferences; and receiving, referring, or answering mail.\nReview drafts and finished documents for appropriate grammatical usage; answer questions relating to office operations and established policies and procedures.\nGathers, compiles, and reports on information relevant to supervisor's assignments.\nMay take and transcribe dictation.", "qualifications": {"required": "U.S. Citizenship required.\nMinimum High School Diploma\n2-5 years of experience in a Production administrative role\nProficient with PowerPoint and Excel.\nGeneral manufacturing knowledge\nDetail-oriented and organization-focused\nProblem-solving, good communication, ability to run meetings, and take good notes."}, "skills": ["PowerPoint", "Excel", "Manufacturing", "Communication", "Problem Solving"], "postedDate": "2 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002122743"}