{"jobTitle": "Vice President, Health", "company": {"name": "Edelman", "location": "Los Angeles, CA", "industry": "Public Relations and Communications Services"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "95,000 - 155,000", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Public Relations and Communications Services", "description": "*This role is open to considering applicants located in San Diego, CA*<br/><br/>Are you ready for an amazing opportunity in Health Communications? Interested in helping a Fortune 50 company establish and assert its leadership in Medical Technology? Eager to shape transformational communications fueled by innovation at the intersection of biology and technology?<br/><br/>We need people with passion to be at the forefront of healthcare and want to inform, inspire, and create meaningful interactions for healthcare professionals, patients, and caregivers alike. While essential to the category, our work isn’t just about science communications that rely on traditional venues such as medical meetings, clinical milestones, and regulatory approvals. We are creating unique, integrated programming, targeting consumers and healthcare professionals to drive discussion and motivate action.<br/><br/>In this account leadership role, you will join a broad-based, multi-functional team made up of client leaders,strategists,creatives, experiential marketers, as well as digital, social, and media relations experts. You’ll also have the chance to embed yourself in one of our fastest growing teams with great camaraderie and a unique culture that connects colleagues around the world.<br/><br/>Is it time to make a move and join a team that can introduce you to industry leaders who have insight and expertise across the communications spectrum? If so, let’s talk. You will learn and work with some of the best in the business. And, you’ll have fun, too.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Oversee financial and operational performance of multiple accounts simultaneously, ensuring quality work, deadline and budget adherence, and that plan creation and execution map to goals </li><li>Counsel clients and troubleshoot client and internal issues </li><li>Demonstrate writing excellence when crafting internal and client materials and correspondence </li><li>Demonstrate a strong understanding of healthcare product data and regulatory milestones </li><li>Set and lead both traditional and social media relations strategy, in partnership with our specialists </li><li>Use relationships with internal business partners, reporters and third-party influencers to meet client needs </li><li>Supervise staff by mentoring, motivating, coaching, consistently providing feedback, holding them accountable and conducting their reviews </li><li>Introduce clients to new capabilities, initiate new business processes, and display strong presentation skills during client pitches </li><li>Commit to continuous learning and improvement of leadership skills; set and pursue stretch goals </li><li>Demonstrate behaviors consistent with Edelman’s values and Code of Ethics and Business Conduct. <br/><br/><br/></li></ul><strong>Basic Qualifications:<br/><br/></strong><ul><li>At least 7 years of relevant experience in public relations and/or related fields including research, advertising, management consulting, media, and publishing </li><li>A bachelor’s degree or equivalent work experience <br/><br/><br/></li></ul><strong>Preferred Qualifications:<br/><br/></strong><ul><li>Experience effectively managing multiple sizable accounts (including financials) and serving as the daily client contact simultaneously </li><li>Should have superior written and verbal communication skills along with the proven ability to consistently make sound judgments and effectively motivate and manage teams </li><li>Should have experience working in healthcare, pharmaceutical, medical technology, or biotech communications <br/><br/><br/></li></ul>$95,000 - $155,000 a year<br/><br/>An employee’s pay position within the salary range will be based on several factors including, but not limited to, relevant education, qualifications, certifications, experience, skills, seniority, geographic location, performance, travel requirements, revenue-based metrics, any contractual agreements, and business or organizational needs. The range listed is just one component of DJEH’s total compensation package for employees. Other rewards may include annual bonuses, a Paid Time Off policy, and region-specific benefits.<br/><br/>Edelman is a global communications firm that partners with businesses and organizations to evolve, promote and protect their brands and reputations. Our 6,000 people in more than 60 offices deliver communications strategies that give our clients the confidence to lead and act with certainty, earning the trust of their stakeholders. Our honors include the Cannes Lions Grand Prix for PR; Advertising Age’s 2019 A-List; the Holmes Report’s 2018 Global Digital Agency of the Year; and, five times, Glassdoor’s Best Places to Work. Since our founding in 1952, we have remained an independent, family-run business. Edelman owns specialty companies Edelman Data &amp; Intelligence (DxI) and United Entertainment Group (entertainment, sports, lifestyle).<br/><br/>For more information please visit: www.edelman.com<br/><br/>Please follow this link (https://www.youtube.com/watch?v=Z7AKFCmQvtk) to view a short video about life at Edelman.<br/><br/>Edelman is committed to diversity, equity and inclusion and proud to be an equal opportunity employer. We welcome and encourage racially and ethnically diverse people, members of the LGBTQ community, veterans, parents, individuals with disabilities and members of any and all protected classes to apply.<br/><br/>Part of the Daniel J. Edelman Holdings family of companies, DJE Kinisi is built to serve a company working to address the world’s toughest health challenges and improve human health.<br/><br/>DJE Kinisi is committed to diversity, equity and inclusion and proud to be an equal opportunity employer. We welcome and encourage racially and ethnically diverse people, members of the LGBTQ community, veterans, parents, individuals with disabilities and members of any and all protected classes to apply.<br/><br/>", "responsibilities": "Oversee financial and operational performance of multiple accounts simultaneously, ensuring quality work, deadline and budget adherence, and that plan creation and execution map to goals Counsel clients and troubleshoot client and internal issues Demonstrate writing excellence when crafting internal and client materials and correspondence Demonstrate a strong understanding of healthcare product data and regulatory milestones Set and lead both traditional and social media relations strategy, in partnership with our specialists Use relationships with internal business partners, reporters and third-party influencers to meet client needs Supervise staff by mentoring, motivating, coaching, consistently providing feedback, holding them accountable and conducting their reviews Introduce clients to new capabilities, initiate new business processes, and display strong presentation skills during client pitches Commit to continuous learning and improvement of leadership skills; set and pursue stretch goals Demonstrate behaviors consistent with Edelman’s values and Code of Ethics and Business Conduct.", "qualifications": {"required": "At least 7 years of relevant experience in public relations and/or related fields including research, advertising, management consulting, media, and publishing A bachelor’s degree or equivalent work experience", "preferred": "Experience effectively managing multiple sizable accounts (including financials) and serving as the daily client contact simultaneously Should have superior written and verbal communication skills along with the proven ability to consistently make sound judgments and effectively motivate and manage teams Should have experience working in healthcare, pharmaceutical, medical technology, or biotech communications"}, "skills": [], "postedDate": "3 days ago", "applicationDeadline": "", "benefits": "An employee’s pay position within the salary range will be based on several factors including, but not limited to, relevant education, qualifications, certifications, experience, skills, seniority, geographic location, performance, travel requirements, revenue-based metrics, any contractual agreements, and business or organizational needs. The range listed is just one component of DJEH’s total compensation package for employees. Other rewards may include annual bonuses, a Paid Time Off policy, and region-specific benefits.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4002867670"}