{"jobTitle": "Assistant Manager, Merchandising - The Pike Outlets", "company": {"name": "Gap", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Retail", "description": "Gap has always been about optimistic American style. Starting with our very first store on Ocean Avenue in San Francisco, opened almost 50 years ago by Doris and Don Fisher. The thread that’s run through those five decades is the phenomenal people that make up our brand - our employees and our customers. People who are rooted in the legacy that makes Gap what it is, but who are also focused on the future. People who want to leave the world better than they found it.<br/><br/>We’ve built our brand on staying true to our roots while always being out in front of what’s next. If you want to be part of an iconic American brand, and help lead the way for where we’re headed, we’d love to have you join us.<br/><br/>As an Assistant Manager, you set the tone for the store and the team and help bring our brand to life for our customers. You’re responsible for driving profitable sales growth through all aspects of the store including; customer and product operations, merchandising, and talent development. You are responsible for supporting the execution of the store strategy to achieve performance goals. Through collaboration with your General Manager and/or Assistant General Manager, you will teach and coach behaviors to Leads, Experts and Brand Associates to cultivate a high performing team to deliver a best-in-class experience to our customers.<br/><br/>What You'll Do<br/><br/><ul><li>Support strategies and processes to drive store sales and deliver results through a customer centric mindset.</li><li>Recruit, hire and develop highly productive Brand Associate and Expert teams.</li><li>Own assigned area of responsibility.</li><li>Implement action plans to maximize efficiencies and productivity.</li><li>Perform Service Leader duties.</li><li>Ensure consistent execution of standard operating procedures.</li><li>Represent the brand and understand the competition and retail landscape.</li><li>Promote community involvement.</li><li>Leverage omni-channel to deliver a frictionless customer experience.</li><li>Ensure all compliance standards are met.<br/><br/></li></ul>Who You Are<br/><br/><ul><li>A current or former retail employee with 1-3 years of retail management experience.</li><li>A high school graduate or equivalent.</li><li>A good communicator with the ability to effectively interact with customers and your team to meet goals.</li><li>Passionate about retail and thrive in a fastpaced environment.</li><li>Driven by metrics to deliver results to meet business goals.</li><li>Determined to effectively lead and inspire others to learn and grow through coaching and mentoring.</li><li>Agreeable to work a flexible schedule to meet the needs of the business, including holiday, evening, overnight and weekend shifts.</li><li>Able to utilize retail technology.</li><li> Able to maneuver around the sales floor, stockroom and office and lift up to 30 pounds.</li><li>Ability to travel as required.<br/><br/></li></ul>Benefits at Gap<br/><br/><ul><li>Merchandise discount for our brands: 50% off regular-priced merchandise at Old Navy, Gap, Banana Republic and Athleta, and 30% off at Outlet for all employees.</li><li>One of the most competitive Paid Time Off plans in the industry.*</li><li>Employees can take up to five “on the clock” hours each month to volunteer at a charity of their choice.*</li><li>Extensive 401(k) plan with company matching for contributions up to four percent of an employee’s base pay.*</li><li>Employee stock purchase plan.*</li><li>Medical, dental, vision and life insurance.*</li><li>See more of the benefits we offer.</li><li>For eligible employees<br/><br/></li></ul>Gap Inc. is an equal-opportunity employer and is committed to providing a workplace free from harassment and discrimination. We are committed to recruiting, hiring, training and promoting qualified people of all backgrounds, and make all employment decisions without regard to any protected status. We have received numerous awards for our long-held commitment to equality and will continue to foster a diverse and inclusive environment of belonging. In 2022, we were recognized by Forbes as one of the World's Best Employers and one of the Best Employers for Diversity.<br/><br/>Hourly Range: $19.00 - $26.15 USD<br/><br/>Employee pay will vary based on factors such as qualifications, experience, skill level, competencies and work location. We will meet minimum wage or minimum of the pay range (whichever is higher) based on city, county and state requirements.<br/><br/>Please note that effective, June 30, 2022, Gap Inc. will no longer require any of its employees to wear face masks or require proof of COVID vaccination, unless required by local or state/provincial mandates or as part of Gap Inc’s quarantine guidelines after being exposed to or testing positive for COVID. Therefore, please disregard any language in any job posting that refers to Gap Inc.’s face mask and proof of vaccination policy as said policy is no longer effective.", "responsibilities": "As an Assistant Manager, you set the tone for the store and the team and help bring our brand to life for our customers. You’re responsible for driving profitable sales growth through all aspects of the store including; customer and product operations, merchandising, and talent development. You are responsible for supporting the execution of the store strategy to achieve performance goals. Through collaboration with your General Manager and/or Assistant General Manager, you will teach and coach behaviors to Leads, Experts and Brand Associates to cultivate a high performing team to deliver a best-in-class experience to our customers.", "qualifications": {"required": "A current or former retail employee with 1-3 years of retail management experience. A high school graduate or equivalent. A good communicator with the ability to effectively interact with customers and your team to meet goals. Passionate about retail and thrive in a fastpaced environment. Driven by metrics to deliver results to meet business goals. Determined to effectively lead and inspire others to learn and grow through coaching and mentoring. Agreeable to work a flexible schedule to meet the needs of the business, including holiday, evening, overnight and weekend shifts. Able to utilize retail technology. Able to maneuver around the sales floor, stockroom and office and lift up to 30 pounds. Ability to travel as required.", "preferred": ""}, "skills": [], "postedDate": "6 days ago", "benefits": "Merchandise discount for our brands: 50% off regular-priced merchandise at Old Navy, Gap, Banana Republic and Athleta, and 30% off at Outlet for all employees. One of the most competitive Paid Time Off plans in the industry.* Employees can take up to five “on the clock” hours each month to volunteer at a charity of their choice.* Extensive 401(k) plan with company matching for contributions up to four percent of an employee’s base pay.* Employee stock purchase plan.* Medical, dental, vision and life insurance.* See more of the benefits we offer. For eligible employees", "remoteWork": "No", "salary": {"amount": "19.00 - 26.15", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4002970266"}