{"jobTitle": "Personal Assistant", "company": {"name": "Insight Global", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Associate", "salary": {"amount": "30.00/hr - 35.00/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Entertainment Providers", "description": "Insight Global is seeking an exceptionally organized and resourceful Personal Assistant / Concierge Services Representative to support a dynamic and creative individual. The ideal candidate will possess a blend of professionalism, discretion, and creativity, ensuring the smooth management of all personal affairs under the guidance of the Lead Executive Assistant This role requires flexibility, a proactive mindset, and the ability to handle multiple tasks efficiently.", "responsibilities": "Support and manage daily schedule, appointments, and travel arrangements. Assist with event planning and coordination, including social gatherings and business meetings. Handle confidential and sensitive information with utmost discretion. Organize and manage email correspondence, phone calls, and mail. Prepare reports, presentations, and other documents as needed. Maintain accurate digital records and filing systems. Conduct research and provide summaries on various topics. Assist in the coordination and execution of creative projects and initiatives. Liaise with artists, designers, and other creative professionals. Help brainstorm and develop new ideas and concepts. Support in organizing domestic and international travel, including accommodations, itineraries, and transportation. Handle bill payments, invoicing, and financial record-keeping. Act as a liaison between the lead assistant and various vendors and business associates. Ensure professional and effective written and verbal communication channels are maintained.", "qualifications": {"required": "Proven experience as a personal assistant, executive assistant, or similar role supporting high net worth individuals. Exceptional organizational and time-management skills. Strong written and verbal communication abilities. High level of discretion and confidentiality. Ability to multitask and prioritize effectively in a fast-paced environment. Proficiency in Google Suite and other relevant software - monday.com. Expert in Excel and Google Slides Familiarity with processional organization. Flexible schedule and availability to travel, both domestic and international, as needed - valid driver's license and passport", "preferred": ""}, "skills": ["Google Suite", "Excel", "Google Slides", "Event Planning", "Travel Arrangements", "Research", "Communication", "Organization", "Time Management"], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002876183"}