{"jobTitle": "Demand Supply Planner", "company": {"name": "IPD (Industrial Parts Depot, LLC)", "location": "Carson, CA"}, "location": "Carson, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Supply Chain", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "<strong>SUMMARY OF POSITION: </strong>The Demand Supply Planner is responsible for best-in-class demand planning, forecasting, and SIOP process execution. Duties include planning, scheduling, and coordinating inventory flow from supplier to customer, ensuring timely arrival according to schedule and specifications. The role involves collaborating with various departments to meet customer needs, negotiating with vendors, and coordinating with customs agencies. This position operates under the Director's guidance and adheres to Storm Industries' Core Values.", "responsibilities": "<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES</strong><br/>\n<br/>\n<strong>Regular Functions include:</strong><br/>\n<ul><li>Creates, adjusts, and monitors SKU-level demand planning forecasts based on customer demand to support the annual operating plan, working cross-functionally with Sales, Supply Chain, and Engineering using existing demand planning software.</li></ul><br/>\n<ul><li>Helps develop Sales &amp; Operating Plan summaries, including demand, inventory, and production data to be reviewed by the SIOP team every month with the ability to lead meetings. </li></ul><br/>\n<ul><li>Works closely with IT in reviewing Planning Software MRP parameters and implementing changes as needed.</li></ul><br/>\n<ul><li>Reviews integration requirements to ensure the planning software as well as the ERP systems are in sync &amp; correctly translating supply needs based on customer demand.</li></ul><br/>\n<ul><li>Develops new techniques/tools and being innovative in improving forecast accuracy and managing forecast errors.</li></ul><br/>\n<ul><li>Ensures SIOP metrics are met, including On Time Delivery, Inventory Turns, Supplier Quality, etc.</li></ul><br/>\n<ul><li>Manages Inventory turnover across Domestic and International sites, deciding on internal transfers/obsolescence possibilities and/or shipment rerouting as needed to achieve optimal levels.</li></ul><br/>\n<ul><li>Anticipates possible obstacles in meeting customer orders and implements countermeasures before they become a problem. </li></ul><br/>\n<ul><li>Reviews and expedites shortages under the area of responsibility.</li></ul><br/>\n<ul><li>Provides timely order status to the Customer Service, Sales, and Shipping teams through daily reports, verbally, or by email as requested. </li><li>Schedules purchases as the system requires promptly and ensures purchase orders are received promptly.</li></ul><br/>\n<ul><li>Assists with purchasing products, with guidance from the Director, to meet schedules and quality requirements.</li></ul><br/>\n<ul><li>Other duties as required.</li></ul><br/>\n<br/>\n<strong>Periodic Functions include:</strong><br/>\n<ul><li>Create and coordinate purchase orders and expedite orders with Suppliers as needed</li><li>Prioritize incoming material for any needed testing and expedite any urgent material through the receiving/inspection process. </li><li>Travel will be required (approx. up to 10%).</li></ul><br/>\n<br/>\n<strong>Leadership Responsibilities:</strong> <br/>\n<ul><li>Does not supervise anyone</li></ul><br/>\n<br/>\n<strong>MINIMUM QUALIFICATIONS</strong><br/>\n<br/>\n<strong>Education and/or Experience:</strong> <br/>\n<ul><li>Bachelor’s degree related in Operations/Supply Chain Management/ Manufacturing or equivalent experience</li><li>Minimum 4 years of experience in planning and scheduling production in a manufacturing environment, including extensive analytical work and knowledge of MRP. </li></ul><br/>\n<br/>\n<strong>Professional/Technical Training and Skills include:</strong><br/>\n<ul><li>Strong working ability with Microsoft Office Suite (Excel, Word, Outlook, PowerPoint). Must have advanced skills in Excel including working knowledge of pivot tables and data mining. </li><li>Experience with ERP software, Great Plains and Stock IQ an asset</li><li>Basic Math skills</li><li>Able to define problems, collect data, establish facts and draw valid conclusions</li></ul><br/>\n<br/>\n<strong>Licenses and Certifications include:</strong><br/>\n<ul><li>ASCM: CPIM or CSCP preferred</li></ul><br/>\n<br/>\n<strong>CORE VALUES:</strong><br/>\n<ul><li>Ability to actively promote Storm Core Values of: </li><li>Building Enduring Customer Value </li><li>Passionately Pursue Excellence </li><li>Works as a Team/Win as a Team </li><li>Optimize Results </li><li>Work with Integrity/ Build Trust</li></ul>", "qualifications": {"required": "Bachelor’s degree related in Operations/Supply Chain Management/ Manufacturing or equivalent experience, Minimum 4 years of experience in planning and scheduling production in a manufacturing environment, including extensive analytical work and knowledge of MRP., Strong working ability with Microsoft Office Suite (Excel, Word, Outlook, PowerPoint). Must have advanced skills in Excel including working knowledge of pivot tables and data mining., Experience with ERP software, Great Plains and Stock IQ an asset, Basic Math skills, Able to define problems, collect data, establish facts and draw valid conclusions", "preferred": "ASCM: CPIM or CSCP preferred"}, "skills": ["MRP", "Demand Planning", "Forecasting", "SIOP", "Inventory Management", "Supply Chain", "Customer Service", "Sales", "Engineering", "Microsoft Office Suite", "Excel", "Pivot Tables", "Data Mining", "ERP Software", "Great Plains", "Stock IQ", "Basic Math Skills", "Problem Solving", "Data Collection", "Analysis", "ASCM", "CPIM", "CSCP"], "postedDate": "2 days ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Tuition assistance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002112058"}