{"jobTitle": "Account Executive", "company": {"name": "Oleria", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "About: Are you an experienced and ambitious enterprise Account Executive looking to make a significant impact in the cybersecurity industry? Oleria is an enterprise cybersecurity startup founded by notable industry senior leaders Jim Alkove and Jagadeesh Kunda, with deep security, data, and SaaS experience building and securing some of the world’s largest platforms and products used by billions of people worldwide every day. Oleria has received over $41M in funding from Evolution Equity Partners, Salesforce Ventures, Tapestry VC, Zscaler, and other technology luminaries. Oleria sets business free. For more information, please visit www.oleria.com and follow Oleria on LinkedIn and Twitter. We recognize that identity-based attacks on software as a service (SaaS) applications are becoming increasingly common, highlighting the importance of addressing access risks to prevent data breaches. Traditional access management methods are human-intensive and often have significant blind spots, making it challenging to manage access risks effectively. At Oleria, we are on a mission to revolutionize access control tooling for enterprise SaaS applications, aiming to reduce the opportunity and scope of data breaches drastically. Our esteemed target customers consist of Fortune 500 corporations and public sector organizations, making your contributions vital to improving the security of data for millions of people around the world. Above all, you have a bias for action. You love engaging with customers and constantly learning how to improve our go-to-market approach. And, you love the satisfaction you'll receive from knowing that your contributions are directly improving the security for millions of people in the world. Job Overview: As one of our founding Account Executives, you will be pivotal in setting the standard and building the framework for this key position within our company. Your core competencies should blend strong business acumen with a customer-obsessed focus, along with technical skills and a strategic value mindset. You will architect deep client relationships, both at the C Level and throughout key departments, that not only resonate with the differentiated value proposition of Oleria’s solutions but also translate into sales performance that consistently outperforms expectations. While you will be primarily accountable for pipeline creation &amp; velocity and execution of new sales, you will embrace a long-term view of our customers’ success, satisfaction, retention and growth. This position offers an unparalleled opportunity to interface directly with our co-founders and leadership team, particularly as we build and scale our strategies for customer-facing operations. In essence, this is an opportunity to be an integral part of a dynamic team shaping the future of cybersecurity solutions. Responsibilities:<br/><br/><ul><li>Develop a strong understanding &amp; command of the IAM/IGA category and evangelize how Oleria’s solutions differentiate and provide quantifiable customer value</li><li>Foster trusted customer partnerships through exceptional interpersonal skills with C-Level presence that allow you to engage, advise, and develop credibility and rapport with CISO and other key executives and their teams</li><li>Develop and execute full-cycle sales motions to generate a healthy qualified pipeline (leveraging both warm leads and strategic whitespace prospecting) as well as execute closed business that consistently meets or exceeds sales goals</li><li>Create gold standard investment proposals that align the Oleria solution’s with strategic business value</li><li>Partner with Oleria’s marketing team and partner ecosystem that allow Oleria to maximize our market opportunity</li><li>Build and maintain a disciplined, accurate pipeline with forecasting precision on opportunities &amp; requirements to close and consistently increase win rates</li><li>Build stellar working relationships across the Oleria team to be a voice of the customer and ensure we deliver customer success and value, thereby achieve long-term customer satisfaction, retention, and growth<br/><br/><br/></li></ul>Skills &amp; Qualifications<br/><br/><ul><li>6+ years selling enterprise software solutions in the cybersecurity space with a proven track record of effectively executing full cycle 200k to 1M+ ACV deals to large enterprise customers</li><li>Proven experience navigating complex sales cycles and executive selling to all levels of an enterprise organization to leverage strong customer relationships, to close deals and achieve sales goals</li><li>A knowledgeable, consultative and business value approach to engaging with customers across multiple departments</li><li>Compelling storytelling abilities with adept in-person and remote product presentation and demo skills</li><li>Ability to create effective customer engagements vs. static playbooks and product talk tracks</li><li>Expert level written, verbal and presentation communication skills</li><li>A positive, resilient, accountable and results-oriented mindset</li><li>Successful experience thriving in a dynamic, hypergrowth environment</li><li>Bachelor’s degree preferred, but not required</li><li>Expected Travel: 25-50%<br/><br/><br/></li></ul>What we offer:<br/><br/><ul><li>Competitive salary, equity, and benefits package</li><li>Opportunities for professional growth and advancement in a fast-growing company</li><li>The chance to work directly with our co-founders and contribute meaningfully to shaping the company’s direction</li><li>A collaborative and dynamic work environment with a dedicated team of professionals<br/><br/><br/></li></ul>The on target earnings offered for this role, depending on individual candidate experience and location, is $225,000 to $300,000 including base salary and commission.", "responsibilities": "Develop a strong understanding &amp; command of the IAM/IGA category and evangelize how Oleria’s solutions differentiate and provide quantifiable customer value\nFoster trusted customer partnerships through exceptional interpersonal skills with C-Level presence that allow you to engage, advise, and develop credibility and rapport with CISO and other key executives and their teams\nDevelop and execute full-cycle sales motions to generate a healthy qualified pipeline (leveraging both warm leads and strategic whitespace prospecting) as well as execute closed business that consistently meets or exceeds sales goals\nCreate gold standard investment proposals that align the Oleria solution’s with strategic business value\nPartner with Oleria’s marketing team and partner ecosystem that allow Oleria to maximize our market opportunity\nBuild and maintain a disciplined, accurate pipeline with forecasting precision on opportunities &amp; requirements to close and consistently increase win rates\nBuild stellar working relationships across the Oleria team to be a voice of the customer and ensure we deliver customer success and value, thereby achieve long-term customer satisfaction, retention, and growth", "qualifications": {"required": "6+ years selling enterprise software solutions in the cybersecurity space with a proven track record of effectively executing full cycle 200k to 1M+ ACV deals to large enterprise customers\nProven experience navigating complex sales cycles and executive selling to all levels of an enterprise organization to leverage strong customer relationships, to close deals and achieve sales goals\nA knowledgeable, consultative and business value approach to engaging with customers across multiple departments\nCompelling storytelling abilities with adept in-person and remote product presentation and demo skills\nAbility to create effective customer engagements vs. static playbooks and product talk tracks\nExpert level written, verbal and presentation communication skills\nA positive, resilient, accountable and results-oriented mindset\nSuccessful experience thriving in a dynamic, hypergrowth environment\nBachelor’s degree preferred, but not required\nExpected Travel: 25-50%"}, "skills": ["Cybersecurity", "Sales", "Business Development", "Enterprise Software", "Customer Relationship Management", "Product Presentation", "Storytelling", "Communication", "Leadership"], "postedDate": "1 week ago", "benefits": "Competitive salary, equity, and benefits package\nOpportunities for professional growth and advancement in a fast-growing company\nThe chance to work directly with our co-founders and contribute meaningfully to shaping the company’s direction\nA collaborative and dynamic work environment with a dedicated team of professionals", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002081052"}