{"jobTitle": "Account Executive, Group Sales", "company": {"name": "Los Angeles Kings", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Entertainment Providers", "description": "For more than 20 years, AEG has played a pivotal role in transforming sports and live entertainment. Annually, we host more than 160 million guests, promote more than 10,000 shows and present more than 22,000 events around the world. We are committed to innovation, artistry, and community, and leverage the power of our 300+ venues, leading sports franchises, marquee music brands, integrated entertainment districts, premier ticketing platform and global sponsorship activations, to create memorable moments that give the world reason to cheer.<br/><br/>Our business is interwoven with the human mind and heart, and we strive to build a diverse and inclusive company that reflects the artists, athletes, and fans that we host; reach beyond traditional boundaries to support the communities in which we operate; and minimize our impact on the environment by adopting sustainable practices throughout our business operations.<br/><br/>If you want to be challenged to up your game and make a difference, then join us in giving the world reason to cheer!<br/><br/><strong>Job Description<br/><br/></strong>The Account Executive, Group Sales is extremely proficient in selling group tickets to LA Kings games to various organizations and companies. This individual would seek to develop business relationships to gain revenue by selling group tickets to Los Angeles businesses, specific niche communities and community groups for the LA Kings. They will work during regular office hours and/or event hours including evenings, weekends, and holidays. A core function of this role is proactively and efficiently generating new revenue through outbound calls, client meetings, customized emails, prompt responses to inbound calls, team-related events, upselling, cross-selling, and generating referrals.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Generate group ticket revenue using all sales methods, including cold calls, face to face appointments, arena tours, prospecting, and networking</li><li>Manage accounts to exceed established sales goals; Conduct high amounts of new business calls daily</li><li>Plan, develop, and execute strategic group sales promotions and theme nights by creating a unique offer and targeted sales campaign to a specific niche group or community.</li><li>Prospecting in order to generate new business relationships; responsible for hosting client meetings and potential client presentations on a regular basis</li><li>Provide prompt, thorough, and courteous responses to all inbound &amp; outbound customer communication – phone calls, emails, mail, etc.; Maintain high level of customer service to existing and new clients</li><li>Perform “game day” responsibilities, including entertaining clients and prospects, as well as working ticket sales booths and tables</li><li>Attend team, community, and other events for purpose of maximizing sales opportunities</li><li>Provide sales reports and contact status back to management on a daily and weekly basis during Goal Setting Meetings<br/><br/><br/></li></ul><strong>SPECIFIC JOB KNOWLEDGE, SKILL AND ABILITY<br/><br/></strong>The Account Executive, Group Sales must possess the following knowledge, skills and abilities and be able to explain and demonstrate that he or she can perform the essential functions of the job, with or without reasonable accommodation, using some other combination of skill and abilities:<br/><br/><ul><li>Ability to provide an outstanding level of customer service</li><li>Outstanding listening, written, and verbal communication skills</li><li>Quality presentation skills – ability to create, analyze, interpret, and present reports and correspondence</li><li>Highly organized, resourceful, detailed-oriented, quick learner and time management skills</li><li>Ability to professionally communicate and interact with all levels of management</li><li>Proficient with Microsoft Word, Excel, and Outlook; ability to learn required business systems</li><li>Ability to professionally handle highly sensitive and confidential information</li><li>Knowledge in AXS Back Office, Microsoft Dynamics or other ticketing and CRM software preferred<br/><br/><br/></li></ul><strong>QUALIFICATION STANDARDS<br/><br/></strong>Education:<br/><br/><ul><li>A minimum education level of: BA/BS Degree (4-year)<br/><br/><br/></li></ul>Experience:<br/><br/><ul><li>A minimum of 2-4 years of related experience<br/><br/><br/></li></ul>Pay Scale: $22.84/hr + Commission<br/><br/>AEG reserves the right to change or modify the employee’s job description whether orally or in writing, at any time during the employment relationship. AEG may require an employee to perform duties outside his/her normal description.<br/><br/>", "postedDate": "2 days ago", "skills": ["Customer Service", "Communication", "Presentation Skills", "Microsoft Word", "Microsoft Excel", "Microsoft Outlook", "Time Management", "CRM", "Ticketing", "Sales", "Business Development", "Networking", "Prospecting", "Cold Calling", "Account Management", "Event Management", "Report Writing", "Data Analysis", "Teamwork", "Problem Solving", "Organization", "Detail Oriented", "Quick Learner", "Professionalism", "Confidentiality", "Customer Focus", "Relationship Building", "Sales Management", "Goal Setting", "Strategic Planning", "Marketing", "Advertising", "Public Relations", "Social Media", "Event Planning", "Hospitality", "Sports", "Entertainment", "Live Events", "Ticketing Systems", "CRM Software", "Microsoft Dynamics", "AXS Back Office", "Sales Reporting", "Data Entry", "Data Analysis", "Communication Skills", "Presentation Skills", "Customer Service Skills", "Time Management Skills", "Problem Solving Skills", "Organization Skills", "Detail Oriented Skills", "Quick Learner Skills", "Professionalism Skills", "Confidentiality Skills", "Customer Focus Skills", "Relationship Building Skills", "Sales Management Skills", "Goal Setting Skills", "Strategic Planning Skills", "Marketing Skills", "Advertising Skills", "Public Relations Skills", "Social Media Skills", "Event Planning Skills", "Hospitality Skills", "Sports Skills", "Entertainment Skills", "Live Events Skills", "Ticketing Systems Skills", "CRM Software Skills", "Microsoft Dynamics Skills", "AXS Back Office Skills", "Sales Reporting Skills", "Data Entry Skills", "Data Analysis Skills"], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002130236"}