{"jobTitle": "Assistant Manager - Entry Level", "company": {"name": "Atlas Marketing Solutions", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Internet Publishing", "description": "With decades of collective experience in direct marketing and sales, our company is in a position to advise, plan and execute campaigns with a focused objective to get the best possible returns for our clients. We adapt to changing market and sales trends by doing all it takes to influence our client's target audience, and are on the lookout for an Entry Level Assistant Manager to assist with our growing firm.<br/><br/>We'll help you acquire valuable experience from in-depth training and mentoring to manager support and networking opportunities and broaden your skill sets. We are committed to a diverse, inclusive, equitable and accessible work environment. By taking cues from each other's differences, we acquire strength through our people and our approach.<br/><br/>Entry Level Assistant Manager Responsibilities :<br/><br/><ul><li>Maintain customer satisfaction through developmental direct marketing and brand awareness strategies</li><li>Work with customers hands on and be involved in each sales process to ensure superior customer service is provided</li><li>Participate in classroom training sessions and product knowledge seminars to increase skill set in sales, customer service, and leadership development</li><li>Educateconsumers on new marketing services or promotions to increase sales revenue generated</li><li>Qualify buyers by using the buyer requirement standards and company policies</li><li>Enhance our client's reputation by using top-notch customer service skills<br/><br/></li></ul>Entry Level Assistant Manager Requirements :<br/><br/><ul><li>1-2 years ofsales, or customer service experience is a bonus</li><li>Strong desire to continue learning and developing professional skill sets</li><li>Exceptional personableand communication skills</li><li>Student mentality and the desire to continue learning</li><li>Impeccable work ethic</li><li>Able to problem-solve effectively</li><li>Ability to work in a fast-paced marketing and sales environment</li><li>Comfortable speaking in front of both small and large groups</li><li>Ability to work 40+ hours a week and commute to our office located in North Hollywood<br/><br/></li></ul>Powered by JazzHR<br/><br/>rS0AYVSPlK<br/><br/>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002201553"}