{"jobTitle": "Production Coordinator (Fine Jewelry)", "company": {"name": "Kinn Studio", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Retail Luxury Goods and Jewelry", "description": "Kinn is looking for a full time Production Coordinator to join our growing team. The Production Coordinator is responsible for managing schedules, coordinating with various departments, assisting with quality control, and handling logistical tasks to support the production team. This role involves direct interaction with manufacturers, including picking up and dropping off jewelry, to ensure timely and secure delivery of materials and finished products.\n\nWe're a growing company and are building this foundation from the ground up. We're drawn to people who are talented to contribute, flexible enough to accept the daily challenges. Building is hard, but the opportunity is ultimately more rewarding: the beauty of being at the beginning is that each person can make meaningful contributions to not only the day to day and year to year success of the business.\n\nMust be able to work full time from the downtown Los Angeles studio.\n\n**Key Responsibilities:**\n\nManufacturer & Supplier Coordination:\n\n* Visit manufacturers directly to pick up and drop off jewelry, ensuring secure and timely transportation.\n* Maintain strong relationships with manufacturers to facilitate smooth production processes.\n* Liaise with suppliers to ensure timely delivery of raw materials and components.\n* Coordinate with supplier relationships and address any issues related to material quality or delivery schedules.\n* Safely transport jewelry pieces, gemstones, and other valuable items between the company’s locations, suppliers, manufacturers, and clients.\n* Pick up and deliver jewelry pieces for repair, resizing, or customization.\n* Collect raw materials and components from suppliers and deliver finished products to our studio.\n\nDesign & Production Scheduling:\n\n* Support in developing and maintaining production schedules to meet deadlines and customer demands.\n* Coordinate with design, ops, and marketing teams to align production plans with business goals.\n* Monitor and track the progress of production activities to ensure timelines are met.\n* Coordinate the workflow between different departments, including design, manufacturing, and operations. \n\nQuality Control:\n\n* Maintain quality control processes to ensure that all products meet the company’s high standards.\n* Assist in inspecting products at various stages of production.\n* Address and resolve any quality issues that arise during the production process.\n\nProcess Improvement:\n\n* Identify opportunities for improving production processes and efficiency.\n* Implement best practices and lean manufacturing principles to optimize production operations.\n\nCommunication and Liaison:\n\n* Act as a point of contact between the production team and other departments.\n* Facilitate effective communication to ensure alignment on production goals and timelines.\n* Maintain confidentiality and discretion when handling high-value items and sensitive information.", "postedDate": "2 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002630025"}