{"jobTitle": "Grocery Order Writer (Buyer / Inventory Replenishment)", "company": {"name": "Whole Foods Market", "location": "Huntington Beach, CA"}, "location": "Huntington Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Retail", "description": "Orders, replenishes and merchandises grocery products and participate in WFM program for purchasing and promotions. Monitors inventory control and replenishes product based upon WFM ordering standards. Assists in organizing and developing promotional displays and maintaining OTS standards. All Whole Foods Market Retail jobs require ensuring a positive company image by providing courteous, friendly, and efficient service to customers and Team Members at all times. All positions must be performed in accordance with team and store Standard Operating Procedures. Further, Team Members must be prepared and able to perform the duties inherent in other Team Member job descriptions. All positions must strive to support WFM core values and goals, promote national, regional, and store programs and initiatives, and ensure adherence to all applicable health and safety regulations including Food Safety and regulatory duties required in the department.<br/><br/>Job Responsibilities<br/><br/><ul><li>Completes Order Writer training</li><li>Replenishes products through proper buying procedures.</li><li>Orders perishable and/or non-perishable grocery products and maintains appropriate back stock levels.</li><li>Monitors and acts upon open PO reports for both purchases and credits in an accurate and timely manner.</li><li>Controls spoilage/shrink; participates in inventory and cycle counting.</li><li>Completes spoilage and all other inventory management processes, sampling, temperature, and sweep worksheets as required.</li><li>Ensures orders for product are timely and accurate to monitor inventory turns.</li><li>Oversees customer special order procedure.</li><li>Analyzes and controls product transfers, waste, and spoilage.</li><li>Supports leadership in conducting inventories.</li><li>Maintains financial profitability by meeting and exceeding purchasing and sales targets.</li><li>Arrives to work station on time, appropriately groomed, dressed and ready to work; works all scheduled shifts and attends required trainings and meetings.</li><li>Provides excellent customer service, addresses needs of customers in a timely and effective manner and models suggestive selling techniques; answers phones and pages promptly and courteously.</li><li>Maximizes sales potential through effective and proper procedures for prepping, storing, rotating, stocking, and merchandising product.</li><li>Follows and complies, or ensures compliance, with established procedures, including Weights and Measures, health and sanitation, and safe work practices.</li><li>Maintains, or ensures maintenance of, a clean and sanitary working and shopping environment; maintains equipment in accordance with WFM cleanliness and safety standards.</li><li>Performs opening, mid, and closing duties as assigned; ensures accuracy of signs and pricing.</li><li>Immediately reports safety hazards and violations.</li><li>Performs other duties as assigned by store, regional, or national leadership.<br/><br/></li></ul>Job Skills<br/><br/><ul><li>Comprehensive knowledge of grocery products.</li><li>Working knowledge and application of all grocery merchandising expectations.</li><li>Ability to educate team on product knowledge and convey enthusiasm.</li><li>Strong basic math skills.</li><li>Knowledge and ability to use computer programs such as Microsoft Word, Excel, Outlook and ordering systems.</li><li>Strong to excellent communication skills and willingness to work as part of a team.</li><li>Ability to deliver information in a clear and respectable manner to fellow Team Members, customers, and vendors.</li><li>Ability to meet customer service expectations and standards in all interactions with customers, vendors, and Team Members.</li><li>Ability to follow directions and procedures; effective time management and organization skills.</li><li>Passion for natural foods and the mission of Whole Foods Market.</li><li>Strong work ethic and ability to work in a fast-paced environment with a sense of urgency.</li><li>Understanding of and compliance with WFM quality goals.<br/><br/></li></ul><strong>Experience<br/><br/></strong><ul><li>12+ months retail experience.<br/><br/></li></ul>Physical Requirements/Working Conditions<br/><br/><ul><li>Must be able to lift 50 pounds.</li><li>In an 8-hour work day: standing/walking 6-8 hours.</li><li>Hand use: single grasping, fine manipulation, pushing and pulling.</li><li>Work requires the following motions: bending, twisting, squatting and reaching.</li><li>Exposure to FDA approved cleaning chemicals.</li><li>Exposure to temperatures: 90 degrees Fahrenheit.</li><li>Ability to work in a wet and cold environment.</li><li>Ability to work a flexible schedule including nights, weekends, and holidays as needed.</li><li>Ability to use tools and equipment, including box cutters, electric pallet jacks, and other heavy machinery.<br/><br/></li></ul>Note: The purpose of this document is to provide a general summary of essential responsibilities for the position and is not meant as an exhaustive list. This document does not reflect all job duties or requirements for every position. Requirements build as one progresses through the job levels, so any job duties required at a lower level may be required at the higher level in addition to the duties listed for that higher level. Duties, assignments, and other responsibilities may differ for similar positions based on business conditions, departmental or geographic location, and/or needs for the particular position. An individual must demonstrate successful performance in their current position before being considered for promotion. In addition, in order to promote into a higher-level position, a business need for the promotion must exist and the candidate must be considered the most qualified person for the new position. Completion of certain milestones such as obtaining an advanced degree or certification, time in current position, or developing skills to perform at the higher-level role do not guarantee a promotion.", "postedDate": "1 week ago", "skills": ["Microsoft Word", "Excel", "Outlook", "Communication", "Customer Service", "Time Management", "Organization"], "url": "https://www.linkedin.com/jobs/view/4002208464"}