{"jobTitle": "Human Resources Administrator ($85k)", "company": {"name": "J.R. Berry Search Group, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Human Resources", "industry": "Financial Services", "description": "<strong>Human Resources Administrator ($85k)</strong><br/>A global financial services firm based in West Los Angeles is seeking a poised and professional <strong>Human Resources Administrator </strong>to join their dynamic HR department.<br/>The Human Resources Administrator will be responsible for handling a wide-range of HR tasks, including process administration, employee data management, and ad-hoc projects.<br/>Daily duties will include:<ul><li>Acting as a primary point of contact for the HR department, providing white-glove service to employees and new-hires. </li><li>Handling all HR data and transaction processing, including managing employee data, maintaining payroll change notices, etc.</li><li>Assisting with onboarding and offboarding, including creating all documents, drafting communications, and preparing materials.</li><li>Drafting offer letters and handling correspondence with candidates.</li><li>Serving as the primary point of contact for the HRIS system, including pulling reports, maintaining data integrity, and answering questions regarding the system.</li><li>Acting as the primary point of contact for Payroll – answering employee and new hire questions regarding payroll actions. </li><li>Running background checks, processing I-9s, and reviewing progress reports.</li></ul><br/>Candidates must have 4+ years of administrative/operations experience within an HR department, preferably within finance or a corporate environment. The individual in this role must also be detail-oriented, organized, and have working knowledge of an HRIS system and Microsoft Office Suite. <br/>Perks include: <ul><li>A competitive base salary, up to $85k (DOE)</li><li>Paid overtime</li><li>A hybrid work schedule</li><li>Strong benefits and PTO package</li></ul><br/>Please apply today if qualified and interested!", "postedDate": "2 days ago", "benefits": "A competitive base salary, up to $85k (DOE), Paid overtime, A hybrid work schedule, Strong benefits and PTO package", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002833441"}