{"jobTitle": "Safety Training Supervisor", "company": {"name": "ABM Industries", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Facilities Services", "description": "<strong>Job Description<br/><br/></strong><strong>PAY</strong>: $26.46 Per Hour<br/><br/>The pay listed is the salary range for this position. Any specific offer will vary based on the successful applicant’s education, experience, skills, abilities, geographic location, and alignment with market data.<br/><br/>You may be eligible to participate in a Company incentive or bonus program.<br/><br/>ABM offers a comprehensive benefits package. For information about ABM’s benefits, visit 2024-Recruitment-Staff-Mgmt-11.6.23.pdf (abm.com)<br/><br/><strong>Position Responsibilities<br/><br/><br/></strong><ul><li>Will provide safety training for all new hires</li><li>Perform safety audits</li><li>Maintain employee training records</li><li>Will perform audits</li><li>Train new staff and oversee on-going training of existing employees in proper cleaning methods and use of equipment, safety practices, and regulations</li><li>Will schedule and coordinate all employee training sessions</li><li>Maintain knowledge of safety regulations</li><li>Will put together training packets of safety and materials</li><li>Perform other duties as assigned or requested<br/><br/><br/></li></ul><strong>Knowledge, Skills &amp; Abilities<br/><br/><br/></strong><ul><li>Two years of safety and/or training experience</li><li>Knowledge of Microsoft Office Excel, Word, Outlook and Powerpoint</li><li>Good communication skills both written and verbal</li><li>Good organization skills</li><li>Good customer service skills</li><li>Must be detailed</li><li>Knowledge of computer based training</li><li>Selected candidate must be able to read, write and speak English and Spanish<br/><br/><br/></li></ul><strong>About Us<br/><br/></strong>ABM (NYSE: ABM) is one of the world’s largest providers of facility services and solutions. A driving force for a cleaner, healthier, and more sustainable world, ABM provides essential services and forward-looking performance solutions that improve the spaces and places that matter most. From curbside to rooftop, ABM’s comprehensive services include janitorial, engineering, parking, electrical and lighting, energy and electric vehicle charging infrastructure, HVAC and mechanical, landscape and turf, and mission critical solutions. ABM serves a wide range of industries – from commercial office buildings to universities, airports, hospitals, data centers, manufacturing plants and distribution centers, entertainment venues and more. Founded in 1909, ABM serves over 20,000 clients, with annualized revenue approaching $8 billion and more than 100,000 team members in 350+ offices throughout the United States, United Kingdom, Republic of Ireland, and other international locations. For more information, visit www.abm.com.<br/><br/>ABM is proud to be an Equal Opportunity Employer qualified applicants without regard race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran or any other protected factor under federal, state, or local law. ABM is committed to working with and providing reasonable accommodation to individuals with disabilities. If you have a disability and need assistance in completing the employment application, please call 888-328-8606. We will provide you with assistance and make a determination on your request for reasonable accommodation on a case-by-case basis.<br/><br/>ABM participates in the U.S. Department of Homeland Security E-Verify program. E-Verify is an internet-based system used to electronically confirm employment eligibility.<br/><br/>ABM is a military-friendly company proudly employing thousands of men and women who have served in the U.S. military. With ABM, you’ll have access to a world-class training program and ample opportunities to use the skills you developed while serving our country. Whether you’re looking for a frontline or professional position, you can find post-military career opportunities across ABM.<br/><br/>ABM directs all applicants to apply at www.abm.com ABM does not accept unsolicited resumes.", "responsibilities": "Will provide safety training for all new hires\nPerform safety audits\nMaintain employee training records\nWill perform audits\nTrain new staff and oversee on-going training of existing employees in proper cleaning methods and use of equipment, safety practices, and regulations\nWill schedule and coordinate all employee training sessions\nMaintain knowledge of safety regulations\nWill put together training packets of safety and materials\nPerform other duties as assigned or requested", "qualifications": {"required": "Two years of safety and/or training experience\nKnowledge of Microsoft Office Excel, Word, Outlook and Powerpoint\nGood communication skills both written and verbal\nGood organization skills\nGood customer service skills\nMust be detailed\nKnowledge of computer based training\nSelected candidate must be able to read, write and speak English and Spanish"}, "skills": ["Safety Training", "Microsoft Office", "Communication", "Organization", "Customer Service", "Computer Based Training", "English", "Spanish"], "postedDate": "1 week ago", "benefits": "ABM offers a comprehensive benefits package. For information about ABM’s benefits, visit 2024-Recruitment-Staff-Mgmt-11.6.23.pdf (abm.com)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002211719"}