{"jobTitle": "Senior Manager, Operations", "company": {"name": "New World Medical", "location": "Rancho Cucamonga, CA", "industry": "Medical Equipment Manufacturing"}, "location": "Rancho Cucamonga, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$174,000.00/yr - $193,000.00/yr", "currency": "USD"}, "jobFunction": "Production, Project Management, and Engineering", "industry": "Medical Equipment Manufacturing", "description": "<strong>JOB SUMMARY:</strong><p>Reporting to the VP of Sustaining and Production, the Senior Manager, Operations, leads the production and supply chain departments with top level accountability on major company initiatives. The Senior Manager is expected to embrace challenges, uncertainty, and change as opportunities arise. </p><p><br/></p><p>The Senior Manager will have an effective blend of business acumen and technical savvy, big-picture vision while being able to address tactical/technical issues, and a dynamic leader that can influence and challenge a team while still being sensitive to the needs and development of the team members and customers. Responsibilities include strategy; tactics; staffing; budget; oversight of team; and key interface with NWM in-house engineering staff and/or contract manufacturers/suppliers, and infrastructure. </p><p><br/></p><p><strong>ESSENTIAL JOB DUTIES AND RESPONSIBILITIES:</strong></p><ul><li>Ensures production and supply chain departments are delivering against current and new KPIs. </li><li>Defines, initiates, and executes projects to improve short-term and long-term operations as appropriate.</li><li>Tracks efficiency of Operations processes and adjusts schedules, resources, or procedures as needed to achieve business goals through development of KPIs and metrics. </li><li>Makes decisions based on understanding multiple departments and the relationship between them. </li><li>Support facilities and EH&amp;S for increases in production and supply chain needs. </li><li>Propose space, manufacturing, and EH&amp;S requirements related to operations. </li><li>Maintains cross functional relationships with various department to meet operational goals and objectives. </li><li>Oversees implementation of corrective actions for inadequacies in process execution.</li><li>Evaluates process performance and initiates corrective action when necessary.</li><li>Collaborates with other managers and leadership to set and assess priorities across teams.</li><li>Provides guidance and oversight in development and execution of companywide initiatives affecting operations and products.</li><li>Oversee the organization and staffing of the department, including but not limited to hiring, mentoring, reporting structure adjustments, and terminations.</li><li>Continually develop team members to improve capabilities and ensure best fit of employees’ skillsets and interests.</li><li>Prepare periodic reports as needed for management review. Work with direct reports to communicate and update goals and/or metrics, illustrating objective evidence of improvement.</li><li>Provide cross functional support to the overall organization. Partners and coordinates with other departments within New World Medical to ensure projects needs are properly met.</li><li>Provide strategic inputs for department current and long-term needs to expand coverage and product offerings. </li><li>Functional ownership of ERP system elements related to supply chain and production needs.</li></ul><p><br/></p><p><strong>KNOWLEDGE, SKILLSAND ABILITIES:</strong></p><ul><li>Thorough understanding of production and supply chain management.</li><li>Strong working knowledge of ERP systems and production planning.</li><li>Strong knowledge of manufacturing processes, work planning, and raw material strategy. </li><li>Extensive vendor management experience with monitoring and improving raw material deliveries. </li><li>Proven time and project management skills with attention to detail and the ability to plan and prioritize work and balance multiple projects.</li><li>Ability to build effective working relationships across functional areas and levels of the organization.</li><li>Working knowledge of ISO, FDA, OSHA, and local regulations.</li><li>Strong understanding of safety and compliance with internal and external regulations. </li><li>Ability to translate corporate goals and objectives into successful functional strategies.</li><li>Strong ability to analyze and solve problems to provide solutions to upper management.</li><li>Ability to perform financial analysis, develop budgets, and implement spend management</li><li>Ability to effectively manage conflicts and the ability to resolve them diplomatically</li><li>Strong computer skills and command of Microsoft Office tools.</li></ul><p><br/></p><p><strong>EDUCATION AND EXPERIENCE:</strong></p><ul><li>Bachelor’s degree in a Science or Engineering disciple. Master’s Degree in related field preferred.</li><li>10+ years of manufacturing/operations experience, preferable in medical devices or related industry.</li><li>7 years of experience leading a team.</li><li>Experience with operations scale-up, new product launches, EHS, and facilities management. </li></ul><p><br/></p><p><strong>PHYSICAL REQUIREMENTS:</strong></p><ul><li>Ability to travel up to 25% of the time.</li><li>Must be able to operate a computer and other office productivity machinery, such as a computer printer, computer keyboard, calculator, etc. </li><li>Occasionally lift up to 25 pounds and transport to other offices. This may be performed with reasonable accommodation. </li><li>View and type on computer screens for long periods of time.</li></ul><p><br/></p><p>This description reflects management’s assignment of essential functions, it does not proscribe or restrict the tasks that may be assigned.</p><p><br/></p><p>New World Medical, Inc. (NWM) is an Equal Opportunity Employer. NWM takes pride in maintaining a diverse environment and our policies are not to discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status.</p>", "responsibilities": "<strong>JOB SUMMARY:</strong><p>Reporting to the VP of Sustaining and Production, the Senior Manager, Operations, leads the production and supply chain departments with top level accountability on major company initiatives. The Senior Manager is expected to embrace challenges, uncertainty, and change as opportunities arise. </p><p><br/></p><p>The Senior Manager will have an effective blend of business acumen and technical savvy, big-picture vision while being able to address tactical/technical issues, and a dynamic leader that can influence and challenge a team while still being sensitive to the needs and development of the team members and customers. Responsibilities include strategy; tactics; staffing; budget; oversight of team; and key interface with NWM in-house engineering staff and/or contract manufacturers/suppliers, and infrastructure. </p><p><br/></p><p><strong>ESSENTIAL JOB DUTIES AND RESPONSIBILITIES:</strong></p><ul><li>Ensures production and supply chain departments are delivering against current and new KPIs. </li><li>Defines, initiates, and executes projects to improve short-term and long-term operations as appropriate.</li><li>Tracks efficiency of Operations processes and adjusts schedules, resources, or procedures as needed to achieve business goals through development of KPIs and metrics. </li><li>Makes decisions based on understanding multiple departments and the relationship between them. </li><li>Support facilities and EH&amp;S for increases in production and supply chain needs. </li><li>Propose space, manufacturing, and EH&amp;S requirements related to operations. </li><li>Maintains cross functional relationships with various department to meet operational goals and objectives. </li><li>Oversees implementation of corrective actions for inadequacies in process execution.</li><li>Evaluates process performance and initiates corrective action when necessary.</li><li>Collaborates with other managers and leadership to set and assess priorities across teams.</li><li>Provides guidance and oversight in development and execution of companywide initiatives affecting operations and products.</li><li>Oversee the organization and staffing of the department, including but not limited to hiring, mentoring, reporting structure adjustments, and terminations.</li><li>Continually develop team members to improve capabilities and ensure best fit of employees’ skillsets and interests.</li><li>Prepare periodic reports as needed for management review. Work with direct reports to communicate and update goals and/or metrics, illustrating objective evidence of improvement.</li><li>Provide cross functional support to the overall organization. Partners and coordinates with other departments within New World Medical to ensure projects needs are properly met.</li><li>Provide strategic inputs for department current and long-term needs to expand coverage and product offerings. </li><li>Functional ownership of ERP system elements related to supply chain and production needs.</li></ul>", "qualifications": {"required": "Thorough understanding of production and supply chain management. Strong working knowledge of ERP systems and production planning. Strong knowledge of manufacturing processes, work planning, and raw material strategy. Extensive vendor management experience with monitoring and improving raw material deliveries. Proven time and project management skills with attention to detail and the ability to plan and prioritize work and balance multiple projects. Ability to build effective working relationships across functional areas and levels of the organization. Working knowledge of ISO, FDA, OSHA, and local regulations. Strong understanding of safety and compliance with internal and external regulations. Ability to translate corporate goals and objectives into successful functional strategies. Strong ability to analyze and solve problems to provide solutions to upper management. Ability to perform financial analysis, develop budgets, and implement spend management Ability to effectively manage conflicts and the ability to resolve them diplomatically Strong computer skills and command of Microsoft Office tools.", "preferred": "Bachelor’s degree in a Science or Engineering disciple. Master’s Degree in related field preferred. 10+ years of manufacturing/operations experience, preferable in medical devices or related industry. 7 years of experience leading a team. Experience with operations scale-up, new product launches, EHS, and facilities management."}, "skills": ["ERP", "Production Planning", "Manufacturing Processes", "Vendor Management", "Project Management", "ISO", "FDA", "OSHA", "Financial Analysis", "Budgeting", "Conflict Management", "Microsoft Office"], "postedDate": "6 days ago", "benefits": "Medical insurance, Dental insurance, Vision insurance, 401(k), Paid maternity leave, Paid paternity leave, Tuition assistance, Disability insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002179973"}