{"jobTitle": "Senior Buyer/Planner", "company": {"name": "Alcon", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing and Supply Chain", "industry": "Medical Equipment Manufacturing", "description": "At Alcon, we are driven by the meaningful work we do to help people see brilliantly. We innovate boldly, champion progress, and act with speed as the global leader in eye care. Here, you’ll be recognized for your commitment and contributions and see your career like never before. Together, we go above and beyond to make an impact in the lives of our patients and customers.<br/><br/>We are hiring a Sr. Buyer/Planner for our sunny Irvine, California site. We seek dynamic, inspiring, inclusive team members who collaborate with others, knowing that diverse talent, skills, and perspectives lead to better outcomes. Alcon manufacturing is a fast-paced, high-energy environment. Naturally, we are looking for someone who is a relationship builder, an excellent analytical thinker, intuitive to business needs, and someone who can effectively communicate in challenging situations creating win-win scenarios. Above all, we are looking for someone with a passion for customer service and helping Alcon in our mission to help everyone see brilliantly!<br/><br/><strong>A Day in the Life:<br/><br/></strong>As a Sr. Buyer/Planner, you are responsible for unleashing the full potential of our people and culture while simultaneously achieving timely and cost-effective manufacturing of high-quality medical devices. The Sr. Buyer/Planner is responsible for long-term supply chain strategies and networks that address capacity issues and production location decisions in support of business goals.<br/><br/><ul><li>Plans production schedules and is responsible for procurement functions directly associated with the timely planning of production materials, tooling, and services.</li><li>Analyzes and defines inventory levels to align with the needs of the business.</li><li>Responsible for inventory right sizing to ensure levels are maintained to meet business requirements</li><li>Opens and maintains work orders within the established guidelines and supports finance with the research and resolution of job variances</li><li>Uses MRP planning tools to anticipate issues and implement preemptive solutions</li><li>Maintain data that affects MRP output such as lead time, minimum orders, lot sizes, safety stock, etc.</li><li>Cross functionally lead projects and teams within area of responsibility, as well as coaching peers in areas of expertise</li><li>Responsible for timely review of non-conforming material and understanding of material movement through warehouse processes</li><li>Plans, coordinates, and implements the movement of material both internally and externally</li><li>Develops, improves, and/or analyzes reports for inventory management</li><li>Analyzes ERP data and takes appropriate action as needed</li><li>Mitigate scrap risk by coordinating, planning, and performing analysis activities associated with quality issues, improvements, new releases, and End Of Life (EOL)<br/><br/></li></ul>WHAT YOU'LL BRING TO ALCON:<br/><br/><ul><li>Bachelor’s Degree or Equivalent years of directly related experience (or high school +10 yrs.; Assoc.+6 yrs.; M.S.+0 yrs.)</li><li>The ability to fluently read, write, understand, and communicate in English</li><li>2 Years of Relevant Experience</li><li>Travel Requirements: Minimal</li><li>Relocation assistance &amp; Sponsorship: Not available<br/><br/></li></ul>HOW YOU CAN THRIVE AT ALCON:<br/><br/><ul><li>Collaborate with teammates to share standard processes and findings as work evolves.</li><li>A career at Alcon offers focused growth and development opportunities!</li><li>Join Alcon’s mission to provide outstanding, innovative products and solutions to improve sight, improve lives, and grow your career!</li><li>Alcon provides a robust benefits package including health, life, retirement, flexible time off for exempt associates, PTO for hourly associates, and much more!<br/><br/></li></ul><strong>ATTENTION: Current Alcon Employee/Contingent Worker<br/><br/></strong>If you are currently an active employee/contingent worker at Alcon, please click the appropriate link below to apply on the Internal Career site.<br/><br/>Find Jobs for Employees<br/><br/>Find Jobs for Contingent Worker<br/><br/><strong>Total Rewards<br/><br/></strong>Alcon’s Total Rewards programs are designed to align to incentives with business goals, encourage the right values and behaviors, and deliver long-term value. The first layer of our rewards program is compensation. We offer a combination of fixed pay and variable pay, which includes short-term incentives, and long-term incentives for eligible population. Our benefits program provides security for life events through life and disability insurance, supports savings for retirement, promotes good health and well-being and supports associates and their families during times of illness. To learn more about Alcon’s Corporate Social Responsibility including our Total Rewards, click here<br/><br/><strong>Pay Range<br/><br/></strong>$73,520.00 - $110,280.00<br/><br/><strong>Pay Frequency<br/><br/></strong>Annual<br/><br/>Alcon is an Equal Opportunity Employer and participates in E-Verify. Alcon takes pride in maintaining a diverse environment and our policies are not to discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, gender identity, marital or veteran status, disability, or any other legally protected status. Alcon is also committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the application process, or in order to perform the essential functions of a position, please send an email to <strong><strong>alcon.recruitment@alcon.com</strong></strong> and let us know the nature of your request and your contact information.", "responsibilities": "As a Sr. Buyer/Planner, you are responsible for unleashing the full potential of our people and culture while simultaneously achieving timely and cost-effective manufacturing of high-quality medical devices. The Sr. Buyer/Planner is responsible for long-term supply chain strategies and networks that address capacity issues and production location decisions in support of business goals.<br/><br/><ul><li>Plans production schedules and is responsible for procurement functions directly associated with the timely planning of production materials, tooling, and services.</li><li>Analyzes and defines inventory levels to align with the needs of the business.</li><li>Responsible for inventory right sizing to ensure levels are maintained to meet business requirements</li><li>Opens and maintains work orders within the established guidelines and supports finance with the research and resolution of job variances</li><li>Uses MRP planning tools to anticipate issues and implement preemptive solutions</li><li>Maintain data that affects MRP output such as lead time, minimum orders, lot sizes, safety stock, etc.</li><li>Cross functionally lead projects and teams within area of responsibility, as well as coaching peers in areas of expertise</li><li>Responsible for timely review of non-conforming material and understanding of material movement through warehouse processes</li><li>Plans, coordinates, and implements the movement of material both internally and externally</li><li>Develops, improves, and/or analyzes reports for inventory management</li><li>Analyzes ERP data and takes appropriate action as needed</li><li>Mitigate scrap risk by coordinating, planning, and performing analysis activities associated with quality issues, improvements, new releases, and End Of Life (EOL)<br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s Degree or Equivalent years of directly related experience (or high school +10 yrs.; Assoc.+6 yrs.; M.S.+0 yrs.)\nThe ability to fluently read, write, understand, and communicate in English\n2 Years of Relevant Experience\nTravel Requirements: Minimal\nRelocation assistance & Sponsorship: Not available", "preferred": ""}, "skills": ["MRP", "ERP", "Supply Chain", "Procurement", "Inventory Management", "Production Planning", "Analytical Skills", "Communication Skills", "Relationship Building", "Customer Service"], "postedDate": "6 days ago", "benefits": "Alcon provides a robust benefits package including health, life, retirement, flexible time off for exempt associates, PTO for hourly associates, and much more!", "remoteWork": "No", "salary": {"amount": "73,520.00 - 110,280.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4002968202"}