{"jobTitle": "Dermatology Senior Health and Science Specialist - Santa Ana, CA", "company": {"name": "Pfizer", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "121,000 to 217,000", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Pharmaceutical Manufacturing", "description": "Why Patients Need You<br/><br/>All over the world, Pfizer colleagues work together to positively impact health for everyone, everywhere. Our colleagues have the opportunity to grow and develop a career that offers both individual and company success; be part of an ownership culture that values diversity and where all colleagues are energized and engaged; and the ability to impact the health and lives of millions of people. Pfizer, a global leader in the biopharmaceutical industry, is continuously seeking top talent who are inspired by our purpose to innovate to bring therapies to patients that significantly improve their lives.<br/><br/>What You Will Achieve<br/><br/>The Health &amp; Science Specialists is responsible for launching new products, deciding upon best strategies to manage business relationships, understanding formulary access, and engaging in product promotion within assigned accounts. In addition, the rep is charged with sales efforts and relationship development with assigned customers and accounts, including Therapeutic Area Specialists and Key Opinion Leaders (KOLs).<br/><br/>The Health &amp; Science Specialists should possess customer, market and business acumen combined with strong product and disease state knowledge; demonstrate strong sales, promotional and strategic business development and management skills and in-depth customer engagement expertise in both virtual and in-person settings, utilize a systematic approach to virtual engagement (e.g., clear agenda, next steps/follow ups); have outstanding communications skills and be adept in the operation of digital and virtual tools/multi-platforms skills.<br/><br/>The Health &amp; Science Specialists should possess customer, market and business acumen combined with strong product and disease state knowledge; demonstrate strong sales, promotional and strategic business development and management skills and in-depth customer engagement expertise in both virtual and in-person settings, utilize a systematic approach to virtual engagement (e.g., clear agenda, next steps/follow ups); have outstanding communications skills and be adept in the operation of digital and virtual tools/multi-platforms skills.<br/><br/>How You Will Achieve It<br/><br/><ul><li>Ability to effectively identify and implement the most efficient virtual/in-person engagement strategies, by customer, to maximize overall effectiveness and impact. Develops and implements effective business and territory call plans and adapts based on self-identified opportunities and insights. </li><li>Effectively builds rapport and relationships with customers across virtual and F2F environments; maintains a methodical approach toward call objectives (e.g., clear next steps and appropriate documentation, managing to KPIs); utilizes current digital tools effectively (e.g., Veeva Engage, Zoom, WebEx, Microsoft Office) as well as adapts quickly to new/beta tools (e.g., digital triage app) for successful customer engagement; leverages analytics to assist with developing insights and next best action plans</li><li>Compliantly delivers relevant, targeted messaging utilizing approved materials via customer engagement to drive product demand (ask the HCP to change their prescribing behavior/close sales) and leverages account priorities to drive a positive business outcome; proactively provides insights for the development of new and innovative approved product messaging and resources</li><li>Leverages product and disease state knowledge to appropriately educate providers on unbranded and branded product value proposition for relevant patient populations and effectively utilizes approved clinically oriented disease state information, as applicable). </li><li>Works effectively with HCPs and directs office staff to plan for customer engagements in multiple formats (e.g., virtual and in-person)</li><li>Responsible for strategic deployment of approved Pfizer resources to support provider and patient’s needs (e.g., samples, vouchers, co-pay resources and patient education); works effectively across multiple virtual engagement platforms based on customer preferences/compliance guidelines; able to integrate guidance from management and other support functions (Marketing, Strategy) technical solutions (e.g., content recommendation engines) into pre-call planning; proactive planning and optimization of call environment in multiple locations; able to effectively plan day-to-day work based on personal and customer schedules; collaborate effectively with other Customer-Facing (CF) colleagues and Pfizer Connect team members</li><li>Appropriately support patients’ access to Pfizer products by providing relevant information to HCPs on Reimbursement, Patient Assistant Program (PAP), Pfizer hub programs, and Co-Pay Resources. </li><li>Present terms of sale of product or existing contract terms where appropriate and with approved language; proactively answer on-label questions; proactively introduce customers to future state Pfizer on-demand portal (Galaxy) with access to appropriate targeted content<br/><br/></li></ul>Qualifications<br/><br/>Must-Have<br/><br/><ul><li>A Bachelor’s Degree</li><li>Minimum of 3 years of previous Pharmaceutical biotech or medical marketing/promotional/sales experience, a promoted position and or developmental role with demonstrated leadership across peer groups with experienced marketing, promotional and sales in a specialized market where third-party reimbursement and service center has been utilized</li><li>Have a history of marketing, promotional or sales success, strong territory management skills, outstanding communications skills, as well as demonstrated teamwork, leadership ability and accountability</li><li>Must live within 50 miles of the territory</li><li>Valid US driver’s license and a driving record in compliance with company standards<br/><br/></li></ul>Nice-to-Have<br/><br/><ul><li>3-5 years specialty marketing/promotional/sales experience</li><li>Strong knowledge of disease states, therapeutic areas, and products</li><li>Deep knowledge of applicable customers and markets (prescribers/HCPs/institutions/organizations)</li><li>Strategic account marketing, promotional, sales and management skills. </li><li>Superior marketing, promotional, sales, technical and relationship building skills</li><li>Demonstrated track record of assessing account needs and bringing relevant information and resources to drive performance</li><li>Demonstrated track record of strong business acumen, problem solving, strategic thinking, data analytical skills and project management skills, as well as excellent planning and prioritization skills</li><li>Demonstrated ability to engage, influence and support customers throughout the marketing, promotional and sales process, excellent communication, and interpersonal and leadership skills. </li><li>Demonstrated ability to quickly learn and embrace new ways of working in a rapidly changing environment. </li><li>Possess the ability to work in a matrix environment and to leverage multiple resources to meet customer needs and deliver results. </li><li>Demonstrated track record of strong leadership, cross functional leadership, collaboration, and effective utilization of available resources to drive performance. <br/><br/></li></ul>Non-standard Work Schedule, Travel Or Environment Requirements<br/><br/><ul><li>Ability to travel to all accounts/office locations within territory</li><li>Depending on size of territory and business need, candidates may be required to stay overnight as necessary<br/><br/></li></ul>Other Job Details:<br/><br/><ul><li>Last Date to Apply: June 27, 2024</li><li>The annual base salary for this position ranges from $121,000 to $217,000. In addition, this position offers an additional quarterly Sales Incentive bonus. We offer comprehensive and generous benefits and programs to help our colleagues lead healthy lives and to support each of life’s moments. Benefits offered include a 401(k) plan with Pfizer Matching Contributions and an additional Pfizer Retirement Savings Contribution, paid vacation, holiday and personal days, paid caregiver/parental and medical leave, and health benefits to include medical, prescription drug, dental and vision coverage. Learn more at Pfizer Candidate Site – U.S. Benefits| (uscandidates.mypfizerbenefits.com). Pfizer compensation structures and benefit packages are aligned based on the location of hire. The United States salary range provided does not apply to any location outside of the United States. <br/><br/></li></ul>The annual base salary for this position ranges from $83,500.00 to $139,100.00. In addition, this position is eligible for participation in Pfizer’s Global Performance Plan with a bonus target of 0.0% of the base salary. We offer comprehensive and generous benefits and programs to help our colleagues lead healthy lives and to support each of life’s moments. Benefits offered include a 401(k) plan with Pfizer Matching Contributions and an additional Pfizer Retirement Savings Contribution, paid vacation, holiday and personal days, paid caregiver/parental and medical leave, and health benefits to include medical, prescription drug, dental and vision coverage. Learn more at Pfizer Candidate Site – U.S. Benefits | (uscandidates.mypfizerbenefits.com). Pfizer compensation structures and benefit packages are aligned based on the location of hire. The United States salary range provided does not apply to Tampa, FL or any location outside of the United States.<br/><br/>Relocation assistance may be available based on business needs and/or eligibility.<br/><br/>Sunshine Act<br/><br/>Pfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider’s name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.<br/><br/>EEO &amp; Employment Eligibility<br/><br/>Pfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer. This position requires permanent work authorization in the United States.<br/><br/>Sales<br/><br/>", "responsibilities": "The Health &amp; Science Specialists is responsible for launching new products, deciding upon best strategies to manage business relationships, understanding formulary access, and engaging in product promotion within assigned accounts. In addition, the rep is charged with sales efforts and relationship development with assigned customers and accounts, including Therapeutic Area Specialists and Key Opinion Leaders (KOLs).", "qualifications": {"required": "A Bachelor’s Degree, Minimum of 3 years of previous Pharmaceutical biotech or medical marketing/promotional/sales experience, a promoted position and or developmental role with demonstrated leadership across peer groups with experienced marketing, promotional and sales in a specialized market where third-party reimbursement and service center has been utilized, Have a history of marketing, promotional or sales success, strong territory management skills, outstanding communications skills, as well as demonstrated teamwork, leadership ability and accountability, Must live within 50 miles of the territory, Valid US driver’s license and a driving record in compliance with company standards", "preferred": "3-5 years specialty marketing/promotional/sales experience, Strong knowledge of disease states, therapeutic areas, and products, Deep knowledge of applicable customers and markets (prescribers/HCPs/institutions/organizations), Strategic account marketing, promotional, sales and management skills., Superior marketing, promotional, sales, technical and relationship building skills, Demonstrated track record of assessing account needs and bringing relevant information and resources to drive performance, Demonstrated track record of strong business acumen, problem solving, strategic thinking, data analytical skills and project management skills, as well as excellent planning and prioritization skills, Demonstrated ability to engage, influence and support customers throughout the marketing, promotional and sales process, excellent communication, and interpersonal and leadership skills., Demonstrated ability to quickly learn and embrace new ways of working in a rapidly changing environment., Possess the ability to work in a matrix environment and to leverage multiple resources to meet customer needs and deliver results., Demonstrated track record of strong leadership, cross functional leadership, collaboration, and effective utilization of available resources to drive performance."}, "skills": [], "postedDate": "6 days ago", "applicationDeadline": "June 27, 2024", "benefits": "The annual base salary for this position ranges from $121,000 to $217,000. In addition, this position offers an additional quarterly Sales Incentive bonus. We offer comprehensive and generous benefits and programs to help our colleagues lead healthy lives and to support each of life’s moments. Benefits offered include a 401(k) plan with Pfizer Matching Contributions and an additional Pfizer Retirement Savings Contribution, paid vacation, holiday and personal days, paid caregiver/parental and medical leave, and health benefits to include medical, prescription drug, dental and vision coverage. Learn more at Pfizer Candidate Site – U.S. Benefits| (uscandidates.mypfizerbenefits.com). Pfizer compensation structures and benefit packages are aligned based on the location of hire. The United States salary range provided does not apply to any location outside of the United States. <br/><br/>The annual base salary for this position ranges from $83,500.00 to $139,100.00. In addition, this position is eligible for participation in Pfizer’s Global Performance Plan with a bonus target of 0.0% of the base salary. We offer comprehensive and generous benefits and programs to help our colleagues lead healthy lives and to support each of life’s moments. Benefits offered include a 401(k) plan with Pfizer Matching Contributions and an additional Pfizer Retirement Savings Contribution, paid vacation, holiday and personal days, paid caregiver/parental and medical leave, and health benefits to include medical, prescription drug, dental and vision coverage. Learn more at Pfizer Candidate Site – U.S. Benefits | (uscandidates.mypfizerbenefits.com). Pfizer compensation structures and benefit packages are aligned based on the location of hire. The United States salary range provided does not apply to Tampa, FL or any location outside of the United States.<br/><br/>Relocation assistance may be available based on business needs and/or eligibility.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4002962259"}