{"jobTitle": "Junior Account Manager", "company": {"name": "Eclipse California", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "We are currently interviewing for a Junior Account Manager to join our team! We are looking for an individual who is hard working and dedicated to growing into a Management Role with our company. As a Junior Account Manager you would focus on the following:<br/><br/><ul><li>Development of marketing campaigns and strategies, customer service and client acquisition, and implementation of product launches</li><li>Rigorous leadership training, &amp; promotional advertising<br/><br/></li></ul>We provide full one-on-one training in customer relations, brand name recognition, acquisition, and management training through direct marketing. You must be goal-oriented, possess a strong work ethic, and have a friendly demeanor. We promote a very positive and friendly work environment, so all potential candidates must be constructive and career-driven individuals!<br/><br/>Junior Level Account Manager Requirements:<br/><br/><ul><li>Work experience in the following industries is an asset, but not required: Communications, Business administration, Management, Advertising, Marketing, Public Relations, Political Science, Psychology, Sports Management, and related fields</li><li>Willingness to succeed and train in an entry-level promotions position</li><li>Great communication skills and people skills</li><li>Excellent work ethic</li><li>A positive business attitude like the rest of our client’s enthusiastic staff</li><li>You must be confident you'll be successful, just waiting for a career opportunity where you can prove yourself<br/><br/></li></ul>***Guaranteed training is provided to all entry-level positions***<br/><br/><em><strong>This position requires the candidate to reliably commute to the office daily, and be able to start within 2 weeks of being offered the position.<br/><br/></strong></em>Powered by JazzHR<br/><br/>q5sYnfYECm<br/><br/>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002094833"}