{"jobTitle": "Associate Director of Events", "company": {"name": "ANdAZ", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "102,000.00 to $112,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Hospitality", "description": "<strong>Organization- Andaz West Hollywood<br/><br/></strong><strong>Summary<br/><br/></strong>At Hyatt, we pride ourselves on our caring and attentive associates who deliver exceptional service and create meaningful experiences for our guests.<br/><br/>The Associate Director of Events at Andaz West Hollywood is a critical leader in our event operations, responsible for overseeing the planning, coordination, and execution of a diverse array of events, from corporate meetings to social gatherings and special occasions. Reporting directly to the Director of Sales, Marketing, and Events, this role includes leading and mentoring a team of event professionals, driving event sales, and building strong, lasting client relationships. The Associate Director ensures that all events align with the hotel's standards and revenue goals, while also managing budgets, negotiating contracts, and upholding the highest quality standards. This position also collaborates closely with culinary and operations teams to ensure seamless execution and supports the planning and coordination of internal events, all while delivering exceptional and memorable experiences for our clients.<br/><br/>Hyatt associates work in an environment that demands exceptional performance yet reaps great rewards. Whether it’s career opportunities, job enrichment or a supportive work environment, if you are ready for this challenge, then we are ready for you.<br/><br/><em> The salary range for this position is $102,000.00 to $112,000.00. This pay range for this position is what the hotel reasonably expects to pay. Decisions regarding individual pay will be based on a number of factors, such as experience and education. <br/><br/></em><strong>Qualifications<br/><br/></strong><ul><li> A true desire to satisfy the needs of others in a fast-paced environment.</li><li> Refined verbal and written communication skills.</li><li> Proficient in general computer knowledge.</li><li> Minimum of 3 years of experience in Hotel Event Sales and/or Event Planning.</li><li> CMP Certification preferred.</li></ul>", "responsibilities": null, "qualifications": {"required": "A true desire to satisfy the needs of others in a fast-paced environment., Refined verbal and written communication skills., Proficient in general computer knowledge., Minimum of 3 years of experience in Hotel Event Sales and/or Event Planning.", "preferred": "CMP Certification"}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4002097755"}