{"jobTitle": "Sr.Buyer", "company": {"name": "Action Staffing-Group", "location": "Simi Valley, CA"}, "location": "Simi Valley, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$70,000.00/yr - $80,000.00/yr", "currency": "USD"}, "jobFunction": "Purchasing, Strategy/Planning, and Supply Chain", "industry": "Aviation and Aerospace Component Manufacturing", "description": "Schedule: Monday - Friday 7:30am - 4:30pm - Come November the schedule will shift to Monday - Thursday 6am - 5pm.  \n\n<strong>BASIC FUNCTIONS:</strong>\nThis role is responsible for establishing relationships with external vendors, order placement and fulfillment, supporting operations with production material, and inventory management. Will select and negotiate with approved vendors and place purchase orders to meet material requirements relative to quantity and timing. The role is a focal point for executing the Company’s sourcing and procurement strategy.\n\n<strong>ESSENTIAL DUTIES:</strong>\n<ul><li>Locate vendors of materials, equipment or supplies, and lead price negotiations, terms and conditions with vendors and suppliers.</li><li>Work with planning team and ERP system to determine order quantities; analyze market and delivery systems to assess present and future material availability.</li><li>Support initiatives on lead time reduction, supplier rationalization, material cost reduction, improved payment terms, quality, and delivery; prepare report on supplier performance and market conditions.</li><li>Review purchase order claims and contracts for conformance to company policy; develop and implement purchasing and contract management instructions, policies, and procedures.</li><li>Participate in the development of specifications for equipment, products or substitute materials.</li><li>Resolve vendor or contractor grievances, and claims against suppliers; represent companies in negotiating contracts and formulating policies with suppliers.</li><li>Manage material inventory levels in support of production needs and financial target.</li><li>Plan, develop and administer policies, procedures, and work instructions.</li><li>Follow-up, expedite and counsel departments and suppliers as required to maintain valid production schedules in support of company goals.</li></ul>\n\n<strong>REQUIREMENTS:</strong>\n<ul><li>Bachelors degree from an accredited university or a Purchasing Certification from a recognized professional organization; previous purchasing experience may be substituted.</li><li>A broad understanding of procurement processes and supply chain management, with 3-5 years of experience in a procurement role purchasing electronic components.</li><li>Prior experience with an aerospace or automotive manufacturing company preferred.</li><li>Proficient in the use of ERP/MRP systems.</li><li>Proficient in MS Office software suite, with emphasis on spreadsheet analysis.</li><li>Sustained dependable attendance.</li><li>Cooperation with others in team environment for cross training and conference on operational issues.</li><li>Initiative in learning and changing work methods to accomplish assigned tasks on a timely basis.</li></ul><p></p>", "postedDate": "1 week ago", "skills": ["ERP", "MRP", "Procurement", "Supply Chain Management", "Negotiation", "Vendor Management", "Inventory Management", "Spreadsheet Analysis", "MS Office"], "url": "https://www.linkedin.com/jobs/view/4002219112"}