{"jobTitle": "Assistant Accounting Officer", "company": {"name": "Open Bank", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Accounting/Auditing and Finance", "industry": "Banking", "description": "At Open Bank , we pride ourselves on being different and OPEN to new ideas and opportunities for our clients and employees.<br/><br/>We celebrate innovation, diversity, teamwork, excellence and integrity. We are an equal opportunity employer and offer competitive compensation and benefits package to recruit, retain and reward top talent. We would like to be your partner in success and happiness!<br/><br/>Join our TEAM - <strong> T </strong> ogether <strong> E </strong> veryone <strong> A </strong> chieves <strong> M </strong> ore<br/><br/>We are looking for <strong>Assistant Accounting Officer </strong>to join our team. The Assistant Accounting Officer is responsible for assisting the Controller and Accounting Officer II to manage day-to day operation of general accounting related activities, maintain accounting system up-to-date in compliance with Generally Accepted Accounting Principles, and prepare financial reports to management, auditors and regulatory agencies.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li> Assist in balancing general ledger and reviewing daily general ledger changes. </li><li> Assist in reconciling general ledger accounts. </li><li> Maintain cash balance in Due from Banks accounts. </li><li> Assist in managing investment portfolio and related investment accounting. </li><li> Assist in preparing timely and accurate financial reports, including balance sheet, income statement, net interest margin, risk based capital, and other various analyses. <br/><br/><br/></li></ul><strong>Requirements/Qualifications<br/><br/></strong><ul><li> Bachelor’s degree in Accounting, Finance or related field or equivalent work experience required. </li><li> Minimum one year of experience in bank accounting preferred. </li><li> Good written and oral communication skills; ability to communicate effectively and project a professional image when giving and taking information in writing, in person, and over the phone. </li><li> Advanced knowledge and experience with Microsoft Excel. </li><li> Willingness and ability to learn new systems or programs without direct supervision. <br/><br/><br/></li></ul>Employee Benefits &amp; Perks<br/><br/><ul><li> Medical, Dental, &amp; Vision : Open Bank offers medical, dental, and vision insurance for all full-time employees and their immediate family members. Employees become eligible for insurance benefits on the first of the month following their hire date. </li><li> Life, Accidental Death &amp; Dismemberment, &amp; Long-Term Disability : Open Bank pays 100% of the cost. </li><li> Flexible Spending Account (FSA) : Tax-advantaged financial accounts are offered for employees to pay for eligible out-of-pocket expenses (health, dependent care, transit, and parking) with pre-tax dollars. </li><li> 401(k) Retirement Savings Plan : Open Bank matches 100% of the first 6% of employees' contributions. Employees are eligible to participate on the first of the month following 90 days of employment. </li><li> Paid Time Off (PTO) : Employees begin to accrue PTO hours at the time of hire to use for vacation, illness, or other personal reasons. </li><li> Employee Assistance Program (EAP) : The EAP offers counseling sessions, online tools and resources, and legal and financial guidance for employees and their family. </li><li> Company Paid Lunch: Open Bank provides company paid lunch twice a week. <br/><br/><br/></li></ul>To view current job openings, please visit <strong>Open Bank Careers Page</strong>: https://myopenbank.com/about/#", "responsibilities": "The Assistant Accounting Officer is responsible for assisting the Controller and Accounting Officer II to manage day-to day operation of general accounting related activities, maintain accounting system up-to-date in compliance with Generally Accepted Accounting Principles, and prepare financial reports to management, auditors and regulatory agencies.", "qualifications": {"required": "Bachelor’s degree in Accounting, Finance or related field or equivalent work experience required.", "preferred": "Minimum one year of experience in bank accounting preferred."}, "skills": ["Microsoft Excel"], "postedDate": "6 days ago", "benefits": "Medical, Dental, &amp; Vision : Open Bank offers medical, dental, and vision insurance for all full-time employees and their immediate family members. Employees become eligible for insurance benefits on the first of the month following their hire date. \nLife, Accidental Death &amp; Dismemberment, &amp; Long-Term Disability : Open Bank pays 100% of the cost. \nFlexible Spending Account (FSA) : Tax-advantaged financial accounts are offered for employees to pay for eligible out-of-pocket expenses (health, dependent care, transit, and parking) with pre-tax dollars. \n401(k) Retirement Savings Plan : Open Bank matches 100% of the first 6% of employees' contributions. Employees are eligible to participate on the first of the month following 90 days of employment. \nPaid Time Off (PTO) : Employees begin to accrue PTO hours at the time of hire to use for vacation, illness, or other personal reasons. \nEmployee Assistance Program (EAP) : The EAP offers counseling sessions, online tools and resources, and legal and financial guidance for employees and their family. \nCompany Paid Lunch: Open Bank provides company paid lunch twice a week.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4002340684"}