{"jobTitle": "Digital Marketing Manager", "company": {"name": "Narrative Ads", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "70-80k a year", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Advertising Services", "description": "Job description\nNarrative (www.narrativeads.com) is a fast-growing digital video advertising agency with a wide range of e-commerce clients. After starting out in 2019, we are working with some of the biggest consumer brands. As we grow rapidly, we are looking for more talented people to join our team.\n\nWhat we do:\nWe produce and rigorously test hundreds of video ads for our clients to support their marketing efforts on social media channels such as Facebook, Instagram, TikTok, Youtube, and more. Many of the biggest direct-to-consumer rely on our team to drive their business growth.\n\nWho we are looking for:\nNarrative Ads is seeking a strategic-minded and creatively motivated Marketing Manager to join our growing team. It’s an exciting opportunity to champion communications across a digital marketing agency team in true partnership with well-known brands.\n\nWhat you’ll do:\n\n* Lead accounts to success in both creative and strategic aspects.\n* Understand clients, their businesses, their category, and their competition.\n* Manage and grow relationships with clients.\n* Manage timelines and deliverables with respective peers and stakeholders.\n* Partner with our campaign team to drive optimal results for our clients.\n* Act as the main point of contact for assigned accounts and act as a problem solver.\n\nWhat you’ll need:\n\n* A minimum of 2 years of marketing and communications experience.\n* Proven experience driving digital marketing and communication excellence.\n* Proven client services leadership experience.\n* Understand the basics around digital marketing and ready to learn more.\n* Demonstrated skills in relationship management, cross-group collaboration, and conflict management.\n* Self-starter, comfortable working in a fast-paced, growing environment.\n* Ability to think creatively and strategically\n\nIndustry\n\n* Marketing & Advertising\n\nSalary Range\n\n* 70-80k a year\n\nLocation\n\n* In office", "responsibilities": "Lead accounts to success in both creative and strategic aspects. Understand clients, their businesses, their category, and their competition. Manage and grow relationships with clients. Manage timelines and deliverables with respective peers and stakeholders. Partner with our campaign team to drive optimal results for our clients. Act as the main point of contact for assigned accounts and act as a problem solver.", "qualifications": {"required": "A minimum of 2 years of marketing and communications experience. Proven experience driving digital marketing and communication excellence. Proven client services leadership experience. Understand the basics around digital marketing and ready to learn more. Demonstrated skills in relationship management, cross-group collaboration, and conflict management. Self-starter, comfortable working in a fast-paced, growing environment. Ability to think creatively and strategically"}, "skills": ["Marketing", "Communication", "Client Services", "Digital Marketing", "Relationship Management", "Collaboration", "Conflict Management"], "postedDate": "4 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002156760"}