{"jobTitle": "Manager, Human Resources (Onsite)", "company": {"name": "VCA Animal Hospitals", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00 - $125,000.00", "currency": "USD"}, "jobFunction": "General Business, Other, and Health Care Provider", "industry": "Veterinary Services", "description": "<strong>About the company:<br/><br/></strong>VCA, Inc. (Parent Company, Mars) is a leading provider of pet health care services in North America, with a nationwide clinical laboratory system and over 861 free-standing animal hospitals. VCA has an excellent reputation in the pet health care industry. We have achieved this stature by acquiring and managing high quality veterinary practices and providing preeminent diagnostic laboratory services for animal hospitals in 43 states, with expansion into Canada.<br/><br/><strong>About the opportunity:<br/><br/></strong>We currently have an opening for an onsite, People &amp; Organization (Human Resources) Manager. Located at our largest animal hospital in west Los Angeles, California and reporting directly to the Divisional Director of Associate Relations, the P&amp;O (HR) Manager functions as a key member of a highly functioning and collaborative hospital leadership team, supporting over 380 Associates. This position will have one direct report. If you are looking for a chance to apply your exceptional human resources, associate relations, and people-focused skills with a dynamic, thriving company, this may be the ideal opportunity for you!<br/><br/><strong>Essential Functions of the onsite P&amp;O Manager include the following:<br/><br/></strong><ul><li>Ensure that our workforce is treated fairly and reasonably at all times by helping Associates to resolve conflicts and dealing with a myriad of complex personnel management situations;</li><li>Ensure compliance with federal, state, and local regulatory requirements, including FMLA, CFRA, PDL, ADA;</li><li>Source, screen, and quantify candidates for leadership positions within the Hospital. </li><li>Conduct the new hire Associate orientation and collect all necessary documentation.</li><li>Complete Associate onboarding to ensure that each Associate feels welcome and has a positive experience </li><li>Conduct workplace investigations;</li><li>Respond to Associate concerns to ensure that every Associate feels “heard” and well treated;</li><li>Serve as the Point of Contact for Associate Relations and other Centers of Excellence </li><li>Partner with hospital leadership with respect to hospital culture, coaching conversations, corrective action, and separations;</li><li>Assist in developing Associates and bench strength, ensuring the right people are in the right jobs. </li><li>Attend unemployment hearings and mediations as necessary;</li><li>Guide Hospital Managers and Supervisors on best practices, as well as hospital and company policies and procedures</li><li>Assist and contribute to benefits information sharing to the Associates on benefits plans</li><li>Report all Worker’s Compensation Claims and assist with the hospital Safety Compliance</li><li>Train and develop all hospital Associates as well as the Hospital Leadership team. This includes presenting on leadership topics to the Hospital teams</li><li>Roll out company initiatives</li><li>Act as a key liaison with the VCA’s Home Office</li><li>Update job knowledge by participating in educational opportunities; reading professional publications; maintaining business networks; and participating in professional organizations;</li><li>Demonstrate ability to understand how the hospital operates to implement culture focused solutions</li><li>Supervise at least one P&amp;O Specialist and oversee transactions such as transfers, hiring, leaves, interactive process, and related activities.</li><li>Facilitate performance management and performance reviews in collaborations with the Hospital Administrator, Managers, and Supervisors. </li><li>Supports the Company’s vision, mission, values, culture and strategy. </li><li>Support Divisional Director of Associate Relations in providing location specific insights to help with continued process improvements and Associate engagement. </li><li>Other duties as assigned <br/><br/></li></ul><strong>The Ideal Candidate will possess:<br/><br/></strong><ul><li>A genuine love of animals – including humans!</li><li>At least 5-10 years of experience in dealing with complex employee relations issues in medium-large multi-state organization.</li><li>Bachelor’s degree or the equivalent experience in Human Resources</li><li>Outstanding verbal and written communication skills.</li><li>On-the-job experience with writing position statements and conducting workplace investigations.</li><li>Strong proficiency with leave administration and the “interactive process.”</li><li>Ability to interact effectively at all levels of the organization.</li><li>Demonstrated competence in accurately advising managers on complex Associate Relations matters.</li><li>Extraordinary customer service skills.<br/><br/></li></ul><strong>Physical demands of the position:<br/><br/></strong><ul><li>The onsite P&amp;O Manager is part of a dynamic P&amp;O and Hospital Leadership team in the largest animal hospital in the country. Each day is filled with constant challenges and an intense pace.</li><li>Although providing a healthy work/life balance for our team is very important, there are times when the hours are long and irregular. Dedication and motivation are essential.</li><li>Must be able to sit for extended periods of time. </li><li>Must be able to walk, reach, stand, and balance.</li><li>Must be able to work in a demanding and diverse work environment.</li><li>Must be an excellent communicator in person, telephone, and email communications.</li><li>Must be free from or comfortably able to control animal allergies, as there are animals in the workplace on a regular basis.</li><li>Must be an expert in communication in the English language.</li><li>Must be able to see, hear, and speak clearly and articulately.</li><li>Occasionally, local driving trips and air travel may be required.<br/><br/></li></ul><strong>Additional Information<br/><br/></strong>Compensation is negotiable based on education, experience, and other relevant credentials. The US base salary range for this full-time position is $100,000- $125,000. Our salary ranges are determined by role, level, and location. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only.<br/><br/><strong>If you are a current associate, you will need to apply through our internal career site. Please log into Workday and click on the Jobs Hub app or search for Browse Jobs.<br/><br/></strong>Benefits: We offer competitive compensation along with a comprehensive benefits package, including medical, dental, vision and paid vacation/sick days, 401(k), generous employee pet discounts and more!<br/><br/>The information in this position description indicates the general nature and level of work to be performed. It is not designed to be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of associates assigned to this job. Management reserves the right to revise the job description or require that other tasks be performed when the circumstances of the job change (for example, emergencies, change in personnel, workload, or technical development)<br/><br/>We are proud to be an Equal Opportunity Employer - Veterans / Disabled. For a complete EEO statement please see our career page at vcacareers.com", "responsibilities": "Ensure that our workforce is treated fairly and reasonably at all times by helping Associates to resolve conflicts and dealing with a myriad of complex personnel management situations;Ensure compliance with federal, state, and local regulatory requirements, including FMLA, CFRA, PDL, ADA;Source, screen, and quantify candidates for leadership positions within the Hospital. Conduct the new hire Associate orientation and collect all necessary documentation.Complete Associate onboarding to ensure that each Associate feels welcome and has a positive experience Conduct workplace investigations;Respond to Associate concerns to ensure that every Associate feels “heard” and well treated;Serve as the Point of Contact for Associate Relations and other Centers of Excellence Partner with hospital leadership with respect to hospital culture, coaching conversations, corrective action, and separations;Assist in developing Associates and bench strength, ensuring the right people are in the right jobs. Attend unemployment hearings and mediations as necessary;Guide Hospital Managers and Supervisors on best practices, as well as hospital and company policies and proceduresAssist and contribute to benefits information sharing to the Associates on benefits plansReport all Worker’s Compensation Claims and assist with the hospital Safety ComplianceTrain and develop all hospital Associates as well as the Hospital Leadership team. This includes presenting on leadership topics to the Hospital teamsRoll out company initiativesAct as a key liaison with the VCA’s Home OfficeUpdate job knowledge by participating in educational opportunities; reading professional publications; maintaining business networks; and participating in professional organizations;Demonstrate ability to understand how the hospital operates to implement culture focused solutionsSupervise at least one P&amp;O Specialist and oversee transactions such as transfers, hiring, leaves, interactive process, and related activities.Facilitate performance management and performance reviews in collaborations with the Hospital Administrator, Managers, and Supervisors. Supports the Company’s vision, mission, values, culture and strategy. Support Divisional Director of Associate Relations in providing location specific insights to help with continued process improvements and Associate engagement. Other duties as assigned", "qualifications": {"required": "At least 5-10 years of experience in dealing with complex employee relations issues in medium-large multi-state organization.Bachelor’s degree or the equivalent experience in Human ResourcesOutstanding verbal and written communication skills.On-the-job experience with writing position statements and conducting workplace investigations.Strong proficiency with leave administration and the “interactive process.”Ability to interact effectively at all levels of the organization.Demonstrated competence in accurately advising managers on complex Associate Relations matters.Extraordinary customer service skills.", "preferred": ""}, "skills": [], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "We offer competitive compensation along with a comprehensive benefits package, including medical, dental, vision and paid vacation/sick days, 401(k), generous employee pet discounts and more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002828362"}