{"jobTitle": "Senior Mental Health Account Specialist, Neuro Psych - Northern/Central California", "company": {"name": "Bristol Myers Squibb", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$132,000 - $155,000", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Pharmaceutical Manufacturing", "description": "Working with Us<br/><br/>Challenging. Meaningful. Life-changing. Those aren't words that are usually associated with a job. But working at Bristol Myers Squibb is anything but usual. Here, uniquely interesting work happens every day, in every department. From optimizing a production line to the latest breakthroughs in cell therapy, this is work that transforms the lives of patients, and the careers of those who do it. You'll get the chance to grow and thrive through opportunities uncommon in scale and scope, alongside high-achieving teams rich in diversity. Take your career farther than you thought possible.<br/><br/>Bristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives. Read more:  careers.bms.com/working-with-us .<br/><br/>Position: Senior Mental Health Account Specialist (MHAS)<br/><br/>Therapeutic Area (TA): Psychiatry<br/><br/>Location: US Field<br/><br/>Bristol Myers Squibb has a rich history in Neuroscience focused on developing innovative medicines to help people living with Neurodegenerative and Neuromuscular conditions. Bristol Myers Squibb currently markets a product in Neurology and plans to re-enter the Psychiatry market with a focus on patients suffering with schizophrenia.<br/><br/>BMS is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, and spirit of independence and love of challenge.<br/><br/><strong>Position Summary<br/><br/></strong>The MHAS is a critical role in our unique customer model to execute the BMS aspiration to be the BioPharma team that delivers the most impactful engagement with Health Care Providers (HCPs), driving adoption of new and existing medicines for appropriate patients. This role will be hired to support the potential US commercialization of our lead investigational product, which, if approved by the FDA, could be the first ever treatment to target muscarinic receptor circuits for schizophrenia. The Mental Health Account Specialist team will call on the providers and care team members specifically at Community Mental Health Centers and Certified Community Behavior Health Centers. You will be a critical member of the launch team. Geographies may cover multiple states as they will mirror our District footprints.<br/><br/>The primary role of the MHAS is to drive demand for BMS medicines within their portfolio for the appropriate patients. To meet the HCPs expectations, the MHAS engages them with a differentiated Customer Experience (Cx) through deeper scientific dialogue, consistent on-label discussions and leveraging effective avenues for partnering. CE^3.<br/><br/>The role builds and maintains strong professional credibility with regional thought leaders (RTLs) and community-based physicians/HCPs in private practice, medical groups practices, office staff, and other stakeholders in the patient care continuum as their primary point of contact.<br/><br/>The MHAS liaises with other BMS functions, including partner portfolio aligned Therapeutic Areas Specialists (TAS) to deliver an overall higher Customer Experience (Cx) - by meeting HCP needs in a timely and scientific manner. This role will prioritize the safe and appropriate use of BMS products while also focusing on overall business results and performance objectives while exemplifying BMS values.<br/><br/>The MHAS role is field-based and is anticipated to spend 100% of their time in the field engaging solely with our customers in Community Mental Health Centers and Certified Community Behavioral Health Centers.<br/><br/><strong>Portfolio Promotion<br/><br/></strong><strong> Key Responsibilities <br/><br/></strong><ul><li> Promotes approved indications of BMS products within a defined territory or region to meet or exceed assigned sales targets in a compliant manner.</li><li> Creates demand for BMS medicines by articulating in a balanced manner the clinical and scientific rationale for use of products in appropriate patients.</li><li> Engages with and continuously maintains/grows a high level of scientific expertise in all assigned products and therapeutic areas.</li><li> Prepares and successfully implements comprehensive territory and account plans.</li><li> Proactively uses available tools such as CE^3 (once implemented) to derive insights and to dynamically inform call plans. Provides feedback on experience using these tools to leadership to enable continuous improvement.<br/><br/></li></ul><strong>Fair &amp; Balanced Scientific Dialogue<br/><br/></strong><ul><li> Demonstrates scientific expertise and passion in using approved scientific resources and publications to present information to HCPs and ensures medical accuracy.</li><li> Conducts in-office presentations (e.g., lunch and learns) and discusses product-related scientific information with HCPs that is consistent with label.</li><li> Organizes external speaker programs, selecting speakers from list approved by Speakers Bureau and facilitating scheduling and logistics.</li><li> Maintains a high level of working expertise on emerging data for approved indications.</li><li> Engages real-time medical support through Medical on Call to reactively answer unsolicited questions and complex technical inquiries.<br/><br/></li></ul><strong>Cross-functional Collaboration<br/><br/></strong><ul><li> Proactively collaborates with other field teams to ensure the best Customer Experience (Cx) for HCPs.</li><li> Gathers and shares relevant insights and information internally with the appropriate stakeholders to enable BMS to better serve its customers.<br/><br/></li></ul>Complies with all laws, regulations, and policies that govern the conduct of BMS.<br/><br/> <br/><br/><strong>Required Qualifications &amp; Experience<br/><br/></strong><ul><li> Advanced scientific degree and/or preferred 5+ years of pharmaceutical or biotechnology experience as healthcare sales / MSL / HCP / nurse.</li><li> Ability to communicate scientific or clinical data accurately and convincingly to help physicians best serve their patients.</li><li> Demonstrated experience building and maintaining strong credibility with key customers, office staff, and others in the customer influence network via a customer-centric mindset and desire to create positive and differentiated Customer Experience (Cx).</li><li> Experience in Psychiatry is preferred.</li><li> Experience in Community Mental Health Centers and Certified Community Behavior Health Centers preferred.</li><li> Demonstrated strong capability in account management skill sets, superior selling competencies, and proven sales performance track record of meeting or exceeding goals.</li><li> Demonstrated ability to work effectively cross-functionally with a positive team mindset and can-do attitude.</li><li> Strong selling and promotional skills proven through a track record of performance.<br/><br/></li></ul><strong> Key competencies desired <br/><br/></strong><strong>Customer/commercial Mindset<br/><br/></strong><ul><li> Demonstrated ability to drive business results.</li><li> Experience identifying, engaging, and cultivating credibility with customers across the patient care journey.</li><li> Demonstrated account management skills and problem-solving mentality. Understands the patient journey and can customize engagement and deliver tailored messages.</li><li> Demonstrated resourcefulness and ability to connect with customers.<br/><br/></li></ul><strong>Patient Centricity<br/><br/></strong><ul><li> Understands the patient journey and experience.</li><li> Has a patient-focused mindset.<br/><br/></li></ul><strong>Scientific Agility<br/><br/></strong><ul><li> Excellent communication and presentation skills to articulate scientific and clinical data in an easy-to-understand manner to help HCPs best serve their patients.</li><li> Has a strong learning mindset and passion for science. Prioritizes staying current with the latest data.<br/><br/></li></ul><strong>Analytical Capability<br/><br/></strong><ul><li> Ability to analyze data, such as prescribing patterns, market trends, and HCP preferences. Data-driven insights help MHAS strategize and target their efforts effectively.</li><li> Ability to segment HCPs based on their preferences and other relevant factors. This helps them tailor their communication and product presentations to suit individual HCP needs.</li><li> Understanding how to interpret and analyze data related to BMS products, customer preferences, clinical data.</li><li> Ability to use CE^3 to generate insights and do dynamic call planning.<br/><br/></li></ul><strong>Technological Agility<br/><br/></strong><ul><li> Understanding, adapting, and effectively using technology in various aspects of healthcare business and interacting with HCPs.</li><li> Utilizing various digital communication channels such as emails, instant messaging apps, and video conferencing to stay in touch with healthcare professionals, colleagues, and clients. This enables MHAS to respond promptly to inquiries, share updates, and maintain effective communication.</li><li> Competency using CE^3 and other software or CRM tools to collect, enter, and manage quality data in a timely and compliant manner, track interactions, and plan future engagements with healthcare professionals.</li><li> Ability to use the Medical on Call technology effectively.</li><li> Being able to navigate and utilize the internet and online resources effectively.</li><li> Keeping up to date with technological advancements and changes.<br/><br/></li></ul><strong>Teamwork/Enterprise Mindset<br/><br/></strong><ul><li> Strong business acumen to understand and analyze business and market drivers and develop, execute, and adjust business plans.</li><li> Demonstrates a strong sense of learning agility. Seeks out and learns from unfamiliar experiences, and then applies those lessons to achieve better results in subsequent situations.</li><li> Track record of balancing individual drive and collaborative attitude.</li><li> Holds a high level of integrity and good judgment, in order to navigate the requirements of the role effectively and compliantly in accordance with BMS policies and procedures.<br/><br/></li></ul>As this position requires the operation of a Company-provided vehicle, offers of employment are contingent upon the candidate meeting the requirements of Qualified Driver, as determined by the Company in its sole discretion, including but not limited to the following: 1) at least 21 years of age; 2) a driver's license in good standing issued by your state of residence; and, 3) a driving risk level deemed acceptable by the Company.<br/><br/>The starting compensation for this job is a range from $132,000 - $155,000, plus incentive cash and stock opportunities (based on eligibility).<br/><br/>The starting pay rate takes into account characteristics of the job, such as required skills and the where the job is performed.<br/><br/>Final individual compensation will be decided based on demonstrated experience.<br/><br/>For more on benefits, please visit our https://careers.bms.com/working-with-us<br/><br/>Eligibility for specific benefits listed on our BMS Careers site may vary based on the job and location.<br/><br/>Benefit offerings are subject to the terms and conditions of the applicable plans then in effect and may include the following: Medical, pharmacy, dental and vision care. Wellbeing support such as the BMS Living Life Better program and employee assistance programs (EAP). Financial well-being resources and a 401(K). Financial protection benefits such as short- and long-term disability, life insurance, supplemental health insurance, business travel protection and survivor support. Work-life programs include paid national holidays and optional holidays, Global Shutdown days between Christmas and New Year's holiday, up to 120 hours of paid vacation, up to two (2) paid days to volunteer, sick time off, and summer hours flexibility. Parental, caregiver, bereavement, and military leave. Family care services such as adoption and surrogacy reimbursement, fertility/infertility benefits, support for traveling mothers, and child, elder and pet care resources. Other perks like tuition reimbursement and a recognition program.<br/><br/>and #BMSNEURO<br/><br/>If you come across a role that intrigues you but doesn't perfectly line up with your resume, we encourage you to apply anyway. You could be one step away from work that will transform your life and career.<br/><br/><strong>Uniquely Interesting Work, Life-changing Careers<br/><br/></strong>With a single vision as inspiring as Transforming patients' lives through science™ , every BMS employee plays an integral role in work that goes far beyond ordinary. Each of us is empowered to apply our individual talents and unique perspectives in an inclusive culture, promoting diversity in clinical trials, while our shared values of passion, innovation, urgency, accountability, inclusion and integrity bring out the highest potential of each of our colleagues.<br/><br/><strong>On-site Protocol<br/><br/></strong><strong>Responsibilities<br/><br/></strong>BMS has a diverse occupancy structure that determines where an employee is required to conduct their work. This structure includes site-essential, site-by-design, field-based and remote-by-design jobs. The occupancy type that you are assigned is determined by the nature and responsibilities of your role:<br/><br/>Site-essential roles require 100% of shifts onsite at your assigned facility. Site-by-design roles may be eligible for a hybrid work model with at least 50% onsite at your assigned facility. For these roles, onsite presence is considered an essential job function and is critical to collaboration, innovation, productivity, and a positive Company culture. For field-based and remote-by-design roles the ability to physically travel to visit customers, patients or business partners and to attend meetings on behalf of BMS as directed is an essential job function.<br/><br/>BMS is dedicated to ensuring that people with disabilities can excel through a transparent recruitment process, reasonable workplace accommodations/adjustments and ongoing support in their roles. Applicants can request a reasonable workplace accommodation/adjustment prior to accepting a job offer. If you require reasonable accommodations/adjustments in completing this application, or in any part of the recruitment process, direct your inquiries to  adastaffingsupport@bms.com  . Visit  careers.bms.com/  eeo  -accessibility  to access our complete Equal Employment Opportunity statement.<br/><br/>BMS cares about your well-being and the well-being of our staff, customers, patients, and communities. As a result, the Company strongly recommends that all employees be fully vaccinated for Covid-19 and keep up to date with Covid-19 boosters.<br/><br/>BMS will consider for employment qualified applicants with arrest and conviction records, pursuant to applicable laws in your area.<br/><br/>Any data processed in connection with role applications will be treated in accordance with applicable data privacy policies and regulations.<br/><br/>", "responsibilities": "The MHAS is a critical role in our unique customer model to execute the BMS aspiration to be the BioPharma team that delivers the most impactful engagement with Health Care Providers (HCPs), driving adoption of new and existing medicines for appropriate patients. This role will be hired to support the potential US commercialization of our lead investigational product, which, if approved by the FDA, could be the first ever treatment to target muscarinic receptor circuits for schizophrenia. The Mental Health Account Specialist team will call on the providers and care team members specifically at Community Mental Health Centers and Certified Community Behavior Health Centers. You will be a critical member of the launch team. Geographies may cover multiple states as they will mirror our District footprints.<br/><br/>The primary role of the MHAS is to drive demand for BMS medicines within their portfolio for the appropriate patients. To meet the HCPs expectations, the MHAS engages them with a differentiated Customer Experience (Cx) through deeper scientific dialogue, consistent on-label discussions and leveraging effective avenues for partnering. CE^3.<br/><br/>The role builds and maintains strong professional credibility with regional thought leaders (RTLs) and community-based physicians/HCPs in private practice, medical groups practices, office staff, and other stakeholders in the patient care continuum as their primary point of contact.<br/><br/>The MHAS liaises with other BMS functions, including partner portfolio aligned Therapeutic Areas Specialists (TAS) to deliver an overall higher Customer Experience (Cx) - by meeting HCP needs in a timely and scientific manner. This role will prioritize the safe and appropriate use of BMS products while also focusing on overall business results and performance objectives while exemplifying BMS values.<br/><br/>The MHAS role is field-based and is anticipated to spend 100% of their time in the field engaging solely with our customers in Community Mental Health Centers and Certified Community Behavioral Health Centers.", "qualifications": {"required": "Advanced scientific degree and/or preferred 5+ years of pharmaceutical or biotechnology experience as healthcare sales / MSL / HCP / nurse.<br/>Ability to communicate scientific or clinical data accurately and convincingly to help physicians best serve their patients.<br/>Demonstrated experience building and maintaining strong credibility with key customers, office staff, and others in the customer influence network via a customer-centric mindset and desire to create positive and differentiated Customer Experience (Cx).<br/>Experience in Psychiatry is preferred.<br/>Experience in Community Mental Health Centers and Certified Community Behavior Health Centers preferred.<br/>Demonstrated strong capability in account management skill sets, superior selling competencies, and proven sales performance track record of meeting or exceeding goals.<br/>Demonstrated ability to work effectively cross-functionally with a positive team mindset and can-do attitude.<br/>Strong selling and promotional skills proven through a track record of performance.", "preferred": "Experience in Psychiatry is preferred.<br/>Experience in Community Mental Health Centers and Certified Community Behavior Health Centers preferred."}, "skills": ["Scientific", "Clinical", "Communication", "Presentation", "Account Management", "Selling", "Sales", "Cross-functional", "Teamwork", "Business Acumen", "Learning Agility", "Integrity", "Judgment", "Customer-centric", "Patient-focused", "Data Analysis", "Technology", "Digital Communication", "CRM", "Medical on Call", "Internet", "Online Resources"], "postedDate": "1 week ago", "benefits": "The starting compensation for this job is a range from $132,000 - $155,000, plus incentive cash and stock opportunities (based on eligibility).<br/><br/>The starting pay rate takes into account characteristics of the job, such as required skills and the where the job is performed.<br/><br/>Final individual compensation will be decided based on demonstrated experience.<br/><br/>For more on benefits, please visit our https://careers.bms.com/working-with-us<br/><br/>Eligibility for specific benefits listed on our BMS Careers site may vary based on the job and location.<br/><br/>Benefit offerings are subject to the terms and conditions of the applicable plans then in effect and may include the following: Medical, pharmacy, dental and vision care. Wellbeing support such as the BMS Living Life Better program and employee assistance programs (EAP). Financial well-being resources and a 401(K). Financial protection benefits such as short- and long-term disability, life insurance, supplemental health insurance, business travel protection and survivor support. Work-life programs include paid national holidays and optional holidays, Global Shutdown days between Christmas and New Year's holiday, up to 120 hours of paid vacation, up to two (2) paid days to volunteer, sick time off, and summer hours flexibility. Parental, caregiver, bereavement, and military leave. Family care services such as adoption and surrogacy reimbursement, fertility/infertility benefits, support for traveling mothers, and child, elder and pet care resources. Other perks like tuition reimbursement and a recognition program.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002472647"}