{"jobTitle": "Lead Safety Manager", "company": {"name": "Afton Consulting Group", "industry": "Human Resources Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$150,000.00 - $175,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Human Resources Services", "description": "Company is seeking a Lead Safety Manager to join our Project in Los Angeles, CA. Company is a leading civil, building, and specialty Construction Company that believes integrity, teamwork, and a collaborative approach are fundamental to our business success. We transform industries and communities through stunning and complex infrastructure projects — to ensure public safety, maintain a quality of life and support a healthy economy. For more than a century, Company’s family of construction companies has supported the development and maintenance of many diverse projects across our great nation. From coast to coast, notable projects include The Purple Line Extensions in Los Angeles, SR 99 Viaduct replacement tunnel in Seattle, East Side Access projects and the Hudson Yards Platform in New York, Central Subway Third Street Light Rail in San Francisco, and multiple airport expansions and bridge projects. At Company you will have the opportunity to work on a variety of large, high-profile, projects that impact your community.", "responsibilities": "Maintains a SAFE jobsite, monitors safety and takes appropriate action to correct any safety issues or deficiencies. Oversees and manages on-site Safety Staff, which includes, Safety Coordinators, Safety Apprentices and Safety Administrative Assistants on multiple shifts. Purchases Safety equipment. Responsible for site specific safety assignments and multi-shift coverage. Ensures compliance with all health and safety regulations and keeps abreast of any changes to laws and regulations that impact the organization. Monitors activities at construction sites. Inspects construction site daily. Assists Project Manager and/or Superintendents with the development and monitoring of the job specific safety plans. Review accident procedure. Prepares and reviews the minutes of safety meetings. Maintain MSDS and Hazardous Communication Program. Completes incident reports and distributes and maintains files. Gathers toolbox reports from foreman and subcontractors. Receives and monitors safety reports and responds when discrepancies occur in monthly man-hour report and maintains JV OSHA Log 300. Monitors all accidents and maintains appropriate paperwork and files pertaining to same. Gathers Monthly Safety Hours from subcontractors for the monthly Report and forwards to Safety Director. Maintains and conducts Safety audits. Control hazardous working conditions and unsafe employee activities through safety management and contact with field supervisory personnel. Supervise and conduct safety and first aid training of staff at the project sites. Document all accidents, safety violations, unsafe conditions/activities. Manage investigations with employees, subcontractor personnel and CCIP carrier for each accident occurrence or violation. Review daily, weekly, and monthly field documentation to ensure all required records and reports are complete, accurate and submitted per established procedures. Accompany all safety, health, and insurance inspectors on walk through tours. Prepare written appeals for safety violation citations. Additional assignments on supervisor’s request.", "qualifications": {"required": "Requires at least five years of underground construction safety experience. Requires at least 10 years of heavy civil construction. Construction Safety and Health Technician (CHST) or Certified Safety Professional (CSP). Familiarity with occupational safety and health laws and regulations. Current certification in first aid and CPR by the American Red Cross or its equivalent. Current certification by Cal/OSHA, Mining and Tunneling Division as both an Underground Safety Representative and an Underground Gas Tester. College Degree highly preferred. Proficient in Microsoft 365 software. The Cal OSHA certifications may be earned within 6 months of hire date.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4002362891"}