{"jobTitle": "Communications Specialist, Movies, Amazon MGM Studios", "company": {"name": "Amazon", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Software Development", "description": "Amazon MGM Studios is seeking an experienced Communications Specialist to support the studio's film business. You will be an integral member of the Corporate Communications team and be responsible for supporting media relations and strategic communications. You must be highly self-motivated, have extraordinary judgment, excellent communications and project management skills and exemplary writing ability.<br/><br/>Key job responsibilities<br/><br/><ul><li> Draft announcements and help secure placements surrounding film development, green lights, acquisitions, and castings, in addition to helping manage the process with the studio’s senior leaders and representatives on behalf of filmmakers and talent</li><li> Develop and foster relationships with entertainment media and help handle corporate and film-related inquiries</li><li> Develop high-quality written materials such as press releases, executive biographies, messaging documents, and talking points, in addition to corporate reports for stakeholders that provide key information about the studio’s news-driving announcements and events</li><li> Provide on-site support for film festivals and premieres, such as overseeing executive logistics</li><li> Help to strategically identify editorial opportunities, proactively pitch stories, and secure placements across trade and business outlets</li><li> Handle administrative functions supporting the studio’s Corporate Communications team, including: scheduling calls and meetings, drafting and circulating agendas, maintaining the team’s internal drive, and monitoring and servicing press breaks.<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> 5+ years of recent professional communications or public relations experience</li><li> Bachelor's degree in communications, public relations, or a related field<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Experience in entertainment communications, specifically at a streaming service, studio, network, or agency<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $68,900/year in our lowest geographic market up to $147,400/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2734746", "postedDate": "6 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002283150"}