{"jobTitle": "Entry-Level Remote Social Media Manager", "company": {"name": "NoGigiddy", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "20-27 per hour", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "Job Description: NoGigiddy is looking for a creative and motivated Entry-Level Social Media Manager to join our remote team. In this role, you will assist in managing our social media presence, creating engaging content, and building our brand online. This position is perfect for someone eager to start their career in social media and digital marketing. No college degree is required, but a passion for social media and excellent communication skills are essential. Key Responsibilities: Content Creation : Assist in developing and curating engaging and creative content for social media platforms including Facebook, Twitter, LinkedIn, and Instagram. Social Media Strategy : Support the implementation of social media strategies to increase brand awareness, engagement, and followers. Community Management : Monitor and engage with our community across social media platforms, responding to comments, messages, and mentions under the guidance of senior team members. Analytics and Reporting : Help track and analyze social media metrics to assess performance and inform future strategies. Assist in providing regular reports on social media activity. Collaboration : Work closely with the marketing team to ensure consistent messaging and support overall marketing goals. Campaign Management : Assist in planning and executing social media campaigns, including paid advertising campaigns. Trend Monitoring : Stay updated on the latest social media trends, tools, and best practices to keep our social media efforts current and effective. Brand Voice : Help maintain and develop NoGigiddy’s brand voice and ensure all content aligns with our brand values and goals. Skills and Qualifications: Communication Skills : Exceptional verbal and written communication skills. Creativity : Ability to create visually appealing and engaging content. Technical Skills : Basic proficiency with social media platforms and tools (Facebook, Twitter, LinkedIn, Instagram, etc.). Organizational Skills : Ability to manage multiple tasks and prioritize effectively. Interpersonal Skills : Strong ability to interact with online community members and stakeholders. Analytical Skills : Basic ability to analyze social media metrics and translate them into actionable insights. Problem-Solving : Ability to address and resolve issues that arise on social media platforms. Time Management : Strong ability to manage time and meet deadlines. Preferred Experience: Experience in social media management, digital marketing, or a related field is a plus but not required. Familiarity with social media advertising and analytics tools is a plus. Previous experience with gig economy platforms or staffing apps is a plus. Education: High school diploma or equivalent. Relevant certifications or coursework in social media, marketing, or digital marketing are beneficial but not required. Working Conditions: Remote Work : The role is remote, allowing for flexibility in work location. Collaboration : Regular virtual meetings and communications with the marketing team. Tools : Use of various communication and collaboration tools, such as email, video conferencing, and social media management software. Salary Range: $20 to $27 per hour, depending on experience and qualifications.", "responsibilities": "Content Creation : Assist in developing and curating engaging and creative content for social media platforms including Facebook, Twitter, LinkedIn, and Instagram. Social Media Strategy : Support the implementation of social media strategies to increase brand awareness, engagement, and followers. Community Management : Monitor and engage with our community across social media platforms, responding to comments, messages, and mentions under the guidance of senior team members. Analytics and Reporting : Help track and analyze social media metrics to assess performance and inform future strategies. Assist in providing regular reports on social media activity. Collaboration : Work closely with the marketing team to ensure consistent messaging and support overall marketing goals. Campaign Management : Assist in planning and executing social media campaigns, including paid advertising campaigns. Trend Monitoring : Stay updated on the latest social media trends, tools, and best practices to keep our social media efforts current and effective. Brand Voice : Help maintain and develop NoGigiddy’s brand voice and ensure all content aligns with our brand values and goals.", "qualifications": {"required": "Communication Skills : Exceptional verbal and written communication skills. Creativity : Ability to create visually appealing and engaging content. Technical Skills : Basic proficiency with social media platforms and tools (Facebook, Twitter, LinkedIn, Instagram, etc.). Organizational Skills : Ability to manage multiple tasks and prioritize effectively. Interpersonal Skills : Strong ability to interact with online community members and stakeholders. Analytical Skills : Basic ability to analyze social media metrics and translate them into actionable insights. Problem-Solving : Ability to address and resolve issues that arise on social media platforms. Time Management : Strong ability to manage time and meet deadlines.", "preferred": "Experience in social media management, digital marketing, or a related field is a plus but not required. Familiarity with social media advertising and analytics tools is a plus. Previous experience with gig economy platforms or staffing apps is a plus. Education: High school diploma or equivalent. Relevant certifications or coursework in social media, marketing, or digital marketing are beneficial but not required."}, "skills": ["Facebook", "Twitter", "LinkedIn", "Instagram", "Social Media", "Digital Marketing", "Content Creation", "Social Media Strategy", "Community Management", "Analytics", "Reporting", "Collaboration", "Campaign Management", "Trend Monitoring", "Brand Voice", "Communication", "Creativity", "Technical Skills", "Organizational Skills", "Interpersonal Skills", "Analytical Skills", "Problem-Solving", "Time Management"], "postedDate": "1 week ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002711183"}