{"jobTitle": "Business Development Manager - Tech, Amazon Shipping", "company": {"name": "Amazon", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "83,100.00/year - 177,800.00/year", "currency": "USD"}, "jobFunction": "Business Development and Information Technology", "industry": "Software Development", "description": "This is an exciting opportunity to join a new emerging business in transportation. We are a startup team looking for a highly driven, entrepreneurial, analytical and customer-obsessed individual to help create and lead the Business Development strategy. The ideal candidate will be excited by launching a new program from the beginning of its life cycle, and will have familiarity with leading sales generation with both small and large customers. We are reinventing the approach to selling in this industry and looking for a candidate who can partner with Product Management and Tech as we challenge the status quo and invent on behalf of our customers.<br/><br/>Key job responsibilities<br/><br/><ul><li> Drive revenue, adoption and market segment share for our product</li><li> Earn trust of customers and recommend product solutions that fit their business needs</li><li> Measure performance, articulate root-cause analysis and make recommendations for improvement areas</li><li> Relay market needs and customer feedback to internal Amazon teams including Product Management and Technical</li><li> Create program goals and metrics, track progress and manage through obstacles to achieve your objectives</li><li> Assess risks, anticipate challenges and provide escalation management when necessary</li><li> Meet or exceed targets for customer and/or feature spend adoption<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> 3+ years of business development, partnership management, or sourcing new business experience</li><li> Bachelor's degree or equivalent</li><li> Experience using data and metrics to determine and drive improvements<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Experience in online advertising or high-tech products/services<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $83,100/year in our lowest geographic market up to $177,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2734565", "responsibilities": "Drive revenue, adoption and market segment share for our product\nEarn trust of customers and recommend product solutions that fit their business needs\nMeasure performance, articulate root-cause analysis and make recommendations for improvement areas\nRelay market needs and customer feedback to internal Amazon teams including Product Management and Technical\nCreate program goals and metrics, track progress and manage through obstacles to achieve your objectives\nAssess risks, anticipate challenges and provide escalation management when necessary\nMeet or exceed targets for customer and/or feature spend adoption", "qualifications": {"required": "3+ years of business development, partnership management, or sourcing new business experience\nBachelor's degree or equivalent\nExperience using data and metrics to determine and drive improvements", "preferred": "Experience in online advertising or high-tech products/services"}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002278663"}