{"jobTitle": "Manager/Director of Strategic Sourcing", "company": {"name": "Nevados", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing and Supply Chain", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "<strong>Company Overview<br/></strong>Nevados is the premier solar tracker company for PV power plants built on sloped and rolling terrain. We offer innovative all-terrain trackers paired with a comprehensive software suite in an integrated technology platform that optimizes solar performance, improves plant reliability and respects the natural landscape. Headquartered in Oakland and backed by institutional capital, Nevados is transforming utility-scale PV deployment with our tracking solutions and partnership approach.<br/><br/>Nevados is a distributed organization with many team members working remotely, while other roles require an in office and on-site presence. Specifics of the work location, travel expectations and other role requirements are outlined in the position overview. Ideal candidates are self-starters who are able to direct and manage their time wisely.<br/><br/><strong>Position Overview:<br/><br/></strong>Nevados is seeking a Manager of Strategic Sourcing who will be focused on pre-project / BOM sourcing, steel planning strategy, commodities sourcing, futures planning and new supplier partnerships while maintaining current relationships. This person will create a path for risk management and be responsible for identifying new partners, going through RFI/RFQ and contracting new partners to meet regional expansion requirements for Nevados.<br/><br/>The Strategic Sourcing Manager will report into the Vice President of Operations &amp; Global Supply Chain and be responsible for managing the execution of supplier strategy, sourcing, planning procurement volumes, factory capacity management, negotiations with current and future Nevados suppliers, long term contract negotiations and liaison with Nevados Product Management, NPI, Applications Team, Supply Chain and Leadership.<br/><br/>Location: Hybrid/Remote Depending on candidate location - Opportunities for travel with on-site meetings at Headquarters, trade shows, project sites and suppliers as needed.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Steel Procurement strategy with mills and service centers</li><li>Create new partnerships with service centers</li><li>Geographic supplier planning in the US to support growth</li><li>Identify and qualify new partners outside the US for high quality manufacturing for steel parts</li><li>New partner outside the US for electronic components </li><li>Ownership of Pre-BOM, releases of updates/changes/capacity</li><li>Risk Management for supply chain activities (supplier, capacity, sub-suppliers, quality)<br/><br/><br/><br/><br/></li></ul><strong>Key Tasks<br/><br/><br/></strong><ul><li>Communication and collaboration with manufacturers to improve relationships and scale production capabilities</li><li>Collaboration with product team to incorporate new products within the manufacturing process for future projects</li><li>Onboarding and development of relationships with new suppliers to create depth in manufacturing capabilities</li><li>Manage commodity costs within using all tools and strategy to reduce risk in cost change/trend</li><li>New supplier onboarding</li><li>Identifying bottlenecks and develop solutions to meet needs of customers and avoid delays</li><li>Implement strategic sourcing initiatives including Master Supplier Agreements (MSA), stocking plans, and other actions which improve cost structure and support to customers</li><li>Assist in the adoption and implementation of corporate purchasing initiatives</li><li>Design and implement risk management program</li><li>Drive Key Initiatives and Key Performance Indicators that bring value to Nevados growth and stabilization<br/><br/><br/><br/><br/></li></ul>The role is not limited to these activities and opportunities will arise to take on additional responsibilities. The individual will work collaboratively with the supply chain team, engineering, sales, leadership, suppliers, and Nevados suppliers. They will be expected to take leadership in accomplishing tasks and to lead meetings with the internal team, suppliers, organize thoughts and release notes with open items and actions to stakeholders. Nevados is partially a remote team, and this person must be a self-starter, be able to manage their time wisely and be driven for success. Organizational, communication and leadership skills will help this person be successful in the role.<br/><br/><strong>Required Qualifications<br/><br/></strong><ul><li>Minimum 10 years of experience in Sourcing /Supply Chain / Procurement / Partnership Building </li><li>5+ years of leading a supply chain or sourcing team and working, communicating, and negotiating with overseas suppliers</li><li>Proven leader in building strong relationships with domestic and international suppliers</li><li>Experience reading and validating commercial contracts and associated paperwork</li><li>Create reports to analyze supply chain functions</li><li>Ability to professionally communicate (verbal and written) with suppliers and customers</li><li>Strong Microsoft Excel abilities with knowledge of Microsoft office applications</li><li>Sourcing experience and relevant experience working in the steel industry is a plus<br/><br/><br/><br/><br/></li></ul><strong>Skills<br/><br/></strong><ul><li>Leadership and team skills (ability to build and maintain cross-functional and cross-regional relationships</li><li>Strategic focus, with ability to convert strategy into executable plans and drive results</li><li>Planning, organizing, problem solving, and decision-making skills</li><li>Strong communication skills </li><li>ERP and Microsoft Suite proficiency</li><li>Critical thinking and adaptability <br/><br/><br/><br/><br/></li></ul>Actual base salary may vary depending on job-related factors, which may include knowledge, skills, experience, and location.<br/><br/><strong>Benefits &amp; Total Compensation Package<br/></strong>Nevados offers competitive base salary, bonus, and equity commensurate with qualifications and experience. Full time employees are provided medical, dental, vision, 401(k), life insurance, and unlimited PTO, with additional benefit offerings as we continue to grow.<br/><br/>This job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee. Duties, responsibilities and activities may change, or new ones may be assigned at any time with or without notice.<br/><br/>Unless otherwise explicitly stated as a requirement of the role, candidates must be willing to travel at least 10-20% of the time for company off-sites, conferences, trade shows, site visits, and other potential events as needed.<br/><br/><em>Don't meet every qualification listed in the job posting above? Apply anyways! Nevados is an Equal Opportunity Employer and committed to building a more inclusive ecosystem that integrates women, people of color, and other underrepresented groups into the cleantech sector and the overall tech industry. We strongly encourage applications from qualified individuals and members of underrepresented groups, even if your past experience doesn't align perfectly. You might be a fit for this role or another open position.<br/><br/></em><strong>Interview Process<br/><br/></strong>At Nevados, our interview process is designed to be comprehensive and thorough to ensure the best fit for both the candidate and our team. It typically entails 3-5 conversations over the course of 3-4 weeks. This timeline and format may vary based on the role as well as availability of team members and the candidate. The process is subject to change at any time.<br/><br/><strong>Phone Screen</strong>: An initial call with Recruiting to discuss your background, expectations, and interest in the role.<br/><br/><strong>Discussions with Hiring Managers</strong>: In-depth calls with hiring managers/team members to assess your technical skills and fit.<br/><br/><strong>Cross Functional Team Member Interviews</strong>: Meetings to gauge team dynamics and working style.<br/><br/><strong>Executive Leadership Conversations</strong>: Discussions with our executive team to ensure alignment with the company's strategic goals and vision.<br/><br/><strong>Professional Reference Checks</strong>: The final step before an offer involves contacting your provided professional references to verify your qualifications and past performance.<br/><br/>We look forward to getting to know you better and exploring the possibility of you joining our team!", "responsibilities": "<ul><li>Steel Procurement strategy with mills and service centers</li><li>Create new partnerships with service centers</li><li>Geographic supplier planning in the US to support growth</li><li>Identify and qualify new partners outside the US for high quality manufacturing for steel parts</li><li>New partner outside the US for electronic components </li><li>Ownership of Pre-BOM, releases of updates/changes/capacity</li><li>Risk Management for supply chain activities (supplier, capacity, sub-suppliers, quality)<br/><br/><br/><br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Minimum 10 years of experience in Sourcing /Supply Chain / Procurement / Partnership Building </li><li>5+ years of leading a supply chain or sourcing team and working, communicating, and negotiating with overseas suppliers</li><li>Proven leader in building strong relationships with domestic and international suppliers</li><li>Experience reading and validating commercial contracts and associated paperwork</li><li>Create reports to analyze supply chain functions</li><li>Ability to professionally communicate (verbal and written) with suppliers and customers</li><li>Strong Microsoft Excel abilities with knowledge of Microsoft office applications</li><li>Sourcing experience and relevant experience working in the steel industry is a plus<br/><br/><br/><br/><br/></li></ul>", "preferred": null}, "skills": ["Leadership", "Team skills", "Strategic focus", "Planning", "Organizing", "Problem solving", "Decision-making skills", "Communication skills", "ERP", "Microsoft Suite proficiency", "Critical thinking", "Adaptability"], "postedDate": "1 week ago", "benefits": "Nevados offers competitive base salary, bonus, and equity commensurate with qualifications and experience. Full time employees are provided medical, dental, vision, 401(k), life insurance, and unlimited PTO, with additional benefit offerings as we continue to grow.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002068653"}