{"jobTitle": "Principal Buyer", "company": {"name": "Life Science Outsourcing, Inc.", "industry": "Medical Equipment Manufacturing", "size": "Not specified", "location": "Brea, CA"}, "location": "Brea, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Medical Equipment Manufacturing", "description": "(www.lso-inc.com)is in North Orange County in the city of Brea, California. Life Science Outsourcing, Inc (“LSO”) is a contract manufacturer of medical devices with in-built capabilities to offer clients full-service solutions through our six divisions. Clients rely on LSO to perform all activities required to introduce their products to market, from sourcing to drop shipping. We are shaped by our values: Do the Right Thing, Customer Success, Employee Success, Speed and Simplicity. In January 2021, LSO partnered with PPC Enterprises(www.ppcenterprises.com), a leading private equity firm based out of New York, to expand LSO’s geographic reach in the medical device arena. We are currently seeking an energetic and motivated Principal Buyer to join our fast-growing organization. In this role, you will be responsible for performing and coordinating the procurement, scheduling, and expediting of direct and indirect materials and service to meet production schedule and internal customer order requirements. Mainly responsible for all activities surrounding the purchase of raw materials to optimize inventory management through supplier quality and deliveries. And no matter where you look at LSO, you will witness our shared purpose—helping realize life’s potential—in action; it’s at the heart of what we do. Our work helps improve millions of lives. We hope you will see yourself here, too. We encourage you to submit a resume with salary requirements.", "responsibilities": "Work closely with Planning to perform and coordinate the procurement of raw material for complex product lines to meet master schedule and customer order requirements across sites. Serve as the key point-of-contact with supplier to communicate forecast, capacity, and supply needs. Process purchase orders while negotiating a cost reduction for multiple sites to reach cost saving goals. Implement procurement strategies, policies, and procedures while successfully managing risks. Resolve quality, pricing, and delivery issues with suppliers. Support new product development by coordinating supplier’s input during the development period and lead negotiation for desired results. Collect, analyze, and interpret manufacturing data to make decisions that may impact production, staff, or processes. Identify and implement cost savings and cost avoidance opportunities. Establish and maintain positive supplier relations and partnerships. Develop procurement metrics and tracking reports. Manage large projects and critical tasks progress. Accept the responsibility of a leader role in improving processes. Prioritize own assignments while focusing on key tasks despite limited time and resources. Work under minimal supervision while assisting less experienced peers. Perform additional duties and responsibilities as assigned.", "qualifications": {"required": "Bachelor’s degree in a related area. Minimum of ten (10) years of relevant experience. Experience using Deacom or related MRP system. Strong knowledge of ERP/MRP Systems, BOM and planning skills. Tactical experience with lean principles and supply chain management including material flow and delivery applications. Advanced knowledge and understanding of manufacturing, purchasing, scheduling, and planning best practices and procedures. Strong analytical, problem solving, and negotiating skills. Experience with developing and implementing procurement policies. Excellent written and verbal communication and interpersonal skills to build and enhance solid working relationships that promote collaboration and cooperation with all levels of the company and suppliers. Ability to think independently in a constantly changing production environment. Sound judgment and exceptional time management skills. Proficient with MS Word, Excel, Access, Teams, and Outlook.", "preferred": "Knowledge of medical device ISO13485. Medical Device manufacturing experience. APICS or CPIM Certification(s)"}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4002273809"}