{"jobTitle": "Associate Manager, New Verticals - Retail Strategy & Operations", "company": {"name": "DoorDash", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Software Development", "description": "About The Team<br/><br/>The New Verticals team is building and scaling our next big businesses on the DoorDash Marketplace platform, focusing on markets beyond food (e.g., Pet Supplies, Beauty, Home, and Electronics). These Retail categories bring about new challenges and opportunities to build something at DoorDash from the ground up!<br/><br/>About The Role<br/><br/>We’re hiring an Associate Manager to help us build and scale DoorDash’s Retail business. You will cover key functions such as defining the strategy, testing hypotheses, and developing and scaling consumer growth and marketing strategies that will take our retail categories to the next level. You will have an opportunity to drive the strategy for acquiring new customers and retaining existing customers, launch marketing campaigns and promotions, monitor and draw insights from the customer funnel performance, and conduct category and customer deep dives to unlock insights to shape long term strategy. You will report into a Senior Manager on our New Verticals Strategy &amp; Operations team. We are currently operating in a hybrid model, some time in-office and some time remote but it is quite flexible!<br/><br/>You’re Excited About This Opportunity Because You Will…<br/><br/>• Build. You’ll have your fingerprints all over DoorDash’s next big business. You’ll do whatever it takes to launch, get 1% better every day, and scale something completely new. This means everything from high-level strategy to nitty-gritty operational details.<br/>• Strategize. From first principles, you’ll develop the optimal strategy for best serving our customers. <br/>• Experiment. You’ll transform strategies into operational experiments that create measurable and actionable outcomes, informing your larger initiative implementation plans.<br/>• Analyze. You’ll assess the operational and financial impacts of your decisions, and iterate based on data.<br/>• Lead and collaborate. You’ll work with a cross-functional team, including marketing, design, product, and operations to build this new line of business for DoorDash.<br/><br/>We’re Excited About You Because…<br/><br/>• You solve problems from first principles. You’re excited to solve problems in innovative ways, and you resist “this is how it’s always been done” thinking.<br/>• You’re equally comfortable operating at 10,000 feet and 1 foot. You don’t hesitate to get in the weeds and operate at the lowest level of detail, but you’re just as comfortable thinking long-term and inspiring a team. No job is beneath you.<br/>• You’re unafraid of ambiguity. Rapid change and learning is exciting to you, and you thrive in ambiguous, startup environments<br/>• You’re analytical. You let data win arguments, and you’re comfortable pulling your own data in SQL or modeling in Excel.<br/>• You’re a team player. You are able to influence cross-functional stakeholders through data and can ruthless prioritize based on business needs.<br/>• You have 4-6+ years of experience. You’ve succeeded in high-performance cultures (whether in tech, operations, strategy, consulting, banking, or a related experience).<br/>• You have a completed Bachelor’s Degree.<br/><br/>Bonus Points<br/><br/>• You have experience starting or scaling a successful startup.<br/>• You have a demonstrated interest or experience in retail and/or ecommerce.<br/>• You have SQL experience.<br/><br/>We use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on June 20, 2024.<br/><br/>Please see the independent bias audit report covering our use of Covey here.<br/><br/>Compensation<br/><br/>The successful candidate's starting pay will fall within the pay range listed below and is determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions. Base salary is localized according to an employee’s work location. Ranges are market-dependent and may be modified in the future.<br/><br/>In addition to base salary, the compensation for this role includes opportunities for equity grants. Talk to your recruiter for more information.<br/><br/>DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.<br/><br/>To learn more about our benefits, visit our careers page here.<br/><br/>The base pay for this position ranges from our lowest geographical market up to our highest geographical market within California, Colorado, District of Columbia, Hawaii, New Jersey, New York and Washington.<br/><br/>$91,800—$135,000 USD<br/><br/>About DoorDash<br/><br/>At DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users—from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods.<br/><br/>DoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees’ happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.<br/><br/>Our Commitment to Diversity and Inclusion<br/><br/>We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.<br/><br/>Statement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on “protected categories,” we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce – people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.<br/><br/>If you need any accommodations, please inform your recruiting contact upon initial connection.", "responsibilities": "You’ll have your fingerprints all over DoorDash’s next big business. You’ll do whatever it takes to launch, get 1% better every day, and scale something completely new. This means everything from high-level strategy to nitty-gritty operational details.<br/>From first principles, you’ll develop the optimal strategy for best serving our customers. <br/>You’ll transform strategies into operational experiments that create measurable and actionable outcomes, informing your larger initiative implementation plans.<br/>You’ll assess the operational and financial impacts of your decisions, and iterate based on data.<br/>You’ll work with a cross-functional team, including marketing, design, product, and operations to build this new line of business for DoorDash.", "qualifications": {"required": "You solve problems from first principles. You’re excited to solve problems in innovative ways, and you resist “this is how it’s always been done” thinking.<br/>You’re equally comfortable operating at 10,000 feet and 1 foot. You don’t hesitate to get in the weeds and operate at the lowest level of detail, but you’re just as comfortable thinking long-term and inspiring a team. No job is beneath you.<br/>You’re unafraid of ambiguity. Rapid change and learning is exciting to you, and you thrive in ambiguous, startup environments<br/>You’re analytical. You let data win arguments, and you’re comfortable pulling your own data in SQL or modeling in Excel.<br/>You’re a team player. You are able to influence cross-functional stakeholders through data and can ruthless prioritize based on business needs.<br/>You have 4-6+ years of experience. You’ve succeeded in high-performance cultures (whether in tech, operations, strategy, consulting, banking, or a related experience).<br/>You have a completed Bachelor’s Degree.", "preferred": "You have experience starting or scaling a successful startup.<br/>You have a demonstrated interest or experience in retail and/or ecommerce.<br/>You have SQL experience."}, "skills": ["SQL", "Strategy", "Retail", "Ecommerce", "Marketing", "Operations", "Analysis", "Leadership", "Collaboration"], "postedDate": "6 days ago", "benefits": "DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.", "salary": {"amount": "91,800—$135,000", "currency": "USD"}, "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002319850"}