{"jobTitle": "Customer Service & Sales Associate", "company": {"name": "Riverside Payments", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Financial Services", "description": "Job Description<br/><br/>Who we are:<br/><br/>What are you working for? Sure, most people work for money, but beyond that. Is it stability? Is it so you can afford that new home? Maybe there is looming debt that needs to be paid, or maybe you’re looking to grow your retirement. Whatever it is you’re working for, be it money or some larger goal, Riverside Payments has developed the system and provided the tools to thousands of Customer Service &amp; Sales Associates to accomplish what they set out to do.<br/><br/>Welcome to the Riverside Family. Working with us is not just another sales job. We’re changing our community and want you to be a part of our Customer Service &amp; Sales Associate team. We’ll set you up for success and be there with you every step of the way. Come as you are, bring the energy and get rewarded. We will take care of the rest.<br/><br/>What we do:<br/><br/>Riverside Payments is one of the largest and fastest growing merchant services companies in the nation. We give businesses the ability to accept debit and credit cards as a form of payment. From providing the equipment to processing the transactions, we provide businesses the ability to accept credit cards and allow them to compete in today’s changing marketplace. We do this all while saving them money on every transaction that they run.<br/><br/>We are determined to grow our organization and we are hiring immediately for good candidates. With a team that operates with a foundation built on family, community, teamwork, positivity and dedication we are committed to your success. If this sounds like the future you can picture yourself living, send us your resume' today for a chance to tell us why you believe you will be a great asset to join our diverse and dynamic team!<br/><br/>Customer Service &amp; Sales Associate Expectations:<br/><br/><ul><li>Help local business owners save money on their credit card processing!</li><li>Prospect leads thru a combination of warm leads and referrals</li><li>Attend appointments set by marketing and pitch Riverside’s products and services</li><li>Follow Riverside’s proven sales methods to negotiate and close new deals</li><li>Check in with National Sales Managers for support in closing new accounts and to receive additional training</li><li>Follow up with leads and move them thru the sales funnel</li><li>Attend ongoing trainings to enhance sales skills</li><li>Attend AM conference calls to learn about daily bonuses and prizes</li><li>Remote work - from home (10%) and field sales work (90%)<br/><br/></li></ul>Customer Service &amp; Sales Associate Qualifications`:<br/><br/>Looking for sales Candidates who are self driven, upbeat and outgoing. We are hiring immediately for team players who are willing to learn!<br/><br/><ul><li>Customer service background (preferred)</li><li>Self driven, upbeat, outgoing individuals!</li><li>All levels of sales experience accepted, some sales experience preferred but not required!</li><li>Ability to network/self-market to gain self-generated leads. </li><li>We are looking for those with great time management, positive mindset, communication, and integrity; we can teach you the rest!<br/><br/></li></ul>Customer Service &amp; Sales Associate Position Perks:<br/><br/>There is extensive training for the Customer Service &amp; Sales Associate position. Riverside's National Sales Managers are also there to guide you during appointments and in reviews. Our motto is Together We Rise so we strive to help you be the best so we can all succeed together<br/><br/><ul><li>1099 Sales Associates are commission based with uncapped earnings!</li><li>YOU create your own schedule. </li><li>Weekly draw available. </li><li>Residual Income. </li><li>Recruiting bonuses &amp; Referral Program</li><li>Train from home over video conference calls. </li><li>Remote meetings/conference calls from home and field sales work. </li><li>Production bonuses earned weekly. </li><li>$75k-95k earned yearly, with top performers making 100k +. </li><li>Travel expenses compensated. </li><li>Advancement opportunities to Territory Manager and National Sales Manager. </li><li>Gas reimbursement. <br/><br/></li></ul>Riverside Payments encourages applicants of all ages and experience, as we do not discriminate on the basis of an applicant's age. Riverside Payments provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national original, age, disability or genetics. In addition to federal law requirements, Riverside Payments complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities.<br/><br/>This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.<br/><br/>Company Description<br/><br/>Who we are:<br/><br/>What are you working for? Sure, most people work for money, but beyond that. Is it stability? Is it so you can afford that new home? Maybe there is looming debt that needs to be paid, or maybe you’re looking to grow your retirement. Whatever it is you’re working for, be it money or some larger goal, Riverside Payments has developed the system and provided the tools to thousands of Account Executives to accomplish what they set out to do.<br/><br/>Welcome to the Riverside Family. Working with us is not just another sales job. We’re changing our community and want you to be a part of our Account Executive team. We’ll set you up for success and be there with you every step of the way. Come as you are, bring the energy and get rewarded. We will take care of the rest.<br/><br/>What we do:<br/><br/>Riverside Payments is one of the largest and fastest growing merchant services companies in the nation. We give businesses the ability to accept debit and credit cards as a form of payment. From providing the equipment to processing the transactions, we provide businesses the ability to accept credit cards and allow them to compete in today’s changing marketplace. We do this all while saving them money on every transaction that they run.<br/><br/>We are determined to grow our organization and we are hiring immediately for good candidates. With a team that operates with a foundation built on family, community, teamwork, positivity and dedication we are committed to your success. If this sounds like the future you can picture yourself living, send us your resume' today for a chance to tell us why you believe you will be a great asset to join our diverse and dynamic team!<br/><br/>Who we are: What are you working for? Sure, most people work for money, but beyond that. Is it stability? Is it so you can afford that new home? Maybe there is looming debt that needs to be paid, or maybe you’re looking to grow your retirement. Whatever it is you’re working for, be it money or some larger goal, Riverside Payments has developed the system and provided the tools to thousands of Account Executives to accomplish what they set out to do. Welcome to the Riverside Family. Working with us is not just another sales job. We’re changing our community and want you to be a part of our Account Executive team. We’ll set you up for success and be there with you every step of the way. Come as you are, bring the energy and get rewarded. We will take care of the rest. What we do: Riverside Payments is one of the largest and fastest growing merchant services companies in the nation. We give businesses the ability to accept debit and credit cards as a form of payment. From providing the equipment to processing the transactions, we provide businesses the ability to accept credit cards and allow them to compete in today’s changing marketplace. We do this all while saving them money on every transaction that they run. We are determined to grow our organization and we are hiring immediately for good candidates. With a team that operates with a foundation built on family, community, teamwork, positivity and dedication we are committed to your success. If this sounds like the future you can picture yourself living, send us your resume' today for a chance to tell us why you believe you will be a great asset to join our diverse and dynamic team!", "responsibilities": "Help local business owners save money on their credit card processing!\nProspect leads thru a combination of warm leads and referrals\nAttend appointments set by marketing and pitch Riverside’s products and services\nFollow Riverside’s proven sales methods to negotiate and close new deals\nCheck in with National Sales Managers for support in closing new accounts and to receive additional training\nFollow up with leads and move them thru the sales funnel\nAttend ongoing trainings to enhance sales skills\nAttend AM conference calls to learn about daily bonuses and prizes\nRemote work - from home (10%) and field sales work (90%)", "qualifications": {"required": "Customer service background (preferred)\nSelf driven, upbeat, outgoing individuals!\nAll levels of sales experience accepted, some sales experience preferred but not required!\nAbility to network/self-market to gain self-generated leads. \nWe are looking for those with great time management, positive mindset, communication, and integrity; we can teach you the rest!", "preferred": ""}, "skills": ["Customer Service", "Sales", "Networking"], "postedDate": "5 days ago", "benefits": "1099 Sales Associates are commission based with uncapped earnings!\nYOU create your own schedule. \nWeekly draw available. \nResidual Income. \nRecruiting bonuses &amp; Referral Program\nTrain from home over video conference calls. \nRemote meetings/conference calls from home and field sales work. \nProduction bonuses earned weekly. \n$75k-95k earned yearly, with top performers making 100k +. \nTravel expenses compensated. \nAdvancement opportunities to Territory Manager and National Sales Manager. \nGas reimbursement.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002511157"}