{"jobTitle": "Senior Marketing Manager", "company": {"name": "AudaCity Capital Management", "location": "San Marino, CA"}, "location": "San Marino, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": ["Technology", "Information and Internet", "Financial Services", "Investment Management"], "description": "AudaCity Capital is a progressive and flourishing prop trading firm, and trading education provider. We are based in London, and at the moment have a team of highly trained properly trading professionals, managing the company’s extensive funds on our City of London based trading floor.We believe that the only way to be a winner in our industry is to invest heavily in talented people who want to grow with us. We are seeking like-minded professionals to develop their skills and enable them to join our team.We trade on all major asset classes on multiple exchanges with our own capital and do not handle any client funds or have customers. By becoming a member of the team, you become part of our success. We are market leaders because we have always had an internal vision to promote a strong entrepreneurial working culture.Our mission statement is to mix a strong base of intellectual capital with state-of-the-art technology, to build for the future. Our trading has a unique combination of skills, talent, and industry-leading software, which has been produced in-house by the company development department.Strict, Prudent Risk ManagementYou can have guts, but not glory, if you don’t back your trading moves with proper management practices. That’s why we treat risk management with the utmost seriousness …<br/><br/><strong>The Role<br/><br/></strong><strong>You Will Be Responsible For<br/><br/></strong><ul><li>Taking brand ownership and devising the brand strategy, including the setting of style guides, brand guidelines, brand vision and value proposition for the short as well as the long term.</li><li>Translating brand strategy into brand plan and go-to-market strategy.</li><li>Planning and execution of communications and media actions across offline, online and social media.</li><li>Participating in product development, pricing and supporting new product launches.</li><li>Guiding the Advertising &amp; Promotion budget.</li><li>Supporting the development and launch of new products.</li><li>Working with other stakeholders to optimise the conversion funnel for specific traffic sources, campaigns, user segments etc.</li><li>Driving business growth by developing innovative ideas and campaigns.</li><li>Testing and optimising marketing tactics that boost conversion rates and accelerate customer acquisition.</li><li>Managing a team of 6-10 people.<br/><br/></li></ul><strong>Ideal Profile<br/><br/></strong><ul><li>You have at least 5 years experience ideally in Brand Marketing / Brand Manager or Performance Marketing within Financial Services and Internet industry.</li><li>You have working knowledge of managing a team</li><li>Experience within would be a strong advantage.</li><li>You enjoy finding creative solutions to problems</li><li>You are a strong mentor and coach who can build high performing teams</li><li>You are highly goal driven and work well in fast paced environments<br/><br/></li></ul><strong>What's on Offer?<br/><br/></strong><ul><li>Opportunity within a company with a solid track record of performance</li><li>Strong opportunities to progress your career</li><li>Leadership Role</li></ul>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002019198"}