{"jobTitle": "Brand Marketing Assistant", "company": {"name": "Sunset AcquisitionsInc", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Internet Publishing", "description": "We are searching for a motivated Brand Marketing Assistant to join our sales and promotional marketing department. The Brand Marketing Assistant will help exceed company and client goals by assisting the Marketing Manager with developing unique campaigns and programs to appeal to consumers and increase client revenue. We provide an established marketing and sales training program that includes learning the fundamentals of marketing and sales, client knowledge, relations with lead management, interviewing, recruiting, reports and management on a small scale with room for growth into a large scale.<br/><br/>Our company is a fast growing Marketing Firm with a team oriented culture that provides individualized training for each employee to ensure success as a team. Our marketing team serves as a leader in delivering exceptional brand awareness to increase the market share for any brand. We are in need of an avid Marketing Assistant to support the marketing department by coming together as a team and organizing campaigns and developing marketing strategies that will impact company sales. The Marketing Assistant is a critical factor for the Marketing Department's goals and long term growth of the company.<br/><br/>Responsibilities:<br/><br/><ul><li>Assist in marketing and promotional activities to gain new customer acquisition and maintain existing customer retention</li><li>Collaborate with the marketing and sales team to drive the marketing and promotions of our clients by preparing and delivering promotional presentations</li><li>Develop diverse marketing and sales approaches and maintain relationships with potential consumers</li><li>Research the latest product trends and insights across campaigns and create new ideas to enhance the process</li><li>Assist the marketing and sales team by improving sales tactics by evaluating data and personalizing each approach to the consumer<br/><br/></li></ul>What we look for in a Brand Marketing Assistant:<br/><br/><ul><li>Experience - 1-2 years of marketing or sales background preferred</li><li>Teamwork - We’re team players in everything we do</li><li>Problem-solving skills - Identify issues and immediately respond with solutions</li><li>Student mentality - Management is constantly trying to improve by providing feedback to all departments so it is crucial to be able to take constructive criticism and implement it</li><li>Self starter - Initiate, plan, and execute projects from beginning to end without constant supervision<br/><br/></li></ul>Benefits of working with us:<br/><br/><ul><li>Leadership development with the opportunity to grow your career in a national organization</li><li>Opportunities for performance-based rewards such as paid vacations, gift cards, tickets to events</li><li>A work environment that encourages creativity and innovative ideas</li><li>Team oriented where every employee is considered a vital asset</li><li>Holidays off <br/><br/></li></ul>Powered by JazzHR<br/><br/>Jj5ZqMacbM<br/><br/>", "responsibilities": "Assist in marketing and promotional activities to gain new customer acquisition and maintain existing customer retention\nCollaborate with the marketing and sales team to drive the marketing and promotions of our clients by preparing and delivering promotional presentations\nDevelop diverse marketing and sales approaches and maintain relationships with potential consumers\nResearch the latest product trends and insights across campaigns and create new ideas to enhance the process\nAssist the marketing and sales team by improving sales tactics by evaluating data and personalizing each approach to the consumer", "qualifications": {"preferred": "Experience - 1-2 years of marketing or sales background preferred\nTeamwork - We’re team players in everything we do\nProblem-solving skills - Identify issues and immediately respond with solutions\nStudent mentality - Management is constantly trying to improve by providing feedback to all departments so it is crucial to be able to take constructive criticism and implement it\nSelf starter - Initiate, plan, and execute projects from beginning to end without constant supervision", "required": ""}, "skills": [], "postedDate": "1 week ago", "benefits": "Leadership development with the opportunity to grow your career in a national organization\nOpportunities for performance-based rewards such as paid vacations, gift cards, tickets to events\nA work environment that encourages creativity and innovative ideas\nTeam oriented where every employee is considered a vital asset\nHolidays off", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4002291155"}