{"jobTitle": "VP of Human Resources", "company": {"name": "Financial Partners Credit Union", "location": "Costa Mesa, CA", "industry": "Banking"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Human Resources", "industry": "Banking", "description": "<strong>Job Description<br/><br/></strong><strong>The ideal candidate will come from a larger financial institution such as a bank or credit union.<br/><br/></strong><strong>Must be familiar with ADP Payroll, benefits administration, and current laws and regulations.<br/><br/></strong><strong>Why Join Us?<br/><br/></strong>At Financial Partners Credit Union, we are more than just a team; we're a community dedicated to excellence. We are looking for a Vice President of Human Resources who is not only a strategic leader but also a hands-on professional ready to drive and execute HR initiatives directly. With $2.5 billion in assets and a commitment to empowerment, quality, and productivity, our mission, vision, and values are deeply embedded in our high-performance culture.<br/><br/><strong>About The Role<br/><br/></strong>The VP of HR is pivotal in developing and executing a human capital strategy that anticipates and responds to the evolving needs of our industry. This is a working role where you will actively participate in all facets of the HR functions, from strategy to implementation, while also leading a strong team of HR professionals. Reporting directly to the EVP, Chief Administrative Officer, and part of the senior leadership team, you'll oversee talent acquisition, performance management, compensation, employee relations, and compliance.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Actively engage in and lead HR operations, ensuring hands-on involvement in talent management and operational effectiveness. </li><li>Serve as a strategic and operational advisor to Senior Management on all HR matters. </li><li>Directly manage the recruitment process and implement talent management strategies that include succession planning and career development. </li><li>Develop and manage compensation and benefits programs that attract and retain top talent. </li><li>Maintain compliance with all applicable employment laws, focusing on the California market. </li><li>Oversee the administration of benefits and retirement plans, ensuring cost-effective solutions. </li><li>Leverage HR technology to enhance process efficiency and use HR analytics for informed decision-making. <br/><br/></li></ul><strong>What We Are Looking For<br/><br/></strong><ul><li>Bachelor’s degree in Human Resources or related field. </li><li>Minimum of 10 years of HR leadership experience, with hands-on involvement in managing HR functions. </li><li>Proven track record in strategic HR management within a financial services environment, preferably within a Credit Union. </li><li>Strong knowledge of HR laws, regulations, and best practices. </li><li>Excellent interpersonal, communication, and leadership skills. </li><li>SHRM-SCP, SPHR, or similar HR certification is preferred. <br/><br/></li></ul><strong>Join Us and Make a Difference<br/><br/></strong>At Financial Partners Credit Union, you’ll not only lead but also directly contribute to a workplace that values collaboration, innovation, and work-life balance. If you're ready to actively shape our HR landscape and drive our mission forward, apply today.<br/><br/><strong>Company Description<br/><br/></strong>The pay range for this position is listed above. Our pay ranges are designed to allow for candidates with various levels of experience and skill to be considered, and to allow room for growth to be achieved in a role over time. Generally, new hire salary offers fall within the minimum to midpoint of a pay range for many candidates. Any offer extended to a candidate will be based upon their individual combination of experience, knowledge, skills, and education as well as internal equity.<br/><br/>Financial Partners Credit Union is an equal opportunity employer and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.<br/><br/>The pay range for this position is listed above. Our pay ranges are designed to allow for candidates with various levels of experience and skill to be considered, and to allow room for growth to be achieved in a role over time. Generally, new hire salary offers fall within the minimum to midpoint of a pay range for many candidates. Any offer extended to a candidate will be based upon their individual combination of experience, knowledge, skills, and education as well as internal equity. Financial Partners Credit Union is an equal opportunity employer and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.", "responsibilities": "<ul><li>Actively engage in and lead HR operations, ensuring hands-on involvement in talent management and operational effectiveness. </li><li>Serve as a strategic and operational advisor to Senior Management on all HR matters. </li><li>Directly manage the recruitment process and implement talent management strategies that include succession planning and career development. </li><li>Develop and manage compensation and benefits programs that attract and retain top talent. </li><li>Maintain compliance with all applicable employment laws, focusing on the California market. </li><li>Oversee the administration of benefits and retirement plans, ensuring cost-effective solutions. </li><li>Leverage HR technology to enhance process efficiency and use HR analytics for informed decision-making. <br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s degree in Human Resources or related field. Minimum of 10 years of HR leadership experience, with hands-on involvement in managing HR functions. Proven track record in strategic HR management within a financial services environment, preferably within a Credit Union. Strong knowledge of HR laws, regulations, and best practices. Excellent interpersonal, communication, and leadership skills.", "preferred": "SHRM-SCP, SPHR, or similar HR certification is preferred."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4002389752"}