{"jobTitle": "Sales Associate - Brentwood", "company": {"name": "Theory", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "18/hr - 20/hr", "currency": "USD"}, "jobFunction": "Customer Service and Sales", "industry": "Retail Apparel and Fashion", "description": "At Theory, we create clothes that matter, that empower and improve the way we live through exceptional fit, fabric, and style. In 1997, Theory was founded in New York on the simple idea that stretch fabrics in tailored clothing could change how we dress and live.\n\nTwo decades later, we continue to perfect our offering of elevated wardrobe essentials for the ambitious, urban man and woman. From sourcing materials from the best mills in the world, to the innovation and craftsmanship at our atelier in New York’s Meatpacking District, the integrity of our process is just as important as our final product.\n\nIn 2004, Theory was acquired by Fast Retailing, spurring international expansion of the brand. Operating 440 stores worldwide, today Theory is a New York brand with a global mindset. Our customers dream big, achieve goals, and aim for perfection. So do we, and so do our clothes.\n\n<u>The Responsibilities </u>\nA **Sales Associate** works to achieve store sales goals and develop lasting client relationships. Through effective clienteling, the Sales Associate works to create a superior store experience for our clients that results in sales growth. A Sales Associate is also responsible for complying with policy, procedure, and company initiatives. Also open to Stock/Support Associate experience for this position.\n\n<br/>\nBusiness Leader\n● Meet personal and store sales and KPI goals\n● Demonstrate excellent knowledge of the product to support the brand goals\n● Develop sales techniques that are relevant to the market\n● Establish and maintains client-base\n● Leverage company tools, incentives &amp; strategies to support meeting sales goals\n\n<br/>\nPeople Leader\n● Ensure effective communication between managers &amp; other team members\n● Support keeping other team members motivated and engaged\n● Contribute new &amp; innovative ideas to support meeting business goals\n● Resolves client needs quickly and effectively, ensuring customer satisfaction\n● Participates in all training and development meetings.\n\n<br/>\nOperations Leader:\n● Ensure all functions of the store are maintained to support a superior shopping-experiences\n● Uphold store standards and policy and procedures daily\n● Assist in the maintenance in all areas of stock, shipping, and receiving protocols.\n● Identify product concerns and communicate inventory needs to support the business goals\n● Comply with all point of sale register policies and procedures\n\n<br/>\nCustomer Focus:\n● Ensure the highest level of customer service to each and all individuals in the store\n● Build meaningful relationships with clients through strong-interpersonal skills\n● Collaborate with all team members to support a superior shopping experience\n● Be present on and off the floor as a Theory Brand Ambassador\n\n<br/>\nThe Essentials\n● 1-2 years’ prior work experience in a client-centric, sales environment\n● Dynamic interpersonal and communication skills, both verbal and written\n● Independent work ethic, time management skills\n● Computer skills to operate point of sale system, experiences with teamwork is a plus\n\n<br/>\nSalary: $18/hr - $20/hr* \n\n *The offered salary or salary range is based on several factors, including, but not limited to, overall experience, relevant experience, education level, certifications, applicable skills and expertise, and location of the position.\n\n<br/>\n<em>As an Equal Opportunity Employer, Fast Retailing does not discriminate against applicants or employees because of race, color, creed, religion, sex, national origin, veteran status, disability, age, citizenship, marital or domestic/civil partnership status, sexual orientation, gender identity or expression or because of any other status or condition protected by applicable federal, state or local law. </em>\n\n<br/>\n<em>Ensure your Theory job offer is legitimate and don’t fall victim to fraud. Theory never seeks payment from job applicants. Feel free to ask your recruiter for a phone call or other type of communication for an interview and ensure your communication is coming from a Theory or sister company email address. For added security, where possible, apply directly through our job posting.</em>\n\n<br/>\nFor information regarding how we handle your personal information and to exercise your rights under the California Consumer Privacy Act, please see our Privacy Policy at Theory.com and Helmutlang.com.", "responsibilities": "A Sales Associate works to achieve store sales goals and develop lasting client relationships. Through effective clienteling, the Sales Associate works to create a superior store experience for our clients that results in sales growth. A Sales Associate is also responsible for complying with policy, procedure, and company initiatives. Also open to Stock/Support Associate experience for this position.", "qualifications": {"required": "1-2 years’ prior work experience in a client-centric, sales environment, Dynamic interpersonal and communication skills, both verbal and written, Independent work ethic, time management skills, Computer skills to operate point of sale system, experiences with teamwork is a plus"}, "skills": ["Sales", "Customer Service", "Retail", "Fashion", "Client Relationship Management", "Communication", "Teamwork", "Time Management", "Point of Sale (POS)"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002206513"}