{"jobTitle": "Supply Chain Director", "company": {"name": "DSJ Global", "industry": "Aviation and Aerospace Component Manufacturing", "size": "51-200 employees", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Management, Manufacturing, and Supply Chain", "industry": "Aviation and Aerospace Component Manufacturing and Defense and Space Manufacturing", "description": "Join a dynamic, established aerospace manufacturing organization in the heart of Los Angeles. You will join a growing procurement team to establish and maintain key supplier partnerships, optimize supply chain processes and play a key strategic role on the supply chain leadership team. If interested in entering an important, strategic role in aerospace, think about applying in!", "responsibilities": "Lead analysis, forecasting, and manufacturing order placement to manage min/max contractual performance. Implement future state GSC model (central intelligence & ship from sites common across all manufacturing locations) and organization changes. Create and begin implementation of future state SIOP model, process, and tools for HFS. Monitor and analyze key performance indicators (KPIs) to ensure operational targets are met or exceeded. Develop risk management strategies to mitigate potential disruptions in the supply chain. Develop and implement strategic plans to optimize supply chain efficiency and reduce costs. Manage min/max customer supply chain engagement/escalations.", "qualifications": {"required": "Bachelor’s degree in Business, Management, Supply Chain, Logistics, or related field from an accredited institution. 10 years of procurement experience in an aerospace manufacturing environment -- 7 years progressive leadership experience. Lean manufacturing experience. Thorough knowledge of complex electronic business enterprise systems required.", "preferred": ""}, "skills": ["Procurement", "Supply Chain Management", "Lean Manufacturing", "Risk Management", "Strategic Planning"], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4002873173"}