{"jobTitle": "Merchandiser", "company": {"name": "24 Seven Talent", "location": "Manhattan Beach, CA"}, "location": "Manhattan Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "75,000.00/yr - 85,000.00/yr", "currency": "USD"}, "jobFunction": "Manufacturing and Strategy/Planning", "industry": "Footwear Manufacturing and Retail Apparel and Fashion", "description": "One of our top clients is looking for an Associate Merchandisers to join their team to support their growing international business. <br/>Direct hire/full timeOnsite daily in Manhattan Beach $75-$85k with a great benefits package including 401k match<br/>This person will:<ul><li>Manage and communicate product assortments, line sheets, inventory, review sales and sample orders for Distributor partners. </li><li>Determine when and how to react to best and worst sellers. </li><li>Consistently monitor the regions order/sales status to identify missed opportunities on key styles and make recommendations with the intent to increase sales. </li><li>Present your product line with confidence and must be able to react to challenging questions during presentations.</li></ul><li></li>Daily and weekly duties:<ul><li>Own your product lines and brand initiatives. Build and manage assortments relevant for each market. </li><li>Manage International partners to understand product availability, sales samples, sales trends, key initiatives, marketing strategies and overall product direction.</li><li>Maintain linesheets/new adds/drops/reductions for each select countries</li><li>Attend Monthly/Quarterly conference meetings/calls with partners to discuss current state of business and needs.</li><li>Review overall sales and understand what categories the countries are achieving growth or losing sales. </li><li>Responsible for answering questions daily and communicating all product/business related information to each partner on a regular and timely basis, it is essential as the time differences in regions can cause delays.</li><li>Review and Analyze selling/bookings/shipments by country for your product lines. Report on business trends by category. Understand what categories are achieving growth or loss in sales to identify opportunity.</li><li>Continually review product assortments to be sure that all key initiatives are represented and make educated recommendations for styles that can work within distributor’s market.</li><li>Collaborate with other international merchandising/planning partners to maximize sales, partner on product opportunities, and manage projects.</li><li>Aggressive sales approach is needed. Ability to be influential in person, video calls and emails are essential.</li><li>Maintain/Run/Review various reports to provide appropriate analysis.</li><li>Initiate/Create reports by leveraging various data from internal systems</li><li>Participate in KI product review meetings to curate corporate key initiative assortment twice a year.</li><li>Attend global product conference twice a year, act as host, support during presentations + review sessions, present state of business for each country.</li><li>Collaborate and communicate with VP – GMM of International</li></ul><br/>JOB REQUIREMENTS<ul><li>Merchandising/Buying experience in footwear/apparel/accessories</li><li>Extensive product knowledge of a large volume of skus</li><li>Advanced Microsoft Excel skills (including pivot tables and v-lookups)</li><li>Must be comfortable with presentations. Present your line at sales meetings and conferences with confidence and be able to react to questions with confidence.</li><li>Global mindset</li><li>Optimistic and Entrepreneurial</li><li>Excellent written and verbal communication skills</li><li>Ability to be flexible in times of changes, evolving business needs and shifting priorities and adaptable in a multi-task environment with a sense of urgency.</li><li>Demonstrate high level of quality work, well-organized with attention to details.</li><li>Build, maintain and grow exceptional relationships with internal cross functional partners and countries’ team members.</li><li>Able to work independently, but also convey successful team building skills.</li><li>Must be able to create and manage appropriate timeline or calendar.</li><li>Outstanding time management to meet multiple deadlines, stay on schedule and manage multiple priorities at any given time.</li><li>Ability to take initiative, solve problems proactively and objectively</li><li>Flexible schedule based on the needs of the business and international time zone.</li></ul><br/>EXPERIENCE AND EDUCATION<ul><li>4+ years of Merchandising experience with a large volume of skus.</li><li>Bachelor’s degree</li><li>International experience</li><li>Sales/Wholesales background a plus</li></ul>", "responsibilities": "This person will:<ul><li>Manage and communicate product assortments, line sheets, inventory, review sales and sample orders for Distributor partners. </li><li>Determine when and how to react to best and worst sellers. </li><li>Consistently monitor the regions order/sales status to identify missed opportunities on key styles and make recommendations with the intent to increase sales. </li><li>Present your product line with confidence and must be able to react to challenging questions during presentations.</li></ul><li></li>Daily and weekly duties:<ul><li>Own your product lines and brand initiatives. Build and manage assortments relevant for each market. </li><li>Manage International partners to understand product availability, sales samples, sales trends, key initiatives, marketing strategies and overall product direction.</li><li>Maintain linesheets/new adds/drops/reductions for each select countries</li><li>Attend Monthly/Quarterly conference meetings/calls with partners to discuss current state of business and needs.</li><li>Review overall sales and understand what categories the countries are achieving growth or losing sales. </li><li>Responsible for answering questions daily and communicating all product/business related information to each partner on a regular and timely basis, it is essential as the time differences in regions can cause delays.</li><li>Review and Analyze selling/bookings/shipments by country for your product lines. Report on business trends by category. Understand what categories are achieving growth or loss in sales to identify opportunity.</li><li>Continually review product assortments to be sure that all key initiatives are represented and make educated recommendations for styles that can work within distributor’s market.</li><li>Collaborate with other international merchandising/planning partners to maximize sales, partner on product opportunities, and manage projects.</li><li>Aggressive sales approach is needed. Ability to be influential in person, video calls and emails are essential.</li><li>Maintain/Run/Review various reports to provide appropriate analysis.</li><li>Initiate/Create reports by leveraging various data from internal systems</li><li>Participate in KI product review meetings to curate corporate key initiative assortment twice a year.</li><li>Attend global product conference twice a year, act as host, support during presentations + review sessions, present state of business for each country.</li><li>Collaborate and communicate with VP – GMM of International</li></ul>", "qualifications": {"required": "Merchandising/Buying experience in footwear/apparel/accessories, Extensive product knowledge of a large volume of skus, Advanced Microsoft Excel skills (including pivot tables and v-lookups), Must be comfortable with presentations. Present your line at sales meetings and conferences with confidence and be able to react to questions with confidence., Global mindset, Optimistic and Entrepreneurial, Excellent written and verbal communication skills, Ability to be flexible in times of changes, evolving business needs and shifting priorities and adaptable in a multi-task environment with a sense of urgency., Demonstrate high level of quality work, well-organized with attention to details., Build, maintain and grow exceptional relationships with internal cross functional partners and countries’ team members., Able to work independently, but also convey successful team building skills., Must be able to create and manage appropriate timeline or calendar., Outstanding time management to meet multiple deadlines, stay on schedule and manage multiple priorities at any given time., Ability to take initiative, solve problems proactively and objectively, Flexible schedule based on the needs of the business and international time zone.", "preferred": "4+ years of Merchandising experience with a large volume of skus., Bachelor’s degree, International experience, Sales/Wholesales background a plus"}, "skills": ["Merchandising", "Buying", "Footwear", "Apparel", "Accessories", "Product Knowledge", "Microsoft Excel", "Pivot Tables", "V-lookups", "Presentations", "Global Mindset", "Entrepreneurial", "Communication", "Flexibility", "Time Management", "Problem Solving", "Sales", "Wholesales", "International Experience"], "postedDate": "3 days ago", "benefits": "401k match", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002108715"}