{"jobTitle": "Grocery Store Director", "company": {"name": "Grocery Outlet", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$90,000.00/yr - $115,000.00/yr", "currency": "USD"}, "jobFunction": "Management, Sales, and General Business", "industry": "Retail", "description": "Grocery Outlet is seeking experienced grocery and retail managers who understand their stores inside and out to independently run a Grocery Outlet location.\n<br/>\nGrocery Outlet partners with top local retail leaders who are interested in moving beyond management to operate their own Grocery Outlet location and share in the profits that their store generates.\n<br/>\n**Operating a Grocery Outlet Requires:**\n· Strong decision making to do what is right for your store (ordering, merchandising, staffing, etc.)\n· Responsibility for total store operations including complete management of the P&amp;L\n· Creating staffing models, hire, train and retain employees\n· Utilizing an existing distribution channel to customize your product offering for your community\n· Local organization partnerships to make a difference in your community\n· Strong drive and motivation\n· Being an ambassador for Grocery Outlet\n<br/>\n**Qualifications:**\n· **4 years of retail management experience**\n· Experience overseeing a large team including hiring and training\n· Detail orientated, analytical, ability to think quickly and extremely results orientated\n· Creative problem-solver\n· Experience with merchandising displays\n· Interest in autonomy and being able to make your own decisions for your retail store\n<br/>\n**About Grocery Outlet:**\nGrocery Outlet Bargain Market is one of the largest extreme-value grocery retailers in the United States. We are a Family oriented, rapidly growing company with over 500 stores open and operating. We’ve been helping customers save big since 1946. That’s when our founder, Jim Read, opened his very first store and today, the third generation of the Read family is leading the way. We currently have over 500 stores across the West Coast and Mid-Atlantic and trade publicly on Nasdaq.\n<br/>\nGrocery Outlet Privacy Policy - https://www.ownagroceryoutlet.com/privacy-policy/", "responsibilities": "Grocery Outlet is seeking experienced grocery and retail managers who understand their stores inside and out to independently run a Grocery Outlet location.", "qualifications": {"required": "4 years of retail management experience, Experience overseeing a large team including hiring and training, Detail orientated, analytical, ability to think quickly and extremely results orientated, Creative problem-solver, Experience with merchandising displays, Interest in autonomy and being able to make your own decisions for your retail store"}, "skills": [], "postedDate": "3 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002602092"}