{"jobTitle": "100% Work from Home Insurance Sales- LEADS/ NO COLD CALLING (copy)", "company": {"name": "AO Globe Life", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Other", "industry": "Insurance", "description": "Due to the rapid expansion of our company, we are looking to hire new associates to our customer service team. Our company works with 45,000 union workers in California who require personal customer care. As a result of the increased demand of our client base, we are looking for highly motivated workers to counsel and serve working families.<br/><br/>However, our service team is selective. We are looking for qualified candidates who have experience in customer service or sales, and are also flexible, adaptable and trainable. This is a full time position.<br/><br/>WHO WE MARKET TO: We specialize in life insurance to protect different areas for the family with average income and health. We have too many requests for insurance through our niche market but not enough agents to help fill these requests.<br/><br/>HOW WE GET PAID: Yes, this is commissions only! The commission schedule is designed to help you make money ASAP! You could be paid within a week of writing your first policy. Our average sale nationwide is for $1,000 in annual premium with 2 bonus structure associates are earning $600 just for one sale.<br/><br/>TRAINING WE PROVIDE: We have made it so you can sell a policy in quickly. We provide you with all the training you will need on our carriers, products, sales scripts. Our job is to help you make money! Want to grow an agency? We can help you achieve that within months!<br/><br/>NOT LICENSED? No Problem. We have many resources available to you to help get you started.<br/><br/>Minimum requirements for consideration:<br/><br/>Great Work Ethic<br/><br/>Positive Attitude<br/><br/>Outgoing Personality<br/><br/>Ambitious<br/><br/>Benefits Includes<br/><br/>Health Insurance reimbursement<br/><br/>Life insurance<br/><br/>Bonuses<br/><br/>Retirement Plan<br/><br/>Weekly pay", "postedDate": "1 week ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002283567"}