{"jobTitle": "HR Director", "company": {"name": "Candle Media", "industry": "Non-profit Organizations and Primary and Secondary Education", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$130,000 - $150,000", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Candle Media is a next-generation media company inspiring audiences and empowering creators through creator-driven brands and franchises, delivering premium content, commerce and experiences to audiences wherever they watch, listen and connect. A commitment to constant innovation, world-class IP, and authentic and deep connections with audiences fuel Candle's content-community-commerce flywheel. Candle Media is seeking a HR Director who has supported the organizational development of a scaling business. Reporting to the Vice President of HR, the individual in this role will be responsible for partnering with leaders in the development and delivery of a wide variety of HR and Talent Acquisitions programs and initiatives related to reaching hiring goals, business support training, development programming, onboarding and retention initiatives, HR/training and workforce metrics, and the buildout of HR policies/their rollout. This role is crucial to the success of the team and an important building block to the success of the entire organization. It is both a strategic and hands on role including focused on improving organizational effectiveness & design, leading change management, providing leadership coaching and driving HR functional excellence. This role's day-to-day will include: Coaching, guiding and supporting managers and the broader team through workforce planning initiatives, performance management, employee engagement and career development. Serving as a thought partner with senior executives, build professional credibility and mutual trust. Identifying market trends and opportunities for Candle and our business unit to grow and thrive. Partner with stakeholders to ensure employee and business needs are met, focusing on organizational design, change management, and employee retention in a rapidly growing company. Drive organizational effectiveness through workforce strategy development/planning, leadership capability development, performance and talent management, compensation planning and recognition, etc. Providing counsel and guidance on complex employee relations matters. Leveraging data to develop and support internal programs including, mentorship, engagement, speaking events, and career development workshops. Supporting the growth of newer managers by partnering with them on how to set up 1:1s, performance reviews, and growth conversations. Partnering with the business leads and their direct reports to advance people strategies and solutions in line with the organizational goals. Facilitating the end-to-end recruitment process; including job postings, writing descriptions, recruit/source, interview, selection and onboarding of new hires to create a best-in-class candidate experience. This role is based in Los Angeles, California.", "responsibilities": "Coaching, guiding and supporting managers and the broader team through workforce planning initiatives, performance management, employee engagement and career development. Serving as a thought partner with senior executives, build professional credibility and mutual trust. Identifying market trends and opportunities for Candle and our business unit to grow and thrive. Partner with stakeholders to ensure employee and business needs are met, focusing on organizational design, change management, and employee retention in a rapidly growing company. Drive organizational effectiveness through workforce strategy development/planning, leadership capability development, performance and talent management, compensation planning and recognition, etc. Providing counsel and guidance on complex employee relations matters. Leveraging data to develop and support internal programs including, mentorship, engagement, speaking events, and career development workshops. Supporting the growth of newer managers by partnering with them on how to set up 1:1s, performance reviews, and growth conversations. Partnering with the business leads and their direct reports to advance people strategies and solutions in line with the organizational goals. Facilitating the end-to-end recruitment process; including job postings, writing descriptions, recruit/source, interview, selection and onboarding of new hires to create a best-in-class candidate experience.", "qualifications": {"required": "6+ years of experience in HR, preferably in an HR Leadership role at a high-growth or scaling organization. A demonstrated track record of helping to lead, guide and influence employee-related decisions. An ability to work in ambiguity and learn quickly how to prioritize. A solution-oriented mindset and curiosity needed to constantly find ways to improve upon things. Incredible customer service skills as it relates to supporting our internal stakeholders in all areas of the employee lifecycle including benefits, performance reviews, organizational development, employee engagement, health and safety, legal compliance, and workforce planning. Excellent people manager, coach and partner. Exceptional written and verbal communication skills, judgment and decision making. Strong organizational leadership skills, integrity, and great follow through on tasks. Proficiency in Microsoft Office Suite, Outlook, Advanced Excel, Powerpoint, and Keynote. Ability to handle confidential information and comfortably interact with high-level executives. Some knowledge of HRIS systems (UKG a plus!). Advanced understanding of employment laws.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Health Care Plan (Medical, Dental & Vision), Retirement Plan (401k, IRA), Life Insurance (Basic, Voluntary & AD&D), Paid Time Off (Vacation, Sick & Public Holidays), Family Leave (Maternity, Paternity), Wellness Resources", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4002051951"}