{"jobTitle": "Remote Travel Planner", "company": {"name": "Travel With Me", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "description": "Calling all vibrant souls with a love for adventure! Join us as a Groovy Customer Service And Sales Support Representative - Remote. With the beat of travel demand on the rise, we offer specialized training, online development, and an endless groove of growth opportunities with our business model. Grooviness, integrity, and professionalism groove at the heart of what we do. If this jazzy opportunity strikes a chord with you, don't miss out - jam your application today!<br/><br/>Duties &amp; Responsibilities:<br/><br/>Sync up with potential clients to vibe out their travel needs, preferences, and financial flow.<br/><br/>Tune marketing materials to resonate with the crowd on social media platforms, bulletin boards, and flyers.<br/><br/>Jam out travel advice based on weather, culture, and all that jazz.<br/><br/>Hit the right notes booking travel appointments, collecting fees, and snagging those required docs from clients.<br/><br/>Groove on with professional relationships with all our travel pals - suppliers, clientele, and trip operators.<br/><br/>Qualifications &amp; Skills:<br/><br/>Fluent in the language of English; bonus points for speaking the language of the soul.<br/><br/>Groovy experience and understanding of all social media platforms, as well as Zoom and Google Suite.<br/><br/>Stay in tune with accuracy and rock those organizational vibes.<br/><br/>Got a knack for problem-solving and can jam out with colleagues like nobody's business.<br/><br/>Quick on the uptake with diverse computer software programs, especially if you've been playing with a broad range of applications.<br/><br/>Master of multitasking and keeping those tasks swinging in the right direction.<br/><br/>Education and Experience Requirements:<br/><br/>Grooved with 1+ years of customer service experience (preferred).<br/><br/>High school diploma or GED, because education is always in tune.<br/><br/>Experienced in the world of travel agents? Even better.<br/><br/>Bring your own instruments - Laptop/Smartphone &amp; Internet Access are a must.<br/><br/>Benefits:<br/><br/>Set your own tempo with flexible hours.<br/><br/>Groove in full-time or part-time, whatever suits your rhythm.<br/><br/>Jam on with travel rebates and discounts.<br/><br/>Groove to the sound of High Paid Commission.<br/><br/>Every gig is a business opportunity.<br/><br/>Keep the rhythm alive with ongoing professional development opportunities. Our organization is all about learning and promoting courses, seminars, and workshops aimed at expanding skill sets and knowledge of industry best practices.<br/><br/>Join us and let's jazz up the world of travel together!", "jobFunction": "Management and Manufacturing", "industry": "Leisure, Travel & Tourism", "postedDate": "3 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002809572"}