{"jobTitle": "Retail Director", "company": {"name": "ASBIS", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Strategy/Planning, Business Development, and Marketing", "industry": "Technology, Information and Media, Retail Luxury Goods and Jewelry, and Retail Furniture and Home Furnishings", "description": "The role focuses on driving brand growth, expanding market presence, and achieving sales targets. \nRetail Director will oversee all aspects of premium brand development, including product strategy, marketing initiatives, sales operations, and team management.\nProviding value to shareholders by profitable sales growth and by providing top class consumer experience and related services related to all LOB of B&O with 70% focus about Stage products, services and other selective lines of business.\n\n<u>Key Responsibilities:</u>\n<ul><li>Oversee day-to-day omnichannel operations planning and setting of work tasks for subordinates, evaluation and management of their business performance and productivity accordingly.</li><li>Develop and execute to the omnichannel strategic plan of retail, e-Commerce and B2B channels, increase operational efficiency and provide premium customer experience, aligning it with the company's overall objectives.</li><li>Give special attention to develop to grow substantially B&O Stage LOB including premium class pre-sales and post sales services.</li><li>Planning, building, managing, monitoring monthly / yearly omnichannel budget and business plans in cooperation with entity supervisors and top-management.</li><li>Development, implementation, and further control over the integration of operational standards, customer service standards, etc.</li><li>Oversee inventory management, including purchasing, sales action plans, stock replenishment, and minimizing losses.</li><li>Sales management, ensuring the implementation of sales plans, marginality, and achievement of established KPIs.</li><li>Lead, train, and coach the sales team to achieve individual and team sales goals.</li><li>Solid understanding of the market, monitoring business trends, pushing the strategic sales objectives with key customers.</li><li>Collection, processing, and analysis of information about the activity of competitors, tracking the share and capacity of the market, assortment, and pricing policy of the company and competitors.</li><li>Drive sales through effective marketing campaigns (digital and offline).</li><li>Foster a positive and high-performance work environment.</li><li>Development of the omnichannel customer’s network, including the opening of new stores (location selection, retail business plans, etc.).</li><li>Maintain security and safety standards across all retail locations.</li><li>Takes the lead in growth strategy and business planning at all levels (financial, operations, business partnerships)</li><li>Excellence in reporting to functional and line managers</li></ul>\n\nRequirements: \n<ul><li>Minimum of 3 years of experience in a similar position</li><li>Experience in premium/luxury brand management, sales, or marketing.</li><li>Proven track record of driving brand growth and achieving sales targets.</li><li>Strong leadership abilities with experience in managing and motivating teams to achieve goals. Proven ability to develop and implement successful sales and marketing strategies.</li><li>Excellent analytical and problem-solving skills. Ability to analyze market trends, consumer behaviour, and sales data to inform strategic decisions.</li><li>Exceptional verbal and written communication skills. Ability to effectively present ideas, negotiate contracts, and build relationships with internal and external stakeholders.</li><li>Solid understanding of business principles, market dynamics, and competitive landscape. Ability to identify and capitalize on market opportunities.</li><li>Proven ability to set ambitious goals, prioritize tasks, and deliver results in a fast-paced and dynamic environment.</li><li>Demonstrated flexibility and adaptability to navigate through ambiguity and drive change within the organization.</li><li>Proficiency in English.</li></ul>\n\nWe offer\n<ul><li>Work for a financially strong, fast-growing multinational company</li><li>Access to continuous professional development: training, certification programs, events, and team buildings</li><li>Competitive salary package and motivation scheme</li><li>Health insurance</li><li>International career opportunities</li></ul>\n\nASBIS Group is a leading IT company specializing in value-added distribution and development of IT, IoT, and Robotic products, solutions, and services to the markets of Europe, the Middle East, and Africa.\n\nIn over 30 years of operations, ASBIS has grown into an international group, headquartered in Cyprus, with subsidiaries in 34 countries across EMEA, and nearly 3,000 employees.\n\nWe are proud of being one of the certified companies by Great Place to Work®, the global authority on workplace culture, as we believe that our true asset is people. ASBIS invests a lot to create a workplace where every employee has a place for professional growth, and appropriate support to unlock their potential and build a future with the Company.\n\nWhatever your area of expertise and specialization, you will find a range of career opportunities at ASBIS. Apply now.\n\nBy responding to the vacancy, you consent to the processing of your personal data indicated in your CV. For more, please visit <u>https://www.asbis.com/gdpr-candidate-privacy-policy</u>", "postedDate": "3 days ago", "qualifications": {"required": "Minimum of 3 years of experience in a similar position, Experience in premium/luxury brand management, sales, or marketing., Proven track record of driving brand growth and achieving sales targets., Strong leadership abilities with experience in managing and motivating teams to achieve goals. Proven ability to develop and implement successful sales and marketing strategies., Excellent analytical and problem-solving skills. Ability to analyze market trends, consumer behaviour, and sales data to inform strategic decisions., Exceptional verbal and written communication skills. Ability to effectively present ideas, negotiate contracts, and build relationships with internal and external stakeholders., Solid understanding of business principles, market dynamics, and competitive landscape. Ability to identify and capitalize on market opportunities., Proven ability to set ambitious goals, prioritize tasks, and deliver results in a fast-paced and dynamic environment., Demonstrated flexibility and adaptability to navigate through ambiguity and drive change within the organization., Proficiency in English.", "preferred": ""}, "skills": [], "benefits": "Work for a financially strong, fast-growing multinational company, Access to continuous professional development: training, certification programs, events, and team buildings, Competitive salary package and motivation scheme, Health insurance, International career opportunities", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002831066"}