{"jobTitle": "Accountant", "company": {"name": "HumanGood", "location": "Duarte, CA"}, "location": "Duarte, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "65,000.00/yr - 75,000.00/yr", "currency": "USD"}, "jobFunction": "Accounting/Auditing", "industry": "Non-profit Organizations", "description": "The Accountant produces timely and accurate financial statements and subsidiary ledgers. Provides financial information to the operating units to aid them in the effective management of the company’s financial resources. Responds to requests for financial information and answers questions as they arise.", "responsibilities": "Works with the Divisional Assistant Controller to develop procedures and accounting processes as well as financial reporting systems as needed. Prepares reconciliations of any or all accounts to determine accuracy of general ledger balances. Reports reconciliation findings and makes oral and written presentations to management when reconciliations identify a material weakness, discussing deficiencies and recommending corrective action to improve operations and reduce cost. Develops, communicates, and follows through on recommendations Collects information and prepares complex audit schedules. Reviews financial statements and is able to provide management with detailed variance analysis. Maintains fixed asset records. Prepares specific journal entries and maintains supporting documentation for those entries. Prepares month-end financial statements and performs the “full cycle” accounting close Coordinates the timely preparation of tax and other regulatory filings. Ensures timely filing of 1099’s for vendors and annual 990’s for all relevant Cornerstone affiliated entities.", "qualifications": {"required": "Bachelor’s degree in Accounting 3-6 years applicable experience or the equivalent combination of training and experience. Experience with reconciliation of all types of balance sheet accounts as well as experience analyzing revenue and expense accounts. Experience performing full cycle accounting duties is highly desirable. Experience in senior living or affordable housing is a plus. Experience using OneSite or Great Plains software is preferred", "preferred": ""}, "skills": [], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "20 days of paid time off, plus 7 company holidays (increases with years of service) 401(k) with up to 4% employer match and no waiting on funds to vest Health, Dental and Vision Plans- start the 1st of the month following your start date $25 per line Cell Phone Plan Tuition Reimbursement 5 star employer-paid employee assistance program Find additional benefits here: www.HGcareers.org", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002186699"}