{"jobTitle": "Remote Sales Representative - Same Day Pay", "company": {"name": "L3 Funding", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Financial Services", "description": "<strong>Job Description<br/><br/></strong><strong>Join Our Team as a Remote Sales Representative!<br/><br/></strong>L3 Funding is looking for motivated individuals to join our Remote Sales Team! This is an opportunity to work from home, earn a steady income, and help small businesses get the funding they need to grow. If you have previous sales experience and enjoy connecting with people, this could be the perfect fit for you.<br/><br/><strong>Why Join Us?<br/><br/></strong><ul><li>Flexible Work Hours: Choose your own schedule and work from anywhere. </li><li>Solid Earnings: Remote Sales Reps can earn $500+ per week with a 20-hour commitment, or $1000+ per week with a 30-hour commitment. </li><li>Simple Role: Make outbound calls to business owners using our dialer software, qualify them for funding, and transfer the leads to our in-house underwriting team. </li><li>Multiple Ways to Earn: Get paid for each qualified lead, earn volume bonuses and funding bonuses whenever one of your leads gets funded. </li><li>Instant Pay: We initiate daily payments automatically – there is no waiting to get paid. </li><li>Supportive Environment: Access to our proprietary CRM, training resources, and a dedicated team to help you succeed. <br/><br/></li></ul><strong>What You’ll Do:<br/><br/></strong><ul><li>Engage Business Owners: Make calls to potential clients who may need funding. </li><li>Qualify Leads: Use our one-page sales script and guidelines to identify businesses that meet our criteria. </li><li>Transfer Leads: Seamlessly hand off qualified leads to our expert underwriting team. </li><li>Grow with Us: High performers have the opportunity to advance to a Remote Processor role, earning up to 20% of revenue on funded deals. <br/><br/></li></ul><strong>What We’re Looking For:<br/><br/></strong><ul><li>Sales Experience: At least 1 year of phone sales experience preferred. </li><li>Communication Skills: Ability to engage and connect with small business owners effectively. </li><li>Tech-Savvy: Basic understanding of CRM systems and sales software. </li><li>Reliable and Organized: Ability to manage your time and follow our lead qualification process. </li><li>Role requires you to already have a Windows or Mac (PC or Laptop) in order to use Five9 software. </li><li>Role requires you to already have a working headset (any headset will do). <br/><br/></li></ul><strong>Ready to Join?<br/><br/></strong>Apply today and start your journey with L3 Funding! Transform your home office into a high-earning opportunity and be part of a team that makes a real impact on small businesses across the country.<br/><br/><strong>Company Description<br/><br/></strong>Who Are We?<br/><br/><ul><li> L3 Funding is a leading provider of business financing solutions, dedicated to empowering small businesses. </li><li> Founded in 2017, we have grown to serve over 10,000 businesses and provided over $500 million in funding. </li><li> Our Mission: To offer accessible, quick, and reliable funding options to business owners, 90% of which are turned away by traditional banks, while we approve over 80% of businesses for funding. <br/><br/></li></ul>Who Are We? - L3 Funding is a leading provider of business financing solutions, dedicated to empowering small businesses. - Founded in 2017, we have grown to serve over 10,000 businesses and provided over $500 million in funding. - Our Mission: To offer accessible, quick, and reliable funding options to business owners, 90% of which are turned away by traditional banks, while we approve over 80% of businesses for funding.", "responsibilities": "Engage Business Owners: Make calls to potential clients who may need funding. \nQualify Leads: Use our one-page sales script and guidelines to identify businesses that meet our criteria. \nTransfer Leads: Seamlessly hand off qualified leads to our expert underwriting team. \nGrow with Us: High performers have the opportunity to advance to a Remote Processor role, earning up to 20% of revenue on funded deals.", "qualifications": {"required": "Sales Experience: At least 1 year of phone sales experience preferred. \nCommunication Skills: Ability to engage and connect with small business owners effectively. \nTech-Savvy: Basic understanding of CRM systems and sales software. \nReliable and Organized: Ability to manage your time and follow our lead qualification process. \nRole requires you to already have a Windows or Mac (PC or Laptop) in order to use Five9 software. \nRole requires you to already have a working headset (any headset will do)."}, "skills": ["Sales", "CRM", "Communication", "Customer Service", "Lead Generation"], "postedDate": "1 week ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002399219"}