{"jobTitle": "Customer Service & E-Commerce Team Leader (Customer Service, In-Store Shopper Department Manager)", "company": {"name": "Whole Foods Market", "industry": "Retail", "size": "Large", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Other", "industry": "Retail", "description": "At Whole Foods Market, we are working to nourish people and the planet. In this role, you will provide overall leadership to the Customer Service & E-Commerce programs; this means you are accountable for the checkout experience and grocery delivery & pickup at your assigned store. You will focus on driving safety, quality of outbound online orders, excellent pickup experience, team productivity, and program execution. You will monitor key performance indicator metrics and visual cues in-store to assess your Team’s performance in these areas. You are accountable for daily operations including managing capacity, labor utilization, adherence to pick processes, and drop of task execution (for E-Commerce); and, cash management, customer demand management, labor utilization, and execution of store processes (for Customer Service). You are responsible for non-inventory supplies management & expense control, regulatory compliance, and special projects and/or assignments. As the Team Leader, you lead and develop Associate Team Leaders (ATLs), Supervisors, Team Trainers, and Team Members (as applicable). You are accountable for hiring, development, corrective actions, and separations. You must strive to support WFM core values, Leadership Principles, and goals, promote national, geographic-specific, store programs and initiatives, and ensure adherence to all applicable health and safety regulations.", "responsibilities": "Delivers outstanding customer experience; and holds all Team Members accountable for delivering outstanding customer service. Establishes clear expectations for balancing in-store customer service and completing online orders. Monitors in-store and online customer flow; assigns customer service-related and online order completion tasks balancing the needs of all customers. Responsible for the integrity of the schedule to maintain in-store customer needs, online order capacity, and cognizant of labor budget. Sustains exceptional knowledge and awareness of relevant competitors and industry trends. Ensures an effective and efficient response to customer questions, requests, and/or concerns. Establishes and maintains collaborative and productive relationships with departmental leaders, store leadership, and 1P/3P partners, e.g., Amazon delivery drivers. Fosters and encourages a positive environment of outstanding teamwork, mutual respect, and exceptional morale. Maintains Team Member safety and security standards. Ensures compliance with relevant regulatory rules and standards. Completing hiring and separation decisions in partnership with Store Leadership. Maintains awareness and adherence to staffing guidance. Develops, coaches, mentors, and motivates Team Members in a manner that sustains a high performing Team and minimizes turnover; ensure Team Members are trained in all required tasks and roles. Provides timely, thorough, and thoughtful performance evaluations. Maintains cleanliness of workspaces including staging area and coolers. Maintains security of equipment, e.g., MSRs, phones, currency counters. Proactively identifies process improvement opportunities. Consistently communicates and models WFM core values, leadership principles, and supports goals.", "qualifications": {"required": "24+ months retail experience including 12+ months of team leadership experience. You have experience leading high-volume teams. You take ownership of your work and team and are available to work overtime during peak seasons and as needed year-round.", "preferred": "You thrive in an ambiguous environment, and when given the opportunity to pilot new ways of working you know how to motivate yourself and your team to deliver. You enjoy analytical work and using data to provide solutions. You see value in long-term thinking and large-scale impact on our company."}, "skills": ["Exceptional ability to perform task management, balancing dynamic customer flows.", "Strong understanding of how labor utilization and task management drive performance metrics and customer experience.", "Strong analysis skills to root cause underperformance (either observed or demonstrated by metric performance).", "Strong ability to communicate performance analysis findings and actions, both verbally and in writing.", "Excellent interpersonal, motivational, team building and customer relationship skills.", "Capable of teaching others in a positive and constructive manner.", "Capable of maintaining inventory of supplies and buying, when necessary.", "Demonstrated decision-making ability, leadership skills, and ability to prioritize and delegate.", "Proficient with email, Microsoft Office, and operations-related applications.", "Proficient with mobile applications, dashboards, and basic understanding of retail systems capabilities."], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4002856944"}