{"jobTitle": "Associate Account Executive", "company": {"name": "Samba TV", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "70,000.00/yr - 70,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "Samba TV tracks streaming and broadcast video across the world with our proprietary data and technology. We are on a mission to fundamentally transform the viewing experience for everyone. Our data enables media companies to connect with audiences for new shows and movies, and enables advertisers to engage viewers and measure reach across all their devices. We have an amazing story with a unique perspective on culture formed by a global footprint of data and AI-driven insights\n\nThis entry-level sales position is responsible for owning the full sales cycle of Samba TV’s advertising solutions, across an assigned list of brands and agencies. This person will evangelize and sell Samba’s entire suite of products, to help their clients deliver efficient and effective advertising campaigns. Candidates must be highly motivated, possess outstanding communication skills, have demonstrated knowledge of online advertising, and be willing to learn while working in a fast-paced, dynamic, and growth minded environment. \n\nResponsibilities\n* Prospect, qualify, close and scale revenue-generating relationships with advertisers and agencies within a territory or vertical. \n* Maintain and Report into a CRM system. \n* Act as a thought partner on behalf of Samba to advertising agencies and brands as they look to evolve their TV, Video, and Marketing strategies through more effective use of data. \n* Educate brands and their agencies on Samba TV’s suite of Targeting and Measurement products. \n* Work closely with Samba’s Product and Marketing teams to proactively identify solutions to client and agency needs. \n* Report into and support a Principal Client Partner with a dedicated book of business by maintaining and developing relationships with both new and existing clients. \n* Persuasively communicate Samba TV’s offerings and unique value-proposition to advertisers and agencies via email, phone and virtual and in-person presentations and discussions. \n* Collaborate with customer success and programmatic teams to deliver proposals that exceed advertiser and agency marketing objectives and expectations. \n* Develop and maintain relationships across all facets of agencies and brands, demonstrating a thorough understanding of the account’s organization, needs and revenue potential. \n* Meet or exceed quarterly sales quotas against the territory and account list. \n* Work with cross-functional teams internally to ensure campaign success and growth of partnerships. \n* Help develop in-market engagement initiatives and represent Samba TV at industry events. \n\nRequirements\n* Demonstrated ability to perform against quota and excel in a highly competitive market. \n* Bachelor’s Degree or equivalent experience. \n* 1+ year(s) total experience in advertising, digital media, mobile or internet technology roles, or other equivalent relevant professional/academic experience. \n* Base knowledge of how the Advertising Industry transacts. \n* Demonstrated strategic, consultative and analytical sales approach with focus on building partnerships with clients. \n* Customer-focused leadership with excellent communication, networking, and negotiation skills. \n* Willingness to travel to when necessary. \n* Knowledge of the TV/online/mobile advertising industry and data a plus. \n* Willingness to entertain clients during evenings, and occasionally weekends. \n\nSamba TV is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.  We strive to empower connection with one another, reflect the communities we serve, and tackle meaningful projects that make a real impact.\n\nSamba TV may collect personal information directly from you, as a job applicant, Samba TV may also receive personal information from third parties, for example, in connection with a background, employment or reference check, in accordance with the applicable law. For further details, please see Samba's Applicant Privacy Policy. For residents of the EU , Samba Inc. is the data controller. \n\nSamba TV expects to offer a base salary of $70,000 per year for roles to be performed in New York or California; actual base salary offered will depend on various factors, including but not limited to, location, experience, and performance. Base salary is just one component of Samba TV’s total compensation package for employees. Other rewards may include bonuses, short-term incentives, and long-term incentives. In addition, Samba provides health insurance, wellness offerings, life and disability insurance, a retirement savings plan, paid holidays and paid time off (PTO), and other employee benefits.", "responsibilities": "Prospect, qualify, close and scale revenue-generating relationships with advertisers and agencies within a territory or vertical. \nMaintain and Report into a CRM system. \nAct as a thought partner on behalf of Samba to advertising agencies and brands as they look to evolve their TV, Video, and Marketing strategies through more effective use of data. \nEducate brands and their agencies on Samba TV’s suite of Targeting and Measurement products. \nWork closely with Samba’s Product and Marketing teams to proactively identify solutions to client and agency needs. \nReport into and support a Principal Client Partner with a dedicated book of business by maintaining and developing relationships with both new and existing clients. \nPersuasively communicate Samba TV’s offerings and unique value-proposition to advertisers and agencies via email, phone and virtual and in-person presentations and discussions. \nCollaborate with customer success and programmatic teams to deliver proposals that exceed advertiser and agency marketing objectives and expectations. \nDevelop and maintain relationships across all facets of agencies and brands, demonstrating a thorough understanding of the account’s organization, needs and revenue potential. \nMeet or exceed quarterly sales quotas against the territory and account list. \nWork with cross-functional teams internally to ensure campaign success and growth of partnerships. \nHelp develop in-market engagement initiatives and represent Samba TV at industry events. ", "qualifications": {"required": "Demonstrated ability to perform against quota and excel in a highly competitive market. \nBachelor’s Degree or equivalent experience. \n1+ year(s) total experience in advertising, digital media, mobile or internet technology roles, or other equivalent relevant professional/academic experience. \nBase knowledge of how the Advertising Industry transacts. \nDemonstrated strategic, consultative and analytical sales approach with focus on building partnerships with clients. \nCustomer-focused leadership with excellent communication, networking, and negotiation skills. \nWillingness to travel to when necessary. \nKnowledge of the TV/online/mobile advertising industry and data a plus. \nWillingness to entertain clients during evenings, and occasionally weekends. "}, "skills": ["Sales", "Advertising", "Digital Media", "Mobile", "Internet Technology", "CRM", "Data", "TV", "Video", "Marketing", "Communication", "Networking", "Negotiation"], "postedDate": "1 week ago", "benefits": "Samba TV expects to offer a base salary of $70,000 per year for roles to be performed in New York or California; actual base salary offered will depend on various factors, including but not limited to, location, experience, and performance. Base salary is just one component of Samba TV’s total compensation package for employees. Other rewards may include bonuses, short-term incentives, and long-term incentives. In addition, Samba provides health insurance, wellness offerings, life and disability insurance, a retirement savings plan, paid holidays and paid time off (PTO), and other employee benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002207741"}