{"jobTitle": "Senior Growth Marketing Manager", "company": {"name": "Jerry", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Software Development", "description": "Why should you join Jerry?\n\n* Join a pre-IPO startup with capital, traction and runway ($240M funded | 40X revenue growth in 4 years | $2T market size)\n* Work closely with brilliant leaders and teammates from companies like McKinsey, BCG, Nvidia, Better, Nerdwallet, Wayfair, Sofi, etc. \n* Disrupt a massive market and take us to a $5B business in the next few years\n* Be immersed in a talent-dense environment and greatly accelerate your career growth\n* Launch new marketing channels from 0 to 1, scale other existing channels from 1 to 100!\n\nAbout the opportunity:\n\nAt Jerry, we are redefining and radically improving how people manage owning a car, one of their most expensive and time-consuming assets. Backed by artificial intelligence and machine learning, Jerry simplifies and automates owning and maintaining a car while providing personalized services for all car owners' needs. We spend every day innovating and improving our AI-powered app to provide the best possible experience for our customers. We are the #1 rated and most downloaded app in our category with a 4.7 star rating in the App Store. We have more than 5 million customers — and we’re just getting started.\n\nWith significant progress across various aspects of our product, we are now prioritizing customer acquisition and profitable growth as our top goals for the coming years. To achieve this, we are eagerly expanding our growth team. You will report to the Head of Growth and work closely with the executive team to propel us towards further exponential growth. You will drive our existing marketing channels (social, affiliates, search) to the next level within this complex and competitive category and expand into new venues of customer acquisition. This role offers substantial career growth opportunities, resources, and CEO visibility. Initially, this position functions as a senior individual contributor to establish a foundational growth engine. Once this is achieved, we envision this individual building and managing their team in marketing, transitioning into a people manager role as we continue to grow. If you’re looking for a unique challenge in a newly-created role with uncapped impact and an opportunity to work with some of the most talented leaders in tech, we’d love to hear from you!\n\nHow you will make impact:\n\n* Phase 1: In this hands-on phase, your focus will be on finding successful strategies to make our channels cost-effective. This period will last a few months, potentially shorter, depending on the speed and effectiveness of the changes you implement. Example responsibilities include:\n\n* Lead and own channel performance from end to end, including strategy, execution, analysis, optimization, with the support from data team, product team, and agency partners \n* Analyze and monitor campaign performance, identify trends, and make optimizations to drive improvement; react to deviations from plans quickly and strategically\n* Conceive and execute innovative experiments; deliver and apply data-driven, analytically rigorous insights and recommendations to enhance performance. \n* Allocate and manage budget for each campaign to maximize ROAS\n* Phase 2: Once successful strategies are identified, the next phase involves scaling those strategies. This will likely require building a team and transitioning into a leadership role, orchestrating the efforts rather than managing them directly. Example responsibilities include:\n\n* Strategize the full-funnel marketing road map to achieve long-term exponential growth\n* Lead new channel expansion with innovation, thoughtfulness and rigor\n* Expand the growth team with exceptional talented junior marketers\n\nWho you are:\n\n* 5+ years of experience in digital performance marketing, including 2+ years managing paid search, social media, or programmatic affiliate advertising channels hands-on\n* Bachelor’s degree in marketing or STEM discipline\n* Strong quantitative analytical ability and a knack for storytelling through data\n* Ability to thrive in an ambiguous and fast-paced environment\n* Ownership mentality - you are not satisfied with “good enough”\n\nJerry is proud to be an Equal Employment Opportunity employer. We prohibit discrimination based on race, religion, color, national origin, sex, pregnancy, reproductive health decisions or related medical conditions, sexual orientation, gender identity, gender expression, age, veteran status, disability, genetic information, or other characteristics protected by applicable local, state or federal laws. \n\nJerry is committed to providing reasonable accommodations for individuals with disabilities in our job application process. If you need assistance or an accommodation due to a disability, please contact us at recruiting@getjerry.com\n\nAbout Jerry:\n\nJerry is America’s first and only AllCar™ app. We are redefining and radically improving how people manage owning a car, one of their most expensive and time-consuming assets.\n\nBacked by artificial intelligence and machine learning, Jerry simplifies and automates owning and maintaining a car while providing personalized services for all car owners' needs. We spend every day innovating and improving our AI-powered app to provide the best possible experience for our customers. From car insurance and financing to maintenance and safety, Jerry does it all.\n\nWe are the #1 rated and most downloaded app in our category with a 4.7 star rating in the App Store. We have more than 6 million customers — and we’re just getting started.\n\nJerry was founded in 2017 by serial entrepreneurs and has raised more than $242 million in financing.\n\nJoin our team and work with passionate, curious and egoless people who love solving real-world problems. Help us build a revolutionary product that’s disrupting a massive market.", "postedDate": "1 week ago", "skills": ["Paid Search", "Social Media", "Programmatic", "Affiliate Advertising", "Marketing", "Data Analysis", "Storytelling", "Experimentation", "Budget Management", "Team Building", "Leadership"], "url": "https://www.linkedin.com/jobs/view/4002464848"}