{"jobTitle": "Import Operations", "company": {"name": "NNR Global Logistics", "location": "Carson, CA"}, "location": "Carson, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "<strong>Job Description<br/><br/></strong><strong>Job Summary <br/><br/></strong>Import Operations is responsible for performing break bulk operations and import customer service duties to process the documentation necessary for import freight to clear US Customs and delivered to the final consignee in a timely and safe manner in accordance with governmental regulations.<br/><br/><strong>Duties &amp; Functions<br/><br/></strong><em>Essential:<br/><br/></em><ul><li> Coordinates with Agents and partners and ensure that all import shipments are properly documented. </li><li> Sort, process and distribute all documentation for incoming consolidations and direct shipments. </li><li> Study various modes of transportation to ascertain the most efficient and timely movement of freight for forwarding and delivery. </li><li> Make I/T entries for on-forwarding of shipments to all destinations and arrange transportation to said destination. </li><li> Ensure that all documents required by U.S. Customs regulations are correct and complete to include customer compliance under the supervision of the designated<br/><br/></li></ul>Customs Brokers.<br/><br/><ul><li> Negotiate with trucking companies and airlines to obtain rates and guarantee of delivery. </li><li> Arrange local deliveries for NNR customers after customs clearance when appropriate. </li><li> Issue invoices to customers. </li><li> Set up all necessary arrangements indicated on Advance Information for the smooth movement of import freight. </li><li> Provide quotations in response to customers and internal requests including overseas partners. </li><li> Perform customer service duties with correspondence to customers and overseas partners, e-mails fax, etc. </li><li> Assist in the implementation of customer service policies and procedures to ensure that the service that is being provided is of the appropriate standard and level. </li><li> Perform other duties as requested by management. <br/><br/></li></ul><strong>QUALIFICATION STANDARDS<br/><br/></strong><em>Education &amp; Experience:<br/><br/></em><ul><li> Minimum requirement High School diploma or GED. </li><li> Proficient with Microsoft Office applications. </li><li> Ability to use basic math skills to calculate duties and freight, storage and other charges. </li><li> Solid understanding of the international forwarding business. <br/><br/></li></ul><em>Physical requirements:<br/><br/></em><ul><li> Flexible and long hours sometimes required. </li><li> Medium work - Exerting up to 50 pounds of force occasionally, frequently and/or constantly to lift, carry, push, pull or otherwise move objects. Overnight travel may be required. </li><li> Overnight travel may be required.</li></ul>", "postedDate": "5 days ago", "skills": ["Microsoft Office"], "url": "https://www.linkedin.com/jobs/view/4002500819"}