{"jobTitle": "Corporate Communications Senior Specialist", "company": {"name": "Jobs via eFinancialCareers", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Staffing and Recruiting", "description": "<strong>CORPORATE COMMUNICATIONS SENIOR SPECIALIST<br/><br/></strong>WHAT IS THE OPPORTUNITY?<br/><br/>The HR Communications Senior Specialist plays a key role in informing City National's 6,000 colleagues of what they need to do to be successful; updating them on the competitive benefits, compensation and career growth opportunities designed to support them; and engaging them to remain vital contributors to the bank's priorities for serving its clients and communities.<br/><br/>To do this, the HR Communications Senior Specialist will create and improve communications among City National colleagues, supervisors, the Human Resources department, and executive leadership, translating critical HR priorities into tangible messaging that drives awareness, engagement and action.<br/><br/>A member of the Corporate Communications team reporting to the HR Communications Lead, the HR Communications Senior Specialist serves as a trusted communications partner and advisor to City National's Human Resources team. While remaining constantly attuned to City National's internal reputation and strategic direction, the person in this role will execute a comprehensive HR communications strategy that supports City National colleagues to provide excellent client service, grow their careers and thrive along with the bank.<br/><br/>What You Will Do<br/><br/><ul><li>Partner with key HR stakeholders to understand and assess their communications needs, provide meaningful counsel and translate their needs into action via strategic communication plans and deliverables that achieve desired results.</li><li>Maintain an HR Communications calendar, and create inclusive communications for a variety of channels, including email, newsletters, intranet, presentations, and large-scale events and programs like town hall events.</li><li>Own and lead multiple communications projects from conception to completion, which often include project management and administrative tasks.</li><li>Ensure the overall communications approach and deliverables align with Corporate Communications best practices and team-level priorities, and reflect the bank's culture, brand, vision and values.</li><li>Measure and monitor the performance of communications effectiveness for internal reporting on metrics and to identify opportunities for continuous improvement.</li><li>Participate in other projects and duties as assigned.<br/><br/><br/></li></ul><strong>Must-Have*<br/><br/></strong><ul><li>Bachelor's Degree or equivalent</li><li>Minimum 6 years of relevant experience in writing and copy-editing skills, proofreading, Journalism, editing, AP Style</li><li>Minimum 6 years corporate communications experience<br/><br/><br/></li></ul><strong>Skills And Knowledge<br/><br/></strong><ul><li>BA/BS degree in English, Journalism, Public Relations, or related communications field preferred</li><li>Finance/banking background preferred</li><li>Editing, AP Style, business communications background a plus</li><li>Excellent writing and copyediting skills required</li><li>Must be able to provide high attention to detail</li><li>Must possess an interpersonal style that enables effective relationships with peers and senior leaders in the execution of job responsibilities</li><li>Must be capable of working well independently and in teams.<br/><br/><br/></li></ul><strong>Compensation<br/><br/></strong>Starting base salary: $92,114 - $156,880 per year. Exact compensation may vary based on skills, experience, and location. This job is eligible for bonus and/or commissions.<br/><br/><ul><li>To be considered for this position you must meet at least these basic qualifications The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.<br/><br/><br/></li></ul><strong>Benefits And Perks<br/><br/></strong>At City National, we strive to be the best at whatever we do, including the benefits and perks we offer our colleagues. Get an inside look at our Benefits and Perks.<br/><br/><strong>INCLUSION AND EQUAL OPPORTUNITY EMPLOYMENT<br/><br/></strong>City National Bank is an equal opportunity employer committed to diversity and inclusion. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or any other basis protected by law.<br/><br/><strong>About City National<br/><br/></strong>City National Bank, a subsidiary of Royal Bank of Canada, is the largest bank headquartered in Los Angeles with $92.03 billion in assets as of April 30, 2024. Founded in 1954, City National provides personalized banking, investment and trust services in select markets including Los Angeles, Orange County, San Diego, the San Francisco Bay Area, New York City, Nashville, Atlanta, Delaware, Las Vegas, Washington D.C. and Miami.* In addition, the company and its investment affiliates manage or administer $96.83 billion in client investment assets. City National is dedicated to strengthening communities, and in 2023 alone, the company made more than $11 million in charitable contributions to nonprofits that support the communities it serves.<br/><br/><ul><li>City National Bank does business in Miami and the state of Florida as CN Bank.<br/><br/><br/></li></ul>For more information about City National, visit cnb.com.", "postedDate": "5 days ago", "qualifications": {"required": "Bachelor's Degree or equivalent, Minimum 6 years of relevant experience in writing and copy-editing skills, proofreading, Journalism, editing, AP Style, Minimum 6 years corporate communications experience", "preferred": "BA/BS degree in English, Journalism, Public Relations, or related communications field preferred, Finance/banking background preferred, Editing, AP Style, business communications background a plus"}, "skills": ["Writing", "Copy Editing", "Proofreading", "Journalism", "Editing", "AP Style", "Corporate Communications", "Finance", "Banking", "Business Communications"], "benefits": "At City National, we strive to be the best at whatever we do, including the benefits and perks we offer our colleagues. Get an inside look at our Benefits and Perks.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002510133"}