{"jobTitle": "Receptionist", "company": {"name": "Company 3", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Animation and Post-production", "description": "Company: Company 3<br/><br/>Position: Receptionist<br/><br/>Location: Hollywood, CA<br/><br/><ul><li>Pay Range: $18.00 USD hourly<br/><br/></li></ul>Position Summary<br/><br/>The Receptionist is responsible for greeting guests upon entry and checking them in to their respective areas. They are the first face people see upon entering the buildings. The receptionist answer and direct employees in a polite and friendly manner and maintain standard office equipment on a regular basis.<br/><br/>Main Duties<br/><br/>The Receptionist will greet clients and employees upon entry and assist them throughout their sessions. They will be responsible for answering incoming calls; directing calls to the appropriate staff; answering general inquiries (telephone, e-mail, walk-in). They will be working closely with our Scheduling department to maintain current production schedules and compose daily supervised and unsupervised session reports for the studio. The Receptionist will assign and deactivate studio access badges, order, update, and assist with security audits for all offices, conference rooms, and bays, and create facility tickets and enter studio ticketing system. Additional duties include:<br/><br/><ul><li>Distribute paychecks, log, and mail unclaimed checks. </li><li>Conduct onsite parking audits. </li><li>Conduct nightly security briefing with onsite personal and review operation reports. </li><li>Communicate call times with Client Services department. </li><li>Liaison between employees and management as needed. </li><li>Create email distribution lists for show creations or departments. </li><li>Onboard new hires: Parking, badge ordering, input contact and picture in LDAP, confirming department and company aliases. </li><li>Draft studio wide memos. </li><li>Assist HR &amp; Resource Management during employee offboard process by collecting company equipment and access badges. <br/><br/></li></ul>What You Bring<br/><br/>The ideal candidate will be self-motivated with strong interpersonal communication skills and superior client service skills. They will have excellent organizational skills with proven attention to detail, as well as excellent written and verbal communication skills. They will be comfortable working in a fast-paced environment, and have the ability to multi-task, prioritize, and work under high pressure with short deadlines. Additional desired skills include:<br/><br/><ul><li>Resourcefulness and exceptional time management skills. </li><li>Strong knowledge of the Microsoft Office software, including Word, Excel, PowerPoint, and Outlook. Excellent typing skills. </li><li>Must be able to work out of our Santa Monica studio on an as needed basis. </li><li>Must be able to work occasional overtime, weekends, and variable shifts as needed. </li><li>Demonstrated experience using a multi-line phone system. </li><li>Demonstrated experience editing and composing business communications (i.e., letters, notices, e-mails). <br/><br/></li></ul>About The Company<br/><br/>Company 3 / Method Studios provides a full range of Creative Services for content creators, including conceptual design, pre-vis, look development, ideation and rapid prototyping, 3D animation/CGI, motion graphics/designers, matte painting, compositing, dailies and production services, color grading, post-production finishing, marketing/trailers, live-action production, experiences, and more. <br/><br/>Diversity And Inclusion At Company 3<br/><br/>Creativity has diversity at its core. We celebrate the value of each unique experience by being dedicated to fostering the most diverse, equitable and inclusive culture where every employee feels empowered and safe to show up to work as their full self.<br/><br/>It is our policy to provide equal employment opportunities to all applicants and employees. Please inform the company's HR representative if you need assistance completing any forms or to otherwise participate in the application process.<br/><br/><ul><li>The listed pay range represents the lowest to highest range that we in good faith believe we would pay for this role at the time of this posting. We may ultimately pay more or less than the posted range, and the range may be modified in the future. An employee’s pay position within the range will be based on several factors including, but limited to, relevant education, qualifications, certifications, experience, skills, seniority, geographic location, local currency exchange rates, performance, shift, travel requirements, sales or revenue-based metrics, applicable law, and business or organizational needs.<br/><br/></li></ul>The benefits for eligible part-time employees working 25 or more hours per week and full-time employees in the US include a comprehensive package of health, retirement, and insurance benefits and paid time off. The benefits for eligible project hires and part-time employees working less than 25 hours per week in the US include retirement, select insurance benefits, and where required by law, health benefits. For roles filled in Canada and other territories, local benefits plan offerings will apply.<br/><br/>Both external and internal candidates can apply for this role through this careers’ website.<br/><br/>The above compensation and benefits information is provided in accordance with various state and local pay transparency laws.<br/><br/>Note: No amount of pay is considered to be wages or compensation until such amount is earned, vested, and determinable. The amount and availability of any bonus, commission, or any other form of compensation that are allocable to a particular employee remains in the Company's sole discretion unless and until paid and may be modified at the Company’s sole discretion, consistent with applicable law.", "responsibilities": "The Receptionist is responsible for greeting guests upon entry and checking them in to their respective areas. They are the first face people see upon entering the buildings. The receptionist answer and direct employees in a polite and friendly manner and maintain standard office equipment on a regular basis.<br/><br/>The Receptionist will greet clients and employees upon entry and assist them throughout their sessions. They will be responsible for answering incoming calls; directing calls to the appropriate staff; answering general inquiries (telephone, e-mail, walk-in). They will be working closely with our Scheduling department to maintain current production schedules and compose daily supervised and unsupervised session reports for the studio. The Receptionist will assign and deactivate studio access badges, order, update, and assist with security audits for all offices, conference rooms, and bays, and create facility tickets and enter studio ticketing system. Additional duties include:<br/><br/><ul><li>Distribute paychecks, log, and mail unclaimed checks. </li><li>Conduct onsite parking audits. </li><li>Conduct nightly security briefing with onsite personal and review operation reports. </li><li>Communicate call times with Client Services department. </li><li>Liaison between employees and management as needed. </li><li>Create email distribution lists for show creations or departments. </li><li>Onboard new hires: Parking, badge ordering, input contact and picture in LDAP, confirming department and company aliases. </li><li>Draft studio wide memos. </li><li>Assist HR &amp; Resource Management during employee offboard process by collecting company equipment and access badges. <br/><br/></li></ul>", "qualifications": {"required": "The ideal candidate will be self-motivated with strong interpersonal communication skills and superior client service skills. They will have excellent organizational skills with proven attention to detail, as well as excellent written and verbal communication skills. They will be comfortable working in a fast-paced environment, and have the ability to multi-task, prioritize, and work under high pressure with short deadlines. Additional desired skills include:<br/><br/><ul><li>Resourcefulness and exceptional time management skills. </li><li>Strong knowledge of the Microsoft Office software, including Word, Excel, PowerPoint, and Outlook. Excellent typing skills. </li><li>Must be able to work out of our Santa Monica studio on an as needed basis. </li><li>Must be able to work occasional overtime, weekends, and variable shifts as needed. </li><li>Demonstrated experience using a multi-line phone system. </li><li>Demonstrated experience editing and composing business communications (i.e., letters, notices, e-mails). <br/><br/></li></ul>"}, "skills": ["Microsoft Office", "Word", "Excel", "PowerPoint", "Outlook", "Time Management", "Client Service", "Communication", "Multi-tasking", "Prioritization"], "postedDate": "6 days ago", "benefits": "The benefits for eligible part-time employees working 25 or more hours per week and full-time employees in the US include a comprehensive package of health, retirement, and insurance benefits and paid time off. The benefits for eligible project hires and part-time employees working less than 25 hours per week in the US include retirement, select insurance benefits, and where required by law, health benefits. For roles filled in Canada and other territories, local benefits plan offerings will apply.", "remoteWork": "No", "salary": {"amount": "18.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4002972915"}