{"jobTitle": "Director Project Management", "company": {"name": "24 Seven Talent", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Not Applicable", "salary": {"amount": "65.00/hr - 70.00/hr", "currency": "USD"}, "jobFunction": "Advertising", "industry": "Staffing and Recruiting", "description": "Digital First, Ad Agency, is seeking a Director-level Project Manager to join the team.  You will be spearheading all elements of the engagement including project management: project definition, scope management, risk management, hand-off management, and team management. The ideal candidate will have automotive client experience. YOUR RESPONSIBILITIES • Drive the planning and execution of a simultaneous integrated projects • Leads project direction collaborating with cross-functional teams to define and re-define project specifications (goals, budget, schedule, and scope)  • Lead and mentor Project Managers and Sr. Project Managers • Author and review program SOW’s and estimate documentation when needed • Be responsible for the development and management of timelines, quality and profit margins related to agency deliverables • Oversee internal account-related meetings including weekly producer/account status meetings, internal reviews, etc. • Direct resource management against deliverables ensuring alignment against work and required times throughout the project lifecycle • Lead financial management and budget tracking; manage and own project financials • Risk management, proactively mitigating risks and comfortable driving solutions to adapt to changes from inception or project to delivery  • Drive project measurement, reporting and analysis • Evaluate and optimize production workflows and processes • Project documentation samples are required (SOW and Project Plan) SKILLS/EXPERIENCE • 7-9 years of industry experience producing and project management at a media, entertainment or creative brand and/or interactive advertising agency • Working knowledge &amp; understanding of web technologies, including HTML, DHTML, content management systems and deployment platforms, etc. • Direct Marketing and CRM experience a plus! • Excellent documentation and presentation development, such as financial reports, proposals, roadmaps and workflows • Strong communication and presentations skills - capable of presenting solutions in a clear, logical manner • Excellent negotiation skills Contract- 40 hours/week Duration- on-going Hybrid Schedule- 3 days in-office Location- West Los Angeles", "responsibilities": "Drive the planning and execution of a simultaneous integrated projects Leads project direction collaborating with cross-functional teams to define and re-define project specifications (goals, budget, schedule, and scope)  Lead and mentor Project Managers and Sr. Project Managers Author and review program SOW’s and estimate documentation when needed Be responsible for the development and management of timelines, quality and profit margins related to agency deliverables Oversee internal account-related meetings including weekly producer/account status meetings, internal reviews, etc. Direct resource management against deliverables ensuring alignment against work and required times throughout the project lifecycle Lead financial management and budget tracking; manage and own project financials Risk management, proactively mitigating risks and comfortable driving solutions to adapt to changes from inception or project to delivery  Drive project measurement, reporting and analysis Evaluate and optimize production workflows and processes Project documentation samples are required (SOW and Project Plan)", "qualifications": {"required": "7-9 years of industry experience producing and project management at a media, entertainment or creative brand and/or interactive advertising agency Working knowledge &amp; understanding of web technologies, including HTML, DHTML, content management systems and deployment platforms, etc. Direct Marketing and CRM experience a plus! Excellent documentation and presentation development, such as financial reports, proposals, roadmaps and workflows Strong communication and presentations skills - capable of presenting solutions in a clear, logical manner Excellent negotiation skills", "preferred": ""}, "skills": ["Project Management", "Risk Management", "Team Management", "HTML", "DHTML", "Content Management Systems", "Direct Marketing", "CRM", "Communication", "Presentations", "Negotiation"], "postedDate": "3 days ago", "applicationDeadline": "", "benefits": "Medical insurance, Vision insurance, Dental insurance, Disability insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002873506"}