{"jobTitle": "Sr. Analyst, Data & Analytics", "company": {"name": "Quigley-Simpson", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Advertising Services", "description": "<strong>Candidates must live in CA, CO, FL, IL, MA, MI, MN, NC, NY TRI-STATE, OR, TN, TX, WA</strong><strong> Summary: <br/><br/></strong>Quigley-Simpson seeks a Senior Analyst, Data &amp; Analytics, to research, analyze, and report on omnichannel media, including market trends, competitors, customers, and campaign performance. The candidate should have marketing analytics experience across multiple channels and knowledge of aligning KPIs with the purchase funnel. Proficiency in rules-based attribution models and SQL for database exploration is required. The Senior Analyst will collaborate with multidisciplinary teams in a fast-paced environment to deliver analytics solutions to clients.<br/><br/><strong>Core Accountabilities<br/><br/></strong><ul><li> 4-5+ years professional experience </li><li> 2+ years working in a client-focused environment such as an ad agency or adjacent business </li><li> Experience with paid media ecosystem — customer journey/marketing funnels, retargeting audiences, etc. </li><li> Proven analytics background: ideally focused on campaign performance analytics. Big plus: demonstrated knowledge of A/B, MVT, and other forms of testing </li><li> 2+ years of experience working with a data visualization tool and experience designing dashboards for different stakeholders with different needs and goals. Experience with Tableau/Power BI (or similar tools, e.g., Spotfire a big plus) </li><li> Experience with web analytics platforms and using them to analyze paths to conversion and to generate insights around the impact of marketing </li><li> Experience providing analysis and insights for one or more of the following: web and search traffic; email messaging statistics; social media trends; and offline media impact </li><li> Experience conducting ROI analysis, making optimization recommendations and developing key insights for online and/or offline advertising </li><li> Working knowledge in SQL and one of these programming languages: Python or R (SQL tests will be administered to all candidates) </li><li> Ability to troubleshoot data issues </li><li> Knowledge of Brand Impact measurement </li><li> Experience with reporting automation </li><li> Has successfully managed projects through partnerships with cross-functional teams, both internal and external </li><li> Ability to diplomatically work with a wide range of personalities </li><li> Highly detail-oriented and organized with the ability to multi-task and work in a very fast-paced environment <br/><br/></li></ul><strong> Required Skills/Experience: <br/><br/></strong><ul><li> Mentor junior analysts </li><li> Manage assigned client engagements and workloads </li><li> Manage data visualization platforms, including managing the API connections and offline data inputs, updating data models as needs change, establishing templates and best practices for the organization </li><li> Understand and help define the Key Performance Indicators (KPIs) of campaigns and marketing activities and derive relevant metrics, targets, and data collection strategies </li><li> Devise and own analytics and reporting processes, including requirements-gathering in collaboration with internal stakeholders </li><li> Execute data visualization and dashboards in Tableau </li><li> Function as a liaison between account teams and technical resources to translate business needs into data infrastructure and reporting approach </li><li> Analyze collected data and present results, including hypothesis development </li><li> Perform analytical “deep dives” as needed </li><li> Monitor and provide optimizations recommendations for omnichannel campaigns </li><li> Design and conduct A/B testing and make recommendations for optimization </li><li> Ability to learn new techniques, concepts, and information quickly </li><li> Supportive of teammates and respectful </li><li> Emotional maturity with day-to-day client and internal interactions </li><li> Open-minded to new ideas and an appetite for learning </li><li> Adaptable with an appetite for innovation and operational efficiency</li></ul>", "postedDate": "6 days ago", "skills": ["SQL", "Tableau", "Power BI", "Python", "R", "A/B Testing", "MVT", "Data Visualization", "Marketing Analytics", "Omnichannel Media", "Campaign Performance Analytics", "ROI Analysis", "Brand Impact Measurement", "Reporting Automation", "Project Management", "Cross-functional Collaboration", "Client Management", "Data Infrastructure", "Data Modeling", "Data Analysis", "Hypothesis Development", "Optimization Recommendations", "Data Troubleshooting"], "url": "https://www.linkedin.com/jobs/view/4002964833"}