{"jobTitle": "Finance Analyst, Amazon", "company": {"name": "Amazon", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$51,100.00/year - $109,200.00/year", "currency": "USD"}, "jobFunction": "Finance, Information Technology, and Accounting/Auditing", "industry": "Software Development", "description": "Advertising Sales is a global organization dedicated to providing major brand partners with compelling customized media, sponsorship and event programs. The Pricing Financial Analyst, Programmatic Operations, will play an integral role in crafting the programmatic pricing and incentives strategy across Twitch, Prime Video, Alexa Audio among others. They will work with stakeholders in order to provide pricing recommendations for new product launches while operationalizing pricing and incentives through system update and reporting. The candidate should be data-driven, and experience in advertising is highly desirable.<br/><br/>Key job responsibilities<br/><br/><ul><li> Support finance, sales teams and the wider business, and help proactively develop forward-looking projects to scale the business</li><li> Act as trusted partner to the business team and generate insightful reporting, e.g. ability to meet quarterly/annual goals.</li><li> Support performance improvements across the sales organization and build the foundation for it to scale. This will include evaluating revenue optimization opportunities, process redesign, and financial reporting &amp; analysis.</li><li> Assist with co-authoring and providing data for highly visible business reporting.</li><li> Work closely with team and management to identify systems, data or process needs that can generate revenue.</li><li> Use data systems such as Salesforce, SQL, and Tableau to identify insights and surface to management.<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> 1+ years of finance experience</li><li> Knowledge of standard software including Excel, Access, Oracle, Essbase, SQL and VBA skills</li><li> Experience using data to influence business decisions</li><li> Experience in corporate finance including budgeting/planning, forecasting and reporting<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> 2+ years of participating in continuous improvement projects in your team to scale and improve controllership with measurable results experience</li><li> Experience in TM1, Data Warehouse and SQL<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $51,100/year in our lowest geographic market up to $109,200/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon Advertising LLC - B11<br/><br/>Job ID: A2734512", "responsibilities": "Support finance, sales teams and the wider business, and help proactively develop forward-looking projects to scale the business\nAct as trusted partner to the business team and generate insightful reporting, e.g. ability to meet quarterly/annual goals.\nSupport performance improvements across the sales organization and build the foundation for it to scale. This will include evaluating revenue optimization opportunities, process redesign, and financial reporting & analysis.\nAssist with co-authoring and providing data for highly visible business reporting.\nWork closely with team and management to identify systems, data or process needs that can generate revenue.\nUse data systems such as Salesforce, SQL, and Tableau to identify insights and surface to management.", "qualifications": {"required": "1+ years of finance experience\nKnowledge of standard software including Excel, Access, Oracle, Essbase, SQL and VBA skills\nExperience using data to influence business decisions\nExperience in corporate finance including budgeting/planning, forecasting and reporting", "preferred": "2+ years of participating in continuous improvement projects in your team to scale and improve controllership with measurable results experience\nExperience in TM1, Data Warehouse and SQL"}, "skills": ["Salesforce", "SQL", "Tableau", "Excel", "Access", "Oracle", "Essbase", "VBA"], "postedDate": "1 week ago", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4002281489"}