{"jobTitle": "Corporate Lawyer", "company": {"name": "Pact", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Legal and Business Development", "industry": "Legal Services and Law Practice", "description": "Are you a forward-thinking corporate attorney eager to revolutionize your legal practice with technology-based innovation? At Pact, we are redefining legal services, transforming the traditional corporate law firm model one attorney at a time.\n<br/>\nPact is the ideal law firm for attorneys who excel in a collaborative and supportive environment and desire to serve their clients how they see fit, without the unnecessary red tape associated with traditional models. Our attorneys partner with their clients, tackling legal challenges to drive business success locally, nationally, and globally. We've eliminated bureaucracy, lock-step compensation, and internal politics, focusing instead on recruiting top-tier talent and providing the resources for effective teamwork.\n<br/>\nJoin Pact and immerse yourself in a modern law firm environment. Leveraging a virtual structure and technological advancements, Pact attorneys collaborate seamlessly across state lines and time zones, enjoying a flexible and empowered approach to corporate law. For forward-thinking attorneys, the professional landscape has never been more exciting.\n<br/>\nIf you want to join a dynamic team of highly motivated and skilled attorneys, consider applying at Pact today.\n<br/>\n**Job Summary**\n<br/>\nPact seeks Partners with at least seven years of firm experience practicing corporate law. Partners are responsible for generating new work for the law firm and will work closely with clients and firm staff to provide sound guidance on the legal realities that clients and their companies face. Ideal partners are passionate about delivering exceptional legal services their way and thrive in a fast-paced, collaborative environment.\n<br/>\n**Job Responsibilities**\n<br/>\n<ul><li>Generate new clients for legal work and cultivate prospective opportunities for the sustained growth of the law firm.</li><li>Assist businesses in preventing, navigating, and resolving complex legal issues.</li><li>Draft, review, negotiate, and finalize business agreements.</li><li>Manage multiple clients, matters, and legal activities that carry varying deadlines.</li><li>Advise, guide, and mentor Law Clerks and Associates.</li><li>Work collaboratively with colleagues across the firm.</li></ul>\n<br/>\n**Required Skills**\n<br/>\n<ul><li>Strong attention to detail and contract review abilities.</li><li>Demonstrated relationship-building, communication, and leadership aptitudes.</li><li>Comfortable working with evolving technology.</li><li>Self-motivated with excellent time management skills.</li><li>Ability to oversee client matters and delegate effectively to associate attorneys and support staff.</li><li>Exceptional business judgment and a high level of professionalism.</li></ul>\n<br/>\n**Education**\n<br/>\n<ul><li>J.D. degree from an ABA-accredited school.</li><li>An active member in good standing with a State Bar Association.</li></ul>\n<br/>\n**Experience**\n<br/>\n<ul><li>Partner applicants must have at least seven years of law firm experience practicing corporate law.</li><li>Applicants must demonstrate a transferable book of originations to be considered for a partner position.</li></ul>\n<br/>\n**Compensation**\n<br/>\nUnlike a traditional law firm, Pact pays attorneys a percentage of client fees. Where traditional firms offer attorneys a salary of approximately one-third of the value they create, Pact attorneys make a percentage of collected origination and matter responsible fees.\n<br/>\n**Life at Pact**\n<br/>\nAt Pact, our values represent who we are: hardworking professionals passionate about providing exceptional legal services to our clients by leveraging our most vital resource—our team. Our core values—no bullshit, stay driven, be a good person, work-life harmony, and create everlasting Pacts—guide us daily. We trust our team and believe that investing in the health and wellness of all members is paramount to building successful relationships, both internally and with our clients. By fostering a supportive, collaborative, and dynamic working environment, we ensure that our people are poised to thrive, ultimately delivering exceptional service to our clients and promoting a new way to legal.\n<br/>\n**Why Join Pact**\n<br/>\nIf you take your work seriously but want to have some fun along the way, then you should apply to Pact. Some of the benefits you can expect when you join Pact include:\n<br/>\n<ul><li>Competitive pay.</li><li>Flexible schedule and fully remote working environment.</li><li>Employee-paid health insurance with company contribution.</li><li>401K with Company Match.</li><li>Unlimited paid time off.</li><li>Monthly remote office stipend.</li><li>Monthly Health &amp; Wellness reimbursement.</li><li>Student Loan Reimbursement.</li><li>Performance Coaching and Professional Development.</li><li>Company-sponsored training opportunities and events.</li></ul>\n<br/>\n**Commitment to Diversity and Inclusion**\n<br/>\nPact is dedicated to equal treatment and opportunity in all recruitment, selection, and employment aspects. We are an equal opportunity employer committed to fostering a community of inclusion and an environment free from discrimination, harassment, and retaliation.\n<br/>\n**Ready to Join Us?**\n<br/>\nIf you take your work seriously but want to have some fun along the way, apply to Pact today. Join a team that values your passion and drive and provides the support you need to excel in your career.", "responsibilities": "<ul><li>Generate new clients for legal work and cultivate prospective opportunities for the sustained growth of the law firm.</li><li>Assist businesses in preventing, navigating, and resolving complex legal issues.</li><li>Draft, review, negotiate, and finalize business agreements.</li><li>Manage multiple clients, matters, and legal activities that carry varying deadlines.</li><li>Advise, guide, and mentor Law Clerks and Associates.</li><li>Work collaboratively with colleagues across the firm.</li></ul>", "qualifications": {"required": "<ul><li>Strong attention to detail and contract review abilities.</li><li>Demonstrated relationship-building, communication, and leadership aptitudes.</li><li>Comfortable working with evolving technology.</li><li>Self-motivated with excellent time management skills.</li><li>Ability to oversee client matters and delegate effectively to associate attorneys and support staff.</li><li>Exceptional business judgment and a high level of professionalism.</li></ul>", "preferred": "<ul><li>J.D. degree from an ABA-accredited school.</li><li>An active member in good standing with a State Bar Association.</li></ul>"}, "skills": ["Contract Review", "Relationship Building", "Communication", "Leadership", "Technology", "Time Management", "Client Management", "Delegation", "Business Judgment", "Professionalism"], "postedDate": "3 days ago", "benefits": "<ul><li>Competitive pay.</li><li>Flexible schedule and fully remote working environment.</li><li>Employee-paid health insurance with company contribution.</li><li>401K with Company Match.</li><li>Unlimited paid time off.</li><li>Monthly remote office stipend.</li><li>Monthly Health &amp; Wellness reimbursement.</li><li>Student Loan Reimbursement.</li><li>Performance Coaching and Professional Development.</li><li>Company-sponsored training opportunities and events.</li></ul>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002860461"}