{"jobTitle": "Vice President Human Resources", "company": {"name": "Pinnacle Executive Recruiting", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Human Resources", "industry": "Banking and Financial Services", "description": "In collaboration with SAG-AFTRA Federal Credit Union - We are searching for a VPHR to work onsite in the Burbank, CA office. If you have worked in financial services preferably a credit union or bank would be looked at favorably. You must live in the Burbank area and work onsite full time.  The Vice President of Human Resources is responsible for developing people and shaping the culture for success. This role will participate in forming and implementing organizational strategic plans and the general management of the Credit Union. As a visionary leader, the VP of HR will inspire confidence and convey key information effectively to various key stakeholders, including the Board of Directors, strategic partners, and associates. This role serves as a positive influence on others by demonstrating a commitment to the Credit Union’s Leadership Competencies: Instilling Shared Vision; Strategic Agility; Emotional Intelligence; Communication Skills; Business Acumen; Relationship Skills; and Developing Individuals and Teams. Essential: Oversees all aspects of Human Resources functions that include but are not limited to payroll, benefits and retirement plan administration, talent acquisition, employee relations, leave of absence administration, HR compliance, compensation analysis, performance management, and onboarding/offboarding employees. Leads the development and execution of innovative HR strategic initiatives aligned with the Credit Union’s business objectives while fostering a culture of engagement. Collaborates with senior leadership to align HR policies, programs, and practices with the overall business strategy. Provides guidance and leadership to the HR team and builds organizational capability and effectiveness; oversees the department’s daily workflow and assists with inquiries about HR-related responsibilities. Ensures compliance with employment, pay and benefits, and other laws surrounding HR practices. Provides advice and counsel to organizational leaders on HR-related issues. Serve as the payroll backup. Performs other job-related duties as assigned. Contribute to a supportive and positive work environment. Promote a cooperative team environment.  Knowledge, Skills, and Abilities: Bachelor of Science (BS) degree with emphasis in Business Administration, Human Resources Management or an equivalent level of training and experience. Eight to ten (8 to 10) years of similar or related experience. PHR, SPHR, or SCP preferred.", "postedDate": "3 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002121710"}