{"jobTitle": "Junior Account Manager - Entry Level", "company": {"name": "Elysium Ventures", "industry": "Internet Publishing", "size": "Not specified", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "At our company, we’re determined to challenge the status quo and push forward to be better in the future than we are right now. As a member of our team, we embrace a culture of growth, diversity, and possessing an entrepreneurial spirit to take our careers to the next level. Our Junior Account Manager to upper-level team is encouraged to innovate, be creative, take risks, and LEARN. Working with us, you can find endless opportunities for advancement and are encouraged to expose yourself to situations that are challenging, yet rewarding. We are in need of a Junior Account Manager who can act as the liaison between our renowned clientele we represent and their customer base. The role is heavily rooted in building and maintaining relationships with our customers and creating the brand visibility we need to bolter our sales pipeline at an exponential rate. As a Junior Account Manager, you must possess a can-do attitude, an unwavering commitment to an unbelievable customer experience, and an entrepreneurial spirit to continue moving forward in strides. If this is you, APPLY TODAY!", "responsibilities": "Core Daily Functions of Our Junior Account Manager: Present products and services directly to our customers and complete the sales process with qualifying individuals. Deliver exceptional customer service with each and every interaction, internal and external. Meet all sales targets and KPIs, and conduct work in accordance with the standards of our Quality Assurance Department. Become an expert on our clients’ products, services, sales processes, and new technology. Track, analyze, and manage your sales projections on a daily and weekly basis. Report sales activity with our Quality Assurance Department to target any issues to help drive business growth and improvements.", "qualifications": {"required": "Not specified", "preferred": "Bachelor’s Degree in Communications, Marketing, Sales, and/or related study is strongly preferred. Experience in a customer-facing, high octane environment is required. Can multi-task and work on multiple projects at the same time. Understand how to build relationships and relate to a diverse group of people. Strong communication skills, both written and verbal. Excitement working in an extremely team-oriented and collaborative environment."}, "skills": ["Strong communication skills", "Customer service", "Sales process expertise", "Relationship building", "Multi-tasking"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4002288040"}