{"jobTitle": "Operational Specialist", "company": {"name": "House of Shipping", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Other", "industry": "Transportation, Logistics, Supply Chain and Storage, Boilers, Tanks, and Shipping Container Manufacturing, and Shipbuilding", "description": "House of Shipping provides business consultancy and advisory services for Shipping & Logistics companies. House of Shipping's commitment to their customers begins with developing an understanding of their business fundamentals.\n<br/>\nCurrently House of Shipping is recruiting for a Executive – Equipment/ Operations Management on behalf of our client a global shipping company.\n<br/>\nJob Purpose:\n<br/>\nEquipment Management to manage the Company’s shipping container fleet & accomplish day-to-day tasks in related to container activities\n<br/>\nJob Responsibilities:\n<ul><li>Coordinating with overseas agencies on day-to-day equipment management issues.</li><li>Inventory management – demand & supply planning, aging control, FI-FO control, etc.</li><li>Execution of effective and efficient empty container disposal and empty container repositioning activities.</li><li>Liaise with external and internal parties to ensure smooth container pick-up / drop-off / sale activities, etc.</li><li>Develop, execute, and manage one-way container movements </li><li>Assist in container sales activities if required</li><li>Monitor demurrage and detention invoicing and collection process and take actions against dispute cases/slow payment</li><li>Equipment Management System data integrity management</li><li>Cost management – budget control & invoice processing related to equipment management</li><li>Analysis & Report – produce relevant reports, statistics, and analysis</li><li>Any other tasks assigned by reporting managers in relation to equipment management</li></ul>\n<br/>\nEducation requirements:\nGraduate level education, good computer skills (MS office & shipping software), Certificates related logistics / shipping / marine / container inspection, e.g. IICL\n<br/>\nLanguage requirements:\nEnglish – Fluent (required)\nOther languages is an asset \n<br/>\nBackground and experience:\n<ul><li>More than 3 years experience in the container shipping or NVOCC</li><li>Preferably with container management experience</li><li>Knowledge on customs rules and regulations in international shipping is an advantage</li><li>Network with container leasing companies, factories, container shipping liners, container brokers and traders will be an asset</li></ul>\n<br/>\nCompetencies and skills: \n<ul><li>Good team player but also can work independently</li><li>Good planning and execution capabilities</li><li>Excellent communications and interpersonal skills</li><li>Time management and organizational skills</li><li>Analytical, numerical and problem-solving skills</li><li>Able to work under pressure and tight deadlines</li></ul>", "postedDate": "6 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002792214"}