{"jobTitle": "Human Resources Coordinator", "company": {"name": "HYBE", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "55,000.00/yr - 60,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources, Administrative, and Other", "industry": "Entertainment Providers, Musicians, and Technology, Information and Media", "description": "<strong>Job Overview:</strong> <p>We are looking for a bilingual (Korean/ English) HR Coordinator to support the full spectrum of HR functions including recruitment, onboarding, compliance, and benefits administration. The ideal candidate will have strong attention to detail, excellent communication skills, and the ability to handle multiple responsibilities independently in a fast-paced environment.</p><p><br/></p><p><strong>Key Responsibilities:</strong></p><ul><li>Collaborate with hiring managers on the recruitment process workflow, including job posting, candidate sourcing, interview scheduling , and candidate vetting.</li><li>Onboard new hires and ensure all new employee enrollments are completed </li><li>Assign and track training via the company’s LMS.</li><li>Coordinate with IT and other departments to ensure new hires have the tools and access needed to begin work. </li><li>Conduct periodic audits of HR processes and systems </li><li>Prepare monthly reports including headcount, benefit enrollment changes, etc. </li><li>Maintain accurate and up-to-date employee files</li><li>Update employee records as needed</li><li>Support global HR initiatives, acting as liaison with the company’s HQ in Seoul, Korea </li><li>Assist with gathering company documents for visa applications </li><li>Manage and distribute the monthly company-wide newsletter </li><li>Maintain HR Calendar up to date</li></ul><p><br/></p><p><strong>Requirements:</strong></p><ul><li>Bilingual, English and Korean </li><li>Bachelor’s degree in HR, Business Administration., or a related field.</li><li>1-2 years of experience in HR operations or a similar role</li><li>Basic knowledge of HR compliance and CA labor regulations.</li><li>Excellent organizational and multitasking skills</li><li>High level of discretion and protection of personal data.</li><li>HRIS experience preferred</li><li>Strong communication and interpersonal skills.</li></ul><p></p>", "responsibilities": "Collaborate with hiring managers on the recruitment process workflow, including job posting, candidate sourcing, interview scheduling , and candidate vetting. Onboard new hires and ensure all new employee enrollments are completed  Assign and track training via the company’s LMS. Coordinate with IT and other departments to ensure new hires have the tools and access needed to begin work.  Conduct periodic audits of HR processes and systems  Prepare monthly reports including headcount, benefit enrollment changes, etc.  Maintain accurate and up-to-date employee files Update employee records as needed Support global HR initiatives, acting as liaison with the company’s HQ in Seoul, Korea  Assist with gathering company documents for visa applications  Manage and distribute the monthly company-wide newsletter  Maintain HR Calendar up to date", "qualifications": {"required": "Bilingual, English and Korean  Bachelor’s degree in HR, Business Administration., or a related field. 1-2 years of experience in HR operations or a similar role Basic knowledge of HR compliance and CA labor regulations. Excellent organizational and multitasking skills High level of discretion and protection of personal data. HRIS experience preferred Strong communication and interpersonal skills.", "preferred": null}, "skills": ["HRIS", "Recruitment", "Onboarding", "Compliance", "Benefits Administration", "Communication", "Multitasking", "Bilingual", "Korean", "English", "HR Compliance", "CA Labor Regulations"], "postedDate": "3 days ago", "applicationDeadline": null, "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4002126865"}