{"jobTitle": "Director, Marketing Science", "company": {"name": "Snap Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "244,000-$366,000", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Software Development", "description": "Snap Inc is a technology company. We believe the camera presents the greatest opportunity to improve the way people live and communicate. Snap contributes to human progress by empowering people to express themselves, live in the moment, learn about the world, and have fun together. The Company’s three core products are Snapchat, a visual messaging app that enhances your relationships with friends, family, and the world; Lens Studio, an augmented reality platform that powers AR across Snapchat and other services; and its AR glasses, Spectacles.<br/><br/>The Revenue Product team uses creativity, insights, and operational excellence to steer our product vision across Snap Inc. This team of designers, scientists, and product managers work in a highly collaborative environment to build the products and experiences that bring our community together in new and special ways.<br/><br/>We're looking for a Director, Marketing Science to join our team. You will inspire and lead the teams responsible for driving Snapchat’s advertiser retention through the construction and application of measurement strategy, processes, organizational design, analysis, learning frameworks, consulting and R&amp;D. You will define and propel this strategy, and deliver insights to customers in synchrony with Snap’s Product, Engineering, Strategy, Sales, and adjacent organizations.<br/><br/>What you'll do:<br/><br/><ul><li>Elevate the organizational impact and operational efficiency of the Marketing Science organization, with a particular focus on measurement &amp; insights strategy, methodology, and operations. </li><li>Develop organizational-level goals and drive product and growth commitments in partnership with cross functional teams within Snap. </li><li>Build, mentor and grow a team of senior managers and individual contributors. </li><li>Influence key decisions and implementation of scalable, reliable, and cost-effective solutions for clients, agencies and partners. </li><li>Iterate quickly without compromising quality and raise the bar on operational excellence. <br/><br/></li></ul>Knowledge, Skills, and Abilities:<br/><br/><ul><li>Ability to collaborate strategically with all facets of an organization from C-Levels through to engineers, designers, and other cross-functional teams</li><li>Ability to inspire and be an effective mentor to direct reports and cross functional teams</li><li>Ability to execute against defined objectives both tactically and strategically</li><li>Ability to initiate and drive emerging projects from strategy to completion</li><li>Ability to communicate results clearly and effectively across a matrix organization</li><li>A seasoned strategic leader and product-minded thinker</li><li>A passion for Snapchat and creative problem solving!<br/><br/></li></ul>Minimum qualifications:<br/><br/><ul><li>BS/BA or equivalent experience</li><li>15+ years of product, analysis, or measurement experience in digital ads and/or related space. </li><li>3+ years of experience managing a team<br/><br/></li></ul>Preferred qualifications:<br/><br/><ul><li>Bachelor’s degree in a quantitative field such as mathematics, statistics, engineering, or finance, or equivalent years of experience</li><li>Demonstrated experience leading a team at scale with an eye for driving efficiency</li><li>Previous experience partnering with cross-functional executives and management across a globally distributed organization</li><li>Track record of delivery in rapidly changing, highly collaborative, multi-site, multi-stakeholder environments<br/><br/></li></ul>If you have a disability or special need that requires accommodation, please don’t be shy and provide us some information.<br/><br/>\"Default Together\" Policy at Snap: At Snap Inc. we believe that being together in person helps us build our culture faster, reinforce our values, and serve our community, customers and partners better through dynamic collaboration. To reflect this, we practice a “default together” approach and expect our team members to work in an office 4+ days per week.<br/><br/>At Snap, we believe that having a team of diverse backgrounds and voices working together will enable us to create innovative products that improve the way people live and communicate. Snap is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification, in accordance with applicable federal, state, and local laws. EOE, including disability/vets.<br/><br/>Our Benefits: Snap Inc. is its own community, so we’ve got your back! We do our best to make sure you and your loved ones have everything you need to be happy and healthy, on your own terms. Our benefits are built around your needs and include paid parental leave, comprehensive medical coverage, emotional and mental health support programs, and compensation packages that let you share in Snap’s long-term success!<br/><br/><strong>Compensation<br/><br/></strong>In the United States, work locations are assigned a pay zone which determines the salary range for the position. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. The starting pay may be negotiable within the salary range for the position. These pay zones may be modified in the future.<br/><br/>Zone A (CA, WA, NYC):<br/><br/>The base salary range for this position is $244,000-$366,000 annually.<br/><br/>Zone B:<br/><br/>The base salary range for this position is $232,000-$348,000 annually.<br/><br/>Zone C:<br/><br/>The base salary range for this position is $208,000-$311,000 annually.<br/><br/>This position is eligible for equity in the form of RSUs.", "responsibilities": "What you'll do:<br/><br/><ul><li>Elevate the organizational impact and operational efficiency of the Marketing Science organization, with a particular focus on measurement &amp; insights strategy, methodology, and operations. </li><li>Develop organizational-level goals and drive product and growth commitments in partnership with cross functional teams within Snap. </li><li>Build, mentor and grow a team of senior managers and individual contributors. </li><li>Influence key decisions and implementation of scalable, reliable, and cost-effective solutions for clients, agencies and partners. </li><li>Iterate quickly without compromising quality and raise the bar on operational excellence. <br/><br/></li></ul>", "qualifications": {"required": "Minimum qualifications:<br/><br/><ul><li>BS/BA or equivalent experience</li><li>15+ years of product, analysis, or measurement experience in digital ads and/or related space. </li><li>3+ years of experience managing a team<br/><br/></li></ul>", "preferred": "Preferred qualifications:<br/><br/><ul><li>Bachelor’s degree in a quantitative field such as mathematics, statistics, engineering, or finance, or equivalent years of experience</li><li>Demonstrated experience leading a team at scale with an eye for driving efficiency</li><li>Previous experience partnering with cross-functional executives and management across a globally distributed organization</li><li>Track record of delivery in rapidly changing, highly collaborative, multi-site, multi-stakeholder environments<br/><br/></li></ul>"}, "skills": ["Measurement", "Insights", "Strategy", "Methodology", "Operations", "Product", "Growth", "Team Management", "Leadership", "Consulting", "R&D", "Digital Ads", "Collaboration", "Strategic Thinking", "Problem Solving", "Communication", "Execution", "Project Management", "Quantitative Analysis", "Mathematics", "Statistics", "Engineering", "Finance"], "postedDate": "1 week ago", "benefits": "Our Benefits: Snap Inc. is its own community, so we’ve got your back! We do our best to make sure you and your loved ones have everything you need to be happy and healthy, on your own terms. Our benefits are built around your needs and include paid parental leave, comprehensive medical coverage, emotional and mental health support programs, and compensation packages that let you share in Snap’s long-term success!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002066219"}