{"jobTitle": "Senior Operations Manager", "company": {"name": "Altius Talent | Freight Forwarding Recruitment", "location": "Los Angeles, CA", "industry": "Freight and Package Transportation, Transportation, Logistics, Supply Chain and Storage, and Truck Transportation"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "95,000.00/yr - 150,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Distribution", "industry": "Freight and Package Transportation", "description": "Senior Operations Manager<br/>\n<br/>\nLos Angeles, CA<br/>\n<br/>\n**Company Overview:** Join a global leader in the freight forwarding industry, dedicated to providing exceptional logistics solutions across the globe. With a strong presence in Los Angeles, our company is committed to delivering innovative and efficient supply chain services to our diverse clientele. We are looking for a seasoned Senior Operations Manager to drive our operations to new heights.<br/>\n<br/>\n**Position Overview:** As the Senior Operations Manager, you will be at the helm of our Los Angeles operations, overseeing the end-to-end freight forwarding process. This role is integral to ensuring the smooth and efficient movement of goods internationally, from origin to destination. You will be responsible for optimizing our operational processes, managing a skilled team, and ensuring that we meet our clients' needs with the highest standards of service.<br/>\n<br/>\n**Key Responsibilities:**<br/>\n<br/>\n<ul><li>Lead and manage the operations team in all aspects of freight forwarding, including air, ocean, and ground transportation.</li><li>Develop and implement strategies to enhance operational efficiency, reduce costs, and improve service levels.</li><li>Ensure compliance with international trade regulations, customs requirements, and company policies.</li><li>Oversee the coordination of shipments, ensuring timely and accurate delivery of goods.</li><li>Collaborate with global offices, carriers, and partners to streamline operations and resolve any issues.</li><li>Manage relationships with key clients, providing them with superior service and support.</li><li>Analyze operational performance metrics and implement continuous improvement initiatives.</li><li>Control budgets, manage resources, and optimize workflow to meet financial and operational targets.</li><li>Foster a culture of teamwork, accountability, and professional growth within the operations team.</li></ul><br/>\n<br/>\n**Qualifications:**<br/>\n<br/>\n<ul><li>Bachelor’s degree in Logistics, Supply Chain Management, Business, or a related field. MBA or equivalent is a plus.</li><li>7-10 years of experience in operations management within the freight forwarding or logistics industry, with a minimum of 3 years in a senior leadership role.</li><li>In-depth knowledge of international freight forwarding processes, including air, ocean, and customs brokerage.</li><li>Proven ability to manage large-scale operations and lead cross-functional teams.</li><li>Strong problem-solving skills and the ability to thrive in a fast-paced, dynamic environment.</li><li>Excellent communication and interpersonal skills, with the ability to build strong relationships with clients, partners, and team members.</li></ul><br/>\n<br/>\n**Why Join Us?**<br/>\n<br/>\n<ul><li>Competitive salary and benefits package.</li><li>Opportunity to work with a global leader in the logistics industry.</li><li>Be part of a dedicated and professional team in a collaborative work environment.</li><li>Opportunity for career growth and development within a global company.</li></ul><br/>\n<br/>\nIf you're a strategic thinker with a passion for logistics and a proven track record in operations management, we want to hear from you!", "responsibilities": "Lead and manage the operations team in all aspects of freight forwarding, including air, ocean, and ground transportation. Develop and implement strategies to enhance operational efficiency, reduce costs, and improve service levels. Ensure compliance with international trade regulations, customs requirements, and company policies. Oversee the coordination of shipments, ensuring timely and accurate delivery of goods. Collaborate with global offices, carriers, and partners to streamline operations and resolve any issues. Manage relationships with key clients, providing them with superior service and support. Analyze operational performance metrics and implement continuous improvement initiatives. Control budgets, manage resources, and optimize workflow to meet financial and operational targets. Foster a culture of teamwork, accountability, and professional growth within the operations team.", "qualifications": {"required": "Bachelor’s degree in Logistics, Supply Chain Management, Business, or a related field. MBA or equivalent is a plus. 7-10 years of experience in operations management within the freight forwarding or logistics industry, with a minimum of 3 years in a senior leadership role. In-depth knowledge of international freight forwarding processes, including air, ocean, and customs brokerage. Proven ability to manage large-scale operations and lead cross-functional teams. Strong problem-solving skills and the ability to thrive in a fast-paced, dynamic environment. Excellent communication and interpersonal skills, with the ability to build strong relationships with clients, partners, and team members."}, "skills": [], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "Competitive salary and benefits package. Opportunity to work with a global leader in the logistics industry. Be part of a dedicated and professional team in a collaborative work environment. Opportunity for career growth and development within a global company.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002835145"}