{"jobTitle": "Branch Operations Coordinator Malibu", "company": {"name": "Wells Fargo", "location": "Malibu, CA"}, "location": "Malibu, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$20.00 - $27.69", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Financial Services, Investment Management, and Banking", "description": "Why Wells Fargo<br/><br/>Are you looking for more? Find it here. At Wells Fargo, we believe that a meaningful career is much more than just a job. It's about finding all of the elements that help you thrive, in one place.  means you're supported in life, not just work. It means having a competitive salary, a robust benefits package, and programs to support your work-life balance and well-being. It means being rewarded for investing in your community, celebrated for being your authentic self, and empowered to grow. And we're recognized for it! Wells Fargo ranked in the top three on the 2024 LinkedIn Top Companies List of best workplaces \"to grow your career\" in the U.S.<br/><br/>About This Role<br/><br/>Wells Fargo is seeking a Branch Operations Coordinator for our National Branch Network as part of the Consumer, Small &amp; Business Banking division. Learn more about the career areas and business divisions at wellsfargojobs.com .<br/><br/>In This Role You Will<br/><br/><ul><li>Support customer experience by accurately processing and approving teller transactions, sharing digital solutions, and making appropriate introductions to bankers</li><li>Complete operational activities while minimizing risks under established policies</li><li>Perform routine to moderately complex transactional, operational, and customer support tasks efficiently through knowledge of bank procedures and products, as well as partners across the organization</li><li>Support the Branch manager in operational tasks and scheduling</li><li>Resolve issues related to daily operations of the teller line, under direction of regional banking management</li><li>Support customers and employees in resolving or escalating concerns or complaints</li><li>Receive guidance from managers and exercise judgment within defined policies and procedures</li><li>Provide excellent service to customers and individuals by demonstrating care, building relationships, and completing requested transactions</li><li>Identify information and services to meet customers financial needs</li><li>Motivate a diverse team to achieve full potential and meet established business objectives<br/><br/></li></ul>Required Qualifications:<br/><br/><ul><li>2+ years of customer service and issue resolution experience or equivalent demonstrated through one or a combination of the following: work experience, training, military experience, education<br/><br/></li></ul>Desired Qualifications:<br/><br/><ul><li>Ability to provide strong customer service while listening, eliciting information and comprehending customer issues</li><li>Ability to educate and connect customers to technology and share the value of mobile banking options</li><li>Ability to interact with integrity and professionalism with customers and employees</li><li>Ability to identify potential fraud/risky accounts and take appropriate action to prevent loss</li><li>Cash handling experience</li><li>Well-organized, independent and able to prioritize in a fast-paced environment</li><li>Ability to exercise judgment, raise questions to management, and adhere to policy guidelines</li><li>Relevant military experience including working in personnel benefits management, processing military personnel orders or transitions, wartime readiness operations, human resources, or military recruiting</li><li>Knowledge and understanding of retail compliance controls, risk management, and loss prevention</li><li>Motivate others to achieve full potential and meet established business objectives<br/><br/></li></ul>Job Expectations:<br/><br/><ul><li>Ability to work a schedule that may include most Saturdays</li><li>This position is not eligible for Visa sponsorship<br/><br/></li></ul>Posting Location:<br/><br/><ul><li>23361 Pacific Coast Highway MALIBU, CA 90265<br/><br/></li></ul>Pay Range<br/><br/>Reflected is the base pay range offered for this position. Pay may vary depending on factors including but not limited to achievements, skills, experience, or work location. The range listed is just one component of the compensation package offered to candidates.<br/><br/>$20.00 - $27.69<br/><br/>Benefits<br/><br/>Wells Fargo provides eligible employees with a comprehensive set of benefits, many of which are listed below. Visit Benefits - Wells Fargo Jobs for an overview of the following benefit plans and programs offered to employees.<br/><br/><ul><li>Health benefits</li><li>401(k) Plan</li><li>Paid time off</li><li>Disability benefits</li><li>Life insurance, critical illness insurance, and accident insurance</li><li>Parental leave</li><li>Critical caregiving leave</li><li>Discounts and savings</li><li>Commuter benefits</li><li>Tuition reimbursement</li><li>Scholarships for dependent children</li><li>Adoption reimbursement<br/><br/></li></ul>Posting End Date:<br/><br/>22 Aug 2024<br/><br/><ul><li> Job posting may come down early due to volume of applicants. <br/><br/></li></ul>We Value Diversity<br/><br/>At Wells Fargo, we believe in diversity, equity and inclusion in the workplace; accordingly, we welcome applications for employment from all qualified candidates, regardless of race, color, gender, national origin, religion, age, sexual orientation, gender identity, gender expression, genetic information, individuals with disabilities, pregnancy, marital status, status as a protected veteran or any other status protected by applicable law.<br/><br/>Employees support our focus on building strong customer relationships balanced with a strong risk mitigating and compliance-driven culture which firmly establishes those disciplines as critical to the success of our customers and company. They are accountable for execution of all applicable risk programs (Credit, Market, Financial Crimes, Operational, Regulatory Compliance), which includes effectively following and adhering to applicable Wells Fargo policies and procedures, appropriately fulfilling risk and compliance obligations, timely and effective escalation and remediation of issues, and making sound risk decisions. There is emphasis on proactive monitoring, governance, risk identification and escalation, as well as making sound risk decisions commensurate with the business unit's risk appetite and all risk and compliance program requirements.<br/><br/>Candidates applying to job openings posted in US: All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or any other legally protected characteristic.<br/><br/>Applicants With Disabilities<br/><br/>To request a medical accommodation during the application or interview process, visit Disability Inclusion at Wells Fargo .<br/><br/>Drug and Alcohol Policy<br/><br/>Wells Fargo maintains a drug free workplace. Please see our Drug and Alcohol Policy to learn more.<br/><br/>Wells Fargo Recruitment And Hiring Requirements<br/><br/><ul><li> Third-Party recordings are prohibited unless authorized by Wells Fargo.</li><li> Wells Fargo requires you to directly represent your own experiences during the recruiting and hiring process.<br/><br/></li></ul>Reference Number<br/><br/>R-394140", "responsibilities": "Support customer experience by accurately processing and approving teller transactions, sharing digital solutions, and making appropriate introductions to bankers\nComplete operational activities while minimizing risks under established policies\nPerform routine to moderately complex transactional, operational, and customer support tasks efficiently through knowledge of bank procedures and products, as well as partners across the organization\nSupport the Branch manager in operational tasks and scheduling\nResolve issues related to daily operations of the teller line, under direction of regional banking management\nSupport customers and employees in resolving or escalating concerns or complaints\nReceive guidance from managers and exercise judgment within defined policies and procedures\nProvide excellent service to customers and individuals by demonstrating care, building relationships, and completing requested transactions\nIdentify information and services to meet customers financial needs\nMotivate a diverse team to achieve full potential and meet established business objectives", "qualifications": {"required": "2+ years of customer service and issue resolution experience or equivalent demonstrated through one or a combination of the following: work experience, training, military experience, education", "preferred": "Ability to provide strong customer service while listening, eliciting information and comprehending customer issues\nAbility to educate and connect customers to technology and share the value of mobile banking options\nAbility to interact with integrity and professionalism with customers and employees\nAbility to identify potential fraud/risky accounts and take appropriate action to prevent loss\nCash handling experience\nWell-organized, independent and able to prioritize in a fast-paced environment\nAbility to exercise judgment, raise questions to management, and adhere to policy guidelines\nRelevant military experience including working in personnel benefits management, processing military personnel orders or transitions, wartime readiness operations, human resources, or military recruiting\nKnowledge and understanding of retail compliance controls, risk management, and loss prevention\nMotivate others to achieve full potential and meet established business objectives"}, "skills": [], "postedDate": "1 week ago", "benefits": "Wells Fargo provides eligible employees with a comprehensive set of benefits, many of which are listed below. Visit Benefits - Wells Fargo Jobs for an overview of the following benefit plans and programs offered to employees.\n\n<ul><li>Health benefits</li><li>401(k) Plan</li><li>Paid time off</li><li>Disability benefits</li><li>Life insurance, critical illness insurance, and accident insurance</li><li>Parental leave</li><li>Critical caregiving leave</li><li>Discounts and savings</li><li>Commuter benefits</li><li>Tuition reimbursement</li><li>Scholarships for dependent children</li><li>Adoption reimbursement<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002419597"}