{"jobTitle": "Director of Operations", "company": {"name": "Mendocino Farms", "industry": "Restaurants and Hospitality", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$125,000.00 - $150,000.00", "currency": "USD"}, "jobFunction": "Management, Administrative, and Customer Service", "industry": "Restaurants and Hospitality", "description": "As a DIRECTOR OF RESTAURANT OPERATIONS for Mendocino Farms, you will lead a team of restaurant operators focused on operational excellence. You will lead, manage, and develop our operators in the Los Angeles area. You’ll be an active member of the Operations Leadership Team, help shape operations strategy, and ensure that the company’s strategic initiatives come to light in your market. This role will be based in Los Angeles and require travel throughout the assigned Mendocino Farms locations in Los Angeles.", "responsibilities": "Manage field operations teams to deliver on our mission of Selling Happy. Maintain company culture and team morale. Manage day-to-day operations while also working toward long-term business goals. Monitor and drive flawless execution in our restaurants to ensure all aspects of the business meet established guidelines and standards. Hire, develop and train the team and provide paths for growth within our company. Assist with the development of strategic and tactical plans for the market and ensure the completion of each, holding individuals accountable to assigned tasks. Monitor all aspects of the business using the various methods and reporting tools available (Daily sales reports, score cards, guest insights, labor and food cost tools), and then use the data and personal observations to coach and re-established goals. Develop and execute plans and initiatives that consistently achieve and beat the company's desired sales and profitability targets. Champion the operating culture by delivering a high level of system-wide operations execution that exceed guest expectations. Ensure flawless execution and results of new restaurant openings (pre and post opening). Develop and maintain relationships across the company to ensure productive partnerships with various cross functional business partners and disciplines at Base Camp (Corporate Office). Deliver consistently on the company's goals and KPI’s. Lead by example through effective coaching, motivating and reinforcing the company's operating principles and core values. Demonstrate progress through analysis and forecasting and presentation of conclusions and recommendations to the executive team. Ensure compliance with all local laws and regulations as well as company policy. Maintain a strong industry network and local market knowledge for our brand.", "qualifications": {"required": "7+ years of successful restaurant management/leadership operations experience required. Previous senior leadership experience leading large restaurant teams in a geographically dispersed operations environment.", "preferred": "Demonstrated ability to lead people and get results through others. Ability to organize and manage multiple priorities. Familiar with Microsoft Office and experience with using Excel. Managed high-performance teams and is a strong team player. Skill in assessing and prioritizing multiple tasks, projects, and demands. Strong written and verbal communication skills."}, "skills": ["Leadership", "Operational Excellence", "Team Management", "Strategic Planning", "Data Analysis", "Communication"], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "Health, Dental, Vision, Life Insurance, 401(k) Match and other ancillary benefits, Unlimited Paid Vacation, Paid Sick Leave, Employee assistance program, Bonus Program, Parking & Transit Reimbursement, Discounted tickets through Tickets at Work, Pet Insurance, Gym Memberships, Free and delicious Mendo Meals, Clear path for growth and development.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4002826483"}