{"jobTitle": "Account Manager - OOH Media", "company": {"name": "billups", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Strategy/Planning, Advertising, and Management", "industry": "Advertising Services, Technology, Information and Media, and Marketing Services", "description": "Reinventing out-of-home planning and placement for the performance age. Billups is the leading independent out-of-home (OOH) specialist in North America and is continuing to grow in the EMEA and APAC regions. Delivering OOH managed services globally, helping advertisers and agencies strengthen media performance through our patented analytics and measurement platform. Our mission is to transform the power of places to connect brands with their consumers.\n\nSummary\nThe Client Team (comprising Client Services and Client Development functions) undertakes a wide range of responsibilities in driving Billups’ business forward, developing and nurturing client and partner relationships. \n\nAs part of our Client Services function, the Account Manager role collaborates closely with reports, peers, Senior Account Manager(s), Account Director(s) and Senior Account Director(s) in:\n\n*Media Planning &amp; Buying*\n*Project Management*\n*Relationship-Building*\n*Thought Leadership*\n*Business Development*\n*Department Collaboration*\n*Professionalism &amp; Compliance*\n*Team Leadership Duties*\n*Other duties as assigned by Senior Account Managers, Account Director(s) and leadership.*\n\nEssential Skills\n\n*Excellent organizational skills.\n*Multitasking skills with the ability to balance competing demands.\n*Exceptional attention to detail with the ability to maintain high levels of accuracy in complex tasks.\n*Must showcase strong time management skills.\n*Ability to manage multiple deadlines while maintaining high-quality standards.\n*Experience in taking initiative, and exercising sound judgment in decision-making.\n*Growing experience in developing others.\n\nRequired Interpersonal Skills\n\n*Expressing ideas and thoughts clearly, both orally and in written form.\n*Exceptional attention to detail with proven ability to maintain high levels of accuracy in complex tasks.\n*Strong ability to receive and apply constructive feedback to achieve improved outcomes.\n*Exhibiting good listening, comprehension, and engagement.\n*Good relationship management skills, including the ability to communicate with senior directors and peers—both internally and externally—and establish and maintain excellent rapport.\n*Demonstrating tact and diplomacy in communicating with clients/agencies and media suppliers, as well as with colleagues internally.\n*Bringing creativity and passion to your work, embracing change and innovation.\n*Exhibiting Billups’ values (particularly under pressure) and inspiring others to do the same.\n*Collaborating and contributing to the establishment of a positive team spirit. Being proactive and a team player, with the ability to engage others.\n*Growing experience in resolving issues between others.\n\nQualifications\nAbility to perform essential job duties with or without reasonable accommodation and without posing a direct threat to safety or health of employee or others. To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform essential duties.\n\nRequired Media Experience\n\n*A growing knowledge of the OOH media landscape, including client and supplier news and activity.\n*Experience delivering the highest standards of client service levels. A growth mindset with the confidence to apply this within your work.\n*Experience in negotiating pricing and booking campaigns.\n*Reasoning: the ability to define problems, collect data, establish facts, and draw valid conclusions. \n*The ability to analyze and data in order to identify and present meaningful observations and recommendations.\n*The ability to calculate figures and amounts such as discounts, interest, commissions, percentages, area. Being able to apply concepts of basic algebra and geometry.\n*Some experience using various applications including database, spreadsheet, report writing, project management, graphics, word processing, presentation creation/editing, email communication and CRM software.\n*The desire to grow yourself, your line reports, and Billups’ business.\n\nEducation &amp; Experience\nBachelor's degree (B.A. or B.S.) from four-year college or university; or 3-5 years related experience and/or training; or equivalent combination of education and experience. Experience in media and/or advertising is required. Strong knowledge of OOH Industry and OOH Media Strategies, preferred.\n\nBillups has adopted a compensation strategy that allows us to be competitive in each market for which we hire. Thereby, salary ranges for each position are not only determined based on experience and knowledge base, but also regional labor markets. it is not typical for an individual to be hired at or near the top of the pay range and compensation decisions are dependent on the facts and circumstances of each case.\n\nIn addition, this position may also be eligible to earn performance-based incentive compensation, which may include cash bonus(es) and/or equity. Billups offers a competitive benefits package, including not but limited to medical, dental, vision, paid time off, a 401(k) plan with employee and company contribution opportunities, life, disability, and accident insurance, and a work computer.\n\nBillups is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. We strive to achieve a diverse, equitable, and inclusive workplace.\n\nWe are committed to supporting the onboarding, growth, and engagement of employees who choose to work remotely permanently. For team members who seek to work in-office, where local regulations allow, we can provide an experience that supports in-person social interaction and collaboration in our current hub cities of Chicago, London, Malaysia, and Amsterdam.\n\nRespectfully, please no third-party recruiters.", "responsibilities": "The Client Team (comprising Client Services and Client Development functions) undertakes a wide range of responsibilities in driving Billups’ business forward, developing and nurturing client and partner relationships. \n\nAs part of our Client Services function, the Account Manager role collaborates closely with reports, peers, Senior Account Manager(s), Account Director(s) and Senior Account Director(s) in:\n\n*Media Planning &amp; Buying*\n*Project Management*\n*Relationship-Building*\n*Thought Leadership*\n*Business Development*\n*Department Collaboration*\n*Professionalism &amp; Compliance*\n*Team Leadership Duties*\n*Other duties as assigned by Senior Account Managers, Account Director(s) and leadership.", "qualifications": {"required": "A growing knowledge of the OOH media landscape, including client and supplier news and activity.\nExperience delivering the highest standards of client service levels. A growth mindset with the confidence to apply this within your work.\nExperience in negotiating pricing and booking campaigns.\nReasoning: the ability to define problems, collect data, establish facts, and draw valid conclusions. \nThe ability to analyze and data in order to identify and present meaningful observations and recommendations.\nThe ability to calculate figures and amounts such as discounts, interest, commissions, percentages, area. Being able to apply concepts of basic algebra and geometry.\nSome experience using various applications including database, spreadsheet, report writing, project management, graphics, word processing, presentation creation/editing, email communication and CRM software.\nThe desire to grow yourself, your line reports, and Billups’ business.", "preferred": "Bachelor's degree (B.A. or B.S.) from four-year college or university; or 3-5 years related experience and/or training; or equivalent combination of education and experience. Experience in media and/or advertising is required. Strong knowledge of OOH Industry and OOH Media Strategies, preferred."}, "skills": ["Media Planning", "Project Management", "Relationship Management", "Business Development", "Client Services", "OOH Media", "Media Strategy", "Negotiation", "Data Analysis", "CRM Software"], "postedDate": "2 days ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002186303"}