{"jobTitle": "Administrative Assistant / Project Coordinator", "company": {"name": "Burns Environmental Services", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Environmental Services", "description": "<strong>Job Description<br/><br/></strong>ABOUT THE POSITION<br/><br/>We are seeking to add a detail-oriented and well organized staff member to our growing team. You will play a key role in the day-to-day activities, helping with multiple aspects of our projects. Successful candidates will possess a client-focused, positive attitude and the ability to work well in a high-volume environment and possess strong communication skills.<br/><br/><strong>Duties And Responsibilities<br/><br/></strong><ul><li>Ensuring accurate and compliant project setup using system software. </li><li>Conduct a full range of contract and document support for our Project Managers and other areas of our Company</li><li>Communicate with internal and external stakeholders with regard to many aspects of project management</li><li>Managing administrative documentation</li><li>General office duties (phones, filing, mailing, etc.)<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>2+ years in an administrative role</li><li>Strong verbal and written communication skills</li><li>Familiarity with MS Office as well as other business software</li><li>Excellent time management and multitasking skills</li><li>Client-focused approach to problem solving</li><li>Ability to present and represent the Company to all level of employees as well as external parties</li><li>Confident they can \"do what it takes\" to complete duties</li><li>Experience in the construction industry a plus</li><li>Professional phone skills<br/><br/></li></ul><strong>Company Description<br/><br/></strong>Burns Environmental Services is an environmental and demolition firm that never stands still because something great is always happening. As a leader in our industry, Burns Environmental cares about meeting our customers' specific needs and providing them with economic and efficient solutions. Professionalism, clear communication and integrity are core standards at Burns Environmental Services. Our clients know they can depend on us to consistently exceed expectations, every time.<br/><br/>The most valuable commodity that Burns has is our people. Company culture is an important aspect at Burns. We appreciate the team we have, and our looking to expand into a market that is continually growing.<br/><br/>Our mission is to become the number one leader in the environmental remediation industry by taking a genuine and passionate interest in the growth of our people and our clients. We will continue to expand and increase our influence in California, while constantly developing our leadership roles in the for-profit and non-profit sectors. Through our vision, our competitive drive to be the best, and our unrelenting work ethic, we will make our positive mark on the world by making a positive mark in the lives of every individual or organization we come in contact with.<br/><br/>Burns Environmental Services is an environmental and demolition firm that never stands still because something great is always happening. As a leader in our industry, Burns Environmental cares about meeting our customers' specific needs and providing them with economic and efficient solutions. Professionalism, clear communication and integrity are core standards at Burns Environmental Services. Our clients know they can depend on us to consistently exceed expectations, every time. The most valuable commodity that Burns has is our people. Company culture is an important aspect at Burns. We appreciate the team we have, and our looking to expand into a market that is continually growing. Our mission is to become the number one leader in the environmental remediation industry by taking a genuine and passionate interest in the growth of our people and our clients. We will continue to expand and increase our influence in California, while constantly developing our leadership roles in the for-profit and non-profit sectors. Through our vision, our competitive drive to be the best, and our unrelenting work ethic, we will make our positive mark on the world by making a positive mark in the lives of every individual or organization we come in contact with.", "postedDate": "5 days ago", "skills": ["MS Office", "Communication", "Time Management", "Multitasking", "Problem Solving", "Construction Industry"], "url": "https://www.linkedin.com/jobs/view/4002517474"}