{"jobTitle": "Production Manager", "company": {"name": "Wolf & Shepherd", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development, Production, and Supply Chain", "industry": "Retail Apparel and Fashion", "description": "<strong>Title: </strong>Production Manager\n\n<strong>Reports to:</strong> VP, Sourcing & Production\n\n<strong>Location:</strong> El Segundo, CA\n\n<br/>\n\n<strong>WHO WE ARE</strong> \n\nWolf & Shepherd is designed to equip professionals to win in all aspects of their lives through comfortable fashionable footwear. The concept came from the problem professionals face, going to and from work in athletic shoes just to avoid the common discomfort found in a quality dress shoe. As a fast-growing lifestyle brand, we are on a mission to debunk the myth that classically styled shoes can’t have modern technology comforts.\n\n<br/>\n\n<strong>WHAT WE NEED</strong> \n\nWe’re looking for a driven professional who approaches work with confident vigor, embraces the Wolf & Shepherd brand, and desires to help optimize our operations across the product line. This is a critical position for our company; a lot will be expected. You should be hungry to make changes, grow professionally, and constantly seek new ways to make things better. \n\n<br/>\n\n<strong>JOB TYPE</strong> This is a full-time, on-site, exempt position based at the Wolf & Shepherd offices in El Segundo, CA.\n\n<br/>\n\n<strong>TASKS & RESPONSIBILITIES</strong> \n\nThe Production Manager will be tasked with managing production to ensure our purchase orders are submitted and produced on time. They will work closely with our manufacturing partners, sourcing partners, and cross-functional teams to ensure we are: issuing purchase orders on time and actively managing all facets of production to drive on-time ex-factory dates. They must be an analytical thinker, possess a strong business acumen, be able to communicate effectively to a variety of audiences, rationalize data and provide practical recommendations.\n\n<ul>\n<li>Manage purchase order workflow from: order creation, through vendor acceptance </li>\n<li>Ensure WIP progress and on-time delivery to committed cargo-ready date</li>\n<li>Work on a daily basis with factories to ensure purchase orders are underway, roadblocks are identified and removed, and potential delays are spotted early and minimized</li>\n<li>Develop and maintain transparent relationships with business partners, key vendors and suppliers to ensure healthy and efficient flow of communication between parties</li>\n<li>Complete on-going analysis of buying patterns, business volumes, current vendor base, costing and quality issues</li>\n<li>Able to drive end to end product creation from development through production on accessories and seasonal products</li>\n</ul>\n\n<br/>\n\n<strong>Technical Competencies (Knowledge, Skills & Abilities)</strong>\n\n<ul>\n<li>Creative problem solving with positive, can-do mindset</li>\n<li>Highly organized and structured in approach, build things to scale and automate</li>\n<li>Strong negotiation skills</li>\n<li>Be both reactive and proactive, focused on anticipating needs but able to quickly problem solve when unanticipated issues arise</li>\n<li>Clear written and verbal communication skills</li>\n<li>Able to analyze multiple options and source new partners</li>\n<li>Quick learner with technology and systems</li>\n<li>Strong business acumen</li>\n<li>High energy, high learning agility, ability to move at a fast pace</li>\n</ul>\n\n<br/>\n\n<strong>REQUIREMENTS & QUALIFICATIONS</strong> \n\n<ul>\n<li>5-7 years of experience in sourcing, production or related areas</li>\n<li>Experience managing footwear production preferred</li>\n<li>Working knowledge of development & product creation timelines beneficial</li>\n<li>Able to work across global time zones</li>\n<li>College degree required</li>\n<li>Experience managing both internal and external partners (direct managerial experience a plus)</li>\n<li>DTC or footwear experience a plus</li>\n<li>Mandarin language skills a plus</li>\n<li>Rapid growth company experience a plus</li>\n</ul>\n\n<br/>\n\n<strong>PERKS & BENEFITS </strong>\n\nWe are committed to offering our employees a challenging and rewarding work environment, opportunities for growth and development, benefits, and a competitive compensation package.\n\n<ul>\n<li>Health, vision, and dental benefits program</li>\n<li>401(k) plan</li>\n<li>Flexible time off</li>\n<li>Sick pay</li>\n<li>Frequent free meals and snacks and company-sponsored gatherings</li>\n<li>Wolf & Shepherd shoes and more</li>\n</ul>\n\n<p></p>", "responsibilities": "The Production Manager will be tasked with managing production to ensure our purchase orders are submitted and produced on time. They will work closely with our manufacturing partners, sourcing partners, and cross-functional teams to ensure we are: issuing purchase orders on time and actively managing all facets of production to drive on-time ex-factory dates. They must be an analytical thinker, possess a strong business acumen, be able to communicate effectively to a variety of audiences, rationalize data and provide practical recommendations.\n\n<ul>\n<li>Manage purchase order workflow from: order creation, through vendor acceptance </li>\n<li>Ensure WIP progress and on-time delivery to committed cargo-ready date</li>\n<li>Work on a daily basis with factories to ensure purchase orders are underway, roadblocks are identified and removed, and potential delays are spotted early and minimized</li>\n<li>Develop and maintain transparent relationships with business partners, key vendors and suppliers to ensure healthy and efficient flow of communication between parties</li>\n<li>Complete on-going analysis of buying patterns, business volumes, current vendor base, costing and quality issues</li>\n<li>Able to drive end to end product creation from development through production on accessories and seasonal products</li>\n</ul>", "qualifications": {"required": "5-7 years of experience in sourcing, production or related areas, Experience managing footwear production preferred, Working knowledge of development & product creation timelines beneficial, Able to work across global time zones, College degree required, Experience managing both internal and external partners (direct managerial experience a plus), DTC or footwear experience a plus, Mandarin language skills a plus, Rapid growth company experience a plus", "preferred": ""}, "skills": [], "postedDate": "3 days ago", "benefits": "Health, vision, and dental benefits program, 401(k) plan, Flexible time off, Sick pay, Frequent free meals and snacks and company-sponsored gatherings, Wolf & Shepherd shoes and more", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002186362"}