{"jobTitle": "Micro Influencer Position - Part Time", "company": {"name": "The Black Sheep", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Advertising Services", "description": "Do you love posting on Instagram or setting up photoshoots with friends? Does getting paid for your creative content excite you?<br/><br/>We are looking for exceptional Micro Influencers with a following of 2,500+, who actively post and receive strong engagement on Instagram. The Micro Influencer program is a great opportunity to grow your following and enhance your brand.<br/><br/>You will get the chance to use your Instagram profile to create content for housing companies on your campus and a variety of national brands. If social media, creative freedom, and getting paid to post sounds like something that interests you, then this position is for you!<br/><br/>What You Would Do: Make creative Instagram posts to promote a brand or housing client (depending on the campaign). We’re currently advertising for national brands like Head &amp; Shoulders as well as various national housing properties.<br/><br/><ul><li>2,500+ Instagram followers</li><li>10%+ engagement rate</li><li>Experience with brands or social content creation</li><li>Willing to be a public profile during the campaign</li><li>Willing to turn profile into a Creator Profile</li><li>Legally allowed to work in the U.S.</li><li>You attend one of the following College/Universities: Georgia State U, Iowa State, U of Alabama, U of Florida, U of Georgia, U of Maryland, U of Minnesota, U of South Carolina, Auburn, Boston College, Boston U, Fayetteville State, Florida International U, Northeastern, NYU, Penn State, San Diego State, Texas State, U of Alabama - Birmingham or U of California - Berkeley</li></ul>", "postedDate": "6 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002428947"}