{"jobTitle": "Human Resource Business Partner", "company": {"name": "Schaerer Ltd", "location": "Irvine, CA", "industry": "Food and Beverage Services"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Food and Beverage Services", "description": "Our passion for coffee makes SEB Professional North America a growing company!<br/> <br/>We are in the professional coffee machine business managing three leading global brands: Schaerer, WMF, and Wilbur Curtis.<br/> <br/>You can find our coffee machines in convenience stores, hotels, and restaurants worldwide. Chances are you have enjoyed a cup of coffee brewed by one of our products during your morning coffee run at McDonald’s, Dunkin Donuts, Starbucks, or Tim Hortons.<br/> <br/>SEB Professional is a subsidiary of Groupe SEB, a large French consortium and the world’s largest manufacturer of cookware in more than 150 countries, with 33,0 employees and over €8,1 b in sales annually. Notable brand names associated are Tefal, T-Fal, Krups, Lagostina, Rowenta, Moulinex, SUPOR, Arno, Emsa, All-Clad. Our Company operates in the Professional Coffee Machine division.<br/> <br/>We are looking for a dynamic Human Resource Business Partner to join our team in Irvine, Ca supporting our US corporate office. The HR business partner (HRBP) role is responsible for aligning the business objectives with team members and management in designated business units. The position serves as a consultant to management on human resource-related issues, acting as an employee champion and change agent. Communicating needs proactively with our HR department and business management, the HRBP seeks to develop integrated solutions. The position formulates partnerships across the HR function to deliver value-added service to management and employees that reflects the business objectives of the organization. The HRBP maintains an effective level of business literacy about the business unit’s strategic plans, its culture and its goals.<br/> <br/>Salary Range: $90,000 - $105,000 + Bonus<br/> <br/>Key Responsibilities: <ul><li>Identify training needs for business units and individual executive coaching needs. Participates in evaluation and monitoring of training programs to ensure success and training objectives are met for the organization.</li><li>Manage and resolve complex employee relations issues with support from supporting teams by conducting effective, thorough, timely and objective investigations.</li><li>Provide day-to-day performance management guidance to management (e.g., coaching, counseling, career development, disciplinary actions).</li><li>Work closely with management and team members to improve work relationships, build morale, and increase productivity and retention.</li><li>Ad Hoc projects and assignments per business needs.</li></ul><br/>What you need to be successful in the role: <ul><li>Bachelor’s degree in &amp; required &amp; 5-7 years related experience.</li><li>Strong interpersonal, organization, and conflict resolution skills.</li><li>Strong analytical and problem-solving skills.</li><li>Knowledge of local, state and federal employment laws and procedures.</li><li>Strong demonstrated knowledge of employee relations procedures and applicable law.</li></ul><br/>Overview:<ul><li>Type of employment: Full time – Exempt.</li><li>Workplace type: Hybrid, Irvine, CA - Irvine, CA - In office: Monday, Wednesday &amp; Thursday. Work From Home: Tuesday &amp; Friday. </li></ul><br/>Why SEB Professional North America? <br/>Whether working remotely, in one of our offices, or flexing between the two, we offer a number of benefits and perks to support you and your family. Please ask your recruiter for additional details regarding our benefits.<ul><li>Health insurance – generous employer contribution</li><li>Competitive 401(K) program w/ up to 9% Employer Contribution</li><li>On-site Gym</li><li>Vision &amp; Dental Insurance</li><li>Life insurance</li><li>12 Paid Holidays</li><li>Other voluntary benefits and discounts programs</li></ul><br/>Equal Employment Opportunity (EEO)<br/>SEB Professional is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability. For more information, please see OFCCP Equal Employment.", "responsibilities": "The HR business partner (HRBP) role is responsible for aligning the business objectives with team members and management in designated business units. The position serves as a consultant to management on human resource-related issues, acting as an employee champion and change agent. Communicating needs proactively with our HR department and business management, the HRBP seeks to develop integrated solutions. The position formulates partnerships across the HR function to deliver value-added service to management and employees that reflects the business objectives of the organization. The HRBP maintains an effective level of business literacy about the business unit’s strategic plans, its culture and its goals.", "qualifications": {"required": "Bachelor’s degree in &amp; required &amp; 5-7 years related experience.", "preferred": "Strong interpersonal, organization, and conflict resolution skills. Strong analytical and problem-solving skills. Knowledge of local, state and federal employment laws and procedures. Strong demonstrated knowledge of employee relations procedures and applicable law."}, "skills": ["Employee Relations", "Training", "Performance Management", "Conflict Resolution", "HR"], "postedDate": "1 week ago", "benefits": "Health insurance – generous employer contribution, Competitive 401(K) program w/ up to 9% Employer Contribution, On-site Gym, Vision &amp; Dental Insurance, Life insurance, 12 Paid Holidays, Other voluntary benefits and discounts programs", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002917541"}