{"jobTitle": "Financial Analyst", "company": {"name": "LegalZoom", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Finance and Sales", "industry": "Legal Services", "description": "LegalZoom has been providing accessible and affordable online legal services for over 20 years. Since 2001, we’ve helped millions of customers launch, run, and grow their businesses, secure their intellectual property, and protect their loved ones with estate planning documents.<br/><br/>As the industry leader in business formations, innovation remains at the center of all we do. LegalZoom employees are creative thinkers and problem-solvers who thrive on collaboration and embrace diversity, equity, and inclusion. Together, we’re working to make a positive impact on the world.<br/><br/>Remote-first<br/><br/>In an effort to foster a better work-life balance, LegalZoom is committed to a remote-first work environment. Our Austin, Beaverton, Frisco, LA Metro, and SF Bay Area offices allow our Zoomers to collaborate with teammates and offer special onsite events, lunches, and more.<br/><br/>This position is 100% remote and is not required to come into the office.<br/><br/><strong>Overview<br/><br/></strong>LegalZoom is seeking a Finance Analyst to join our Finance team (Business Finance / FP&amp;A). The highly visible position will be responsible for supporting department leaders, working on strategic projects, building financial models, identifying key business insights, and concisely reporting results to senior management. The optimal candidate will possess excellent interpersonal, project management, and critical thinking abilities to collaborate with teams across our organization and foster data-driven decision-making.<br/><br/>You will<br/><br/><ul><li>Measure the financial performance of LegalZoom’s $150M+ marketing acquisition budget and 200+ person sales team and work closely with sales and marketing leaders to optimize performance</li><li>Develop insightful presentations and supporting materials that summarize data and help facilitate decision-making for our business partners and senior leadership team</li><li>Recommend and implement policies and programs that guide the organization in maintaining and improving its competitive position</li><li>Establish strong partnerships across departments and be the finance subject matter expert on cross-functional working teams focused on new and existing business opportunities</li><li>Provide thought leadership, helping foster new business initiatives, simplify existing processes, drive standardization, and build scalable solutions</li><li>Work in tandem within the Corporate Finance organization to deliver information for planning, actuals, and analyzes to drive business performance and identify opportunities and risks</li><li>Support the ongoing evolution of the budgeting and planning process, assisting with cross-functional projects to improve the integration of key decisions makers with FP&amp;A</li><li>Perform other duties as assigned.<br/><br/></li></ul>You have<br/><br/><ul><li>Bachelor's degree in Finance, Economics, Mathematics, or related field with at least 1-3 years of experience in Consulting, Investment Banking, Corporate Finance, or similar fields</li><li>Advanced Excel and PowerPoint skills required, other data visualization software skills are a plus</li><li>Excellent analytical and organizational skills; demonstrate exceptional attention to detail, accuracy, and follow-through</li><li>Strong worth ethic with ability to manage tight deadlines, prioritize workload and achieve effective results in a fast-paced, dynamic, ever-growing, and sometimes ambiguous environment</li><li>Clear communicator and presenter, comfortable leading cross-functional working teams and prior people management skills are a plus</li><li>Prior understanding of SaaS business model key performance indicators is a plus</li><li>Remote Employees should confirm that the internet service available has adequate bandwidth to support all work processes.<br/><br/></li></ul>LegalZoom is a remote-first company and the national range for this role is ($64,100 - $83,150). Actual compensation offered will depend on several factors including but not limited to: geographic location, work experience, education, skill level, and/or other business and organizational needs. In addition, an annual bonus, incentive bonus and/or restricted stock units may be provided as part of the compensation package. You will also receive a full range of medical, financial, and other benefits as seen below.<br/><br/><ul><li>Medical, Dental, Vision Insurance</li><li>401k, With Matching Contributions</li><li>Paid Time Off</li><li>Health Savings Account (HSA)</li><li>Flexible Spending Account (FSA)</li><li>Short-Term/Long-Term Disability Insurance</li><li>Plus other wellness benefits to include:<br/><br/></li></ul>○ Fertility<br/><br/>○ Mental Health<br/><br/>○ One Medical<br/><br/>○ Fringe lifestyle benefits up to $250<br/><br/>Join us in making a difference as we build our future and help ensure access to professional legal advice to all! LegalZoom is an equal opportunity employer, dedicated to diversity, equality, and inclusion, and provides equal employment opportunities to all employees and applicants for employment. LegalZoom prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.", "responsibilities": "You will<br/><br/><ul><li>Measure the financial performance of LegalZoom’s $150M+ marketing acquisition budget and 200+ person sales team and work closely with sales and marketing leaders to optimize performance</li><li>Develop insightful presentations and supporting materials that summarize data and help facilitate decision-making for our business partners and senior leadership team</li><li>Recommend and implement policies and programs that guide the organization in maintaining and improving its competitive position</li><li>Establish strong partnerships across departments and be the finance subject matter expert on cross-functional working teams focused on new and existing business opportunities</li><li>Provide thought leadership, helping foster new business initiatives, simplify existing processes, drive standardization, and build scalable solutions</li><li>Work in tandem within the Corporate Finance organization to deliver information for planning, actuals, and analyzes to drive business performance and identify opportunities and risks</li><li>Support the ongoing evolution of the budgeting and planning process, assisting with cross-functional projects to improve the integration of key decisions makers with FP&amp;A</li><li>Perform other duties as assigned.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree in Finance, Economics, Mathematics, or related field with at least 1-3 years of experience in Consulting, Investment Banking, Corporate Finance, or similar fields\nAdvanced Excel and PowerPoint skills required, other data visualization software skills are a plus\nExcellent analytical and organizational skills; demonstrate exceptional attention to detail, accuracy, and follow-through\nStrong worth ethic with ability to manage tight deadlines, prioritize workload and achieve effective results in a fast-paced, dynamic, ever-growing, and sometimes ambiguous environment\nClear communicator and presenter, comfortable leading cross-functional working teams and prior people management skills are a plus\nPrior understanding of SaaS business model key performance indicators is a plus\nRemote Employees should confirm that the internet service available has adequate bandwidth to support all work processes.<br/><br/>", "preferred": ""}, "skills": ["Excel", "PowerPoint", "SaaS", "Finance", "Economics", "Mathematics", "Consulting", "Investment Banking", "Corporate Finance"], "postedDate": "1 week ago", "benefits": "Medical, Dental, Vision Insurance\n401k, With Matching Contributions\nPaid Time Off\nHealth Savings Account (HSA)\nFlexible Spending Account (FSA)\nShort-Term/Long-Term Disability Insurance\nPlus other wellness benefits to include:\n○ Fertility\n○ Mental Health\n○ One Medical\n○ Fringe lifestyle benefits up to $250", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002217000"}