{"jobTitle": "Research Operations Senior Associate (Protein Purification)", "company": {"name": "Infotree Global Solutions", "location": "Thousand Oaks, CA"}, "location": "Thousand Oaks, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Associate", "jobFunction": "Science", "industry": "Staffing and Recruiting and Biotechnology Research", "description": "<strong>Description:</strong><p><br/></p><p><strong>100% ONSITE USTO</strong></p><p><strong>M-F standard hours.</strong></p><p><br/></p><p>Entry level role. Prefer master’s degree. Recombinant protein expression and purification from E. coli. Understanding of liquid column chromatography, experience with AKTA system. Analysis of proteins; SDS-PAGE, Western blots, etc. Manager would like to see references.</p><p><br/></p><p>This successful candidate will support discovery research. The technical tasks include performing recombinant protein purification from E. coli, insect cells and mammalian cells, using various modes of liquid column chromatography, including affinity, ion exchange, size exclusion. Additional tasks will include an analysis of purified recombinant proteins, using various bioanalytical and biophysical tools. Experience Requirements:</p><p><br/></p><p>The candidate should have B.S degree in life sciences such as biology, biochemistry, pharmacology or similar and in the biopharmaceutical industry and/or an academic laboratory.</p><p>A successful candidate will possess good written and oral communication skills, the ability to work well in teams, demonstrated technical aptitude and a strong work ethic. Good organizational skills and excellent attention to detail are vital to this position.</p><p><br/></p><p><strong>Basic Qualifications </strong></p><p>Master degree OR Bachelor degree and 2 years of experience OR Associate degree and 6 years of experience OR High school diploma / GED and 8 years of experience</p><p><br/></p><p><strong>Top 3 Must Have Skill Sets: </strong></p><p>1. Recombinant protein expression and purification from E. coli.</p><p>2 Understanding of liquid column chromatography, experience with AKTA system.</p><p>3. Analysis of proteins; SDS-PAGE, Western blots, etc.</p><p><br/></p><p><strong>Day to Day Responsibilities: </strong></p><p>1. Recombinant protein expression and purification from E. coli and mammalian cells.</p><p>2. Operation of AKTA.</p><p>3. Recombinant protein characterization with SDS-PAGE, Western blot, analytical liquid chromatography.</p><p>4. Documentation of experimental procedure and data in ELN.</p>", "postedDate": "4 days ago", "skills": ["Recombinant protein expression and purification from E. coli", "Understanding of liquid column chromatography", "experience with AKTA system", "Analysis of proteins", "SDS-PAGE", "Western blots"], "url": "https://www.linkedin.com/jobs/view/4002123534"}