{"jobTitle": "Content Creator", "company": {"name": "OpenStore", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Software Development", "description": "Our mission is to inspire entrepreneurs and shoppers to find something new. We buy great brands built on Shopify, unlocking liquidity for small business entrepreneurs looking to start new adventures. We manage nearly 50 brands with over 100,000 products across apparel, beauty, home goods, and electronics.<br/><br/>Our team of e-commerce experts and engineers uses our proprietary technology and tooling, and advantages from our size, to grow our brands at scale.<br/><br/>Two million people have purchased OpenStore products, and soon, we’ll launch a consumer shopping app, helping people discover products in an all-new way. OpenStore was started in 2021 by top investor and operator, Keith Rabois, a former executive at PayPal, LinkedIn, and Square, and a co-founder of Opendoor. We are backed with $150M+ from world-class investors such as Atomic, Khosla Ventures, Founders Fund, General Catalyst, and Lux Capital.<br/><br/><strong>ABOUT THE OPPORTUNITY: <br/><br/></strong>Joining OpenStore means being at the forefront of e-commerce innovation. The Content Creator will be responsible for generating high-quality and engaging trend-centric visual content for our brands' social media advertising and organic content. This role involves directing, shooting, and appearing as on-screen talent. The ideal candidate has a strong eye for thumb-stopping, engaging content, and is skilled in creating content for social media. They understand production and post-production workflows, are proficient with various camera types (including iPhones), and have a knack for creating persuasive direct-response ads.<br/><br/><strong>WHAT YOU'LL DO:<br/><br/></strong><strong> Content Creation<br/><br/></strong><ul><li>Generate strategically aligned visual assets by directing, shooting, and appearing as on-screen talent as needed. </li><li>Stay up-to-date with social media trends and integrate findings into content creation ideas. </li><li>Compiling trends and pitching ideas for concepts to shoot. </li><li>Execute shoot requests that align with the account plan generated by the Creative Strategy Team. </li><li>Set up necessary lighting and set decoration for shoots. </li><li>Ensure all content is compliant with brand guidelines. <br/><br/></li></ul><strong> Production Management<br/><br/></strong><ul><li>Receive and expand upon production requests/creative briefs from Creative Strategy. Develop detailed shot lists and production plans in partnership with the Content Production team. </li><li>Identify and request resources needed to execute projects at the requested quality. </li><li>Review Brand &amp; Legal information for brands in received briefs. </li><li>Attend pre-production calls and post-mortem meetings as required. </li><li>Deliver raw video assets by the deadline, adhering to quality and technical standards. </li><li>Enforce on-set safety protocols and professional conduct standards. <br/><br/></li></ul><strong> Performance Analysis<br/><br/></strong><ul><li>Develop an understanding of performance metrics and factors influencing footage performance. </li><li>Research competitor and social media ecosystem trends and apply learnings to content creation. </li><li>Conduct basic research and learn from job results to continuously improve content quality. <br/><br/></li></ul><strong>WHAT YOU HAVE:<br/><br/></strong><ul><li>A reel and/or portfolio showcasing expertise in content creation/direction (must include TikTok content)</li><li>Awareness of what performs well on social media (Particularly on TikTok) and performance creative best practices. </li><li>Knowledge of In-app TikTok editing, sound effects, transitions and content creation features. </li><li>Ability to interpret and apply performance/conversion-based feedback on footage. </li><li>Strong understanding of the production workflow from a creative and technical perspective. </li><li>Excellent communication skills, both written and verbal. </li><li>On-camera modeling and acting experience. </li><li>Strong organizational, problem-solving, and time-management skills. </li><li>Flexible and able to adapt to a fast-paced environment. </li><li>Proficient in shooting with iPhones, DSLRs, and professional-grade video cameras. </li><li>Advanced understanding of lighting techniques and equipment setup. </li><li>Creative vision and ability to translate briefs into actionable production plans. </li><li>Commitment to on-set safety and professional conduct. </li><li>Prior experience in performance marketing is a plus. <br/><br/></li></ul>OpenStore is a proud Equal Opportunity Employer where we welcome and celebrate differences. We are committed to providing a workspace that is safe and inclusive, where everyone feels supported, connected, and inspired to do their best work. If you require any accommodations to participate in our recruitment process, please inform us of your needs when we contact you to schedule an interview.", "postedDate": "1 week ago", "skills": ["TikTok", "Social Media", "Content Creation", "Video Production", "Video Editing", "Performance Marketing", "Creative Strategy", "Production Management", "Performance Analysis", "Lighting Techniques", "Camera Operation", "iPhone", "DSLR", "Professional Video Cameras", "Communication", "On-Camera Experience", "Organizational Skills", "Problem Solving", "Time Management", "Adaptability", "Brand Guidelines", "Safety Protocols", "Professional Conduct"], "url": "https://www.linkedin.com/jobs/view/4002209557"}