{"jobTitle": "Operations Associate", "company": {"name": "JobsInLogistics.com", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "<strong>Job Description<br/><br/></strong>About Us<br/><br/>As a company, we promote a culture of honesty and integrity, and value the trust it allows us to build with customers and employees alike.Our focus on our people is what sets us apart and keeps our customers coming back to work with us!<br/><br/>If you are seeking to be a part of a family, this is the place for you!<br/><br/>Performance Team handles end-to-end warehousing and distribution logistics needs utilizing our strategic network of storage facilities. Our facilities are capable of receiving, storing, processing and dispatching cargo, so we can build flexibility and resilience into the supply chain process.Our integrated solutions allow us to be prepared for supply chain risks, so we can plan distribution to better achieve lead time and goals despite unexpected conditions. Our extensive experience, connections, and deep expertise across different sectors, industries, and transportation modes, means we can be counted on for process excellence that will save time and money.<br/><br/><br/><strong>Job Summary<br/><br/></strong>The operations coordinator is responsible for assisting the manager with daily planning and monitoring the overall operations of delivery and return orders. Work closely with warehouse staff and provide direction for pulling returns from warehouse locations.<br/><br/><br/><strong>Essential Functions<br/><br/><br/></strong><strong>Skills/Competencies<br/><br/><br/></strong><strong>Education<br/><br/><br/></strong><strong>Company Benefits<br/><br/></strong>Medical<br/><br/>Dental<br/><br/>Vision<br/><br/>401k &amp;plus; Company Match<br/><br/>Employee Assistance Program<br/><br/>Paid Time Off<br/><br/>Flexible Work Schedules (when possible)<br/><br/>And more!<br/><br/><br/><strong>Pay Range<br/><br/></strong>$20 to $23 per hour<br/><br/>Monday through Friday<br/><br/>2:00pm to 10:30pm<br/><br/>You must be authorized to work for any employer in the U.S.<br/><br/>Performance Team is committed to a diverse and inclusive workplace, and we embrace different styles of thinking. Performance Team is an equal opportunities employer and welcomes applicants without regard to race, color, gender, sex, age, religion, creed, national origin, ancestry, citizenship, marital status, sexual orientation, physical or mental disability, medical condition, pregnancy or parental leave,veteran status, gender identity, genetic information, or any other characteristic protected by applicable law. We will consider qualified applicants with criminal histories in a manner consistent with all legal requirements.<br/><br/>We are happy to support your need for any adjustments during the application and hiring process. If you need special assistance or an accommodation to use our website, apply for a position, or to perform a job, please contact us by emailing hr.sup port@performanceteam.net .<br/><br/>#PFS<br/><br/>Maersk is committed to a diverse and inclusive workplace, and we embrace different styles of thinking. Maersk is an equal opportunities employer and welcomes applicants without regard to race, colour, gender, sex, age, religion, creed, national origin, ancestry, citizenship, marital status, sexual orientation, physical or mental disability, medical condition, pregnancy or parental leave, veteran status, gender identity, genetic information, or any other characteristic protected by applicable law. We will consider qualified applicants with criminal histories in a manner consistent with all legal requirements.<br/><br/>We are happy to support your need for any adjustments during the application and hiring process. If you need special assistance or an accommodation to use our website, apply for a position, or to perform a job, please contact us by emailing accommodationrequests@maersk.com .<br/><br/><ul><li>Coordinate and process all return shipments on a daily basis</li><ul><li>Review and work daily return report and POD on dock report</li><ul><li>Organize return area as such that every shipment can be identified</li><ul><li>Prioritize shipments for loading in order to maximize trailer capacity</li><ul><li>Coordinate trailer drops and recoveries with Pilot Hub Operations</li><ul><li>Liaise with relevant corporate personnel at all levels</li><ul><li>Help with customer service issues as they arise</li><ul><li>Other duties as requested</li><li>Detail Oriented</li><ul><li>Excellent computer and communication skills</li><ul><li>Able to multitask in a high-paced environment</li><ul><li>Strong verbal and technical written communication</li><ul><li>Highly organized and detail-oriented</li><ul><li>Proficient in Microsoft Office Suite</li><ul><li>Able to type 35&amp;plus; wpm minimum</li><ul><li>Comfortable multitasking and prioritizing tasks without guidance</li><ul><li>Excellent time management</li><ul><li>Ability to work under pressure</li><ul><li>Technology Adaptability</li><ul><li>Interpersonal Skills</li><ul><li>Friendly and approachable personality</li><li>High School Diploma or equivalent required</li></ul></ul></ul></ul></ul></ul></ul></ul></ul></ul></ul></ul></ul><li>The above stated pay range is the anticipated starting salary range for the position. The Company may adjust this range in light of prevailing market conditions and other factors such as location. The Company will work directly with the selected candidate(s) on the final starting salary in accordance with all applicable laws.<br/></li></ul></ul></ul></ul></ul></ul></ul>Maersk is committed to a diverse and inclusive workplace, and we embrace different styles of thinking. Maersk is an equal opportunities employer and welcomes applicants without regard to race, colour, gender, sex, age, religion, creed, national origin, ancestry, citizenship, marital status, sexual orientation, physical or mental disability, medical condition, pregnancy or parental leave, veteran status, gender identity, genetic information, or any other characteristic protected by applicable law. We will consider qualified applicants with criminal histories in a manner consistent with all legal requirements.<br/><br/>We are happy to support your need for any adjustments during the application and hiring process. If you need special assistance or an accommodation to use our website, apply for a position, or to perform a job, please contact us by emailing accommodationrequests@maersk.com .", "responsibilities": "Coordinate and process all return shipments on a daily basisReview and work daily return report and POD on dock reportOrganize return area as such that every shipment can be identifiedPrioritize shipments for loading in order to maximize trailer capacityCoordinate trailer drops and recoveries with Pilot Hub OperationsLiaise with relevant corporate personnel at all levelsHelp with customer service issues as they ariseOther duties as requestedDetail OrientedExcellent computer and communication skillsAble to multitask in a high-paced environmentStrong verbal and technical written communicationHighly organized and detail-orientedProficient in Microsoft Office SuiteAble to type 35+ wpm minimumComfortable multitasking and prioritizing tasks without guidanceExcellent time managementAbility to work under pressureTechnology AdaptabilityInterpersonal SkillsFriendly and approachable personality", "qualifications": {"required": "High School Diploma or equivalent required"}, "skills": ["Customer Service", "Communication", "Microsoft Office", "Time Management", "Detail Oriented", "Multitasking", "Organization", "Problem Solving", "Technology"], "postedDate": "6 days ago", "salary": {"amount": "20.00 to 23.00", "currency": "USD"}, "benefits": "MedicalDentalVision401k &amp;plus; Company MatchEmployee Assistance ProgramPaid Time OffFlexible Work Schedules (when possible)And more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002405223"}