{"jobTitle": "Design and Development Manager", "company": {"name": "360 Destination Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$68,000.00/yr - $78,000.00/yr", "currency": "USD"}, "jobFunction": "Art/Creative and Design", "industry": "Events Services", "description": "360 Destination Group is an award-winning national destination and event management company with offices throughout California, Las Vegas, Florida, Texas, Arizona, Nashville, Chicago and New York. 360DG packs decades of know-how into amplifying the very best that each destination has to offer. As a company that values innovation, creativity, and excellence, we pride ourselves on utilizing a unique and customized approach to deliver unforgettable events that leave our clients speechless.\n<br/>\nWe now find ourselves seeking a hospitality-oriented individual with a passion for design and events to be the next Design and Development Manager for our Los Angeles office! As a member of our team, you’ll bring to life a variety of corporate events ranging from carnival-themed seminars to Latin nightclub receptions all while collaborating with professionals who are equally as passionate about creating memorable experiences as you!\n<br/>\n<u>This is what WE offer YOU...</u>\n<ul><li>A competitive salary based on experience.</li><li>Quarterly incentive eligibility, which is based on the company’s performance.</li><li>Health insurance coverage including medical, vision, and dental.</li><li>Discretionary PTO off AND paid holidays.</li><li>A retirement savings plan (401k).</li><li>Short term disability insurance coverage.</li><li>Life insurance coverage.</li><li>Paid DCMP and/or CMP certification.</li></ul>\n<br/>\n<u>As the DESIGN AND DEVELOPMENT MANAGER, you will...</u>\n<ul><li>Work closely with Account Executives to generate creative content for proposals and client facing sales/marketing content, i.e. area guides and partner perspectives.</li><li>Creative development and pricing of proposals and services for client program.</li><li>Ongoing client interaction and support, if needed.</li><li>Ensure proposal timelines and deadlines are met.</li><li>Assist on-site, as needed, to provide client support.</li><li>Assist and support with client site inspections.</li><li>Continue to act as a liaison with operations during final program development and fulfillment.</li><li>Booking and releasing of tentative holds for venues, vendors, and activities for proposals being generated.</li><li>Research/communicate with suppliers; provide an accurate assessment and maintain good vendor relationships.</li><li>Continuously and proactively define the program details with the client and or Account Executive to produce a complete contract of services.</li><li>Ensure files are completed prior to turnover to Operations.</li><li>Follow all accounting and procedural guidelines with respect to deposits, vendor payments and American Express expense reports.</li><li>Construct attachments of contracts and deposit invoices, as necessary.</li><li>Maintain a general knowledge of venues, restaurants, and tours and activities in respective city.</li></ul>\n<br/>\n<u>You'll stand out from the crowd if you...</u>\n<ul><li>Work as a productive team member, take initiative, act creatively, operate flexibly, and do everything with honesty, integrity, and with a focus on client satisfaction.</li><li>Work well in a fast-paced team environment, work overtime when required, and deliver quality service to our clients.</li><li>Act in a self-starting way, make good independent decisions, and take steps to complete work within time parameters.</li><li>Generate new and innovative ways to improve our company's products and services.</li><li>Recognize essential elements of a challenge and develop creative solutions.</li><li>Are detail-oriented with vendor contracts, invoices, and agreement clauses.</li><li>Respond quickly to changing circumstances and anticipate new developments where possible.</li><li>Act in a forthright way.</li><li>Give and accept feedback constructively.</li><li>Recognize and consider the client’s expectations and needs and have a “do what it takes” mentality.</li></ul>\n<br/>\n<u>We are seeking someone with...</u>\n<ul><li>Proficiency in client relations, proposal writing, detailed budget management, event design, contract management, and vendor relations.</li><li>Five or more years total work experience with a minimum of two years of hospitality experience.</li><li>Advanced skills in Microsoft Word, Excel, and PowerPoint.</li><li>Excellent verbal and written communications skills.</li><li>Knowledge of the local destination offerings such as restaurants, clubs, festivals, tours, and venues.</li><li>Experience using computers, phones, copiers, smart phones, tablets, and other standard office equipment.</li></ul>\n<br/>\n<u>Job Conditions:</u>\nThe specific vision abilities required by this job include close vision, distance vision, color vision, depth perception, and ability to adjust focus. The noise level in the work environment is usually low. The physical demands described below are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the associate is:\n<ul><li>Frequently required to perform administrative and professional work using writing tools and electronic media.</li><li>Required to be ambulatory to move around freely between buildings and between levels within buildings.</li><li>Occasionally lift and/or move up to 30 pounds.</li><li>Occasionally exposed to fumes or airborne particles and toxic or caustic chemicals associated with office work.</li></ul>\n<br/>\n<u>Disclaimer:</u>\nThis job has recurring work situations involving moderate degrees of discretion. The need for accuracy and effective utilization of accepted policies and procedures is high. Errors in judgment and execution will waste time and resources, adversely impacting unit performance. Employees operate independently but work is verified by supervision. The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All personnel may be required to perform duties outside of their normal responsibilities from time to time, as needed.\n<br/>\n<u>Acknowledgements:</u>\n360 Destination Group is an Equal Opportunity-Affirmative Action Employer / Disability / Veteran.", "responsibilities": "Work closely with Account Executives to generate creative content for proposals and client facing sales/marketing content, i.e. area guides and partner perspectives.\nCreative development and pricing of proposals and services for client program.\nOngoing client interaction and support, if needed.\nEnsure proposal timelines and deadlines are met.\nAssist on-site, as needed, to provide client support.\nAssist and support with client site inspections.\nContinue to act as a liaison with operations during final program development and fulfillment.\nBooking and releasing of tentative holds for venues, vendors, and activities for proposals being generated.\nResearch/communicate with suppliers; provide an accurate assessment and maintain good vendor relationships.\nContinuously and proactively define the program details with the client and or Account Executive to produce a complete contract of services.\nEnsure files are completed prior to turnover to Operations.\nFollow all accounting and procedural guidelines with respect to deposits, vendor payments and American Express expense reports.\nConstruct attachments of contracts and deposit invoices, as necessary.\nMaintain a general knowledge of venues, restaurants, and tours and activities in respective city.", "qualifications": {"required": "Work as a productive team member, take initiative, act creatively, operate flexibly, and do everything with honesty, integrity, and with a focus on client satisfaction.\nWork well in a fast-paced team environment, work overtime when required, and deliver quality service to our clients.\nAct in a self-starting way, make good independent decisions, and take steps to complete work within time parameters.\nGenerate new and innovative ways to improve our company's products and services.\nRecognize essential elements of a challenge and develop creative solutions.\nAre detail-oriented with vendor contracts, invoices, and agreement clauses.\nRespond quickly to changing circumstances and anticipate new developments where possible.\nAct in a forthright way.\nGive and accept feedback constructively.\nRecognize and consider the client’s expectations and needs and have a “do what it takes” mentality.", "preferred": "Proficiency in client relations, proposal writing, detailed budget management, event design, contract management, and vendor relations.\nFive or more years total work experience with a minimum of two years of hospitality experience.\nAdvanced skills in Microsoft Word, Excel, and PowerPoint.\nExcellent verbal and written communications skills.\nKnowledge of the local destination offerings such as restaurants, clubs, festivals, tours, and venues.\nExperience using computers, phones, copiers, smart phones, tablets, and other standard office equipment."}, "skills": ["Client Relations", "Proposal Writing", "Budget Management", "Event Design", "Contract Management", "Vendor Relations", "Microsoft Word", "Excel", "PowerPoint", "Communication"], "postedDate": "4 days ago", "benefits": "A competitive salary based on experience.\nQuarterly incentive eligibility, which is based on the company’s performance.\nHealth insurance coverage including medical, vision, and dental.\nDiscretionary PTO off AND paid holidays.\nA retirement savings plan (401k).\nShort term disability insurance coverage.\nLife insurance coverage.\nPaid DCMP and/or CMP certification.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002109311"}