{"jobTitle": "Merchandising Rep", "company": {"name": "Retail Merchandising Services, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-Time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "Do you love retail but want the freedom to set your own schedule? Then keep reading! Retail Merchandising Services, Inc. (RMS), a national merchandising company servicing various retailers, has an immediate opening for a Part-Time Merchandising Representative in your area!<br/><br/><strong>Description<br/><br/></strong>As an employee of RMS, you would be assigned to work in retail stores on a weekly, bi-weekly and/or one-time basis. You would be responsible for servicing retail stores within a 15-mile radius of your home address and can expect part-time, varying hours from week to week. On average, you can expect to be scheduled 7-12 hours each week. Workload may vary drastically based on the time of the year.<br/><br/><strong>Compensation<br/><br/></strong><ul><li> Employees are paid an hourly rate of $15.84 to $17.49 per hour.</li><li> Employees who temporarily work or train in a store that is not their own may receive mileage in the amount of $0.45 per mile and/or drive time that is paid at $15.84 per hour or the applicable minimum wage for the employee's location, whichever is highest.<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li> Pay increases based on tenure</li><li> 401k with company match, preventative medical insurance, dental, vision and voluntary life benefits available to eligible employees</li><li> Perks at Work; Savings on travel, general merchandise, groceries, wellness and more through an employee discount and reward program</li><li> DailyPay; access your pay when you need it!</li><li> Flexible scheduling, set your own weekly schedule</li><li> Paid on the job and online training</li><li> Convenient mobile reporting</li><li> Reimbursement for smart device usage</li><li> Employee referral bonus program<br/><br/></li></ul>Employment Type: Part-Time", "postedDate": "3 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002162455"}