{"jobTitle": "Director of Customer Care", "company": {"name": "SuperCare Health (USA)", "location": "City of Industry, CA", "industry": "Hospitals and Health Care"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "jobFunction": "Other", "description": "“Improving the lives of those with chronic care diseases while providing solutions to our customers.\n<br/><br/>\n<em>Looking for a new opportunity? At SuperCare Health you have the chance to reach your dreams by helping us in serving the healthcare needs of our ever-growing patient population. Matching passion with careers, here hard work has never been so satisfying.\n<br/><br/></em>\n<strong>Essential Duties\n<br/><br/></strong>\nThe Customer Care Director is a key strategic and operational leadership role responsible for the development, continuous improvement and delivery of customer service. The Customer Care Director is responsible for identifying and developing all culture, process and performance improvements and efficiencies for the customer and for leading/developing a team, who typically deliver customer interactions across multiple channels. The primary responsibility of the role is to create the best “Customer Experience”.\n<br/><br/>\n<strong>General Responsibilities And Duties\n<br/><br/></strong>\n<ul>\n<li>Oversee all aspects of Customer Support operations, including but not limited to, contact management, complaint handling, training and service quality, customer implementation and support for all SCH products and services.</li>\n<li>Overseeing Customer Service phone call handle and phone operations.</li>\n<li>Overseeing Payer and Managed Care relationships externally, including JOCs, Clinic and Contract visits and meetings.</li>\n<li>Develop and implement strong training, monitoring, and continuous improvement at all levels in the department to insure the best “Customer Experience”</li>\n<li>Act as a change agent in the organization by influencing leadership as to the importance of the service organization and acceptance of the customer experience service strategy.</li>\n<li>Measure customer satisfaction on an ongoing basis and work as part of the team to foster continuous improvement of service and the customer experience within onshore and offshore staff.</li>\n<li>Develop and implement methods to record, assess, and analyze customer feedback.</li>\n<li>Establish performance metrics for customer service representatives that creates alignment with the other department including Sales and Operations.</li>\n<li>Develop and implement training and quality assurance programs for new hires and experienced employees.</li>\n<li>Identify and recommend or acquire updates and expansions to technology, equipment, and policies that may improve customer service and retention.</li>\n<li>Recruits, interviews, hires, and trains departmental supervisory staff.</li>\n<li>Provides constructive and timely performance evaluations.</li>\n<li>Handles discipline and termination of employees in accordance with company policy.</li>\n<li>Establish service levels and requirements for the department.</li>\n<li>Acts as a liaison between the customer service department and other divisions in the company.</li>\n<li>Management of the department’s budget.</li>\n<li>Performs other related duties as assigned.\n<br/><br/></li>\n</ul>\n<strong>Qualifications And Experience\n<br/><br/></strong>\n<ul>\n<li>Excellent verbal and written communication skills.</li>\n<li>Excellent interpersonal and customer service skills.</li>\n<li>Excellent organizational skills and attention to detail.</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Strong supervisory and leadership skills.</li>\n<li>Proficient with Gsuite or related software.\n<br/><br/></li>\n</ul>\n<strong>Education And Experience\n<br/><br/></strong>\n<ul>\n<li>Bachelor’s degree preferred.</li>\n<li>At least five years of related experience required, preferably in the HME/DME industry.\n<br/><br/></li>\n</ul>\n<strong>Benefits\n<br/><br/></strong>\n<ul>\n<li>Medical</li>\n<li>Dental</li>\n<li>Vision</li>\n<li>Flexible Savings Account</li>\n<li>401K</li>\n<li>Voluntary Life Insurance</li>\n<li>Observed Holidays: New Year's Day, Memorial Day, July 4th, Labor Day, Thanksgiving Day, Christmas Day.\n<br/><br/></li>\n</ul>\n<strong>Perks\n<br/><br/></strong>\n<ul>\n<li>Paid Training</li>\n<li>Paid Time Off</li>\n<li>Sick Time</li>\n<li>Growth Opportunities</li>\n<li>Employee Referral Reward Program</li>\n<li>Employee Discount Program\n<br/><br/></li>\n</ul>\n<strong><em>Any employment proposal is contingent upon satisfactory completion of: Background Check, Reference Check(s), Driving Record (if applicable), Pre-employment Drug and TB Tests\n<br/><br/></em></strong>\n<strong>What SuperCare Health Is About\n<br/><br/></strong>\n<em>“SuperCare Health is a comprehensive, post- acute care, respiratory services company, focused on managing high-risk respiratory patients in their homes.\n<br/><br/>\n</em>\n<em>Today, SuperCare health manages millions of lives annually, with a growing team of more than 400 members, and has one of the highest-rated satisfaction scores from both our customers and patients.\n<br/><br/>\n</em>\n<em>Our goal is to be the most trusted and preferred resource to manage high-risk, post-acute respiratory patients through our high-touch clinical team and high-tech, innovative solutions. Our end-to- end care solutions, from the hospital to the home, close gaps in care, reduce costs of care and improve outcomes. Our in-home services include ventilation, oxygen, CPAP/BiPAP, enteral nutrition, pharmacy services, and an expanding population health program. \n<br/><br/>\n</em>\n<em>We are uniquely structured to be a responsive and agile community provider, yet we also possess the stability and effectiveness of a large enterprise. As a thriving business, our chief focus is on what really matters: reducing hospital re-admissions, optimizing outcomes and improving the lives of patients with chronic care diseases, every day.``\n<br/><br/></em>\n<strong>Connect With Us!\n<br/><br/></strong>\nCompany Website https://supercarehealth.com/\n<br/><br/>\nCompany Business Hours - 8:30 AM – 5:30 PM PST\n<br/><br/>\nLinkedIn https://www.linkedin.com/company/273667/admin/\n<br/><br/>\nTwitter https://twitter.com/SuperCareHealth\n<br/><br/>\nFacebook https://www.facebook.com/SuperCareHealth/\n<br/><br/>\nInstagram https://www.instagram.com/supercarehealth/\n<br/><br/>\nAraceli Richardson - Jr. Recruiter LinkedIn\n        ", "postedDate": "5 days ago", "benefits": "Medical\nDental\nVision\nFlexible Savings Account\n401K\nVoluntary Life Insurance\nObserved Holidays: New Year's Day, Memorial Day, July 4th, Labor Day, Thanksgiving Day, Christmas Day.\n<br/><br/>", "skills": ["Gsuite"], "url": "https://www.linkedin.com/jobs/view/4002183414"}