{"jobTitle": "Sales Executive Assistant", "company": {"name": "Sonic Gods Studios", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Broadcast Media Production and Distribution", "description": "About Us:\n\nSonic Gods Studios is an innovative entertainment studio dedicated to creating content that drives social impact. We tell stories that resonate with diverse audiences and champion meaningful change, managing everything from financing and creative development to pioneering virtual production, distribution, and marketing.\n\nRole Overview:\n\nWe’re seeking a Sales Executive Assistant to support our sales team and provide general support to one of our executives. This in-person role in Los Angeles is ideal for someone who’s passionate about entertainment, highly organized, and eager to contribute to sales growth.\n\nWhat You’ll Do:\n\n* Support Sales Efforts: Assist with outreach to potential clients and partners, helping to identify and secure new business opportunities.\n* Communication: Lead on follow up communication with prospects\n* Sales Campaigns: Contribute to the development and execution of sales strategies and campaigns that align with our mission.\n* Executive Support: Provide general administrative support to one of the executives, including managing calendars, preparing documents, and coordinating meetings.\n* CRM Management: Maintain and update sales databases and CRM systems, ensuring all information is accurate and up-to-date. \n\nWho You Are:\n\n* Outgoing: You build relationships quickly and effectively.\n* Driven: You’re ambitious, motivated, and eager to grow within the company.\n* Reliable: You consistently deliver high-quality work and meet deadlines.\n\nWhy Join Us?\n\n* Be part of a dynamic team that’s shaping the future of entertainment. At Sonic Gods Studios, you’ll play a key role in driving our sales efforts, supporting our leadership, and growing alongside the company.", "postedDate": "2 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002844792"}