{"jobTitle": "Human Resources Manager", "company": {"name": "HR Pals & Recruiting Pals", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Human Resources Services", "description": "Company Overview Due to the great reception our services have received in the marketplace, HR Pals was named by Inc. magazine to its list of the fastest growing private companies in America in 2022 and 2023! We are a team of HR, Payroll, Compliance, and Recruiting experts with multi-industry and multi-state experience. Over the past ten years, the Company has provided hundreds of businesses across America with customizable human resources, payroll, recruiting, and human capital management technology solutions. We believe in building deep relationships with our clients, providing a customer experience that feels like we're an embedded part of our clients' teams. Our most popular solutions include: The Virtual HR Department. We deliver all aspects of a full-service HR department - both strategic and tactical. Customized around your needs, and often paired with an internal resource who needs help, this solution feels similar to having your own HR, payroll, and recruiting department, but at a lower cost. Recruiting Services. We replace expensive headhunters and the \"Post & Pray\" method of finding talent, with a unique labor-based recruiting fee structure Payroll Management. We manage and process your payroll. HR Technology Platform. Our technology solution helps you hire, onboard, pay, and support your team members. Our 50+ team members all work out of their home offices. Position Overview The HR Manager supports a group of 4-7 of our clients across multiple industries. In this role, you will lead day to day HR operations and be the primary point of contact for the client's employees with regards to HR. The successful candidate will have 6-10 years of HR experience, preferably in a client-facing environment, the ability to multi-task, a strong attention to detail, and top-notch communication skills (both written and verbal). Work Schedule/Expectations This is a remote, work from home position. Although there is inherent schedule flexibility built into the role, it is expected that the HR Manager be on call and available to clients as needed. Although this typically involves working during business hours, on occasion the person in this role may be asked to support client needs early in the morning or evenings. It is imperative that clients feel supported and that they can contact the HR Manager at any time and get a very quick response (ideally immediately, but no greater than 4 hours). Customer focus and responsiveness is a must in this position. Essential Job Functions (As a Consultant to our Clients) Manage the overall strategy, administration, coordination and execution of the HR function for each client Ability to be flexible and willing to take on a variety of assignments, depending on the clients specific HR needs. Our clients expect us to be a full-service HR department that handles all aspects of HR for them, so having a \"can-do\" attitude with regards to fulfilling client requests and needs is a must. Provide ongoing performance coaching and feedback to leaders regarding issues of communications, management style, employee interactions, career and leadership development, corrective action and conflict resolution Handle all hands-on, tactical needs in all HR functional areas, including payroll for some clients Make well researched decisions and counsel consistently and appropriately to management and team members to maintain a productive and positive work environment and achieve optimal performance. Where appropriate provide options to clients for alternative courses of action Educate and advise management and team members with regard to employment laws, HR policies and procedures and state and federal laws Partner/advise management on the resolution of employee relations, corrective action and performance issues Mediate employee disputes, ensure proper documentation is followed, and corrective actions are implemented Investigate allegations of harassment, discrimination, wrongful termination, improper conduct and other matters Provide consultation and guidance to management regarding compensation and benefits, including incentive plan design, management of health benefits broker, and salary benchmarking Ensure compliance as it relates to federal and state labor laws. Identify potential legal risk to the client and make recommendations on next steps to minimize risk and ensure compliance. Build and maintain healthy relationships with all team members Other duties as assigned Required Education, Experience, Skills and Abilities Demonstrated track record of establishing relationships and earning credibility and respect with client groups. Bachelor's Degree in HR, Business Administration or related field with 6+ years of successful HR experience in multiple industries. Deep employee relations expertise is needed. Experience processing payroll is preferred. Strong consultation skills and proven track record in a client facing, matrixed role, including the ability to influence leaders to align people processes and practices with business objectives. Expert knowledge of California and Federal labor laws and comfort with HR systems/technology are a must! HR Pals acknowledges that equal opportunity for all persons is a fundamental human value. Each employee and applicant will be considered on the basis of individual ability and merit, without regard to race, color, religion, age, sex, sexual orientation, gender identity, gender expression, pregnancy, national origin, marital status, physical disability, mental disability, medical condition, genetic information, protected military or veteran status, or any other characteristics. For more job opportunities, follow us at HR Pals &amp; Recruiting Pals: My Company | LinkedIn .", "postedDate": "1 week ago", "qualifications": {"required": "Demonstrated track record of establishing relationships and earning credibility and respect with client groups. Bachelor's Degree in HR, Business Administration or related field with 6+ years of successful HR experience in multiple industries. Deep employee relations expertise is needed. Experience processing payroll is preferred. Strong consultation skills and proven track record in a client facing, matrixed role, including the ability to influence leaders to align people processes and practices with business objectives. Expert knowledge of California and Federal labor laws and comfort with HR systems/technology are a must!", "preferred": ""}, "skills": [], "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002707819"}