{"jobTitle": "Executive Assistant to Managing Director", "company": {"name": "SYZYGY", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$55,000.00 - $65,000.00", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Financial Services", "description": "<strong>ABOUT THE COMPANY: </strong><p><br/></p><p>Our client is a full-service creative studio reimagining how brands engage with today’s audience through innovative storytelling. Their diverse roster of visionary creatives are rewriting the rules of storytelling and visual expression, driven by their shared values and unique perspectives. </p><p><br/></p><p>Our client believes passion makes perfect. Every project is an opportunity to contribute to something extraordinary. They partner with some of the biggest brands like Amazon, Apple, Adidas, Bumble, Postmates, Squarespace, XBOX and more! This isn't just work, it's their chance to collectively innovate and inspire their team, their clients, and the world.</p><p><br/></p><p>They are currently looking for a skilled and proactive Executive Assistant to support the Managing Director (MD). If this studio sounds like an exciting fit for you, keep reading! </p><p><br/></p><p><strong>ABOUT YOU: </strong></p><p><br/></p><ul><li>You have 2+ years in an executive assistant or similar role, with a focus on calendar management, task prioritization, and project tracking.</li><li>You are proficient in Google Suite especially Google Sheets and G-Drive, Notion, and Dropbox</li><li>You are highly organized with a knack for keeping everything running smoothly.</li><li>You have the ability to anticipate needs and take initiative.</li><li>You have excellent written and verbal communication skills.</li><li>You are proficient in project management software and tools like Dropbox and G-Drive.</li><li>You have strong attention to detail and accuracy in all tasks.</li><li>You have the ability to troubleshoot issues and keep projects moving forward.</li><li>You have a collaborative mindset with the ability to work well with others.</li><li>You are adaptable and able to handle a variety of tasks and responsibilities.</li></ul><p><br/></p><p><strong>ABOUT THE JOB: </strong></p><p><br/></p><p>This production company is on the hunt for a skilled and proactive Executive Assistant to support our Managing Director (MD). This role is pivotal in ensuring the smooth operation of daily activities and long-term projects. You will be the MD’s right hand, managing schedules, priorities, and ensuring all tasks and projects are on track. Your attention to detail and ability to anticipate needs will help drive our success and keep everything running like a well-oiled machine. Responsibilities and results will include the below but are not limited to:</p><p><br/></p><p><strong>Responsibilities:</strong></p><ul><li>Schedule and manage the MD's calendar, ensuring time is allocated for meetings, tasks, and preparation.</li><li>Keep all projects on track and organized by tracking and updating the statuses using project management software.</li><li>Ensure meeting outcomes are achieved and follow-up tasks are on track, troubleshooting any issues.</li><li>Prioritize daily and weekly tasks based on immediate and long-term needs.</li><li>Prepare for upcoming weeks each Friday with the MD’s review.</li><li>Assist in growing the MD’s LinkedIn presence by generating discussion topic ideas and capturing day-in-the-life content.</li><li>Assist in sales outreach and LinkedIn engagement.</li><li>Provide end-of-day updates on task completion and project statuses.</li><li>Proactively follow up with team members to ensure timely task completion.</li><li>Schedule and confirm meetings, ensuring the MD has adequate prep time.</li><li>Oversee company budget updates and job book accuracy, providing reports and analysis to the MD.</li><li>Monitor and report on the weekly KPIs of the MD’s direct reports.</li><li>Oversee work delegated by the MD to ensure timely completion.</li><li>Create internal and external presentations with company branding.</li><li>Conduct research as needed, providing findings and analysis.</li><li>Keep Dropbox and G-Drive organized with easily locatable files and assets.</li><li>Ensure key tasks and dates are on track, and draft and send emails on behalf of the MD as needed.</li><li>Handle various personal and professional tasks as needed.</li></ul><p><br/></p><p><strong>Results: </strong></p><ul><li>The Managing Director is able to focus more time on strategic business tasks to grow the business than working in the business. </li><li>The MD’s calendar is meticulously managed, allowing more time for strategic business tasks and reducing time spent on operational duties.</li><li>All projects are tracked and updated consistently, ensuring timely completion and maintaining momentum, enabling the MD to stay focused on high-level objectives.</li><li>Financial reports and budgets are accurately maintained and delivered on time, allowing the MD to concentrate on analysis and decision-making rather than data entry.</li><li>The MD’s LinkedIn presence and engagement are significantly enhanced through proactive content generation and interaction, supporting business growth.</li><li>Key tasks and deadlines are consistently managed and met, providing comprehensive support and allowing the MD to focus on growing the business rather than day-to-day operations.</li></ul><p><br/></p><p><strong>ABOUT OUR BENEFITS + PERKS: </strong></p><p><br/></p><ul><li>Medical, Vision, Dental Benefits with portion covered by company </li><li>401k with employer match</li><li>PTO Policy</li><li>WFH Fridays </li><li>Monday Lunches supplied by company </li><li>Salary range: $55,000 to $65,000 (Base + OT + Incentive Structure)</li></ul><p><br/></p><p><strong>ABOUT OUR COMMITMENT TO DIVERSITY:</strong></p><p><br/></p><p>As an equal opportunity employer committed to meeting the needs of a multigenerational and multicultural workforce, we recognize that a diverse staff, reflective of our community, is an integral and welcome part of a successful and ethical business. We hire local talent at all levels regardless of race, color, religion, age, national origin, gender, gender identity, sexual orientation, or disability, and actively foster inclusion in all forms both within our company and across interactions with clients, candidates, and partners.</p><p><br/></p><p>If this role sounds like a perfect fit for you please email hr@syzygy.la. For best consideration, please include the job title and the source where you found this position in the subject line of your email. We look forward to potentially having you join our team!</p>", "responsibilities": "Schedule and manage the MD's calendar, ensuring time is allocated for meetings, tasks, and preparation. Keep all projects on track and organized by tracking and updating the statuses using project management software. Ensure meeting outcomes are achieved and follow-up tasks are on track, troubleshooting any issues. Prioritize daily and weekly tasks based on immediate and long-term needs. Prepare for upcoming weeks each Friday with the MD’s review. Assist in growing the MD’s LinkedIn presence by generating discussion topic ideas and capturing day-in-the-life content. Assist in sales outreach and LinkedIn engagement. Provide end-of-day updates on task completion and project statuses. Proactively follow up with team members to ensure timely task completion. Schedule and confirm meetings, ensuring the MD has adequate prep time. Oversee company budget updates and job book accuracy, providing reports and analysis to the MD. Monitor and report on the weekly KPIs of the MD’s direct reports. Oversee work delegated by the MD to ensure timely completion. Create internal and external presentations with company branding. Conduct research as needed, providing findings and analysis. Keep Dropbox and G-Drive organized with easily locatable files and assets. Ensure key tasks and dates are on track, and draft and send emails on behalf of the MD as needed. Handle various personal and professional tasks as needed.", "qualifications": {"required": "You have 2+ years in an executive assistant or similar role, with a focus on calendar management, task prioritization, and project tracking. You are proficient in Google Suite especially Google Sheets and G-Drive, Notion, and Dropbox You are highly organized with a knack for keeping everything running smoothly. You have the ability to anticipate needs and take initiative. You have excellent written and verbal communication skills. You are proficient in project management software and tools like Dropbox and G-Drive. You have strong attention to detail and accuracy in all tasks. You have the ability to troubleshoot issues and keep projects moving forward. You have a collaborative mindset with the ability to work well with others. You are adaptable and able to handle a variety of tasks and responsibilities."}, "skills": ["Google Suite", "Notion", "Dropbox", "Project Management", "Calendar Management", "Task Prioritization", "Communication", "Organization", "Problem Solving", "Collaboration"], "postedDate": "2 days ago", "benefits": "Medical, Vision, Dental Benefits with portion covered by company, 401k with employer match, PTO Policy, WFH Fridays, Monday Lunches supplied by company, Salary range: $55,000 to $65,000 (Base + OT + Incentive Structure)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002195567"}