{"jobTitle": "Head of Marketing, Amazon Autos", "company": {"name": "Amazon", "location": "New York, United States"}, "location": "New York, United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "166,100.00/year - 274,600.00/year", "currency": "USD"}, "jobFunction": "Public Relations and Marketing", "industry": "Software Development", "description": "Come build the future with us! We are seeking an accomplished marketing leader to bring the Amazon Autos brand to life.<br/><br/>This leader is responsible for building the brand, driving awareness, acquisition, and engagement. The ideal candidate must be able to think strategically and execute flawlessly. They must have strong communication skills and be able to influence cross-functional partners to galvanize an organization around a central strategy. They must be a steadfast brand protector who always puts the customer at the center and focuses on brand and messaging continuity. They will have a diverse and proven track record of building brands and delivering results.<br/><br/>The ideal candidate will utilize a data-driven approach to create and optimize sophisticated marketing programs, structure marketing plans, and be able to pivot based in in-market performance. This individual will excel in managing and navigating cross-functional efforts and be a customer advocate in all forums. They must be a self-starter with strong analytical ability, attention to detail, excellent communication skills and an ability to drive innovative programs involving multiple stakeholders. In this role you will be expected to flex both analytical skills and creative muscles.<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> Bachelor's degree</li><li> 10+ years of marketing experience</li><li> 5+ years experience managing teams</li><li> Experience building and managing a brand</li><li> Experience guiding creative input, development and execution from concept to completion</li><li> Experience collaborating with internal stakeholders and external agencies/partners, including day-to-day management of campaign milestones and agency deliverables</li><li> Ability to guide teams in building strategic and tactical marketing recommendations based on quantitative/qualitative data</li><li> Demonstrated effectiveness in working across organizational boundaries to influence and deliver results.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> MBA</li><li> Experience building teams by setting vision, mission and mechanisms that ensure delivery of business impacting results.</li><li> Excellent communication, presentation, and interpersonal skills; the ability to communicate complex concepts clearly and persuasively across different audiences and varying levels of the organization.</li><li> Experience working in a global context, and leading global teams, with a proven ability to effectively design for customer engagement in multiple countries.<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $166,100/year in our lowest geographic market up to $274,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon Advertising LLC<br/><br/>Job ID: A2734505", "postedDate": "6 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002283211"}