{"jobTitle": "Operations Assistant - Construction Industry", "company": {"name": "Burns Environmental Services", "location": "Simi Valley, CA"}, "location": "Simi Valley, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Environmental Services", "description": "<strong>Job Description<br/><br/></strong>We are seeking an Operations Assistant to join our team! You will perform clerical and administrative functions in order to drive company success.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Work closely with Operations Management to coordinate and maintain daily scheduling of project calendar</li><li>Daily coordination, communication, dispatching and confirmation of assigned field personnel to project</li><li>Daily labor assignment data entry</li><li>Video and photo documentation archiving to database</li><li>Review and submittal of daily field documentation</li><li>Maintain company data in different systems</li><li>Provide general project administration including permit applications, maintenance of project files, compilation of reports</li><li>Perform other office tasks as assigned by Management<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Bi-lingual (Spanish) preferred</li><li>Previous experience in office administration in the construction industry a plus</li><li>Ability to prioritize and multitask in a fast-paced environment</li><li>Excellent written and verbal communication skills</li><li>Ability to adapt and prioritize differing tasks</li><li> Strong organizational skills and attention to detail<br/><br/></li></ul><strong>Company Description<br/><br/></strong>Burns Environmental Services is an environmental and demolition firm that never stands still because something great is always happening. As a leader in our industry, Burns Environmental cares about meeting our customers' specific needs and providing them with economic and efficient solutions. Professionalism, clear communication and integrity are core standards at Burns Environmental Services. Our clients know they can depend on us to consistently exceed expectations, every time.<br/><br/>The most valuable commodity that Burns has is our people. Company culture is an important aspect at Burns. We appreciate the team we have, and our looking to expand into a market that is continually growing.<br/><br/>Our mission is to become the number one leader in the environmental remediation industry by taking a genuine and passionate interest in the growth of our people and our clients. We will continue to expand and increase our influence in California, while constantly developing our leadership roles in the for-profit and non-profit sectors. Through our vision, our competitive drive to be the best, and our unrelenting work ethic, we will make our positive mark on the world by making a positive mark in the lives of every individual or organization we come in contact with.<br/><br/>Burns Environmental Services is an environmental and demolition firm that never stands still because something great is always happening. As a leader in our industry, Burns Environmental cares about meeting our customers' specific needs and providing them with economic and efficient solutions. Professionalism, clear communication and integrity are core standards at Burns Environmental Services. Our clients know they can depend on us to consistently exceed expectations, every time. The most valuable commodity that Burns has is our people. Company culture is an important aspect at Burns. We appreciate the team we have, and our looking to expand into a market that is continually growing. Our mission is to become the number one leader in the environmental remediation industry by taking a genuine and passionate interest in the growth of our people and our clients. We will continue to expand and increase our influence in California, while constantly developing our leadership roles in the for-profit and non-profit sectors. Through our vision, our competitive drive to be the best, and our unrelenting work ethic, we will make our positive mark on the world by making a positive mark in the lives of every individual or organization we come in contact with.", "postedDate": "5 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002512119"}