{"jobTitle": "Sr Director, Sr Relationship Manager", "company": {"name": "TIAA", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$118,500/yr. - $195,000/yr.", "currency": "USD"}, "jobFunction": "Other", "industry": "Financial Services", "description": "<strong>Sr Relationship Manager<br/><br/></strong>The Sr Relationship Manager plays a crucial role in our mission to deliver lifetime income to all, responsible for deepening client relationships and identifying sales opportunities within a large complex book of clients (with at least one top 200 client or complex book within Institutional client business.) They are responsible for delivering a distinctive and strategic client experience through leadership of integrated teams ensuring growth, retention and servicing of existing client relationship. They are accountable for deepening relationships with key decision makers and partners to drive plan and participant outcomes through: alignment with best practices in retirement plan design, delivery of lifetime income through expanded adoption of TIAA products and delivery of the full value of TIAA solutions and services.<br/><br/><strong>Key Responsibilities And Duties<br/><br/></strong><ul><li>Leads the internal integrated client team with responsibility to grow, retain and deepen relationships that drive positive client outcomes (book of business, client, and consultant) establishes the strategic approach to growing business and executes to drive profitable results.</li><li>Strategic partner and trusted advisor of the plan sponsors and consultants. Identifies, influences, and executes on a strategic vision of both the plan sponsor and TIAA. </li><li>Effectively positions the value of lifetime income to sell our products and solutions to plan sponsors and consultants. Demonstrates expertise in identifying unstated current and future client needs and in planning to meet those client opportunities. </li><li>Leverages analytics, investment, market knowledge, and financials to develop multi-year strategic plans within and across institutions to profitably grow the business. </li><li>Leads integrated teams to successful collaboration, development, and execution of business strategy to maximize client outcomes and takes ownership of working with key stakeholders to drive resolution to complex issues and ensure overall client satisfaction.</li><li>Partners with Consultant Relations, proactively identify, build and strengthen TIAA's position with consulting firms and individual consultants.</li><li>Mentors relationship management staff within their market and region.</li><li>Creates an agile environment by embracing new ways of working and encourages others to operate efficiently to maximize client outcomes.</li><li>Creates B2B and B2B2C business opportunities by promoting enterprise employer solutions and employee engagement with TIAA Consultants and Advisors.</li><li>Reviews client financials and regularly meets with senior executives to understand their long-term strategies.</li><li>Develops highly specialized product knowledge and financing expertise for covered sector to lead client discussions in product positioning and adoption, manage profitability and maintain competitive pricing.<br/><br/></li></ul><strong>Educational Requirements<br/><br/></strong><ul><li>University (Degree) Preferred<br/><br/></li></ul><strong>Work Experience<br/><br/></strong><ul><li>5+ Years Required; 7+ Years Preferred<br/><br/></li></ul><strong>FINRA Registrations<br/><br/></strong><ul><li>SRC Indicator: Series 6 or 7; Series 63<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li>Physical Requirements: Sedentary Work<br/><br/></li></ul><strong>Career Level<br/><br/></strong>9IC<br/><br/>Related Skills<br/><br/>Accountability, Business Development, Client Relationship Management, Commercial Acumen, Commercial Mindset, Communication, Financial Markets Impact, Group Problem Solving, Inspires Others, Negotiation, Relationship Management, Retirement Planning Selling<br/><br/><strong>Anticipated Posting End Date<br/><br/></strong>2024-08-23<br/><br/>Base Pay Range: $118,500/yr. - $195,000/yr.<br/><br/>Actual base salary may vary based upon, but not limited to, relevant experience, time in role, base salary of internal peers, prior performance, business sector, and geographic location. In addition to base salary, the competitive compensation package may include, depending on the role, participation in an incentive program linked to performance (for example, annual discretionary incentive programs, non-annual sales incentive plans, or other non-annual incentive plans).<br/><br/>_____________________________________________________________________________________________________<br/><br/><strong>Company Overview<br/><br/></strong>TIAA is the leading provider of financial services in the academic, research, medical, cultural and government fields. We offer a wide range of financial solutions, including investing, banking, advice and education, and retirement services.<br/><br/><strong>Benefits And Total Rewards<br/><br/></strong>The organization is committed to making financial well-being possible for its clients, and is equally committed to the well-being of our associates. That’s why we offer a comprehensive Total Rewards package designed to make a positive difference in the lives of our associates and their loved ones. Our benefits include a superior retirement program and highly competitive health, wellness and work life offerings that can help you achieve and maintain your best possible physical, emotional and financial well-being. To learn more about your benefits, please review our Benefits Summary.<br/><br/><strong>Equal Opportunity <br/><br/></strong>We are an Equal Opportunity/Affirmative Action Employer. We consider all qualified applicants for employment regardless of age, race, color, national origin, sex, religion, veteran status, disability, sexual orientation, gender identity, or any other protected status.<br/><br/>Read more about the Equal Opportunity Law here.<br/><br/><strong>Accessibility Support<br/><br/></strong>TIAA offers support for those who need assistance with our online application process to provide an equal employment opportunity to all job seekers, including individuals with disabilities.<br/><br/>If You Are a U.S. Applicant And Desire a Reasonable Accommodation To Complete a Job Application Please Use One Of The Below Options To Contact Our Accessibility Support Team<br/><br/>Phone: (800) 842-2755<br/><br/>Email: accessibility.support@tiaa.org<br/><br/><strong>Privacy Notices<br/><br/></strong>For Applicants of TIAA, Nuveen and Affiliates residing in US (other than California), click here.<br/><br/>For Applicants of TIAA, Nuveen and Affiliates residing in California, please click here.<br/><br/>For Applicants of Nuveen residing in Europe and APAC, please click here.", "responsibilities": "Leads the internal integrated client team with responsibility to grow, retain and deepen relationships that drive positive client outcomes (book of business, client, and consultant) establishes the strategic approach to growing business and executes to drive profitable results.\nStrategic partner and trusted advisor of the plan sponsors and consultants. Identifies, influences, and executes on a strategic vision of both the plan sponsor and TIAA. \nEffectively positions the value of lifetime income to sell our products and solutions to plan sponsors and consultants. Demonstrates expertise in identifying unstated current and future client needs and in planning to meet those client opportunities. \nLeverages analytics, investment, market knowledge, and financials to develop multi-year strategic plans within and across institutions to profitably grow the business. \nLeads integrated teams to successful collaboration, development, and execution of business strategy to maximize client outcomes and takes ownership of working with key stakeholders to drive resolution to complex issues and ensure overall client satisfaction.\nPartners with Consultant Relations, proactively identify, build and strengthen TIAA's position with consulting firms and individual consultants.\nMentors relationship management staff within their market and region.\nCreates an agile environment by embracing new ways of working and encourages others to operate efficiently to maximize client outcomes.\nCreates B2B and B2B2C business opportunities by promoting enterprise employer solutions and employee engagement with TIAA Consultants and Advisors.\nReviews client financials and regularly meets with senior executives to understand their long-term strategies.\nDevelops highly specialized product knowledge and financing expertise for covered sector to lead client discussions in product positioning and adoption, manage profitability and maintain competitive pricing.", "qualifications": {"required": "5+ Years Required; 7+ Years Preferred", "preferred": "University (Degree) Preferred"}, "skills": ["Accountability", "Business Development", "Client Relationship Management", "Commercial Acumen", "Commercial Mindset", "Communication", "Financial Markets Impact", "Group Problem Solving", "Inspires Others", "Negotiation", "Relationship Management", "Retirement Planning Selling"], "postedDate": "1 week ago", "benefits": "The organization is committed to making financial well-being possible for its clients, and is equally committed to the well-being of our associates. That’s why we offer a comprehensive Total Rewards package designed to make a positive difference in the lives of our associates and their loved ones. Our benefits include a superior retirement program and highly competitive health, wellness and work life offerings that can help you achieve and maintain your best possible physical, emotional and financial well-being. To learn more about your benefits, please review our Benefits Summary.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4002218778"}