{"jobTitle": "School Office Staff", "company": {"name": "Selected", "location": "Thousand Oaks, CA"}, "location": "Thousand Oaks, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Competitive; varies by role type and school"}, "jobFunction": "Administrative", "industry": "Internet Publishing", "description": "Free job-searching + PD for educators. Find a school you love!<br/><br/>www.getselected.com<br/><br/><strong>Position Description<br/><br/></strong><strong>School Office Staff </strong>at multiple partner school sites (school-specific role descriptions available upon profile approval).<br/><br/><strong>Role Types Available:<br/><br/></strong><ul><li>Front Office Management</li><li>Office Assistant</li><li>School Executive Assistant<br/><br/></li></ul><strong>How To Apply<br/><br/></strong><strong>Create a single profile at https://www.getselected.com/signup to start your application</strong> with any of our hiring schools that meet your preferences. <strong>Only one application is needed to be considered by all relevant schools</strong>—our schools will then reach out to you with their matching vacancies and directions.<br/><br/><strong>About Schools + Support on Selected<br/><br/></strong>GetSelected.com is a free teacher support and administrative specialties hiring platform with over 1,500+ hiring schools (public, private, PK-12) and families across the country. Create a complimentary account to learn about and connect with our schools that match your search preferences. Access our library of educator resources to help you thrive in your position.<br/><br/>We accept applications on a rolling basis and encourage candidates to apply as soon as possible to avoid missing opportunities at the best-fit hiring schools.<br/><br/><strong>Why Apply<br/><br/></strong><strong>Candidates accepted onto our free platform will be:<br/><br/></strong><ul><li>Marketed to hiring schools matching your position-search preferences (names, resumes, and contact information shared only with schools you actively choose to connect with)</li><li>Fast-tracked as pre-screened, priority candidates with a recommendation to hiring managers as a pre-screened, Selected-approved candidate</li><li>Approved to access our full library of educator resources (blog, course modules, webinars, and more) on everything from acing the teacher interview to classroom management</li><li>Provided with 1:1 candidate search support to turn to for interview prep and professional development opportunities</li><li>Given the option to job-search in private-mode<br/><br/></li></ul><strong>Qualifications + Eligibility<br/><br/></strong><ul><li>For our team to review and approve your profile application, you must:</li><li>Be currently located AND authorized to work in the US</li><li>Currently reside in (or willing to relocate to) one of our school regions<br/><br/></li></ul><strong>Job Type<br/><br/></strong>Full-time(May also have Part-Time and Contract positions available)<br/><br/><strong>Salary Range<br/><br/></strong>Competitive; varies by role type and school<br/><br/>Powered by JazzHR<br/><br/>KLg6xQteMO", "postedDate": "2 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002895580"}