{"jobTitle": "Senior Benefits Analyst - LOA & Accommodations", "company": {"name": "Riot Games", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "description": "Riot's People team exists to help Rioters make better decisions around its people. We bring our expertise to all of those typical HR activities such as hiring, onboarding, training and development, diversity and inclusion, performance management, benefits, perks, compensation, employee relations, and off-boarding so that all Rioters can flourish.<br/><br/>As a Sr. Benefits Analyst, reporting to the Benefits Sr. Manager, you will play a meaningful role in the leave and PTO programs and the accommodation process at Riot. You'll assist with the configuration and updates to our benefit system and processes to achieve harmony and strong colaboration with our leave partner. You will play a key role in helping sync Riot’s internal leave and salary continuation policies to our disability policies and Federal and State Leave Laws as well as educating our sizable company on our leave policies and accommodation process by partnering with our leave partner to create internal marketing and training. Individual Rioters will depend on your direct care for different benefit needs, and you'll review and transmit their sensitive data with focus.<br/><br/>Responsibilities:<br/><br/><ul><li>Serve as a primary contact and manage Riot’s Americans with Disabilities (ADA) interactive process to include engaging directly with employees about restrictions and accommodations, evaluating medical documentation, engaging with physicians (as needed), arriving at creative accommodation solutions based on experience and completing undue hardship analysis</li><li>Effectively manage and prioritize multiple ADA accommodation cases from initiation to disposition and maintain accurate follow up, tracking, documentation, and timely communication for individuals requesting an accommodation.</li><li>Independently track, monitor and follow up on ADA scenarios that are open, and regularly report status updates and complex matters to your manager, Employee Relations, HRBPs and Legal.</li><li>Proactively engage with HRBPs and managers on all related accommodation request cases, keeping them updated on the status of cases</li><li>Serve as a primary contact and manage Riot's US leave of absence and workers' comp programs, including Family and Medical Leave (FMLA), parental leave, military leave, disability, and PTO</li><li>Ensure compliance with local, state, and federal laws and regulations of leave and disability and that the workers' compensation program is managed following applicable OSHA and workers' compensation laws</li><li>Be the primary contact for Rioters and vendors regarding all leaves of absence and related processes, from the initial notice of the need for leave through the return to work date</li><li>Partner with our leave of absence and disability vendor, Employee Relations and HRBPs on all related cases, keeping them updated on the status of cases/claims</li><li>In coordination with the Sr. Benefits manager, drive the implementation of disability and leave policies, new leave of absence vendor, and accommodation processes and tracking. This includes managing leave and disability vendors to ensure they are meeting Service Level Agreements and administering Riot’s policies and processes correctly and in compliance with local, state, and federal laws and regulations pertaining to leave and disability. Maintain documentation for all plans, amendments, and processes.</li><li>Analyze patterns in utilization data, leave claims and accommodation requests to track performance across our leave and accommodation programs. Use this data and industry best practice to make recommendations to process improvement to the leaves of absence and accommodation effectiveness and experience for Rioters, HRBP and managers. </li><li>Maintain the time and attendance process related to leaves of absence in Workday and partner with leave administration vendor and payroll on coordinating pay related to leave of absence. </li><li>Develop educational and communications materials/training for Riot's growing organization<br/><br/><br/></li></ul>Required Qualifications:<br/><br/><ul><li>7+ years of HR or benefits experience, with 3+ years in leave, disability, and accommodation administration</li><li>You have demonstrated experience conducting Interactive Process meetings</li><li>You have a solid understanding of current federal and state benefits laws and regulations (including FMLA, CFRA, PFL, HIPAA and other benefit legislation) </li><li>You’re proficient working with benefits and leave administration software systems</li><li>You regularly interpret and discuss complex accommodation and leave related information with others, clearly explaining terminology and concepts unfamiliar to most people </li><li>You’re able to maintain a high level of confidentiality and comfortable delivering service to a variety of customers, from senior managers to entry-level talent</li><li>You've often proposed, documented, and implemented new processes to improve and streamline the accommodation and leave experiences </li><li>You have strong interpersonal skills and service orientation</li><li>You have strong organizational, analytical, time management and detail oriented skills </li><li>You’re equally comfortable working independently on projects or cross functionally with Rioters from all over the organization<br/><br/><br/></li></ul>Desired Qualifications:<br/><br/><ul><li>Bachelor's degree in Human Resources, Insurance &amp; Risk Management, or a comparable field</li><li>HR experience at entertainment or technology organizations, or a similar industry that operates in a fast paced and agile environment</li><li>You have demonstrated experience managing vendor relationships</li><li>Experience with Excel (can maintain complex spreadsheets)</li><li>Experience with Workday HCM<br/><br/><br/></li></ul>For this role, you'll find success through craft expertise, a collaborative spirit, and choices that focus on your fellow Rioters, who are the customers of your work. Being a dedicated fan of games is not necessary for this position!<br/><br/><strong>Our Perks:<br/><br/></strong>Riot has a focus on work/life balance, shown by our open paid time off policy, in addition to other perks such as flexible work schedules. We offer medical, dental, and life insurance, parental leave for you, your spouse/domestic partner and children, and a 401k with company match. Check out our benefits pages for more information.<br/><br/>Riot Games fosters a player and workplace experience that values teamwork embodied by the <strong>Summoner's Code</strong> and <strong>Community Code</strong>. Our culture embraces differences as a strength, and our values are the guiding principles for how we approach work. We are committed to putting diversity and inclusion (D&amp;I) at the center of everything we do, and promoting a fair and collaborative culture where Rioters treat one another with dignity and respect. We encourage you to read more about our value of <strong>thriving together</strong> and our ongoing work to build the <strong>most inclusive company in Gaming</strong>.<br/><br/><ul><li>(Los Angeles Only) Base salary range between $127,300.00 - $179,000.00 USD + incentive compensation + equity + 401K with company match + medical, dental, vision, and life insurance + short and long-term disability + open PTO.<br/><br/><br/></li></ul>It’s our policy to provide equal employment opportunity for all applicants and members of Riot Games, Inc. Riot Games makes reasonable accommodations for handicapped and disabled Rioters and does not unlawfully discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, handicap, veteran status, marital status, criminal history, or any other category protected by applicable federal and state law, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance relating to an applicant's criminal history (LAMC 189.00).", "jobFunction": "Human Resources", "industry": "Computer Games, Software Development, and Technology, Information and Internet", "postedDate": "17 hours ago", "qualifications": {"required": "7+ years of HR or benefits experience, with 3+ years in leave, disability, and accommodation administration\nYou have demonstrated experience conducting Interactive Process meetings\nYou have a solid understanding of current federal and state benefits laws and regulations (including FMLA, CFRA, PFL, HIPAA and other benefit legislation) \nYou’re proficient working with benefits and leave administration software systems\nYou regularly interpret and discuss complex accommodation and leave related information with others, clearly explaining terminology and concepts unfamiliar to most people \nYou’re able to maintain a high level of confidentiality and comfortable delivering service to a variety of customers, from senior managers to entry-level talent\nYou've often proposed, documented, and implemented new processes to improve and streamline the accommodation and leave experiences \nYou have strong interpersonal skills and service orientation\nYou have strong organizational, analytical, time management and detail oriented skills \nYou’re equally comfortable working independently on projects or cross functionally with Rioters from all over the organization<br/><br/><br/>", "preferred": "Bachelor's degree in Human Resources, Insurance &amp; Risk Management, or a comparable field\nHR experience at entertainment or technology organizations, or a similar industry that operates in a fast paced and agile environment\nYou have demonstrated experience managing vendor relationships\nExperience with Excel (can maintain complex spreadsheets)\nExperience with Workday HCM<br/><br/><br/>"}, "skills": ["ADA", "FMLA", "HIPAA", "Leave of Absence", "Disability", "Workers' Compensation", "Accommodation", "Benefits Administration", "HRIS", "Workday HCM", "Excel"], "benefits": "Riot has a focus on work/life balance, shown by our open paid time off policy, in addition to other perks such as flexible work schedules. We offer medical, dental, and life insurance, parental leave for you, your spouse/domestic partner and children, and a 401k with company match. Check out our benefits pages for more information.", "remoteWork": "No", "salary": {"amount": "127,300.00 - 179,000.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4002143922"}