{"jobTitle": "Global Alliances Revenue Operations Manager", "company": {"name": "Canonical", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "Canonical has opened a management position for an exceptional Revenue Operations leader to grow our global alliances and channel partner sales. Our Revenue Operations teams analyse and drive interventions to maximise net customer retention, and lead robust, repeatable processes to plan, manage and deliver revenue.<br/><br/>As a Revenue Operations Manager you will partner with Canonical's executive team across sales, business development, customer success, marketing, product management, commercial systems, delivery, finance and legal and provide a focal point to drive improvements. This position requires an analytical approach, a keen eye for detail and the ability to drive process and system improvement.<br/><br/><strong>Location</strong>: These roles can be held remotely in Americas or EMEA time zones.<br/><br/>What your day will look like<br/><br/><ul><li>Deliver precise, scalable revenue operations for business conducted through alliances and indirect channels </li><li>Develop and lead a team of revenue operations analysts in driving critical partner processes and providing daily operational support and enablement to sales, partners, and cross-functional teams for all partner related issues</li><li>Drive partner Sales Engagement, Training/Enablement/Data Enrichment, Customer Relationship Management, Deal Registration, Configure Price Quote, Analytics and Commissions</li><li>Instrument, measure and improve processes across the entire revenue operations spectrum for alliances and partners</li><li>Deliver metrics and reporting to monitor and improve the operational effectiveness of critical channel and partner processes, including onboarding, deal registration and certification. Use this data to drive insight, manage channels, improve productivity and agree and implement actionable change with executive management through regular sales and business reviews.</li><li>Oversee our partner portal, distributor store and other sales technology and processes, driving automation and process improvements and partnering with our commercial systems engineering team to continuously improve business systems and integration</li><li>Lead the introduction to channels of new products, pricing, packaging and bundling through systems that are easy for our partners to navigate and quote</li><li>Drive data quality in our alliance and partner tools, through order processing, new hire training, process documentation, reporting and data cleansing </li><li>Lead and enhance our commercial review process for evaluating and steering alliance and partner sales opportunities </li><li>Own the commission plan and lead the process for setting goals, evaluating and paying against that plan for alliance and partner sales and business development teams<br/><br/></li></ul>What we are looking for in you<br/><br/><ul><li>An exceptional academic track record from both high school and university</li><li>Undergraduate degree in a related field, or a compelling narrative about your alternative path</li><li>Drive and a track record of going above-and-beyond expectations</li><li>Experience operating in a senior leadership role, driving effectiveness of channel and alliance partnerships, ideally within a similar technology subscription-based business </li><li>Track record of providing insight through robust technology platforms, data, analytics, compensation systems and processes to deliver excellent revenue operations</li><li>Deep understanding of working in a global, multicultural organisation including managing a team of direct reports remotely in different time zones</li><li>A thoughtful systematic approach, skill in measuring, identifying and delivering systems and processes that ensure repeatable, scalable outcomes</li><li>Comfort with commercial pressure, and the ability to put revenue teams under appropriate performance pressure </li><li>Organisational skills and the ability to interact and work with stakeholders within all levels of the organisation </li><li>Communication and negotiation skills to achieve buy-in to priorities from key stakeholders</li><li>Fluent in business English (written and spoken)</li><li>Willingness to travel internationally up to 4 times a year for company events<br/><br/></li></ul>What we offer you<br/><br/>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.<br/><br/><ul><li>Distributed work environment with twice-yearly team sprints in person</li><li>Personal learning and development budget of USD 2,000 per year</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Maternity and paternity leave</li><li>Employee Assistance Programme</li><li>Opportunity to travel to new locations to meet colleagues</li><li>Priority Pass, and travel upgrades for long haul company events<br/><br/></li></ul><strong>About Canonical<br/><br/></strong>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004. Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.<br/><br/>Canonical is an equal opportunity employer<br/><br/>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.<br/><br/>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002990905"}