{"jobTitle": "Pricing Strategy & Operations Manager", "company": {"name": "StubHub", "location": "Los Angeles, CA", "industry": "Software Development"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$99,000.00 - $260,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Software Development", "description": "StubHub is on a mission to redefine the live event experience on a global scale. Whether someone is looking to attend their first event or their hundredth, we’re here to delight them all the way from the moment they start looking for a ticket until they step through the gate. The same goes for our sellers. From fans selling a single ticket to the promoters of a worldwide stadium tour, we want StubHub to be the safest, most convenient way to offer a ticket to the millions of fans who browse our platform around the world.<br/><br/>Our Business Development team is looking for a skilled data analyst with experience in dynamic ticket pricing for live events. Our team develops partnerships across the live events value chain with sports teams, leagues, concert promoters, festival organizers, and other rights holders and venues. This person will play a critical role on the team, using historical data and market trends in conjunction with knowledge of consumer behavior, live events, and ticket marketplaces to help StubHub’s partners optimize yield.  <br/><br/><strong>This role can be based out of our Los Angeles, CA, New York, NY or Washington DC, office and has a hybrid (3 in-person days per week) work schedule.<br/><br/></strong>What You'll Do<br/><br/><ul><li>Using in-house and third-party tools to manage and distribute live events tickets in accordance with defined pricing strategies and broader business objectives </li><li>Setting and evaluating ticket pricing and distribution strategies across a range of live event types to maximize yield while managing risk </li><li>Analyzing vast historical datasets to build sophisticated dynamic pricing models </li><li>Monitoring trends in live events, yield, ticket marketplaces, and consumer behavior to inform pricing strategies </li><li>Forecasting changes in yield in response to changes in pricing, supply, demand, distribution channels, or other factors </li><li>Tracking yield performance, defining key metrics, and preparing periodic reports for leadership  </li><li>Collaborating with analytics, engineering, and data science teams to refine pricing and distribution tools<br/><br/><br/></li></ul>What You've Done<br/><br/><ul><li>3+ years of demonstrated work experience pricing and distributing live events tickets via secondary marketplaces</li><li>Advanced quantitative skills, including experience in data analysis, statistics, yield forecasting, and/or modeling </li><li>Ability to read primary and secondary trends in order to make adjustments</li><li>Understanding P&amp;L reporting and this will affect decisions</li><li>Identifying broadcasting strategies to ensure we have the probability to selling to each type of buyer but ensuring not to saturate the market</li><li>Advanced quantitative skills, including experience in data analysis, statistics, yield forecasting, and/or modeling </li><li>Ability to perform quick math and strong problem solving and critical thinking</li><li>Proven track record with being a trusted, reliable team member</li><li>Flexibility of scheduling<br/><br/><br/></li></ul>What We Offer<br/><br/><ul><li>Accelerated Growth Environment: Immerse yourself in an environment designed for swift skill and knowledge enhancement, where you have the autonomy to lead experiments and tests on a massive scale.</li><li>Top Tier Compensation Package: Enjoy a rewarding compensation package that includes enticing stock incentives, aligning with our commitment to recognizing and valuing your contributions.</li><li>Flexible Time Off: Embrace a healthy work-life balance with unlimited Flex Time Off, providing you the flexibility to manage your schedule and recharge as needed.</li><li>Comprehensive Benefits Package: Prioritize your well-being with a comprehensive benefits package, featuring 401k, and premium Health, Vision, and Dental Insurance options.</li><li>Team-Building Events: Engage in vibrant team events that foster camaraderie and collaboration, creating an atmosphere where your professional and personal growth are celebrated.<br/><br/><br/></li></ul>The anticipated gross base annual salary range for this role is $130,475 - $156,400 per year. Actual compensation will vary depending on factors such as a candidate’s qualifications, skills, experience, and competencies. Base annual salary is one component of StubHub’s total compensation and competitive benefits package, which includes equity, 401(k), paid time off, paid parental leave, and comprehensive health benefits.<br/><br/>California Job Applicant Privacy Notice found here<br/><br/><strong>About Us<br/><br/></strong>StubHub is the world’s leading marketplace to buy and sell tickets to any live event, anywhere. Through StubHub in North America and viagogo, our international platform, we service customers in 195 countries in 33 languages and 49 available currencies. With more than 300 million tickets available annually on our platform to events around the world -- from sports to music, comedy to dance, festivals to theater -- StubHub offers the safest, most convenient way to buy or sell tickets to the most memorable live experiences. Come join our team for a front-row seat to the action.<br/><br/><strong>We are an equal opportunity employer and value diversity on our team. We do not discriminate on the basis of race, color, religion, sex, national origin, gender, sexual orientation, age, disability, veteran status, or any other legally protected status.</strong>", "responsibilities": "Using in-house and third-party tools to manage and distribute live events tickets in accordance with defined pricing strategies and broader business objectives \nSetting and evaluating ticket pricing and distribution strategies across a range of live event types to maximize yield while managing risk \nAnalyzing vast historical datasets to build sophisticated dynamic pricing models \nMonitoring trends in live events, yield, ticket marketplaces, and consumer behavior to inform pricing strategies \nForecasting changes in yield in response to changes in pricing, supply, demand, distribution channels, or other factors \nTracking yield performance, defining key metrics, and preparing periodic reports for leadership  \nCollaborating with analytics, engineering, and data science teams to refine pricing and distribution tools", "qualifications": {"required": "3+ years of demonstrated work experience pricing and distributing live events tickets via secondary marketplaces\nAdvanced quantitative skills, including experience in data analysis, statistics, yield forecasting, and/or modeling \nAbility to read primary and secondary trends in order to make adjustments\nUnderstanding P&amp;L reporting and this will affect decisions\nIdentifying broadcasting strategies to ensure we have the probability to selling to each type of buyer but ensuring not to saturate the market\nAdvanced quantitative skills, including experience in data analysis, statistics, yield forecasting, and/or modeling \nAbility to perform quick math and strong problem solving and critical thinking\nProven track record with being a trusted, reliable team member\nFlexibility of scheduling"}, "skills": ["Data Analysis", "Statistics", "Yield Forecasting", "Modeling", "P&L Reporting", "Problem Solving", "Critical Thinking"], "postedDate": "3 days ago", "benefits": "Accelerated Growth Environment: Immerse yourself in an environment designed for swift skill and knowledge enhancement, where you have the autonomy to lead experiments and tests on a massive scale.\nTop Tier Compensation Package: Enjoy a rewarding compensation package that includes enticing stock incentives, aligning with our commitment to recognizing and valuing your contributions.\nFlexible Time Off: Embrace a healthy work-life balance with unlimited Flex Time Off, providing you the flexibility to manage your schedule and recharge as needed.\nComprehensive Benefits Package: Prioritize your well-being with a comprehensive benefits package, featuring 401k, and premium Health, Vision, and Dental Insurance options.\nTeam-Building Events: Engage in vibrant team events that foster camaraderie and collaboration, creating an atmosphere where your professional and personal growth are celebrated.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002898297"}