{"jobTitle": "Sr. Buyer", "company": {"name": "Vaco", "industry": "Consumer Services", "size": "Not specified", "location": "Placentia, CA"}, "location": "Placentia, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$35.00/hr - $40.00/hr", "currency": "USD"}, "jobFunction": "Manufacturing", "industry": "Consumer Services", "description": "Job Summary: Immediate Need, temp to hire! We are seeking an experienced and detail-oriented Senior Buyer to join our client's procurement team. The Senior Buyer will play a critical role in managing procurement activities, including purchasing, inventory control, contract negotiation, and supplier management. The ideal candidate will have a strong understanding of procurement practices, MRP processes, and cost accounting, along with the ability to analyze data and track budget expenses. This role requires excellent communication and interpersonal skills to effectively manage supplier relationships and collaborate with cross-functional teams.", "responsibilities": "Manage the end-to-end procurement process, including purchasing, inventory control, and supplier relationship management. Negotiate contracts and terms with suppliers to ensure cost-effective and timely delivery of materials and services. Develop and maintain strong relationships with suppliers to ensure quality and reliability. Monitor and track budget expenses, ensuring procurement activities align with financial goals. Utilize MRP processes and procurement practices to optimize inventory levels and meet production requirements. Analyze procurement data using intermediate/advanced Excel skills to support decision-making and identify cost-saving opportunities. Work closely with internal teams, including operations and finance, to ensure alignment of procurement strategies with overall business objectives. Maintain and update procurement records and reports using SAP. Communicate effectively with suppliers, internal teams, and management to ensure smooth procurement operations.", "qualifications": {"required": "Bachelor's degree in Materials Management, Procurement, Business Administration, Operations Planning, or a related field. Minimum of seven (7) years of experience in procurement, including purchasing, inventory control, contract negotiation, and supplier management in a manufacturing environment. Strong understanding of MRP processes and procurement practices. Intermediate experience with SAP and proficiency in Excel for data analysis. Excellent communication skills, including listening, speaking, writing, and presentation abilities. Strong interpersonal skills with the ability to build and maintain effective relationships with suppliers and internal teams.", "preferred": "Experience with cost accounting and budget tracking in a manufacturing environment. Certification in procurement or supply chain management is a plus."}, "skills": ["Procurement", "Inventory Control", "Contract Negotiation", "Supplier Management", "MRP Processes", "Data Analysis", "Excel", "SAP"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4002948516"}