{"jobTitle": "Plant Manager", "company": {"name": "Perricone Farms", "location": "Beaumont, CA"}, "location": "Beaumont, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "165,000.00/yr - 190,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Food & Beverages", "description": "<strong>Perricone Juices </strong>(aka Perricone Farms), a leading citrus juice supplier located in Beaumont, CA, is seeking a <strong>Plant Manager</strong> to join our team. The Plant Manager will foster a culture of continuous improvement to keep up with rapid growth. This position provides stable, long-term employment along with a competitive benefits package and bonus opportunities. \n<br/>\n<strong>Pay Rate</strong>: $165,000 - $190,000 annually\n<br/>\n<strong>Shift / Hours: </strong>Mon – Fri; possible weekend work <em>(If needed))</em> \n<br/>\nThe Plant Manager is responsible for leading and coordinating all plant activities concerned with production, packaging and shipping of company product(s). Leads the delivery of key results including Safety, Quality, Cost, Productivity, Customer Delivery and Employee Relations.\n<br/>\n<strong>Essential Duties and Responsibilities</strong> include the following. Other duties may be assigned.\n<ul><li>Leads (through personal efforts and collaboration with others) the production process, schedule, workflow, production methods, and ensures employee safety and workforce utilization.</li><li>Ensures that products are produced in a timely manner and are produced within Perricone quality specifications.</li><li>Leads and establishes effective communication processes amongst all groups.</li><li>Drives improving Safety Culture by bringing Safety Mission to life and striving to achieve an injury free environment.</li><li>Leads the development of operating methods and procedures to eliminate waste and reduce operational costs.</li><li>Establishes and monitors KPIs and uses performance data and experience to align organization and deliver systemic improvements.</li><li>Responsible for production scheduling systems and adjustments to schedules / priorities to improve plant efficiency.</li><li>Ensures a compliance mindset so that all employees adhere to procedures and regulations with emphasis on safety, sanitation, and quality.</li><li>Provides training and guidance at all organizational levels on how to achieve goals in accordance with established company policies.</li><li>Provides employee coaching and development of all employees. Collaborates with Human Resources to ensure continuity in administration of policies and procedures.</li><li>Manages personnel issues in collaboration with direct managers and human resources.</li><li>Accountable for organizational growth and development to include improved accountability, setting expectations and succession planning.</li></ul>\n<br/>\n<strong>Food Safety Requirements/Responsibilities:</strong>\n<ul><li>Comply with all Plant, State and Federal OSHA, EPA, FDA, HACCP, and SQF regulations.</li><li>Ensure all verification activities are conducted to assure finished product complies with food safety and quality specifications.</li><li>Participates in the annual review and regular auditing of the food safety system.</li><li>Supports Quality Director / Manager in the maintenance of Food Safety and Quality system.</li><li>Responsible for Non-GMO SGS Supply Chain Standards.</li></ul>\n<strong>Supervisory Responsibilities:</strong> \n<ul><li>Manages five subordinate supervisors who supervise a total of 60-70 employees in the Maintenance, Shipping, Extraction and Bottling/Packaging departments. Responsible for the overall direction, coordination, and evaluation of these departments.</li><li>Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws. </li><li>Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems.</li></ul>\n<br/>\n<strong>Qualifications: </strong> \n<br/>\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The qualifications listed below reflect the knowledge, skills, and abilities needed for this role. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<ul><li>Hands on understanding of manufacturing / production equipment and systems. A technical or engineering background is a plus.</li><li>10+ years’ experience in Beverage or Food operations. Citrus industry experience is a plus.</li><li>Experienced with MRP, Shop Floor Control and Inventory Management systems.</li><li>Demonstrated track record of success in making data-based decisions that lead to sustainable business improvements. </li><li>Able to present and support effective training programs at many levels in both 1:1 and group settings. </li><li>Able to operate in a non-structured environment while striving to implement processes and systems to run an efficient operation. </li><li>Must be experienced in HACCP system and SQF programs </li><li>Demonstrated experience managing department activities for planning, budgeting to meet business requirements, including managing vendors for supplies and services. </li><li>Have effective leadership, interpersonal and supervisory skills.</li><li>Demonstrated organizational, time management and problem-solving skills.</li><li>Must have strong verbal and written communication skills. Must be fluent in reading, writing, and speaking English. Spanish is a plus.</li><li> Advanced knowledge of Juice processes preferred. </li></ul>\n<strong>Education and/or Experience</strong> \n<ul><li>BA or BS degree in Engineering, Supply Chain or Business Management/Administration and/or 10+ years related experience in roles with increasing responsibility in food / beverage manufacturing environment at a plant manager or large operations level. </li></ul>\n<strong>Language Skills</strong> \n<ul><li>Bilingual in English &amp; Spanish preferred</li><li>Ability to read, analyze, and interpret general business periodicals, professional journals, technical procedures, or governmental regulations. </li><li>Ability to write reports, business correspondence, and procedure manuals. </li><li>Ability to effectively present information and respond to questions from groups of managers, clients, customers, and the general public.</li></ul>\n<strong>Mathematical Skills</strong> \n<ul><li>Ability to calculate figures and amounts such as discounts, interest, commissions, proportions, percentages, area, circumference, and volume. </li><li>Ability to apply concepts of basic algebra and geometry.</li></ul>\n<strong>Reasoning Ability</strong> \n<ul><li>Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists. </li><li>Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form.</li></ul>\n<strong>Computer Skills</strong> \n<ul><li>To perform this job successfully, an individual should have knowledge of Word Processing software including Word, Outlook and Excel. Also, individual should have the ability to navigate Internet as needed.</li></ul>\n<strong>Certificates, Licenses, Registrations</strong> \n<ul><li>None required - Lean, TPM, or CSCP (Certified Supply Chain Professional) certifications are a plus.</li></ul>\n<br/>\n<strong>Physical Demands:</strong>\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this Job, the employee is regularly required to use hands to finger, handle, or feel and talk or hear. The employee is frequently required to stand; walk and taste or smell. The employee is occasionally required to sit; reach with hands and arms; climb or balance and stoop, kneel, crouch, or crawl. The employee must regularly lift and/or move up to 10 pounds, frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus.\n<br/>\n<strong>Work Environment:</strong>\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this Job, the employee is regularly exposed to moving mechanical parts. The employee is frequently exposed to outside weather conditions. The employee is occasionally exposed to high, precarious places, toxic or caustic chemicals and extreme heat. The noise level in the work environment is usually loud.\n<br/>\n \n<em>This job description is not intended, and should not be construed, to be an all-inclusive list of all responsibilities, skills, efforts, or working conditions as associated with a job.</em> <em>While this job description is intended to be an accurate reflection of the job requirements, management reserves the right to modify, add or remove duties from particular jobs and to assign other duties as necessary.</em> ", "responsibilities": "The Plant Manager is responsible for leading and coordinating all plant activities concerned with production, packaging and shipping of company product(s). Leads the delivery of key results including Safety, Quality, Cost, Productivity, Customer Delivery and Employee Relations.", "qualifications": {"required": "Hands on understanding of manufacturing / production equipment and systems. A technical or engineering background is a plus.\n10+ years’ experience in Beverage or Food operations. Citrus industry experience is a plus.\nExperienced with MRP, Shop Floor Control and Inventory Management systems.\nDemonstrated track record of success in making data-based decisions that lead to sustainable business improvements. \nAble to present and support effective training programs at many levels in both 1:1 and group settings. \nAble to operate in a non-structured environment while striving to implement processes and systems to run an efficient operation. \nMust be experienced in HACCP system and SQF programs \nDemonstrated experience managing department activities for planning, budgeting to meet business requirements, including managing vendors for supplies and services. \nHave effective leadership, interpersonal and supervisory skills.\nDemonstrated organizational, time management and problem-solving skills.\nMust have strong verbal and written communication skills. Must be fluent in reading, writing, and speaking English. Spanish is a plus.\n Advanced knowledge of Juice processes preferred. ", "preferred": "BA or BS degree in Engineering, Supply Chain or Business Management/Administration and/or 10+ years related experience in roles with increasing responsibility in food / beverage manufacturing environment at a plant manager or large operations level. \nBilingual in English &amp; Spanish preferred\nLean, TPM, or CSCP (Certified Supply Chain Professional) certifications are a plus."}, "skills": ["MRP", "Shop Floor Control", "Inventory Management", "HACCP", "SQF", "Leadership", "Supervisory", "Communication", "English", "Spanish", "Juice", "Engineering", "Supply Chain", "Business Management", "Lean", "TPM", "CSCP"], "postedDate": "6 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002113391"}