{"jobTitle": "(CAN) Stock Unloader Associate ", "company": {"name": "Walmart Canada", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Retail, Manufacturing, and Retail Groceries", "description": "Position Summary...Working as a Stock Unloader Associate at Walmart Canada is a great way to gain valuable experience in the retail industry. A Stock Unloader Associate provides support with unloading trailers, processing merchandise, and moving pallets to the store floor, while maintaining a safe and clean environment and providing exemplary customer service. If you are looking for an exciting job in customer service or retail, working as a Stock Unloader Associate may be a great fit for you!<br/><br/>What You'll Do...<br/><br/>\n<ul><li> Prepares and resets Receiving Area</li><li> Unloads and sorts general merchandise trailers</li><li> Completes live unloading of all remaining merchandise</li><li> Maintains cold chain for refrigerated and frozen receiving and stocking</li><li> Pulls pallets of merchandise to the salesfloor for overnight processing</li><li> Assisting in stocking the salesfloor as assigned and providing customer service when necessary</li><li> Labels and places overstock merchandise</li><li> Contributes to a safe, clean and hazard free work environment through adherence to Company policy and procedures, including the completion of safety sweep logs and ensuring displays and fixtures are secure<br/><br/></li></ul>‎<br/><br/>Minimum Qualifications...<br/><br/><em><em>Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications. <br/><br/></em></em>Age – 16 or older<br/><br/>Preferred Qualifications...<br/><br/><em><em>Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications. <br/><br/></em></em>Walmart will accommodate the disability-related needs of applicants and associates as required by law.<br/><br/>Primary Location…<br/><br/>161 Route 230 Ouest Unit 400, La Pocatiere, QC G0R 1Z0, Canada<br/><br/>Are you currently a Walmart associate?<br/><br/>Please login to your Workday account and use the Find Jobs report to apply for this job.<br/><br/><ul><li>Find Jobs<br/><br/></li></ul>R-1962372", "postedDate": "5 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002523539"}