{"jobTitle": "Junior Accountant", "company": {"name": "LHH", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$24.00/hr - $28.00/hr", "currency": "USD"}, "jobFunction": "Accounting/Auditing and Finance", "industry": "Entertainment Providers", "description": "<strong>Jr. Accountant (Entry Level)</strong><p><br/></p><p><br/></p><p>We are seeking a Jr. Accounts Receivable &amp; Billing Specialist for a well-established Entertainment company in Beverly Hills. The role supports areas of billing, accounts receivable and communicating past dues to contracted parties within the music department.</p><p><br/></p><p><br/></p><p><strong>As Jr. Accounts Receivable Specialist your job duties will include:</strong></p><p><br/></p><ul><li>Daily processing of payments received by credit card using online software.</li><li>Research and processing of refunds </li><li>Maintain monthly reconciliation of unapplied payments ensuring timely application of fees.</li><li>Research of unknown payments and open credit memos.</li><li>Send emails confirming payments have been received.</li><li>Perform monthly, quarterly, and ad-hoc invoicing.</li><li>Daily processing of payments received by checks, wire transfer and ACH payments using Excel and Oracle Fusion. </li><li>Respond to email request related to billing and accounts receivable. </li><li>Support Service Delivery by completing request received through shared tracker.</li><li>Prepare the bi-monthly aging used of dunning of invoices.</li><li>Send bi-monthly dunning notices to past due accounts based on existing policies &amp; guidelines.</li><li>Prepare Contractual Compliance escalations of past due fees in the Naming Service portal.</li></ul><p><br/></p><p><br/></p><p><strong>You are the perfect person if you have the following skills:</strong></p><ul><li>Bachelor’s degree in Accounting or related field preferred</li><li>6+ months of Accounts Receivable or Billing experience </li><li>Knowledge of Oracle software preferred </li><li>Highly organized team-oriented person who can work independently</li><li>Excellent written and oral communication skills</li><li>Service oriented and proactive in taking the initiative to resolve exceptions or issues as they arise</li><li>Strong attention to detail, analytical and able to determine root cause</li><li>Advanced skills in Microsoft Office, Excel, Word, and Outlook</li></ul><p><br/></p><p>The office is in a very central area next to multiple exciting shops and restaurants. There is also potential to work from home 1-2 days per week. This is a great opportunity for an Accounts Receivable Professional who is excited about growing their accounting career within a stable environment.</p><p><br/></p><p>Benefit offerings include medical, dental, vision, life insurance, short-term disability, additional voluntary benefits, EAP program, commuter benefits and 401K plan. Our program provides employees the flexibility to choose the type of coverage that meets their individual needs. Available paid leave may include Paid Sick Leave, where required by law; any other paid leave required by Federal, State, or local law; and Holiday pay upon meeting eligibility criteria.</p><p><br/></p><p><strong>Equal Opportunity Employer/Veterans/Disabled</strong></p><p>To read our Candidate Privacy Information Statement, which explains how we will use your information, please visit https://www.specialcounsel.com/candidate-privacy</p><p>T<strong>he Company will consider qualified applicants with arrest and conviction records.</strong></p><p></p>", "responsibilities": "Daily processing of payments received by credit card using online software. Research and processing of refunds Maintain monthly reconciliation of unapplied payments ensuring timely application of fees. Research of unknown payments and open credit memos. Send emails confirming payments have been received. Perform monthly, quarterly, and ad-hoc invoicing. Daily processing of payments received by checks, wire transfer and ACH payments using Excel and Oracle Fusion. Respond to email request related to billing and accounts receivable. Support Service Delivery by completing request received through shared tracker. Prepare the bi-monthly aging used of dunning of invoices. Send bi-monthly dunning notices to past due accounts based on existing policies &amp; guidelines. Prepare Contractual Compliance escalations of past due fees in the Naming Service portal.", "qualifications": {"required": "Bachelor’s degree in Accounting or related field preferred 6+ months of Accounts Receivable or Billing experience Knowledge of Oracle software preferred Highly organized team-oriented person who can work independently Excellent written and oral communication skills Service oriented and proactive in taking the initiative to resolve exceptions or issues as they arise Strong attention to detail, analytical and able to determine root cause Advanced skills in Microsoft Office, Excel, Word, and Outlook", "preferred": ""}, "skills": ["Oracle", "Accounts Receivable", "Billing", "Excel", "Microsoft Office", "Communication"], "postedDate": "2 days ago", "benefits": "Benefit offerings include medical, dental, vision, life insurance, short-term disability, additional voluntary benefits, EAP program, commuter benefits and 401K plan. Our program provides employees the flexibility to choose the type of coverage that meets their individual needs. Available paid leave may include Paid Sick Leave, where required by law; any other paid leave required by Federal, State, or local law; and Holiday pay upon meeting eligibility criteria.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002843929"}