{"jobTitle": "Manager, Merchandise Execution", "company": {"name": "Macy's", "location": "Westminster, CA"}, "location": "Westminster, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Marketing and Sales", "industry": "Retail Apparel and Fashion, IT Services and IT Consulting, and Retail", "description": "Bring Your Amazing Self to Work<br/><br/>At Macy's, Inc. we're on a mission to create a brighter future with bold representation for all. This is our Mission Every One. We know that each person here is unique. So we respect and invest in each individual to create growth, pride, and satisfaction. If we are able to bring our whole selves to work, it translates into a more abundant and wider array of ideas and energy for all to benefit from. Our success will be built on amazing colleagues, working together.<br/><br/>Job Overview<br/><br/>The Manager, Style Merchandise Execution ensures that every Macy's store customer enjoys an exceptional shopping experience. They lead a team in ensuring merchandise is presented attractively. Responsible for overseeing all merchandising activities, including product movement, price changes, signage, visual execution, event set-up, and reverse logistics, they bring creativity, visual flair, and trend knowledge to create inspiring fashion displays. They also cultivate a supportive work environment for an inclusive team, using coaching, training, and positive management to motivate and inspire.<br/><br/>What You Will Do<br/><br/><ul><li>Apply your fashion and merchandise execution experience and knowledge to drive sales and profits.</li><li>Implement optimal merchandise execution standards by interpreting seasonal and monthly execution guides and tailoring them to store architecture and product assortment.</li><li>Lead the communication, execution, and training of visual merchandising directives, merchandising standards for each business category, and brand partner requirements to ensure the store floor is customer-ready at all times.</li><li>Create stunning store displays using various resources.</li><li>Strategize on pricing, signage, visual presentation, events, and merchandising.</li><li>Provide strategic support for Own Your Style fixtures, fashion trends, and setups.</li><li>Lead DEI initiatives through mannequin and trend presentations that inspire customers to discover their personal style.</li><li>Document your work with photos to create visual resources that educate and inspire others.</li><li>Train the Manager of Sales &amp; Customer Service on merchandising execution standards and techniques.</li><li>Interview, hire, train, manage, coach, develop, coordinate, evaluate, and discipline direct and indirect reports; establish work strategy; provide insight and decision support; direct and manage the team to meet or exceed performance and behavioral expectations; address and resolve concerns.</li><li>Coach team members in effective merchandising techniques.</li><li>Manage inventory, including receipt flow, placement, and stockroom organization.</li><li>Work a flexible retail schedule, including days, evenings, weekends, and holidays.<br/><br/></li></ul>Skills You Will Need<br/><br/>Fashion and Merchandise Execution: Ability to apply experience and knowledge to drive sales and profits through effective merchandising.<br/><br/>Visual Merchandising: Proficiency in leading the communication, execution, and training of visual merchandising directives to ensure a customer-ready store environment.<br/><br/>Strategic Thinking: Ability to strategize on pricing, signage, visual presentation, events, and overall merchandising to enhance sales and customer experience.<br/><br/>Trend Awareness: Knowledge and support for fashion trends and Own Your Style initiatives to drive customer engagement.<br/><br/>Documentation and Communication: Capability to document work effectively with photos and communicate clear strategies and expectations to the team.<br/><br/>Leadership and Team Development: Proficiency in managing, coaching, developing, and motivating a diverse team to achieve performance goals.<br/><br/>Inventory Management: Skill in managing inventory flow, placement, and organization to optimize store operations.<br/><br/>Effective Communication: Strong skills in communication, writing, and presenting ideas clearly and persuasively.<br/><br/>Sense of Urgency: Understanding of prioritization and urgency in a retail environment.<br/><br/>Team Collaboration: Enthusiasm for working collaboratively with customers and colleagues to achieve store goals.<br/><br/>Technical Proficiency: Competence in using Microsoft suite, computers, and handheld devices for daily operations and communication.<br/><br/>Who You Are<br/><br/><ul><li>Dedicated to fulfilling ideals of diversity, inclusion, and respect that Macy’s aspires to achieve every day in every way.</li><li>Candidates with a High School diploma or equivalent are encouraged to apply. 3-5 years of management experience in retail. </li><li>This position requires heavy lifting, constant moving, standing, and reaching with arms and hands. Involves standing for at least two consecutive hours, lifting at least 30 lbs. stooping, kneeling, crouching, and climbing ladders. May involve reaching above eye level. Requires close vision, color vision, depth perception, and focus adjustment.</li><li>Able to work a flexible schedule, including days, evenings, weekends, and holidays, based on department and company needs.<br/><br/></li></ul>What We Can Offer You<br/><br/><ul><li>An inclusive, challenging, and refreshingly fun work environment</li><li>Competitive pay and benefits rooted in principles of equity</li><li>Performance incentives and annual merit review</li><li>Merchandise discounts</li><li>Health and Wellness Benefits across medical, dental, vision, and additional insurance</li><li>Retirement Savings Plan with 401k match opportunity</li><li>Employee Assistance Program (mental health counseling and legal/financial advice)</li><li>Resources for continuous learning, career growth, and leadership development</li><li>8 paid holidays</li><li>Paid Time Off (first year prorated depending on start date)</li><li>Tuition reimbursement program</li><li>Guild education benefit funds 100% of tuition, books, and fees in designated programs</li><li>Colleague Resource Groups (CRGs) and give-back/volunteer opportunities</li><li>Empowerment and autonomy to perform impactful work with tangible results<br/><br/></li></ul>About Macy’s<br/><br/>Now is an exciting time for a Macy's career as we continue to focus on creating exciting and memorable experiences for every Macy's customer, whether their journey starts online or in the store. Our opportunities in Sales, Merchandise, Operations, Customer Service, Warehouse, Marketing, and other areas let you express your creativity and commitment to excellence, grow your career and make a difference to your Macy's colleagues and customers.<br/><br/>Bring your creativity, energy, and ideas to the Macy's team – Apply Today!<br/><br/>STORES00<br/><br/>This position may be eligible for performance-based incentives/bonuses. Benefits include 401k, medical/vision/dental/life/disability insurance options, PTO accruals, Holidays, and more. Eligibility requirements may apply based on location, job level, classification, and length of employment. Additional benefit details are available at macysJOBS.com.", "responsibilities": "The Manager, Style Merchandise Execution ensures that every Macy's store customer enjoys an exceptional shopping experience. They lead a team in ensuring merchandise is presented attractively. Responsible for overseeing all merchandising activities, including product movement, price changes, signage, visual execution, event set-up, and reverse logistics, they bring creativity, visual flair, and trend knowledge to create inspiring fashion displays. They also cultivate a supportive work environment for an inclusive team, using coaching, training, and positive management to motivate and inspire.", "qualifications": {"required": "Candidates with a High School diploma or equivalent are encouraged to apply. 3-5 years of management experience in retail. ", "preferred": ""}, "skills": ["Fashion", "Merchandise Execution", "Visual Merchandising", "Strategic Thinking", "Trend Awareness", "Documentation", "Communication", "Leadership", "Team Development", "Inventory Management", "Microsoft Suite", "Computers", "Handheld Devices"], "postedDate": "2 days ago", "benefits": "An inclusive, challenging, and refreshingly fun work environment\nCompetitive pay and benefits rooted in principles of equity\nPerformance incentives and annual merit review\nMerchandise discounts\nHealth and Wellness Benefits across medical, dental, vision, and additional insurance\nRetirement Savings Plan with 401k match opportunity\nEmployee Assistance Program (mental health counseling and legal/financial advice)\nResources for continuous learning, career growth, and leadership development\n8 paid holidays\nPaid Time Off (first year prorated depending on start date)\nTuition reimbursement program\nGuild education benefit funds 100% of tuition, books, and fees in designated programs\nColleague Resource Groups (CRGs) and give-back/volunteer opportunities\nEmpowerment and autonomy to perform impactful work with tangible results", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002880179"}