{"jobTitle": "Sales Operations Manager", "company": {"name": "MPLC", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00/yr - $85,000.00/yr", "currency": "USD"}, "jobFunction": "Sales, Strategy/Planning, and Analyst", "industry": "Entertainment Providers, Law Practice, and Software Development", "description": "MPLC is the market leader in non-theatrical licensing. We are on a mission to enable companies to use world-class film and television entertainment while supporting the creative industries and protecting their intellectual property.\n\nAt its simplest, companies around the world use TV and films to help their business. Whether it is gyms trying to create a great environment for their customers or employers making their staff/break rooms a better place to be, hundreds of thousands of companies are showing content in public spaces.\n\nGreat content can only be made if creators are paid fairly for what they produce. So we provide a simple, affordable license to businesses. We then pay royalties from our license to our rights holders; from major Hollywood studios to local TV production companies.\n\nWithout MPLC, these performances would still occur. But they would infringe copyrights and deprive our rightsholders' of the money they are entitled to. Our license enables customers to run their businesses compliantly and with peace of mind.\n\nWe work hard to educate organisations about the importance of respecting copyright, and MPLC is a key player in the entertainment and intellectual property ecosystem.\n\nOur company is on a truly exciting journey. We're investing heavily in our teams, growing fast, making much better use of technology and have ambitious plans. As part of that, we're hiring for a **Sales Operations Manager**. \n\nThis is a hybrid role where we would like someone to come to our office in Ladera Heights, LA two days per week. However we are also open to fully remote applicants from across the US.\n\n**What's the situation?**\n\nA Sales Operations Manager at MPLC is responsible for enhancing the efficiency and effectiveness of our sales department. You will work closely with the sales team, as well as other cross-functional teams, to streamline operations, improve productivity, and drive revenue growth.\n\nThis is a key role that demands a combination of strategic thinking, analytical skills, and a deep understanding of the sales process.\n\nThis is a decision-making role and manager must demonstrate professional and fair problem solving at all times.\n\n**Data Analytics and Reporting:**\n\n* Enhance data analytics capabilities to derive meaningful insights from sales data.\n* Invest in reporting tools and dashboards that offer real-time visibility into key performance indicators (KPIs) and facilitate data-driven decision-making.\n* Use data to identify customer segments and market trends that can drive sales strategies.\n\n**Process Optimization:**\n\n* Analyze current sales processes and identify areas for improvement.\n* Develop and implement strategies to streamline workflows and increase sales efficiency.\n* Monitor key performance indicators (KPIs) and make data-driven recommendations for improvement.\n\n**Manage Technology & Tools:**\n\n* Manage and optimize the utilization of Salesforce, Gong and other tools.\n* Identify and implement new technologies and systems to improve sales operations.\n* Ensure the team is well-versed in using all relevant tools.\n\n**Sales Strategy Development:**\n\n* Collaborate with senior management to develop and implement sales strategies that align with company goals.\n* Assist in the development of sales forecasts, budgets, and quotas.\n* Additional responsibilities or tasks may be assigned as needed.\n\n**You should apply if..**\n\n* You have worked in a high volume, high value sales environment.\n* You have worked in in sales operations, with a focus on strategy development and process optimization\n* You have strong analytical skills and proficiency in data analysis tools.\n* You enjoy collaborating with sales teams and helping them be better at their job.\n* You have worked with CRM systems like Salesforce, Gong and sales technologies.\n* Results-oriented mindset with a commitment to continuous improvement.\n\nWe think MPLC is a great place to be already and it's only going to get more exciting. But we're honest that it might not be for everyone. Here are some things you have a think about:\n\n* We are a fast growing business where we're always looking to improve how we operate and to build a stand out culture. That means we like to try new things and experiment and there is always lots we want to fine tune and improve.\n* Your reporting line will be to our Head of Sales Operations in the UK, but you will be working across multiple time zones, flexibility is key.\n* You'll need to be as comfy in the weeds as you are in the clouds. You'll be rolling up your sleeves to deliver in the morning and then building a compelling strategic plan in the afternoon.\n* You'll be happy working with imperfect information and process gaps. You'll help us fix these.\n* Our business is complex and, at over 30 years old, we have our fair share of history and loose ends. People who are good at navigating this tend to be low ego, have high emotional intelligence and be able to make friends and build relationships quickly.\n\n**Location and Salary**\n\n* 2 days in our Ladera Heights LA office but also open to fully remote applicants from across the US\n* Salary between $80,000 - $85,000\n* We offer private medical and life insurance\n* Discounts and fun stuff and are constantly reviewing our benefits", "responsibilities": "A Sales Operations Manager at MPLC is responsible for enhancing the efficiency and effectiveness of our sales department. You will work closely with the sales team, as well as other cross-functional teams, to streamline operations, improve productivity, and drive revenue growth.\n\nThis is a key role that demands a combination of strategic thinking, analytical skills, and a deep understanding of the sales process.\n\nThis is a decision-making role and manager must demonstrate professional and fair problem solving at all times.\n\n**Data Analytics and Reporting:**\n\n* Enhance data analytics capabilities to derive meaningful insights from sales data.\n* Invest in reporting tools and dashboards that offer real-time visibility into key performance indicators (KPIs) and facilitate data-driven decision-making.\n* Use data to identify customer segments and market trends that can drive sales strategies.\n\n**Process Optimization:**\n\n* Analyze current sales processes and identify areas for improvement.\n* Develop and implement strategies to streamline workflows and increase sales efficiency.\n* Monitor key performance indicators (KPIs) and make data-driven recommendations for improvement.\n\n**Manage Technology & Tools:**\n\n* Manage and optimize the utilization of Salesforce, Gong and other tools.\n* Identify and implement new technologies and systems to improve sales operations.\n* Ensure the team is well-versed in using all relevant tools.\n\n**Sales Strategy Development:**\n\n* Collaborate with senior management to develop and implement sales strategies that align with company goals.\n* Assist in the development of sales forecasts, budgets, and quotas.\n* Additional responsibilities or tasks may be assigned as needed.", "postedDate": "2 days ago", "benefits": "We offer private medical and life insurance\nDiscounts and fun stuff and are constantly reviewing our benefits", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002683502"}