{"jobTitle": "Business Marketing Associate", "company": {"name": "A&Z Marketing", "location": "Whittier, CA"}, "location": "Whittier, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Internet Publishing", "description": "A&Z Marketing in the greater Los Angeles area is looking for a Business Marketing Associate. As our company expands, we are seeking a full-time candidate to help evolve our clients' sales strategy by utilizing our professional knowledge and, more importantly, our extensive experience in business partnerships. Our team of Sales Associates is responsible for vetting client knowledge, including new products, services, and upgrades our customers are eligible for. Our Business Marketing Associates will be tasked with controlling our market territory, managing escalations and promotions, specifying prices, and maintaining relationships with our clients and customers.<br/><br/><strong>What will you be doing as a Business Marketing Associate:<br/><br/></strong><ul><li>Grow our clients' accounts monthly with continuous improvement and increases</li><li>Responsible for customer service, price setting, sales promoting listings, and identifying potential services</li><li>Communicate effectively with customers, fellow employees, and management</li><li>Be knowledgeable and familiar with the surrounding businesses to track competitors' tactics</li><li>Maintain and build positive relationships with vendors, suppliers, and customers</li><li>Utilize our existing sales systems and drive sales overall</li><li>Plan and implement corporate and departmental initiatives, policies, and procedures for our office<br/><br/></li></ul><strong>Preferred Qualifications for our next Business Marketing Associate:<br/><br/></strong><ul><li>Higher education degree, preferably in business administration or a related field, or 1-2 years of experience in a customer service, retail, sales, marketing, or leadership position</li><li>A self-starter with a sense of ownership who is adaptable, resilient, and can work independently in a dynamic and fast-paced environment</li><li>Ability to interact with diverse personalities</li><li>Iscomfortable in a team-oriented environment and enjoys collaborating on client marketing, sales, systems, andmore</li><li>Ability to learn and master proper business protocol and strategy<br/><br/></li></ul>A&amp;Z Marketing is an Equal Opportunity Employer of all qualified individuals. All employment decisions are made without age, race, color, religion, sex, sexual orientation, national origin, disability, military leave or veteran status, genetic information, or other status protected by applicable federal, state, or local law. We are committed to creating an inclusive workplace where we value diversity and unique experiences, backgrounds, and identities.<br/><br/>Powered by JazzHR<br/><br/>zdarfQhqAf<br/><br/>", "postedDate": "1 week ago", "qualifications": {"preferred": "Higher education degree, preferably in business administration or a related field, or 1-2 years of experience in a customer service, retail, sales, marketing, or leadership position, A self-starter with a sense of ownership who is adaptable, resilient, and can work independently in a dynamic and fast-paced environment, Ability to interact with diverse personalities, Iscomfortable in a team-oriented environment and enjoys collaborating on client marketing, sales, systems, andmore, Ability to learn and master proper business protocol and strategy"}, "skills": [], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002203299"}