{"jobTitle": "Director, Vendor Management and Procurement - Hybrid", "company": {"name": "Easterseals Southern California", "industry": "Non-profit Organizations, Mental Health Care, Hospitals and Health Care", "size": "Not specified", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$150,000.00 - $160,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Non-profit Organizations, Mental Health Care, Hospitals and Health Care", "description": "Provides leadership to Easterseals' Vendor Management and Procurement strategy and execution. Oversees the procurement process from sourcing to delivery, ensuring timely and cost-effective acquisition of goods and services while maintaining quality standards. Collaborates with leaders and internal stakeholders across all service lines to ensure that the management of vendors is executed consistently and efficiently. Employ strategies to improve vendor performance and decrease cost and risk within vendor relationships.", "responsibilities": "Ensures the efficiency, effectiveness, compliance, and risk management of vendor relationships within the organization. Oversees the lifecycle of Procurement and Supply, from vendor selection and onboarding to performance evaluation and contract renewal. Evaluates vendor capabilities, and negotiate agreements that align with organizational objectives. Creates, maintains, and leads the delivery of policies, standards, procedures, communication and training strategies to support and sustain Vendor Management. Manages and maintains a centralized repository of vendor questionnaires, contracts, agreements and Business Associate Agreements. Ensures all contracts are properly documented, stored, and managed. Develops and implement procurement strategies to optimize cost savings, operational efficiencies and reduce risk. Identifies and evaluates potential vendors and suppliers based on quality, price, and reliability. Negotiates contracts, agreements and renewals with vendors in conjunction with service lines and business functions to secure favorable terms and conditions. Oversee the procurement process, including requisition, sourcing, purchasing, and delivery. Monitors supplier performance and resolve any issues or disputes that may arise. Collaborates with internal stakeholders to understand their procurement needs and requirements. Leads the process of identifying potential vendors through market research, RFPs, and vendor assessments. Works with Enterprise Risk Management, Enterprise Program Office and Compliance teams to mitigate existing and emerging legal, compliance and financial risks associated with vendor relationships. Identifies areas of potential exposure, develops and aligns vendor management strategies with ESSC’s goals and objectives. Oversees the negotiation of contracts and service level agreements (SLAs) to secure favorable terms and conditions. Manages the onboarding process for new vendors and suppliers, including due diligence, contract execution, and integration with internal systems. Manages contract renewals, amendments, and terminations as necessary. Ensure compliance with contractual terms, regulations, and industry standards. Addresses vendor concerns, escalations, and disputes in a timely and professional manner. Ensures effective oversight of vendor risk and procurement compliance. Provides mitigation options for any vendor-related issues and risks. Serves as lead for monitoring, resolving, and remediating risk incidents including development and execution of corrective action plans. Ensures vendors comply with company policies, ethical standards, and regulatory requirements. Provides training and support to business partners and teams on vendor processes and best practices; develops training materials and conduct workshops as needed. Serve as the primary point of contact for vendor-related issues and inquiries. Stays abreast of market trends, economic factors, and regulatory changes that may impact procurement. Performs any other job-related instructions, as requested, with reasonable accommodation.", "qualifications": {"required": "Bachelor’s degree in business or related field. Master’s degree preferred. Minimum of seven (7) years of experience in managing an enterprise-wide vendor management program or procurement sourcing, with specific knowledge of vendor risk/governance management requirements and operational experience. Experience in healthcare industry or other highly regulated environments.", "preferred": "Certification in vendor management, sourcing, procurement, and/or compliance is a plus."}, "skills": ["Strong understanding of healthcare vendor risk management and compliance requirements", "Excellent communication, negotiation, and relationship-building skills", "Strategic thinker with a record of driving compliance and achieving cost savings through vendor optimization initiatives", "Leadership skills balanced with a willingness to play a 'hands-on' role with key projects", "Strong written, verbal and presentation skills required to effectively communicate vendor strategies at all levels, from administrative to the C-Suite", "Ability to thrive in a fast-paced, dynamic, growing environment", "Strong ability to build relationships cross-functionally and partner with leaders to deliver solutions that meet the business needs", "Strong project management and executive presentation skills", "Ability to manage multiple complex projects and processes to completion", "Ability to deal with ambiguity and effectively manage change", "Proficient in Microsoft Office and vendor management software", "Strong knowledge of vendor and procurement management frameworks, standards, and regulations", "Ability to work with IT vendors and understand intellectual property considerations", "Strong understanding of contract negotiation, vendor risk management, and compliance requirements, including Business Associate requirements"], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4002605759"}