{"jobTitle": "Assistant Project Manager", "company": {"name": "Layton Construction", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "85,000.00/yr - 115,000.00/yr", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Construction", "description": "The Assistant Project Manager assists in the planning, management, and execution of work for assigned construction projects. May be assigned one or more projects at a time. Manages projects to meet quality standards, owner expectations, and profitability. Assesses and responds to customer needs and cultivates customer relationships. Promotes Layton business philosophies and assists in training project personnel.<br/><br/><strong>Duties<br/><br/></strong><ul><li> Champions “The Layton Way” by delivering predictable outcomes for internal teams, external teams, and customers.</li><li> Ensures that “Constructing with Integrity” is delivered by working with honesty, unity, safety, and quality of work.</li><li> Assists in the preparation of estimates, project budgets and unit cost reports.</li><li> Organizes and conducts pre-construction planning meetings.</li><li> Participates in the successful negotiation of project subcontracts.</li><li> Assists the project team in preparing the project management plan and planning the successful execution of the construction contract</li><li> Participates in value engineering services as appropriate.</li><li> Obtains and reviews plans and specifications and determines their completeness and consistency.</li><li> Assists the project owner in obtaining permits and participates in resolving other regulatory requirements as necessary.</li><li> Assists in the preparation of project schedule and develops milestones necessary to successfully complete the project in concert with the Project Superintendent. Participates in project schedule updates as needed.</li><li> Develops the monthly client pay requests and follows up on the collection of billings to ensure funds are collected as per the contract terms &amp; in a timely manner.</li><li> Controls the payment of job and subcontractor costs based on construction progress, document review and approval and coordinates with the job cost accountant for payments and lien releases.</li><li> Participates in monthly job cost reviews to declare project status and increases project profitability and promotes Layton objectives and goals.</li><li> Manages project material and equipment procurement within the project budget constraints and consistent with the project delivery schedule.</li><li> Develops and monitors project quality, safety, and risk management plans.</li><li> Negotiates owner and subcontractor change orders and manages the resulting schedule, cost, and profit impacts.</li><li> Attends, directs as needed, and may take notes for project team meetings, including weekly Owner/Architect meetings and subcontractor and other coordination meetings.</li><li> Coordinates all final close out procedures for the project including as-built drawing, punch lists, final billing, occupancy permit, owner acceptance, project manuals, warranty letters, subcontractor close out, letter of substantial completion, and letter of recommendation.</li><li> Participates in the post completion project review and provides Preconstruction with information for their database.</li><li> Trains and mentors project and field engineers and other team members as needed.</li><li> Manages project engineers to assure project construction compliance through reviewing, submitting, and following up on submittals, Requests for Information, document revisions, and other documentation to avoid delays and additional risk to the project.</li><li> Updates and implements software programs for collaboration, quality, and document management.</li><li> Develops and maintains owner relationships.</li><li> Performs other related duties as assigned.<br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Bachelor’s degree in civil engineering, construction management, or related field, or the equivalent combination of education and experience.</li><li> Minimum of two or more years of commercial construction experience.</li><li> Demonstrates excellent communication skills by expressing ideas clearly and effectively and has strong negotiation skills.</li><li> Understands construction laws and practices; applies building codes and other design requirements correctly and reads blueprints correctly.</li><li> Maintains the Layton standard of ethics, conduct, and organizational policies.</li><li> Excels in problem solving. Finds relationships between data from different sources to formulate alternative solutions.</li><li> Works well with other people; takes time to help co-workers, customers, and others to achieve their goals and assignments.</li><li> Knows how to plan an effective course of action for self and others. Knows how to allocate resources and assign personnel. Uses time efficiently and is well-organized.</li><li> Knows how to manage events to achieve goals. Is a self-starter and works well without close supervision. Has a record of achieving aggressive goals.</li><li> Professional affiliations (e.g. AGC member) and credentials (e.g. PE) preferred.</li><li> Ability to speak basic Spanish commands, questions, and instructions regarding construction preferred.</li><li> Strong computer and technical skills. Ability to learn new software programs quickly and apply them to processes.<br/><br/><br/></li></ul><strong><strong>This position will require require you to commute to the West Los Angeles area. <br/><br/></strong></strong><strong>The full salary range for this position is $85,000 - $115,000. This position is eligible for a target bonus.<br/><br/></strong><strong>Benefits: </strong>The Company offers the following benefits for this position, subject to applicable eligibility requirements: Medical Insurance, Dental Insurance, Vision Insurance, Health Savings Account, Healthcare Flexible Spending Account, Dependent Care Flexible Spending Account, 401(k) retirement plan with employer match, Life &amp; AD&amp;D Insurance, Long-term Disability Insurance, Short-term Disability Insurance, Critical Illness Insurance, Accident Insurance, Hospital Indemnity Insurance, Home &amp; Auto Insurance, Family Support, Pre-tax Paid Parking/Public Transportation, Paid time off, Time Away Benefits, Paid Holidays, Group Legal, Employee Stock Purchase Plan, Identity Theft Protection, Group Legal, Pet Insurance, Employee Assistance Program.<br/><br/><strong> Disclaimer: The salary, other compensation, and benefits information is accurate as of the date of this posting. The Company reserves the right to modify this information at any time, subject to applicable law. <br/><br/></strong><strong>EEO Statement: </strong>Layton Construction an equal opportunity employer.  We evaluate qualified employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics.", "responsibilities": "The Assistant Project Manager assists in the planning, management, and execution of work for assigned construction projects. May be assigned one or more projects at a time. Manages projects to meet quality standards, owner expectations, and profitability. Assesses and responds to customer needs and cultivates customer relationships. Promotes Layton business philosophies and assists in training project personnel.", "qualifications": {"required": "Bachelor’s degree in civil engineering, construction management, or related field, or the equivalent combination of education and experience.\nMinimum of two or more years of commercial construction experience.\nDemonstrates excellent communication skills by expressing ideas clearly and effectively and has strong negotiation skills.\nUnderstands construction laws and practices; applies building codes and other design requirements correctly and reads blueprints correctly.\nMaintains the Layton standard of ethics, conduct, and organizational policies.\nExcels in problem solving. Finds relationships between data from different sources to formulate alternative solutions.\nWorks well with other people; takes time to help co-workers, customers, and others to achieve their goals and assignments.\nKnows how to plan an effective course of action for self and others. Knows how to allocate resources and assign personnel. Uses time efficiently and is well-organized.\nKnows how to manage events to achieve goals. Is a self-starter and works well without close supervision. Has a record of achieving aggressive goals.", "preferred": "Professional affiliations (e.g. AGC member) and credentials (e.g. PE)\nAbility to speak basic Spanish commands, questions, and instructions regarding construction"}, "skills": [], "postedDate": "3 days ago", "benefits": "The Company offers the following benefits for this position, subject to applicable eligibility requirements: Medical Insurance, Dental Insurance, Vision Insurance, Health Savings Account, Healthcare Flexible Spending Account, Dependent Care Flexible Spending Account, 401(k) retirement plan with employer match, Life &amp; AD&amp;D Insurance, Long-term Disability Insurance, Short-term Disability Insurance, Critical Illness Insurance, Accident Insurance, Hospital Indemnity Insurance, Home &amp; Auto Insurance, Family Support, Pre-tax Paid Parking/Public Transportation, Paid time off, Time Away Benefits, Paid Holidays, Group Legal, Employee Stock Purchase Plan, Identity Theft Protection, Group Legal, Pet Insurance, Employee Assistance Program.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4002160227"}