{"jobTitle": "Key Account Manager - Hospital Sales Representative - Infectious Disease - Los Angeles, California", "company": {"name": "RxSalesPros", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales", "industry": "Biotechnology Research and Pharmaceutical Manufacturing", "description": "Melinta Therapeutics is a biopharmaceutical company with strong commercial and medical capabilities dedicated to providing innovative therapies to people impacted by acute and life-threatening illnesses. Melinta’s current portfolio includes seven commercial stage products and one investigational product under review by FDA: BAXDELA® (delafloxacin), KIMYRSA® (oritavancin), MINOCIN® (minocycline) for Injection, ORBACTIV® (oritavancin), REZZAYO™ (rezafungin for injection), TOPROL-XL® (metoprolol succinate), VABOMERE® (meropenem and vaborbactam), and cefepime-taniborbactam. With an unsurpassed commitment to providers and patients, Melinta is dedicated to saving lives threatened by the global public health crisis of infections. We are small but mighty, with an unsurpassed commitment to patients, one another, and the business. We strive to offer a dynamic work environment, in which innovation, teamwork, knowledge and flexibility are valued.\n\nMelinta’s portfolio has the unique ability to offer providers and patients a range of solutions that can meet the tremendous need for treating serious infections. Visit www.melinta.com for more information.\n\n**Job purpose**\nThe Key Account Manager (KAM) position is a hospital-based or integrated sites of care-based position focused on launching and selling innovative products in the assigned institutional accounts, including integrated delivery networks (IDNs) and alternate sites of care for infusion. The role includes educating clinicians on the clinical benefits of Melinta products to facilitate and gain improved institutional formulary access while expanding appropriate product utilization, thru protocol adoption, to exceed business and customer objectives with assigned hospitals and IDNs. The KAM also has accountability for pulling through contracts and facilitating account and clinician access opportunities to ensure achievement of Melinta’s business goals. KAMs are required to follow the hospitalized patient journey and call Long Term Acute Care hospitals and home infusion companies if determined necessary in their territories. Some of the products will require to the KAM to call on infusion centers outside the hospital, open sites of care outside of a hospital for infusion as well as call on customers that refer into those infusion centers. \n\n**Duties and responsibilities**\n<ul><li>Increase product access and sales in the geographical area by navigating the institutional formulary approval process, as well as educating customers on appropriate use of Melinta products</li><li>Secure placement of Melinta’s products on appropriate account protocols and ensure products are in the EMR systems</li><li>Develop relationships with local infusion sites, LTACH’s and home infusion companies </li><li>Develop territory and account-level plans to grow product utilization, formulary access, and expand the customer base</li><li>Understand multiple interdependencies within an account, consider customer treatment goals and needs, and maximize account performance by aligning appropriate solutions, messaging, and stakeholdersEstablish and maintain professional relationships with customer opinion leaders and hospitals, including physicians, medical staff and pharmacies</li><li>Plan, coordinate, and implement hospital-oriented education forums in accordance with company policies and business plans</li><li>Partner with hospital treatment committees to include Melinta products on appropriate disease state protocols</li><li>Facilitate continuity of care for discharging patients via Melinta product inclusion on discharge protocols/orders and alignment of approved Melinta reimbursement resources</li><li>Collaborate and communicate with Sales, Medical Affairs, National Accounts, Marketing, and Sales Administration on all needs, opportunities, Key Opinion Leader touch points, formulary changes and pull-through initiatives</li></ul>\n\n**Qualifications**\n<ul><li>A Bachelor’s degree is required</li><li>Minimum of 7 years of related pharmaceutical sales, marketing and/or training experience</li><li>Minimum of 3 years in an account selling role (selling in a hospital/account ecosystem, for all levels of the account)</li><li>Proven track record of sales within a hospital environment of the assigned territory/accounts</li><li>Recent acute care hospital or integrated sites of care sales experience in the assigned territory/accounts</li><li>Ability to create alternate sites of care in assigned territory</li><li>Understanding of how to sell in a buy and bill market </li><li>Success planning and executing a new product or solution launch into a hospital/account setting</li><li>Buy/Bill and Home Infusion experience preferred</li><li>Preferred hospital experience in Acute Care and/or Infectious Disease</li><li>Highly motivated, self-starter and results driven individual</li><li>Must be able to work well independently and as a team member; under pressure, shifting priorities, and a changing landscape</li><li>Strong project management skills to ensure timelines are met, as well as the ability to prioritize and multitask</li><li>A passion for continuous professional development and learning.</li><li>Ability to work in a matrix environment and to value the importance of teamwork</li><li>Ability to establish and build relationships and rapport with a diverse customer base</li><li>Strong ability to learn and use technical product knowledge. </li><li>Willingness and ability to provide proof of childhood immunizations, a negative TB test and other requirements, as set by each hospital’s credentialing protocol for access</li><li>Valid driver’s license and clean driving record.</li><li>The ability to travel as needed to sustain key relationships within the assigned territory and to attend both conferences and sales meetings.</li></ul>", "postedDate": "3 days ago", "qualifications": {"required": "A Bachelor’s degree is required, Minimum of 7 years of related pharmaceutical sales, marketing and/or training experience, Minimum of 3 years in an account selling role (selling in a hospital/account ecosystem, for all levels of the account), Proven track record of sales within a hospital environment of the assigned territory/accounts, Recent acute care hospital or integrated sites of care sales experience in the assigned territory/accounts, Ability to create alternate sites of care in assigned territory, Understanding of how to sell in a buy and bill market , Success planning and executing a new product or solution launch into a hospital/account setting, Highly motivated, self-starter and results driven individual, Must be able to work well independently and as a team member; under pressure, shifting priorities, and a changing landscape, Strong project management skills to ensure timelines are met, as well as the ability to prioritize and multitask, A passion for continuous professional development and learning., Ability to work in a matrix environment and to value the importance of teamwork, Ability to establish and build relationships and rapport with a diverse customer base, Strong ability to learn and use technical product knowledge., Willingness and ability to provide proof of childhood immunizations, a negative TB test and other requirements, as set by each hospital’s credentialing protocol for access, Valid driver’s license and clean driving record., The ability to travel as needed to sustain key relationships within the assigned territory and to attend both conferences and sales meetings.", "preferred": "Buy/Bill and Home Infusion experience preferred, Preferred hospital experience in Acute Care and/or Infectious Disease"}, "skills": ["Pharmaceutical Sales", "Marketing", "Training", "Account Management", "Hospital Sales", "Product Launch", "Relationship Building", "Project Management", "Teamwork", "Technical Product Knowledge", "Travel"], "url": "https://www.linkedin.com/jobs/view/4002195100"}