{"jobTitle": "Production Supervisor", "company": {"name": "Dairy Farmers of America", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Dairy Product Manufacturing", "description": "<strong>GENERAL PURPOSE<br/><br/></strong>Provide work direction and supervision to production employees within the guidelines of standard work rules, union contract provisions (if applicable), and employment policies. Monitor all stages of the production process and ensure accurate processing of product and/or fulfillment of customer orders through appropriate production scheduling. Hold self and others accountable for promoting safety rules and regulations and act in accordance with the requirements for food safety and quality. Ensure that the production process flows smoothly, and daily production goals are met. Function as a resource and point of escalation to direct reports. Coach, mentor, and provide performance development opportunities to team members on an ongoing basis.<br/><br/><strong>Job Duties And Responsibilities<br/><br/></strong><ul><li> Schedule, assign work, and provide clear direction to production employees. Ensure that the production process flows smoothly, and daily production goals are met</li><li> Monitor operations activities (milk receiving, standardizing, pasteurization, separating, freezing, cooling, filling, mixing, packaging, storing, etc.) to ensure that plant production and quality standards are met</li><li> Monitor the equipment used in production processes to ensure that equipment is functioning efficiently and is properly cleaned and sanitized. Arrange for timely repair/resolution of equipment failures</li><li> Actively promote safe work behaviors and hold self and direct reports accountable for following safety rules and regulations. Conduct accident/injury investigations and send reports of injury to HR in a timely manner to meet rapid reporting standards. May coordinate and/or facilitate plant safety meetings and training</li><li> Understand and fulfill the requirements and regulations for food safety and quality. Administer policies, procedures and programs related to operations</li><li> Supervise production scheduling so appropriate quantities and varieties of product are produced to fill orders, meet demand, meet productivity goals, etc. Ensure materials (e.g., ingredients, packaging) are appropriately staged for next production runs</li><li> Proactively look for ways to increase operational efficiency and contain costs</li><li> Work effectively with employees to promote positive and productive working relationships. Effectively apply work rules, union contract provisions (if applicable), and employment policies. Administer discipline consistently and fairly. Work with Human Resources and plant management to resolve employee grievances</li><li> Actively communicate with employees through shift meetings and informal methods</li><li> Complete supervisory activities such as administering employee promotions and transfers; reviewing and editing employee timekeeping; completing performance evaluations; mentoring, training, and coaching employees</li><li> Maintain safe working conditions for employees and compliance with all company, state and federal regulations regarding health and safety issues</li><li> Follow all DFA good manufacturing practices (GMP) and work in a manner consistent with all company regulatory, food safety, quality, and sanitation requirements</li><li> The requirements herein are intended to describe the general nature and level of work performed by employee, but is not a complete list of responsibilities, duties, and skills required. Other duties may be assigned as required<br/><br/></li></ul><strong>SCHEDULE: </strong>2nd shift, 2:00pm-10:30pm with Mondays and Tuesdays off. <strong>Weekends and holidays required.</strong> Days off may change to cover call offs.<br/><br/><strong>BENEFITS:<br/><br/></strong><ul><li>Health and Welfare benefits begin 1st of the month after start date</li><li>401(k) with company contribution – 100% vested at day one of eligibility</li><li>Competitive pay (up to $80k annual salary) + 5% yearly bonus eligibility </li><li>Paid vacation and holidays</li><li>Career growth opportunities – we promote from within!</li><li>Comprehensive healthcare benefits</li><li>Service recognition and employee rewards</li><li>Employee referral program</li><li>Tuition reimbursement</li><li>Work for dairy farm families<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><ul><li> High school diploma or equivalent</li><li> Undergraduate degree in related curriculum preferred</li><li> 2 to 5 years’ experience in a manufacturing environment, preferably food and/or beverage manufacturing</li><li> Demonstrated leadership aptitude, team lead experience, or supervisory experience</li><li> Certification and/or License – may be required during course of employment<br/><br/></li></ul><strong>Knowledge, Skills, And Abilities<br/><br/></strong><ul><li> Knowledge of manufacturing process flow and importance to process</li><li> Knowledge of continuous improvement models</li><li> Knowledge of and skill with Microsoft Office Suite and company computer systems</li><li> Knowledge of principles and practices of supervision, training, and personnel management</li><li> Able to communicate clearly and effectively, both verbally and in writing</li><li> Able to work in collaboration effectively and foster good teamwork</li><li> Able to interact positively and work effectively with others (interpersonal skills)</li><li> Able to think and use independent judgment in planning and organizing multiple tasks and information</li><li> Able to demonstrate initiative and follow through on day-to-day responsibilities</li><li> Must be able to read, write and speak English<br/><br/></li></ul>An Equal Opportunity Employer", "responsibilities": "Provide work direction and supervision to production employees within the guidelines of standard work rules, union contract provisions (if applicable), and employment policies. Monitor all stages of the production process and ensure accurate processing of product and/or fulfillment of customer orders through appropriate production scheduling. Hold self and others accountable for promoting safety rules and regulations and act in accordance with the requirements for food safety and quality. Ensure that the production process flows smoothly, and daily production goals are met. Function as a resource and point of escalation to direct reports. Coach, mentor, and provide performance development opportunities to team members on an ongoing basis.", "qualifications": {"required": "High school diploma or equivalent, 2 to 5 years’ experience in a manufacturing environment, preferably food and/or beverage manufacturing, Demonstrated leadership aptitude, team lead experience, or supervisory experience", "preferred": "Undergraduate degree in related curriculum, Certification and/or License – may be required during course of employment"}, "skills": ["Microsoft Office Suite", "Continuous Improvement", "Food Safety", "Manufacturing", "Teamwork", "Leadership", "Communication", "Supervision"], "postedDate": "6 days ago", "benefits": "Health and Welfare benefits begin 1st of the month after start date, 401(k) with company contribution – 100% vested at day one of eligibility, Competitive pay (up to $80k annual salary) + 5% yearly bonus eligibility, Paid vacation and holidays, Career growth opportunities – we promote from within!, Comprehensive healthcare benefits, Service recognition and employee rewards, Employee referral program, Tuition reimbursement, Work for dairy farm families", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002344823"}