{"jobTitle": "Merchandise Coordinator", "company": {"name": "TeamPeople", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Media Production", "description": "<strong><strong>Primary Function <br/><br/></strong></strong>The Merchandise Coordinator is responsible for managing the merchandise received from our clients before and after photo shoots, as well as tracking inventory on a regular basis. Additional responsibilities may include generating shot lists and ensuring their accuracy based on merchandise received.<br/><br/><strong><strong> Duties &amp; Responsibilities <br/><br/></strong></strong><ul><li> Oversee the organization and maintenance of large merchandise closets </li><li> Track and maintain all product samples by number, color codes and delivery dates </li><li> Work closely with Producers, Photographers and Stylists to acquire samples/props needed for photo shoots </li><li> Organize and pack, ship, receive samples and other related props and supplies to and from photo shoots </li><li> Organize and maintain the inventory within the sample/prop area </li><li> Provide merchandise status reports as required </li><li> Facilitate the prompt return of all samples/props to place of origin </li><li> Enter and update database for all products received and used in photo shoots </li><li> Excellent verbal and written communication skills <br/><br/><br/></li></ul><strong><strong> Skills &amp; Qualifications <br/><br/></strong></strong><ul><li> Ability to multi-task several projects and prioritize by importance while maintaining a high level of detail and accuracy </li><li> Self-starter with proven ability to both work independently and partner in a team environment </li><li> Computer and data entry skills a must, with proficiency in Microsoft Excel </li><li> Physically able to climb a ladder and lift up to 50 pounds <br/><br/><br/></li></ul><strong><strong> Education &amp; Experience <br/><br/></strong></strong><ul><li> Associate degree </li><li> Minimum of 1 year experience in retail or fashion merchandise management, inventory or related field </li><li> Knowledge of clothing and/or accessory fabrications and maintenance </li><li> Retail experience is beneficial <br/><br/><br/></li></ul><strong><strong> To Apply <br/><br/></strong></strong>Use the link at the bottom of this page to apply. Make sure you are using the latest version of your browser.<br/><br/><strong><strong> Diversity Inclusion &amp; Customer Service Statement <br/><br/></strong></strong>TeamPeople, a division of System One, is an organization dedicated to providing superior customer service. Outstanding customer service encompasses everything from performing the technical, creative and operational aspects of our jobs to the best of our ability, to going the extra mile to assist our customers and colleagues in any way. TeamPeople not only serves as a valued partner for our clients, but we offer eligible employees health and welfare benefits coverage options including medical, dental, vision, spending accounts, life insurance, voluntary plans, as well as participation in a 401(k) plan.<br/><br/>We respect, value and celebrate the unique attributes, characteristics and perspectives that make each person who they are. We also believe that bringing diverse individuals together allows us to collectively and more effectively address the issues that face our customers. It is our aim, therefore, that our partners, strategies and investments reflect these core values. TeamPeople is dedicated to providing superior customer service and is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, age, national origin, disability, family care or medical leave status, genetic information, veteran status, marital status, or any other characteristic protected by applicable federal, state, or local law.", "responsibilities": "The Merchandise Coordinator is responsible for managing the merchandise received from our clients before and after photo shoots, as well as tracking inventory on a regular basis. Additional responsibilities may include generating shot lists and ensuring their accuracy based on merchandise received.", "qualifications": {"required": "Ability to multi-task several projects and prioritize by importance while maintaining a high level of detail and accuracy, Self-starter with proven ability to both work independently and partner in a team environment, Computer and data entry skills a must, with proficiency in Microsoft Excel, Physically able to climb a ladder and lift up to 50 pounds", "preferred": "Associate degree, Minimum of 1 year experience in retail or fashion merchandise management, inventory or related field, Knowledge of clothing and/or accessory fabrications and maintenance, Retail experience is beneficial"}, "skills": ["Microsoft Excel"], "postedDate": "2 days ago", "benefits": "TeamPeople not only serves as a valued partner for our clients, but we offer eligible employees health and welfare benefits coverage options including medical, dental, vision, spending accounts, life insurance, voluntary plans, as well as participation in a 401(k) plan.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4002034594"}