{"jobTitle": "Office Manager", "company": {"name": "Naval Air Systems Command (NAVAIR)", "location": "Orange County, CA"}, "location": "Orange County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "41,132.00/yr - 66,692.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Defense and Space Manufacturing", "description": "<strong>Position Description<br/><br/></strong>This position is a NAWCWD administrative support position located at Point Mugu, California<br/><br/>The incumbent of this position provides office services to an organization of limited organization complexity. It may include several subordinate organization levels but the work is directed primarily through face-to-face meetings. Internal administrative and procedural controls are informal.<br/><br/>OR<br/><br/>The incumbent of this position provides administrative support services of a specialized nature. This may include financial tracking, facilities management support, personnel and manpower management support, personnel or physical security or ADP systems controls. The work may be complicated by a variety of processes or procedural requirements.<br/><br/><strong>MAJOR DUTIES AND RESPONSIBILITES<br/><br/></strong><ul><li>Serves as Office Manager for organization defined above in introduction.</li><li>Implements a variety of administrative processes in support of the work unit, which has essentially singular missions and functions.</li><li>Processes moderately complex administrative documents by researching and applying instructions, policies or procedures of the specialty area.</li><li>Applies knowledge of own office and its functions in order to provide the administrative support services required including: maintaining time and attendance records; typing and/or preparing travel requests, advances and vouchers; requisitioning office supplies, equipment , and publications, and similar office support duties.<br/><br/></li></ul><strong>Position Duties/Responsibilities<br/><br/></strong>N/A<br/><br/><strong>Minimum Salary<br/><br/></strong>41,132<br/><br/><strong>Maximum Salary<br/><br/></strong>66,692", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002431947"}