{"jobTitle": "VP of BRAND", "company": {"name": "EMERGING BLUE", "industry": "Retail Apparel and Fashion", "size": "", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$100,000.00/yr - $200,000.00/yr", "currency": "USD"}, "jobFunction": "Management, Public Relations, and Marketing", "industry": "Retail Apparel and Fashion", "description": "Our client is a fast-growing Gen-Z Fashion Brand, looking for an experienced Brand Manager to join their LA team. If you think you can take our Ultra-Fast growing brand to the next level, If You Know How Gen-Z Thinks And Acts, If you have experience with the Gen-Z fashion industry, If you are passionate and resourceful, If you want to become a part of a team who has built a multi million dollar brand within a few years, and to work closely with management to make this brand better and bigger - WE ARE LOOKING FOR YOU! The VP of BRAND stays on the pulse of relevant industry and cultural conversations and ideates creative ways to elevate brand perception. This position supports the marketing team in the development and execution of key initiatives including brand collaborations and partnerships and special events. The Brand Manager must possess a strategic mindset and a deep understanding of how their work impacts the company’s business goals.", "responsibilities": "Develop and maintain key relationships with potential partners and collaborators, and stay on the top of key trends to ensure we are driving awareness for our brand and uplifting the brand’s perception. Initiate and oversee the execution of brand initiatives including celebrity engagement and potential relations around key selling seasons. Initiate and oversee the execution of regionalized events across all channels of business, with a focus on driving sales and new customer acquisition. Work with CEO to develop messaging and visual execution based on brand strategy. Work closely with corporate and brand communications to refine the global communication strategy into a tactical plan that supports the brand. Lead development of brand partnerships meant to increase awareness and support strategic initiatives. Initiate and oversee the execution of potential brand partnerships, outlining requirements, and interfacing with other brand representatives to develop and execute partnerships. Responsible for managing PR budget, including T&E, events, new launch collateral, etc. Pitch and secure regional editorial coverage (digital + print) including product placement and features for women’s and men’s collections, inclusive of bags, ready-to-wear and footwear. Manage regionalized events across wholesale and retail locations.", "qualifications": {"required": "", "preferred": "7+ years of experience in Brand and marketing, with at least 3 years in a leadership role with Fast Fashion brands. Additional experience in PR - Advantage! Demonstrated success in developing and executing brand strategies that drive brand awareness and sales. Strong expertise in the brand management space Highly organized with the ability to juggle multiple priorities and work in a fast-paced environment Excellent written and verbal communication skills, strong follow-through Deep understanding of popular and emerging social networks & influencers regionally Ability to collaborate with and influence internal and external partners Self-starter with strong initiative, ownership and accountability for business Ability to work efficiently in a high-pressure, fast-paced, deadline-driven environment."}, "skills": [], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4002197090"}