{"jobTitle": "Merchandise Planning Analyst", "company": {"name": "GENTLE MONSTER", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "55,000.00 - 60,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Retail Apparel and Fashion", "description": "Founded in 2011, IICOMBINED has launched the global fashion eyewear brand GENTLE MONSTER, followed by the perfume brand TAMBURINS and the dessert brand NUDAKE. Driven by continuous innovation and challenges, IICOMBINED continues its growth by developing brands that exemplify unparalleled beauty and unpredictable progressions.\n\nGENTLE MONSTER is a global fashion eyewear brand that sets eyewear trends worldwide through its unpredictable and innovative advancements.\n\nWith each annual collection, GENTLE MONSTER unveils distinctive and creative products, delivering brand value through diverse initiatives, including unique spaces and campaigns that embody experimental and sophisticated aesthetics.\n\nTAMBURINS is a perfume brand that explores undefined territories of beauty.\n\nTAMBURINS merges storytelling inspired by scattered scenes of the world with sophisticated and delicate perfumery techniques to capture the essence of true fragrance. TAMBURINS is a brand dedicated to sensory communication beyond customary experience through content that reinterprets various artistic elements, including objects, paintings, and performances, within a narrative-driven, exhibition-style space.\n\nNUDAKE is an F&B brand that redefines dessert culture with its ‘Make New Fantasy’ ethos.\n\nIt creates novel desserts by integrating elements of fashion and art, transporting consumers to a new fantasy. By experimenting with and creating content that diverges from conventional processes and norms, NUDAKE delivers a message to consumers beyond the F&B experience.\n\nABOUT THIS ROLE:\nA Merchandise Planning Analyst collects and interprets data to support business decisions aimed at enhancing performance and achieving goals. Key responsibilities include compiling company data and statistics, creating visual representations like graphs and charts for executive review, and leveraging data analysis to boost productivity.\nA crucial aspect of the role involves ensuring the right products are available through US Gentle Monster channels at the optimal times and quantities. This includes forecasting, planning, and analyzing eyewear sales to maximize sales and optimize inventory efficiency. Additionally, the analyst must stay informed about fashion market trends and current styles to make informed recommendations and ensure the product lineup aligns with market demands and consumer preferences.\n\nRESPONSIBILITIES:\nSales and Inventory Data Analysis\n* Collect and analyze sales data and inventory information to monitor sales trends and inventory turnover.\n* Derive insights from data and adjust inventory and sales strategies accordingly.\nSales Forecasting and Planning\n* Use historical sales data and research on market trends to forecast future sales and develop plans.\n* Set seasonal, monthly, and weekly sales targets and propose strategies to achieve them.\nInventory Management and Optimization\n* Monitor inventory levels and develop plans to maintain optimal inventory.\n* Address inventory shortages and surpluses and take appropriate measures for stock replenishment or reduction.\nFashion Market Understanding and Analysis\n* Analyze current fashion and eyewear industry trends, consumer preferences, and competitor activities to respond to market changes.\n* Identify seasonal patterns, styles, and design trends in the fashion and functional eyewear market and incorporate them into product planning.\nProduct Analysis and Understanding\n* Evaluate the performance of individual eyewear products, including sales.\n* Adjust product strategies based on consumer feedback and sales data for optimization.\nProduct Planning and Strategy Support\n* Provide data analysis to support strategic decision-making for eyewear lineup and planning.\n* Assess performance by product and adjust sales strategies to contribute to revenue growth.\nPrice Analysis\n* Identify and categorize the different product ranges offered by competitors, such as entry-level, mid-range, and premium tiers. Analyze how these tiers are priced and positioned within the market.\n* Develop and recommend pricing strategies based on market analysis and company objectives.\n* Identify the customer segments that each competitor targets with their pricing.\nReport Preparation and Presentation\n* Prepare regular sales reports and analysis results and present them to the executive.\n* Monitor key performance products and analyze results to identify and suggest improvements.\nCollaboration and Communication\n* Maintain regular communication with the in-charge individuals of both offline and online channels to review inventory levels and sales performance.\n* Work closely with e-commerce, marketing, retail, and supply chain teams to align and synchronize overall strategies.\n* Align channel-specific strategies and provide updates on inventory status and sales trends to facilitate efficient operations.\n\nQUALIFICATIONS:\n* Education: Bachelor’s degree or higher in a relevant field\n* Experience: Minimum of 2 years of experience in merchandising, product analysis, or a related field\n* Skills: Proficiency in Excel and data analysis tools/software\n* Abilities: Strong analytical skills, problem-solving abilities, and data-driven decision-making capabilities\n* Other: Detail-oriented and capable of effective teamwork\n* Fashion Market Understanding: Deep understanding of the fashion industry, consumer behavior, and competitor analysis\n* Product Analysis: Experience in analyzing sunglasses product performance, quality assessment, and consumer feedback\n\nREQUIRED:\n* As the headquarter is in Korea, proficiency in Korean is required.\n\nJob Type: Full-time (on-site)\n\nPay: $55,000.00 - $60,000.00 per year\n\nBenefits:\n* 401(k)\n* Dental insurance\n* Health insurance\n* Paid time off\n* Vision insurance\n\nSchedule:\n* 8 hour shift", "responsibilities": "A Merchandise Planning Analyst collects and interprets data to support business decisions aimed at enhancing performance and achieving goals. Key responsibilities include compiling company data and statistics, creating visual representations like graphs and charts for executive review, and leveraging data analysis to boost productivity.\nA crucial aspect of the role involves ensuring the right products are available through US Gentle Monster channels at the optimal times and quantities. This includes forecasting, planning, and analyzing eyewear sales to maximize sales and optimize inventory efficiency. Additionally, the analyst must stay informed about fashion market trends and current styles to make informed recommendations and ensure the product lineup aligns with market demands and consumer preferences.", "qualifications": {"required": "As the headquarter is in Korea, proficiency in Korean is required.", "preferred": "Bachelor’s degree or higher in a relevant field, Minimum of 2 years of experience in merchandising, product analysis, or a related field, Proficiency in Excel and data analysis tools/software, Strong analytical skills, problem-solving abilities, and data-driven decision-making capabilities, Detail-oriented and capable of effective teamwork, Deep understanding of the fashion industry, consumer behavior, and competitor analysis, Experience in analyzing sunglasses product performance, quality assessment, and consumer feedback"}, "skills": ["Excel", "Data Analysis"], "postedDate": "3 days ago", "benefits": "401(k), Dental insurance, Health insurance, Paid time off, Vision insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002189327"}