{"jobTitle": "Communications Sales Assistant", "company": {"name": "Diamond Executives", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "As a trusted business development firm, we have been responsible for the growth and implementation of new telecommunications options within the Orange County region. As our client expands their products and services, we aim to connect the community with the most advanced technology available.<br/><br/>We equip our Communications Sales Assistants with the knowledge and resources necessary to assist our client in making their innovations known and achieving their overall sales, outreach, and customer service goals.<br/><br/>Communications Sales Assistant Responsibilities:<br/><br/><ul><li>Initiate and complete the sales and customer service process by communicating with local consumers</li><li>Utilize client-provided information, devices, and resources to provide proper and knowledgeable service to customers</li><li>Discuss client offerings, promotions, and services with the consumer base to provide practical solutions to their current telecommunications issues</li><li>Collaborate with members of the Communications, Sales, and management teams by attending meetings regarding client expectations, sales process, market testing, and business practices</li><li>Become familiar with telecommunications industry trends, competing firms and their offers, and new products to answer consumer questions and negotiate the best service solutions</li><li>Achieve development goals by measuring and tracking sales metrics, consumer outreach, and market trends and working with upper management<br/><br/></li></ul>A Quality Candidate Will:<br/><br/><ul><li>Have 1-2 years of entry-level experience in customer service, sales, marketing, business, or communications</li><li>Be ready to learn and implement entry-level business training in order to serve the client properly</li><li>Build an understanding of the telecommunications field and continue to check on industry trends</li><li>Have professional and friendly communication skills, both with customers and with team members within the office</li><li>Be reliable in time management to ensure all sales, consumer outreach, and advancement goals are met within the expected time<br/><br/></li></ul>Earning potential: Performance-based with the opportunity to achieve weekly commission in addition to potential bonuses and promotions.<br/><br/>Our team looks forward to welcoming a new member with the drive to help others and succeed within the business.<br/><br/>Powered by JazzHR<br/><br/>9qMpWUPUYz<br/><br/>", "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4002099704"}