{"jobTitle": "Practice Manager - Costa Mesa", "company": {"name": "Modern Animal", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "75,000.00 - 102,500.00", "currency": "USD"}, "jobFunction": "Consulting, Information Technology, and Sales", "industry": "Veterinary Services", "description": "<em>Prefer to watch instead of read? Check out “Inside Modern Animal” for a glimpse into what makes Modern Animal different. <br/><br/></em>With a technology-forward approach and a deep commitment to our people, Modern Animal is building the next generation of general practice veterinary care—one that balances the needs of their teams just as much as pet owners and their animals. Our teams are equipped with the tools, structure and support they need to practice the highest quality of medicine, without compromising on the boundaries between work and life.<br/><br/><strong>What You Can Expect At Modern Animal<br/><br/></strong><ul><li>Warm, modern clinic environments that put you, the client, and the pet at ease</li><li>A 24/7 virtual care team there for our patients as an added layer of support</li><li>A dedicated in-clinic support team empowered to be involved more deeply in care</li><li>A growth oriented organization ever evolving to build a better place for all</li><li>A vibrant, supportive, blame-free culture made up of people who are all here to change veterinary medicine for the better<br/><br/></li></ul><strong>Who We're Looking For In This Role<br/><br/></strong>The manager in this role will work towards building exceptional veterinary care teams, have excellent communication skills, ensure accountability, instill trust and build relationships, develop their team, and thrive in a cross-functional environment.<br/><br/>The Clinic Manager leads onsite and will be responsible for ensuring clinics are operating at optimal utilization through a focus on 1) <em>people</em> - right people in the right roles; 2) <em>development of skills</em> - to build effective teams and a pipeline of talent; 3) <em>scheduling</em> and <em>staff deployment</em> to ensure we're staffed according to our operating plan.<br/><br/>In this role, we are looking for a leader who is passionate about pets and the people who love them, and is excited about coaching and mentoring to help us bring our mission to life as we grow.<br/><br/><strong>What You’ll Be Working On<br/><br/></strong><ul><li>Leading a team of passionate and diverse individuals, empowering the hospital team to deliver an unparalleled client experience both in-clinic and virtually</li><li>Managing individual performance of team members and ensuring accountability with respect to work quality, client satisfaction, teamwork, patient care, and embodying Modern Animal values</li><li>Owning the appointment scheduler, dedicating adequate time to forward-planning and maximizing productivity</li><li>Building effective teams, starting with the hiring process, ensuring an appropriate mix of skills, perspectives, and experience.</li><li>Identifying development opportunities for team, providing regular feedback and accountability to to ensure ongoing growth and skill development resulting in productive clinic operations, placing optimal skillsets across workflows</li><li>Advocating for your team to ensure that they feel heard and their perspective is visible during leadership discussions</li><li>Collaborating with team to create regular meeting agendas, leading and conducting monthly meetings, providing opportunities for team members to present to peers</li><li>Participating in the utilization of innovative technology, evaluation of systems, giving frequent, productive feedback</li><li>Creating and managing staff work schedules, including DVMs, based on operating plan by appointment flow and ensuring clinic utilization by solving for future staffing gaps or developmental/skill gaps</li><li>Approving and monitoring timesheets</li><li>Management of relief coverage</li><li>Aiding in conflict resolution among team members and clients, collaborating with Area Clinic Manager and HR when needed</li><li>Ensuring client escalations are addressed personally or routed to appropriate parties for prompt resolution</li><li>Implementing the Modern Animal cultural vision by encouraging flexible scheduling, self-compassion, and a blame- and judgement-free work environment</li><li>Leading and participating in activities that support the well-being of veterinary practitioners by making the profession both joyful and sustainable</li><li>Ensuring supply levels and resources allow team to function at optimal capacity</li><li>Fostering an environment of continuous learning, improvement and excellence</li><li>Living and modeling the Modern Animal vision by encouraging work/life balance, self-compassion, and a blame- and judgement-free work environment<br/><br/></li></ul><strong>Why You'd Be a Great Fit<br/><br/></strong><ul><li>5+ years of leadership role experience with a passion for people leadership</li><li>Previous veterinary experience preferred but not required</li><li>Creates a feeling of belonging and strong team morale</li><li>Fosters open dialogue and collaboration among the team</li><li>Instills trust and gains confidence of others through honesty, integrity, and authenticity</li><li>Forward thinker who enjoys living curiously</li><li>A collaborative go-getter, willing to roll-up sleeves and be hands-on</li><li>Effective communication skills, utilizing various methods</li><li>Operates with high emotional intelligence and exceptional communication skills<br/><br/></li></ul><strong>What You Can Expect From Us<br/><br/></strong><ul><li>Excellent medical, vision, &amp; dental coverage with various options to choose from</li><li>401k savings plan with a company match</li><li>Flexible time off &amp; paid parental leave</li><li>Free membership to Modern Animal for your pets and discounts on extra services</li><li>Free membership to One Medical for primary care</li><li>Access to behavioral and mental health services through Ginger</li><li>WFH stipends to help you set up your home office while we build out an office</li><li>A collaborative team who has your back and will welcome you as part of our pack<br/><br/></li></ul><em>The job of Clinic Manager at Modern Animal requires regular evening and weekend work, managing direct reports as well as working closely with the shift leads working with clients experiencing emotional distress and/or frustration, and handling uncooperative patients. This position will be based in our Costa Mesa clinic with occasional travel required locally for training and cross functional meetings with our Office Team members.<br/><br/></em><em>The pay range for this position is $75,000 - $102,500 per year; however, base pay offered may vary depending on job-related knowledge, skills, and experience. A sign-on bonus and equity grant units may be provided as part of the compensation package, in addition to a full range of medical, financial, and/or other benefits, dependent on the position offered. This information is provided per the California Pay Transparency Act. Base pay information is based on geographic location.<br/><br/></em>We believe an equitable and inclusive work environment and a diverse, empowered team are key to achieving our mission. We’re not looking for candidates who are “culture fits.” We’re looking for candidates who can expand our culture and challenge business as usual. We strive to foster an environment where all staff can bring their whole selves to work, by their own definition, and we strive to provide all candidates with an equitable and accessible recruitment process.<br/><br/>We provide equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, gender identity or expression, veteran status, or genetics.<br/><br/>In addition to federal law requirements, we comply with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities.<br/><br/>This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.<br/><br/>If we can offer accommodations for you in the recruitment process, or if you have feedback on how to make our recruiting more equitable or accessible, please let us know!", "responsibilities": "The manager in this role will work towards building exceptional veterinary care teams, have excellent communication skills, ensure accountability, instill trust and build relationships, develop their team, and thrive in a cross-functional environment.<br/><br/>The Clinic Manager leads onsite and will be responsible for ensuring clinics are operating at optimal utilization through a focus on 1) <em>people</em> - right people in the right roles; 2) <em>development of skills</em> - to build effective teams and a pipeline of talent; 3) <em>scheduling</em> and <em>staff deployment</em> to ensure we're staffed according to our operating plan.<br/><br/>In this role, we are looking for a leader who is passionate about pets and the people who love them, and is excited about coaching and mentoring to help us bring our mission to life as we grow.<br/><br/><strong>What You’ll Be Working On<br/><br/></strong><ul><li>Leading a team of passionate and diverse individuals, empowering the hospital team to deliver an unparalleled client experience both in-clinic and virtually</li><li>Managing individual performance of team members and ensuring accountability with respect to work quality, client satisfaction, teamwork, patient care, and embodying Modern Animal values</li><li>Owning the appointment scheduler, dedicating adequate time to forward-planning and maximizing productivity</li><li>Building effective teams, starting with the hiring process, ensuring an appropriate mix of skills, perspectives, and experience.</li><li>Identifying development opportunities for team, providing regular feedback and accountability to to ensure ongoing growth and skill development resulting in productive clinic operations, placing optimal skillsets across workflows</li><li>Advocating for your team to ensure that they feel heard and their perspective is visible during leadership discussions</li><li>Collaborating with team to create regular meeting agendas, leading and conducting monthly meetings, providing opportunities for team members to present to peers</li><li>Participating in the utilization of innovative technology, evaluation of systems, giving frequent, productive feedback</li><li>Creating and managing staff work schedules, including DVMs, based on operating plan by appointment flow and ensuring clinic utilization by solving for future staffing gaps or developmental/skill gaps</li><li>Approving and monitoring timesheets</li><li>Management of relief coverage</li><li>Aiding in conflict resolution among team members and clients, collaborating with Area Clinic Manager and HR when needed</li><li>Ensuring client escalations are addressed personally or routed to appropriate parties for prompt resolution</li><li>Implementing the Modern Animal cultural vision by encouraging flexible scheduling, self-compassion, and a blame- and judgement-free work environment</li><li>Leading and participating in activities that support the well-being of veterinary practitioners by making the profession both joyful and sustainable</li><li>Ensuring supply levels and resources allow team to function at optimal capacity</li><li>Fostering an environment of continuous learning, improvement and excellence</li><li>Living and modeling the Modern Animal vision by encouraging work/life balance, self-compassion, and a blame- and judgement-free work environment<br/><br/></li></ul>", "qualifications": {"required": "5+ years of leadership role experience with a passion for people leadership", "preferred": "Previous veterinary experience preferred but not required"}, "skills": ["Leadership", "Team Management", "Communication", "Veterinary", "Client Management", "Scheduling", "Staffing", "Conflict Resolution", "Emotional Intelligence"], "postedDate": "3 days ago", "benefits": "Excellent medical, vision, &amp; dental coverage with various options to choose from\n401k savings plan with a company match\nFlexible time off &amp; paid parental leave\nFree membership to Modern Animal for your pets and discounts on extra services\nFree membership to One Medical for primary care\nAccess to behavioral and mental health services through Ginger\nWFH stipends to help you set up your home office while we build out an office\nA collaborative team who has your back and will welcome you as part of our pack", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003617009"}