{"jobTitle": "Production Supervisor", "company": {"name": "Jobot", "location": "Irwindale, CA"}, "location": "Irwindale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$85,000.00 - $95,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Manufacturing, Machinery Manufacturing, and Computers and Electronics Manufacturing", "description": "Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!<br/><br/>Job details<br/><br/><strong>Production Supervisor - Union Environment, Great Pay, Great Benefits, Long Term Stability!<br/><br/></strong>This Jobot Job is hosted by Jacob Grijalva<br/><br/>Are you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.<br/><br/>Salary $85,000 - $95,000 per year<br/><br/><strong>A Bit About Us<br/><br/></strong>Wire Manufacturing Company - One of the largest in the United States and still growing!<br/><br/>We are looking to hire a Production Supervisor with 2+ years experience in an industrial manufacturing environment!<br/><br/><strong><br/><br/><strong>Why join us?<br/><br/><br/></strong></strong>Medical<br/><br/>Dental<br/><br/>Vision<br/><br/>Paid Vacation<br/><br/>Paid Sick Leave<br/><br/>Paid Holidays<br/><br/>401(k) with company match<br/><br/><strong>Job Details<br/><br/></strong>Job Details<br/><br/>We are seeking a dynamic and experienced Production Supervisor to join our finance team. This is a permanent position where you will be responsible for supervising our production department and ensuring that our machinery, systems, and equipment are functioning at peak efficiency. You will be instrumental in helping us reduce cost and scrap, ensuring the safety of our team, and contributing to our overall operational excellence.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Oversee the day-to-day operations of the production department, ensuring that goals and objectives are met.</li><li> Supervise the operation of machinery, systems, and equipment, ensuring they are functioning optimally and safely.</li><li> Implement strategies to reduce cost and scrap, continually seeking ways to improve efficiency and productivity.</li><li> Train and mentor team members, promoting a culture of continuous learning and improvement.</li><li> Ensure compliance with all safety regulations and protocols, fostering a safe and healthy work environment.</li><li> Coordinate with other departments to ensure smooth operation and effective collaboration.</li><li> Monitor and manage production schedules to meet deadlines and quality standards.</li><li> Regularly inspect equipment and machinery, scheduling maintenance and repairs as needed.</li><li> Lead and participate in meetings and project teams.</li><li> Address any issues or delays in production in a timely and effective manner.</li><li> Foster a positive work environment, promoting teamwork and open communication.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Minimum of 5 years of experience in a production supervision role in the finance industry or a similar field.</li><li> Proven experience with machines, industrial settings, training, production departments, machinery, systems, and equipment.</li><li> Demonstrated ability to reduce cost and scrap in a production environment.</li><li> Strong commitment to safety, with a track record of promoting safe work practices.</li><li> Excellent leadership and team management skills, with the ability to train and mentor team members.</li><li> Strong problem-solving skills, with the ability to address issues promptly and effectively.</li><li> Excellent communication and interpersonal skills, with the ability to work collaboratively with team members at all levels of the organization.</li><li> Strong organizational and planning skills, with the ability to manage multiple priorities and meet deadlines.</li><li> Proficient in the use of computer software applications related to production management.</li><li> Bachelor’s degree in Business Administration, Finance, Industrial Engineering, or a related field is preferred.<br/><br/></li></ul>Interested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.<br/><br/><strong>Want to learn more about this role and Jobot?<br/><br/></strong>Click our Jobot logo and follow our LinkedIn page!<br/><br/>", "responsibilities": "Oversee the day-to-day operations of the production department, ensuring that goals and objectives are met. Supervise the operation of machinery, systems, and equipment, ensuring they are functioning optimally and safely. Implement strategies to reduce cost and scrap, continually seeking ways to improve efficiency and productivity. Train and mentor team members, promoting a culture of continuous learning and improvement. Ensure compliance with all safety regulations and protocols, fostering a safe and healthy work environment. Coordinate with other departments to ensure smooth operation and effective collaboration. Monitor and manage production schedules to meet deadlines and quality standards. Regularly inspect equipment and machinery, scheduling maintenance and repairs as needed. Lead and participate in meetings and project teams. Address any issues or delays in production in a timely and effective manner. Foster a positive work environment, promoting teamwork and open communication.", "qualifications": {"required": "Minimum of 5 years of experience in a production supervision role in the finance industry or a similar field. Proven experience with machines, industrial settings, training, production departments, machinery, systems, and equipment. Demonstrated ability to reduce cost and scrap in a production environment. Strong commitment to safety, with a track record of promoting safe work practices. Excellent leadership and team management skills, with the ability to train and mentor team members. Strong problem-solving skills, with the ability to address issues promptly and effectively. Excellent communication and interpersonal skills, with the ability to work collaboratively with team members at all levels of the organization. Strong organizational and planning skills, with the ability to manage multiple priorities and meet deadlines. Proficient in the use of computer software applications related to production management.", "preferred": "Bachelor’s degree in Business Administration, Finance, Industrial Engineering, or a related field is preferred."}, "skills": [], "postedDate": "3 days ago", "applicationDeadline": "", "benefits": "Medical, Dental, Vision, Paid Vacation, Paid Sick Leave, Paid Holidays, 401(k) with company match", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003500158"}