{"jobTitle": "Freight Forwarding Sales", "company": {"name": "JobsInLogistics.com", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "<strong><strong>Job Description:<br/><br/></strong></strong>Sorry, Visa / sponsorship not available.<br/><br/>Business Development Executive<br/><br/>Freight Forwarding Sales<br/><br/>BGI Worldwide Logistics, Inc. is a leading global provider of transportation and logistics services, specializing in delivering comprehensive supply chain solutions to a diverse range of industries. Established in 1999, BGI has built a reputation for excellence in service, reliability, and customer satisfaction. Headquartered in Signal Hill, California, BGI operates with a global network of partners and agents, ensuring seamless logistics solutions across continents.<br/><br/>The company is led by a team of seasoned industry professionals with extensive experience in global logistics and supply chain management. Our team is our greatest asset, and we invest in their continuous development to maintain a high standard of expertise and customer service. Our collaborative culture fosters innovation, teamwork, and a customer-centric approach in everything we do.<br/><br/><br/><strong><strong>Job Description:<br/><br/></strong></strong>We are seeking an experienced Business Development Executive to expand our presence in the Northeast market. This new position is an excellent opportunity for motivated sales professionals who enjoy and thrive in a flexible, goal-driven environment.<br/><br/>If you are looking for the opportunity to create your own future success with a well-established organization, we d like to hear from you.<br/><br/><ul><li> You will be responsible for developing and acquiring new freight forwarding business (All Modes &amp; Services) in the LA market.</li><li>You will report to senior management.</li><li>Additional responsibilities will include: setting appointments, qualifying, warm and cold calls, pricing, proposal preparation, face to face client presentations, and providing innovative solutions to secure new business. You will also be expected to maintain client relationships through coordination with our operations team at our local Long Beach, and Rancho Dominguez, CA offices and with our global partners.</li><li>Diligent CargoWise system use (CRM), pipeline reporting, and internal communication on sales cycles are key to success in this position.<br/><br/><br/></li></ul><strong><strong>Job Requirements:<br/><br/></strong></strong><ul><ul><li>Proven track record of success in Freight Forwarding Sales</li><li> College degree (preferred, although a high school diploma and proven sales experience may be substituted for a degree)</li><li> Knowledge of greater Northeast regional markets</li><li> Knowledge of Trans-Pacific, European and Latin America trade lanes</li><li> Multimodal sales (Air, Ocean, Import, Export, LCL/FCL, Brokerage FTL/LTL)</li><li> Demonstrated business development and territory management skills.</li><li> Familiarity with computers including programs such as Outlook, Excel, Word, PowerPoint, and CRM systems.</li></ul></ul>", "postedDate": "6 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4003464645"}