{"jobTitle": "Employee Relations Manager", "company": {"name": "UCLA Health", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$92,600-$202,200", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Hospitals and Health Care", "description": "<strong>Description<br/><br/></strong>When you join UCLA Health, you can make a difference in people’s lives every day as you’ll be working at an institution that provides leading-edge care to the people of L.A. and throughout the world. We provide our team members with the environment and support to do amazing work, because each and every one of them plays a vital role in our commitment to care.<br/><br/>Under the direction of the Assistant Director of Employee Relations, you will provide guidance and advice on employee relations matters for staff employees at UCLA Health. You will review disciplinary and other types of employment-related documents/actions (FMLA, Layoffs, work rules, etc.) and work with department HR Reps and senior leadership to ensure proper HR procedures are being practiced.<br/><br/>You will be responsible for policy/contract administration, including interpretation, implementation and management of policies and contracts. You will effectively partner/collaborate with Office of Compliance and Privacy Services, Staff Diversity &amp; Compliance, Title IX, Risk Management, Staff/Faculty Counseling, Audit, Campus HR, Local/General Counsel, UC Office of the President, other UC campuses) to ensure uniform and best practices.<br/><br/>As our Employee Relations Manager, you will represent UCLA Health in work-groups/committees to ensure successful partnerships across departments. You will orient management/leadership on policy and legal compliance, such as FMLA, corrective action, layoffs, performance appraisals; provide policy and protocol guidance, interpretation and training to management and leadership. You will also assist in creating HR process protocols as needed and conduct full investigations and/or assist in the investigation of matters pertaining to Title IX/Sexual Violence Sexual Harassment, Discrimination, Whistle blower complaints, Retaliation complaints, Policy/Law/Regulation compliance and general workplace/HR investigations.<br/><br/>1 of 4 open ER Manager roles<br/><br/>Salary range: $92,600-$202,200 Annually", "postedDate": "4 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4003751524"}