{"jobTitle": "Senior Manager, Post Production Finance", "company": {"name": "The Walt Disney Company", "location": "Burbank, CA", "industry": "Entertainment Providers"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "120,000.00/yr - 165,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Entertainment Providers", "description": "It’s the magic of immersing yourself in a motion picture masterpiece, or a new track from your favorite band, or the spectacle of a live Broadway show. It’s hard to define and even harder to create, but that’s what we do at The Walt Disney Studios. Ours is a culture of innovation, collaboration and creativity. We raise the bar, then step over it, blazing trails through the production and distribution of world-class entertainment around the globe. If you want to help tell compelling, enduring stories through movies, music or stage plays, then we want to hear from you.<br/><br/>Imagine a career with an organization that brings smiles to millions every day. Imagine working with people whose passion for what they do is simply indescribable. We are The Walt Disney Company, live with a rich legacy of innovation, entertainment, and lifelong memories. With our vast array of both businesses and professionals, you’ll have the opportunity to join a team that’s beloved around the world, and to find out how it feels to love what you do. We invite you to discover for yourself why a career with Disney is the opportunity you‘ve been looking for.<br/><br/>Reporting to the VP, Post Production Finance, this position is responsible for providing financial support and developing financial plans to guide Walt Disney Studio Motion Pictures Production, Twentieth Century Studios and Searchlight Pictures. The role requires superior strategic, financial analysis, business development, and team leadership skills.<br/><br/>Responsibilities:<br/><br/><br/><ul><li>Supervises a Senior Production Financial Analyst, Post Production Finance</li><li>Work with Vice President Post Production Finance, Post Production &amp; VFX Executives, Post Supervisors and VFX Producers to prepare post/VFX budgets and cash flows and determine foreign currency needs for assigned shows</li><li>Manages and trains freelance post production accountants</li><li>Work directly with Production Finance Execs to oversee all financial aspects of assigned projects; act as lead in managing lower budget projects</li><li>Work with budgeting department and Studio Executives to prepare Dailies, Post &amp; VFX budgets </li><li>Review weekly Cost Report EFC’s for accuracy, providing coverage of concerns to the Executive Director, Post Production Finance and Production, VFX and Post Production Executives </li><li>Estimates/tracks post production and VFX film costs/potentials/cash flows/incentives</li><li>Ensure all show related information, including EFCs and tax incentive estimates, are accurately reported and maintained in the Production Finance reporting database</li><li>Review production budgets, cash flow, funding requests and weekly closing reports for completeness and accuracy; identify and escalate any anomalies to the Production Finance Executive</li><li>Lead film production audits on location along with other Production Finance team members</li><li>Oversee incentive audits, incentive deliverables, tracking and collection of incentives </li><li>Manage production cash flow reporting, including forecast, actuals and plan, for all feature projects; analyze and review variances and variance explanations for reasonableness</li><li>Manage quarterly studio reporting deliverables, including EFCs, tax credits and trial balances</li><li>Work with the Production Finance Execs and Production Tax team on status and timing of tax incentives, review tax incentive estimates and analyze changes for reasonableness</li><li>Identify process improvement opportunities with focus on driving efficiency, transparency and collaboration across the studio</li><li>Manage special projects and ad-hoc reports as needed<br/><br/><br/></li></ul>Qualifications:<br/><br/><br/><ul><li>Minimum of 6 year of finance and accounting experience with 4 years of direct production finance experience</li><li>Strong experience in Feature Film post-production accounting and finance required </li><li>Bachelors of Science in Finance or Accounting</li><li>Knowledge of union/guild agreements</li><li>Knowledge of domestic and international tax incentives</li><li>Acute attention to detail; ability to effectively review the work of others and develop a system to catch errors</li><li>Ability to anticipate and think ahead</li><li>Advanced problem-solving skills; often can see a simple solution to complex problems</li><li>Team player who maintains a high level of professionalism when working with colleagues and other studio partners</li><li>Strong organizational skills; ability to multi-task, prioritize and manage priority changes</li><li>Passionate about entertainment industry and production finance/accounting</li><li>Experience working with production accounting software, such as PSL, Global Vista and Smart Accounting<br/><br/><br/></li></ul>The hiring range for this position in Burbank, California is $120,000 to $165,000 per year. The base pay actually offered will take into account internal equity and also may vary depending on the candidate’s geographic region, job-related knowledge, skills, and experience among other factors. A bonus and/or long-term incentive units may be provided as part of the compensation package, in addition to the full range of medical, financial, and/or other benefits, dependent on the level and position offered.", "responsibilities": "Supervises a Senior Production Financial Analyst, Post Production Finance\nWork with Vice President Post Production Finance, Post Production & VFX Executives, Post Supervisors and VFX Producers to prepare post/VFX budgets and cash flows and determine foreign currency needs for assigned shows\nManages and trains freelance post production accountants\nWork directly with Production Finance Execs to oversee all financial aspects of assigned projects; act as lead in managing lower budget projects\nWork with budgeting department and Studio Executives to prepare Dailies, Post & VFX budgets \nReview weekly Cost Report EFC’s for accuracy, providing coverage of concerns to the Executive Director, Post Production Finance and Production, VFX and Post Production Executives \nEstimates/tracks post production and VFX film costs/potentials/cash flows/incentives\nEnsure all show related information, including EFCs and tax incentive estimates, are accurately reported and maintained in the Production Finance reporting database\nReview production budgets, cash flow, funding requests and weekly closing reports for completeness and accuracy; identify and escalate any anomalies to the Production Finance Executive\nLead film production audits on location along with other Production Finance team members\nOversee incentive audits, incentive deliverables, tracking and collection of incentives \nManage production cash flow reporting, including forecast, actuals and plan, for all feature projects; analyze and review variances and variance explanations for reasonableness\nManage quarterly studio reporting deliverables, including EFCs, tax credits and trial balances\nWork with the Production Finance Execs and Production Tax team on status and timing of tax incentives, review tax incentive estimates and analyze changes for reasonableness\nIdentify process improvement opportunities with focus on driving efficiency, transparency and collaboration across the studio\nManage special projects and ad-hoc reports as needed", "qualifications": {"required": "Minimum of 6 year of finance and accounting experience with 4 years of direct production finance experience\nStrong experience in Feature Film post-production accounting and finance required \nBachelors of Science in Finance or Accounting\nKnowledge of union/guild agreements\nKnowledge of domestic and international tax incentives\nAcute attention to detail; ability to effectively review the work of others and develop a system to catch errors\nAbility to anticipate and think ahead\nAdvanced problem-solving skills; often can see a simple solution to complex problems\nTeam player who maintains a high level of professionalism when working with colleagues and other studio partners\nStrong organizational skills; ability to multi-task, prioritize and manage priority changes\nPassionate about entertainment industry and production finance/accounting\nExperience working with production accounting software, such as PSL, Global Vista and Smart Accounting"}, "skills": ["Financial Analysis", "Business Development", "Team Leadership", "Post Production Accounting", "Production Finance", "Union/Guild Agreements", "Domestic and International Tax Incentives", "Problem Solving", "Production Accounting Software"], "postedDate": "6 days ago", "benefits": "A bonus and/or long-term incentive units may be provided as part of the compensation package, in addition to the full range of medical, financial, and/or other benefits, dependent on the level and position offered.", "url": "https://www.linkedin.com/jobs/view/4003397609"}