{"jobTitle": "Sales Assistant", "company": {"name": "Runinmaps", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "50,000.00/yr - 60,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "description": "<strong>Job title: Sales Assistant</strong><p><strong> </strong></p><p><strong>About Runinmaps</strong></p><p><strong>At Runinmaps, we are the exclusive sales and marketing partner for Easyflex. As a leading distributor of top-quality plumbing, fire protection, and HVAC products, Easyflex has established a reputation for excellence and innovation in the industry.</strong></p><p>Please visit our website at www.easyflexusa.com for more information</p><p><br/></p><p><strong>Job location:</strong> Santa Ana, CA – Full time </p><p><br/></p><p><strong>Job Summary:</strong></p><p>The Sales Assistant provides essential support to the sales team, helping to ensure smooth operations and effective client interactions. The ideal candidate will be organized, proactive, and customer-focused, assisting with administrative tasks, customer service, and sales activities.</p><p><br/></p><p><strong><u>Administrative Support:</u></strong></p><p>§ Assist with daily administrative tasks such as managing schedules, organizing meetings, and arranging travel.</p><p>§ Prepare and process sales documents, including quotes, invoices, and contracts.</p><p>§ Maintain accurate records of sales activities and customer interactions in the CRM system.</p><p><strong><u>Customer Service:</u></strong></p><p>§ Respond to customer inquiries via phone, email, or in person, providing information and assistance as needed.</p><p>§ Follow up with customers on order status, delivery schedules, and post-sales service.</p><p>§ Handle customer complaints and issues, escalating them to the sales team or manager when necessary.</p><p><strong><u>Sales Support:</u></strong></p><p>§ Assist the sales team in preparing presentations and sales pitches.</p><p>§ Help with the organization and execution of sales events, trade shows, and promotional activities.</p><p>§ Support leads generation efforts by researching potential clients and updating the sales database.</p><p><br/></p><p><strong><u>Coordination and Collaboration:</u></strong></p><p><br/></p><p>§ Coordinate with other departments, such as marketing, logistics, and finance, to ensure seamless sales operations.</p><p>§ Communicate effectively with team members to ensure all sales processes are followed accurately.</p><p>§ Participate in team meetings and provide updates on sales activities and customer feedback.</p><p><strong><u>Qualifications:</u></strong></p><p>§ Bachelor’s degree in business administration, marketing, or a related field is a plus.</p><p>§ Proven experience in a sales support or administrative role.</p><p>§ Proficiency in Microsoft Office 365 and CRM software.</p><p><strong><u>Skills:</u></strong></p><p>§ Communication: Strong verbal and written communication skills.</p><p>§ Organization: Excellent organizational and multitasking abilities.</p><p>§ Attention to Detail: High level of accuracy and attention to detail in all tasks.</p><p>§ Customer Service: Strong customer service skills and a positive attitude.</p><p>§ Team Player: Ability to work collaboratively with a team.</p><ul><li>§ Problem-Solving: Ability to handle unexpected issues and provide effective solutions.</li></ul>", "responsibilities": "The Sales Assistant provides essential support to the sales team, helping to ensure smooth operations and effective client interactions. The ideal candidate will be organized, proactive, and customer-focused, assisting with administrative tasks, customer service, and sales activities.", "qualifications": {"required": "Proven experience in a sales support or administrative role.", "preferred": "Bachelor’s degree in business administration, marketing, or a related field is a plus."}, "skills": ["Communication", "Organization", "Attention to Detail", "Customer Service", "Team Player", "Problem-Solving"], "postedDate": "1 week ago", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003166623"}