{"jobTitle": "Director, Human Resources Business Partners", "company": {"name": "KARL STORZ United States", "location": "El Segundo, CA", "industry": "Medical Equipment Manufacturing"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "164,600.00/yr - $251,600.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Medical Equipment Manufacturing", "description": "Are you a visionary HR leader with a passion for driving organizational excellence? We are seeking an exceptional Director of Human Resources Business Partners to join our dynamic team at our US headquarters in El Segundo, CA. In this pivotal role, you will spearhead the development and execution of innovative HR strategies that align with our business objectives and fuel our growth.\n\nAs the Director, HRBPs, you will collaborate closely with key client groups and senior executives to deeply understand their goals, providing strategic insights and solutions that enhance organizational effectiveness across the full employee lifecycle. Your proven expertise in consultation and influence will empower leaders to align people, processes, and practices with the broader business vision, all while ensuring compliance with the law.\n\nWe’re looking for a leader with strong business acumen and a deep understanding of how strategic HR can drive profitability and overall business success. If you have a passion for making a tangible impact and a track record of success in client-facing roles, we invite you to join us in shaping the future of our organization.\n\nWhat you’ll be doing:\n\n* Lead and mentor a team of HR Business Partners throughout the US, driving strategic workforce planning, succession planning, and employee development to meet organizational goals.\n* Provide strategic consulting on key HR topics, including organizational design, change management, culture, and employee lifecycle management, ensuring alignment with business objectives.\n* Analyze HR metrics and KPIs to identify workforce trends, offering actionable recommendations to leadership for continuous improvement.\n* Facilitate leadership development and organizational change initiatives, addressing root causes of employee and managerial challenges through targeted interventions.\n* Develop and execute company-wide HR programs and initiatives, driving consistent action and delivering results as a key member of the HR leadership team. \n\nWhat you need to be considered for the role:\n\n* 15+ years of professional HR experience, including 6-8 years in an HR Management role, with a strong background in employee relations and consultative business partnering. Experience in specialized HR functions or roles outside of HR is a huge plus.\n* Bachelor’s degree in human resources or a related field required; Master’s degree preferred. Professional HR certifications such as PHR, SPHR, GPHR, SHRM-CP, and/or SHRM-SCP are advantageous.\n* Extensive experience in organizational development and change management, with a demonstrated ability to act as a change agent and drive transformation within a business.\n* Willingness to travel up to 20% \n\nWho we are:\n\nAs a globally independent, family operated MedTech company, we ambitiously think in generations instead of fiscal quarters. At KARL STORZ our 9,000+ global associates pride ourselves on harnessing leading technologies, precise workmanship, and dedicated customer support to support the future of medical technology as we pioneer the way forward. We are setting new standards in precision and safety, from improving diagnosis to enhancing outcomes. We see beyond the limits of traditional medicine. Because it’s not just about the tools we create. It’s about the lives we change. Together, we can do so much more. That’s the power of imagination in action.\n\nEligible Employee Benefits\n\n* Medical / Dental / Vision including a state-of-the-art wellness program and pet insurance, too!\n* 3 weeks vacation, 11 holidays plus paid sick time\n* Up to 8 weeks of 100% paid company parental leave; includes maternal/ paternal leave, adoption, and fostering of a child.\n* 401(k) retirement savings plan providing a match of 60% of the employee’s first 6% contribution (up to IRS limits)\n* Section 125 Flexible Spending Accounts\n* Life, STD, LTD & LTC Insurance\n* We prepay your tuition up to $5,250 per year! - Tuition pre-imbursement\n* Fitness reimbursement of up to $200 annually\n* And much more!\n\nKARL STORZ reserves the right to change or modify the employee’s job description whether orally or in writing, at any time during the employment relationship. Additionally, KARL STORZ, through its supervisors, may require an employee to perform duties outside their normal description within the sole discretion of the supervisor. Employees must comply will all applicable KARL STORZ policies and procedures.", "responsibilities": "Lead and mentor a team of HR Business Partners throughout the US, driving strategic workforce planning, succession planning, and employee development to meet organizational goals.\nProvide strategic consulting on key HR topics, including organizational design, change management, culture, and employee lifecycle management, ensuring alignment with business objectives.\nAnalyze HR metrics and KPIs to identify workforce trends, offering actionable recommendations to leadership for continuous improvement.\nFacilitate leadership development and organizational change initiatives, addressing root causes of employee and managerial challenges through targeted interventions.\nDevelop and execute company-wide HR programs and initiatives, driving consistent action and delivering results as a key member of the HR leadership team.", "qualifications": {"required": "15+ years of professional HR experience, including 6-8 years in an HR Management role, with a strong background in employee relations and consultative business partnering. Experience in specialized HR functions or roles outside of HR is a huge plus.\nBachelor’s degree in human resources or a related field required; Master’s degree preferred. Professional HR certifications such as PHR, SPHR, GPHR, SHRM-CP, and/or SHRM-SCP are advantageous.\nExtensive experience in organizational development and change management, with a demonstrated ability to act as a change agent and drive transformation within a business.\nWillingness to travel up to 20% ", "preferred": ""}, "skills": [], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "Medical / Dental / Vision including a state-of-the-art wellness program and pet insurance, too!\n3 weeks vacation, 11 holidays plus paid sick time\nUp to 8 weeks of 100% paid company parental leave; includes maternal/ paternal leave, adoption, and fostering of a child.\n401(k) retirement savings plan providing a match of 60% of the employee’s first 6% contribution (up to IRS limits)\nSection 125 Flexible Spending Accounts\nLife, STD, LTD & LTC Insurance\nWe prepay your tuition up to $5,250 per year! - Tuition pre-imbursement\nFitness reimbursement of up to $200 annually\nAnd much more!", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4003301087"}