{"jobTitle": "Demand Planner", "company": {"name": "Jobot", "location": "Cypress, CA"}, "location": "Cypress, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$120,000.00 - $140,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Human Resources Services, Technology, Information and Internet, and Hospitals and Health Care", "description": "Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!<br/><br/>Job details<br/><br/><strong>Hybrid Remote Schedule<br/><br/></strong>This Jobot Job is hosted by Ray Bahl<br/><br/>Are you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.<br/><br/>Salary $120,000 - $140,000 per year<br/><br/><strong>A Bit About Us<br/><br/></strong>We are a Global $1B food production and distribution company rapidly growing and expanding our USA Operations. We have a commitment to innovation, passion for excellence, personal ownership, customer centricity, and business ethics. Please apply if you want to be part of a team culture where you can truly foster your career development.<br/><br/><strong><br/><br/><strong>Why join us?<br/><br/><br/></strong></strong><ul><li> Family first culture</li><li> Excellent benefits </li><li> Profits sharing </li><li> Domestics and global career opportunities<br/><br/></li></ul><strong>Job Details<br/><br/></strong>Job Details<br/><br/>We are seeking a dynamic and experienced Demand Planner to join our fast-paced Manufacturing industry team. The ideal candidate will have a proven track record in developing and implementing effective demand planning strategies, cost reduction initiatives and ERP migration projects. This position requires a strong ability to analyze complex data and develop statistical forecast models to improve our business operations. The successful candidate will be responsible for managing all demand planning activities and ensuring that our manufacturing processes align with our business goals.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Develop and implement effective demand planning strategies based on historical sales trends, market trends, seasonality and statistical forecast models.</li><li> Conduct detailed data analysis to identify opportunities for cost reduction and efficiency improvements.</li><li> Lead ERP migration projects, ensuring a smooth transition with minimal disruption to business operations.</li><li> Create statistical and business forecast models to predict future demand patterns and inform strategic business decisions.</li><li> Collaborate with cross-functional teams including sales, marketing, finance and operations to align demand planning strategies with business goals.</li><li> Monitor and report on key performance indicators (KPIs) related to demand planning and inventory management.</li><li> Continuously improve demand planning processes through the implementation of new technologies and methodologies.</li><li> Provide training and support to team members on demand planning tools and techniques.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Bachelor's degree in Supply Chain Management, Business Administration, Statistics, or a related field.</li><li> Minimum of 5 years of experience in a demand planning role within the manufacturing industry.</li><li> Certification in APICS CPIM (Certified in Production and Inventory Management) is required.</li><li> Proven experience in cost reduction and ERP migration projects.</li><li> Strong knowledge of demand forecasting and statistical forecast models.</li><li> Excellent data analysis skills with the ability to interpret complex data and translate it into actionable strategies.</li><li> Strong communication and presentation skills with the ability to clearly convey complex information to a variety of audiences.</li><li> Exceptional problem-solving skills with a proactive approach to identifying and resolving issues.</li><li> Proficient in the use of Microsoft Office Suite and advanced Excel skills.</li><li> Experience with ERP systems and other demand planning tools and software.</li><li> Proven ability to work effectively in a fast-paced, deadline-driven environment.</li><li> Strong team player with the ability to collaborate effectively with cross-functional teams.<br/><br/></li></ul>Interested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.<br/><br/><strong>Want to learn more about this role and Jobot?<br/><br/></strong>Click our Jobot logo and follow our LinkedIn page!<br/><br/>", "responsibilities": "Develop and implement effective demand planning strategies based on historical sales trends, market trends, seasonality and statistical forecast models. Conduct detailed data analysis to identify opportunities for cost reduction and efficiency improvements. Lead ERP migration projects, ensuring a smooth transition with minimal disruption to business operations. Create statistical and business forecast models to predict future demand patterns and inform strategic business decisions. Collaborate with cross-functional teams including sales, marketing, finance and operations to align demand planning strategies with business goals. Monitor and report on key performance indicators (KPIs) related to demand planning and inventory management. Continuously improve demand planning processes through the implementation of new technologies and methodologies. Provide training and support to team members on demand planning tools and techniques.", "qualifications": {"required": "Bachelor's degree in Supply Chain Management, Business Administration, Statistics, or a related field. Minimum of 5 years of experience in a demand planning role within the manufacturing industry. Certification in APICS CPIM (Certified in Production and Inventory Management) is required. Proven experience in cost reduction and ERP migration projects. Strong knowledge of demand forecasting and statistical forecast models. Excellent data analysis skills with the ability to interpret complex data and translate it into actionable strategies. Strong communication and presentation skills with the ability to clearly convey complex information to a variety of audiences. Exceptional problem-solving skills with a proactive approach to identifying and resolving issues. Proficient in the use of Microsoft Office Suite and advanced Excel skills. Experience with ERP systems and other demand planning tools and software. Proven ability to work effectively in a fast-paced, deadline-driven environment. Strong team player with the ability to collaborate effectively with cross-functional teams.", "preferred": ""}, "skills": ["Demand Planning", "ERP", "Data Analysis", "Supply Chain Management", "Forecasting", "Cost Reduction", "Project Management", "Communication", "Presentation Skills", "Problem Solving", "Microsoft Office", "Excel", "Teamwork"], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "Family first culture, Excellent benefits, Profits sharing, Domestics and global career opportunities", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4003293914"}