{"jobTitle": "Madrid ESL Program Coordinator", "company": {"name": "Canterbury English", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Education and Training", "industry": "Higher Education", "description": "# Explore an Exciting Opportunity to Live and Work in Madrid<br/><br/>## Overview<br/><br/>Are you ready to broaden your horizons and immerse yourself in a vibrant new culture while teaching English? Our Madrid Lifestyle &amp; TEFL Programs offer an unique approach to living and working in Spain, designed for individuals from a variety of backgrounds.<br/><br/>## Who Should Consider This Program?<br/><br/><ul><li> **Recent College Graduates**: Take a break before pursuing further education or starting your professional career.</li><li> **Career Changers**: If you're ready to transition out of the corporate world into a fulfilling new role.</li><li> **Current English Teachers**: Whether you have a TEFL or CELTA certificate, there's a place for you.</li><li> **Recent High School Graduates**: If you're 18 and eager to start your journey as an ESL teacher.</li><li> **Retirees**: Embrace a new adventure in your semi-retirement.</li><li> **Independent Professionals**: If you're economically self-sufficient and excited about living abroad.</li><li> **Remote Workers**: Those with a flexible job can balance work with the thrill of life in Madrid.<br/><br/></li></ul>## What to Expect<br/><br/><ul><li> **Cultural Experience**: Enjoy the Mediterranean lifestyle, discover a romance language, and meet new people.</li><li> **Vibrant City Life**: Madrid is known for its low cost of living, exceptional transportation, rich history, cultural diversity, and renowned nightlife.</li><li> **Supportive Community**: From social events to familiar faces, you'll find camaraderie among fellow expats.<br/><br/></li></ul>## Program Details<br/><br/><ul><li>Duration**: One Year</li><li>Visa**: Enjoy the security of a One-Year Student Visa, allowing you to work up to 30 hours a week, with an impressive pay rate.</li><li>Curriculum**:</li><li> 20 hours per week of Spanish language study through an Instituto Cervantes accredited program.</li><li> A 120-hour, four-week TEFL course accredited by College of Teachers.</li><li>Job Placement**:</li><li> After completing the TEFL program, you'll start teaching English while receiving support in finding additional job opportunities in partner English schools throughout Madrid.</li><li> Access potential summer teaching positions for added income.<br/><br/></li></ul>## Program Costs<br/><br/><ul><li> **One Year Study Abroad with TEFL &amp; Spanish**: 2,780€</li><li> **Madrid Lifestyle Program with Spanish for TEFL Holders**: 1,970€<br/><br/></li></ul>### Included in the Programs:<br/><br/><ul><li> One-Year Student Visa for legal living and working in Spain.</li><li> Ten-month, 20-hour per week Spanish program.</li><li> Guaranteed employment with our English academy and additional opportunities with partner schools.</li><li> Activities through the Garcia Lorca Spanish School Adventure Club, enhancing your cultural engagement and social life.</li><li> Exceptional value with future tuition-free years.<br/><br/></li></ul>## Join the Community<br/><br/>Take the next step towards making your dream of living and working in Spain a reality. Engage with a vibrant community, enhance your professional skills, and embrace a lifestyle that balances work and adventure.<br/><br/>Explore the possibilities today!<br/><br/>Employment Type: Full-Time", "postedDate": "5 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4003069712"}