{"jobTitle": "Senior Event Producer", "company": {"name": "CyberCoders", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$85,000.00/yr - $100,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "<strong>Title:</strong> Senior Event Producer<br/><br/><strong>Location:</strong> North Hollywood (ONSITE) Monday - Thursday with WFH on Fridays<br/><br/><strong>Salary: </strong>Up to $100k + bonus, benefits, etc.<br/><br/>As a Senior Event Producer, you are a part of the Event Production Department. You are key in helping deliver our promise of providing a truly immersive and memorable event experience, whether virtual or in-person live events.<br/><br/>You are responsible for working on all aspects of event production including logistics, scheduling, and budgeting. You will also be responsible for the production of specific events.<br/><br/>You understand the current trends in the event industry and stay on top of those to help keep our offerings fresh and exciting to clients.<br/><br/>You're an organized, levelheaded team leader and planner with expertise in the production of B2B and B2C events, exhibits, and experiences.<br/><br/>You are a proactive thinker and doer, and are great at coordinating and bringing various individuals and teams together to ensure an event's success.<br/><br/>Most importantly, you are a hands-on team player who is excited about participating in your own growth and experience within the company and its position as a leader in the event industry.<br/><br/><strong>The Role And Essential Functions<br/><br/></strong><ul><li>Manage an event team to ensure all event creative and materials are delivered on time and within budget to clients. </li><li>Work closely with the art department and sales team to develop event concepts and themes that align with client goals and objectives.</li><li>Attend client meetings and presentations as needed.</li><li>Collaborate with necessary suppliers to source support materials as needed to ensure that budget parameters are met. </li><li>Stay up to date with industry trends and best practices to ensure that all events are innovative and cutting-edge.</li><li>Flexibility to work outside of normal business hours, including evenings and weekends when necessary. <br/><br/></li></ul><strong>Primary Job Duties<br/><br/></strong><strong>PRE-PRODUCTION<br/><br/></strong><ul><li>Help manage the research, creation, and format of proposals.</li><li>Must work quickly, efficiently, and thoroughly to ensure that all production deadlines are met.</li><li>Collaborate with creative team to develop event design. </li><li>Participate in site inspections.</li><li>Be available to client and answer any questions they may have.</li><li>Make travel plans and team hotel arrangements.</li><li>Act as Communications Lead with client and ensure the account executive and Director of Production are in the loop on project status.</li><li>Research and negotiate vendor services and pricing. </li><li>Create and maintain budget and target P&amp;L.</li><li>Work with graphics department to develop event venue layouts.</li><li>Use MONDAY project management software to build task lists and manage duties.</li><li>Create and maintain contact list, production schedule, accounting forms, and all other necessary job documents.</li><li>Request contracts/invoices from vendors. Complete and submit check requests for payment. </li><li>Obtain samples (linens, drawings, etc.) as needed and send to client for approval.</li><li>Prior to event, distribute production schedule, vendor memo, and any other required documents to all involved parties.</li><li>Make any shipping arrangements, if needed.</li><li>Procure permits and approvals as needed for venue, city, state officials.</li><li>Manage event payables and receivables.</li><li>Work with design and AV teams to manage virtual events.<br/><br/></li></ul><strong>ON-SITE<br/><br/></strong><ul><li>Act as point-of-contact for client, venue, and vendors.</li><li>Supervise load-in/load-out.</li><li>Distribute elements such as linens, florals, etc., and assist hands-on with setup.</li><li>Manage production schedule and make sure that everything is done in a timely manner.</li><li>Monitor event and assist client. </li><li>Troubleshoot any issues that arise.<br/><br/></li></ul><strong>POST-PRODUCTION<br/><br/></strong><ul><li>Review all final invoices with accounting department. Request any outstanding invoices from vendors and submit check requests.</li><li>Submit any additional costs or credits that need to go on client final billing.</li><li>Reconcile final job summary worksheet and close file.</li><li>Write \"Thank You\" letters in conjunction with Account Executive.<br/><br/></li></ul><strong>Additional Administrative Duties<br/><br/></strong><ul><li>This position is responsible for training new hires in the processes, procedures, and production systems. Additionally, this position ensures that all new hires have a strong understanding of our Production Training Manual.<br/><br/></li></ul><strong>The Requirements For Success<br/><br/></strong><strong> Required Education, Experience and Abilities<br/><br/></strong><ul><li>Bachelor's degree preferred within the hospitality industry or related field. </li><li>5+ years of experience in production and project management, preferably in the events industry.</li><li>Strong communicator with an ability to share ideas across the organization and with senior-level executives. </li><li>Ability to work well in a fast-paced environment and manage multiple projects simultaneously.</li><li>Ability to multi-task and streamline processes and procedures and projects.</li><li>Ability to demonstrate exceptional resilience and composure while consistently meeting challenging deadlines.</li><li>Ability to work extended hours as required without compromising quality of work or losing focus.<br/><br/></li></ul><strong>Preferred Skill Sets<br/><br/></strong><ul><li>Proficiency with MS Office Suite (Excel, Word, Outlook, PowerPoint) and Adobe Creative Cloud (Illustrator, PhotoShop) are a plus. </li><li>Experience with room layout software such as Room Viewer.</li><li>Familiarity with MONDAY project management software.</li><li>Exceptional organizational and customer service skills. </li><li>Proficiency in conducting comprehensive and efficient internet research and ability to present findings clearly and concisely.</li><li>Exceptional written and verbal communication skills.</li><li>Self-starter, self-motivated and solutions-oriented. <br/><br/></li></ul><strong>Competencies/Traits<br/><br/></strong><ul><li>Organized and structured.</li><li>Detail oriented.</li><li>Sense of high standards.</li><li>Hardworking and dedicated.</li><li>The ideal candidate will have great project management skills, people skills, active listening and communication skills, and the ability to function in a high-pressure and fast-paced environment.</li><li>Meet high-pressure deadlines.<br/><br/></li></ul><strong>The \"Fine Print\" <br/><br/></strong><ul><li>This position reports to the Director of Production for the company.</li><li>This is a full-time position. Days and hours are generally Monday through Friday, 9:00am to 5:00pm. Evening and weekend work may be required as job duties demand.</li><li>This position is salaried and exempt under the FLSA.</li><li>Reasonable accommodations may be made to enable individuals with disabilities to perform essential functions/</li><li>This position supervises a team of people including event producers and freelancers. Scope of supervisory responsibilities includes directing, planning, distributing work to junior staff, and evaluating employees' efficiency and productivity.</li><li>This position operates in a professional office environment, and uses standard office equipment such as computers, phones, printers and filing or storage cabinets.<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Full benefits covered for by company</li><li>Work from home on Fridays</li><li>Flex time when working events</li><li>Yearly company retreat</li><li>Growth opportunity</li><li>Great company culture<br/><br/></li></ul><strong>Email Your Resume In Word To<br/><br/></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br/><br/>jen.dorand@cybercoders.com<br/><br/><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : JF12-1816198 -- in the email subject line for your application to be considered.***<br/><br/></li></ul>Jen Dorand - Sr. Executive Recruiter<br/><br/>Applicants must be authorized to work in the U.S.<br/><br/><strong>CyberCoders is proud to be an Equal Opportunity Employer<br/><br/></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity or expression, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, status as a crime victim, disability, protected veteran status, or any other characteristic protected by law. CyberCoders will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. CyberCoders is committed to working with and providing reasonable accommodation to individuals with physical and mental disabilities. If you need special assistance or an accommodation while seeking employment, please contact a member of our Human Resources team to make arrangements.<br/><br/>", "responsibilities": "As a Senior Event Producer, you are a part of the Event Production Department. You are key in helping deliver our promise of providing a truly immersive and memorable event experience, whether virtual or in-person live events.<br/><br/>You are responsible for working on all aspects of event production including logistics, scheduling, and budgeting. You will also be responsible for the production of specific events.<br/><br/>You understand the current trends in the event industry and stay on top of those to help keep our offerings fresh and exciting to clients.<br/><br/>You're an organized, levelheaded team leader and planner with expertise in the production of B2B and B2C events, exhibits, and experiences.<br/><br/>You are a proactive thinker and doer, and are great at coordinating and bringing various individuals and teams together to ensure an event's success.<br/><br/>Most importantly, you are a hands-on team player who is excited about participating in your own growth and experience within the company and its position as a leader in the event industry.", "qualifications": {"required": "Bachelor's degree preferred within the hospitality industry or related field. \n5+ years of experience in production and project management, preferably in the events industry.\nStrong communicator with an ability to share ideas across the organization and with senior-level executives. \nAbility to work well in a fast-paced environment and manage multiple projects simultaneously.\nAbility to multi-task and streamline processes and procedures and projects.\nAbility to demonstrate exceptional resilience and composure while consistently meeting challenging deadlines.\nAbility to work extended hours as required without compromising quality of work or losing focus.", "preferred": "Proficiency with MS Office Suite (Excel, Word, Outlook, PowerPoint) and Adobe Creative Cloud (Illustrator, PhotoShop) are a plus. \nExperience with room layout software such as Room Viewer.\nFamiliarity with MONDAY project management software.\nExceptional organizational and customer service skills. \nProficiency in conducting comprehensive and efficient internet research and ability to present findings clearly and concisely.\nExceptional written and verbal communication skills.\nSelf-starter, self-motivated and solutions-oriented."}, "skills": ["Project Management", "Event Production", "Communication", "Team Leadership", "Budgeting", "Logistics", "Scheduling", "B2B Events", "B2C Events", "Exhibits", "Experiences", "Proactive Thinking", "Coordination", "Teamwork", "Growth Mindset", "MS Office Suite", "Adobe Creative Cloud", "Room Layout Software", "MONDAY Project Management Software", "Organizational Skills", "Customer Service", "Internet Research", "Written Communication", "Verbal Communication", "Self-Motivation", "Solutions-Oriented"], "postedDate": "5 days ago", "benefits": "Full benefits covered for by company\nWork from home on Fridays\nFlex time when working events\nYearly company retreat\nGrowth opportunity\nGreat company culture", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003657120"}