{"jobTitle": "Sr. Merchant Manager, Amazon Home", "company": {"name": "Amazon", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Information Technology", "industry": "Software Development", "description": "Amazon is looking for talented, customer-obsessed Senior Product Manager to help shape the future of our 3rd party marketplace. The Sr. PM role offers the unique opportunity to own a sizable portion of a fast-growing category P&amp;L while also driving large scale, high visibility projects across a variety of internal teams.<br/><br/>The ideal candidate will be highly organized and have a demonstrated track record of successful project management/ownership, juggling multiple projects with competing deadlines, and using data to identify and prioritize opportunities. They will be analytical, enthusiastic, self-motivated, detail-oriented, customer-focused, and have strong communication skills with the ability to handle ambiguity and influence employees at all levels of the organization.<br/><br/>Key job responsibilities<br/><br/>The Sr. PM will have several key responsibilities within the 3rd party Marketplace side of the business, including:<br/><br/><ul><li> Category strategy and ownership: Work closely with Leadership on planning and business strategy, drive best-in-class customer experience and maximize unit and GMS growth through timely analysis and action.</li><li> Business Development: You will work closely with Marketplace teams to help recruit strategic sellers and drive sales in new categories.</li><li> Seller management: Identify and lead new Seller partnerships, manage large Sellers and enhance overall Seller experience with better self-service and reporting resources.</li><li> Project management: Lead a variety of projects that impact both Home &amp; Kitchen and the broader US business.</li><li> Customer Experience: Innovate with our sellers to drive optimal customer experience across the business.<br/><br/></li></ul>A day in the life<br/><br/><strong>A Successful Sr. PM Must Be Able To<br/><br/></strong><ul><li> Act as the ‘business owner’ for their categories, possessing a complete understanding of internal and external variables that impact our business (this entails owning forecasting, monitoring, understanding and reporting on the category, along with responsibility for driving strategic projects to achieve business objectives)</li><li> Have a complete understanding of customer needs, both existing and potential, and use that knowledge to deliver site features that provide Amazon customers with an unparalleled shopping experience</li><li> Create business plans for new opportunities and develop and execute project plans for the launch of new features, incorporating merchandising and pricing strategies</li><li> Coordinate cross-functional teams, and communicate with internal and external stakeholders, while meeting tight deadlines for high visibility projects</li><li> Conduct financial analysis of business opportunities to meet and exceed revenue and profitability targets. Identify the right referral fee for different category segments to maximize topline growth<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> 5+ years of product or program management, product marketing, business development or technology experience</li><li> Bachelor's degree or equivalent</li><li> Experience owning/driving roadmap strategy and definition</li><li> Experience with end to end product delivery</li><li> Experience with feature delivery and tradeoffs of a product</li><li> Experience as a product manager or owner</li><li> Experience owning technology products<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Experience in influencing senior leadership through data driven insights</li><li> Experience working across functional teams and senior stakeholders<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $124,500/year in our lowest geographic market up to $206,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2736281", "salary": {"amount": "124,500.00/year - 206,000.00/year", "currency": "USD"}, "skills": ["Project Management", "Business Development", "Product Management", "Customer Experience", "Data Analysis", "Communication", "Leadership", "Strategy", "Financial Analysis", "Merchandising", "Pricing", "Cross-functional Teams", "Stakeholder Management", "Technology", "Product Marketing"], "postedDate": "5 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003196794"}