{"jobTitle": "Patient Services Representative - Venice (evening shift)", "company": {"name": "UCLA Health", "industry": "Hospitals and Health Care", "size": "501-1000 employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$25.60 - $36.33", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "Venice Family Clinic is a leader in providing comprehensive, high-quality primary health care to people in need with compassion, dignity and respect. In November 2021, Venice Family Clinic merged with South Bay Family Health Care, uniting more than a century of experience helping patients regardless of their income, insurance or immigration status. The organization now has more than 500 staff who serve 45,000 people from the Santa Monica Mountains through the South Bay. We have 17 locations plus two mobile clinics and an expansive street medicine program for people experiencing homelessness. Read more about us at: venicefamilyclinic.org\n\nThe Patient Service Representative\n\n- Provides customer service oriented administrative support to patients, staff, and clinicians.\n- Completes patient registration, including demographics and payer/insurance information.\n- Schedules and coordinates new and follow up patient appointments and cancellations.\n- Checks in and checks out patients, ensuring a smooth flow from arrival to discharge.\n- Collects insurance cards and payments and balances daily cash drawers.\n- Answers phones and appropriately triage calls.\n- Scans and uploads records to the electronic health record, sort and distribute mail and incoming faxes.\n- Processes tasks in the EHR on a daily basis.\n- Provides additional backup administrative support as assigned.\n\nDiversity, Equity, and Inclusion are core values of the Venice Family Clinic. We believe the professional and clinical environments are enhanced when diverse groups of people with diverse ideas come together.", "responsibilities": "Provides customer service oriented administrative support to patients, staff, and clinicians. Completes patient registration, including demographics and payer/insurance information. Schedules and coordinates new and follow up patient appointments and cancellations. Checks in and checks out patients, ensuring a smooth flow from arrival to discharge. Collects insurance cards and payments and balances daily cash drawers. Answers phones and appropriately triage calls. Scans and uploads records to the electronic health record, sort and distribute mail and incoming faxes. Processes tasks in the EHR on a daily basis. Provides additional backup administrative support as assigned.", "qualifications": {"required": "None specified", "preferred": "None specified"}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4003744971"}