{"jobTitle": "Manager, International Marketing", "company": {"name": "Universal Music Group", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Musicians", "description": "We are UMG, the Universal Music Group. We are the world’s leading music company. In everything we do, we are committed to artistry, innovation and entrepreneurship. We own and operate a broad array of businesses engaged in recorded music, music publishing, merchandising, and audiovisual content in more than 60 countries. We identify and develop recording artists and songwriters, and we produce, distribute and promote the most critically acclaimed and commercially successful music to delight and entertain fans around the world.<br/><br/>Universal Music Enterprises (UMe) is the centralized U.S. catalog entity for the Universal Music Group. Working closely in concert with all of the company’s record labels, UMe provides a frontline approach to catalog management, a greater emphasis on strategic marketing initiatives and opportunities in new and emerging technologies. We manage a diverse and expansive catalog spanning the entire history of recorded music and nearly every genre of music from such renowned record labels as Capitol, Interscope, Def Jam, Geffen, A&amp;M, Motown, Island, and Virgin. The UMe catalog roster includes many of the most iconic and legendary artists of all time, including: The Beatles, Bob Marley, The Rolling Stones, Eminem, Stevie Wonder, Nirvana, and Shania Twain.<br/><br/>UMe is seeking a Manager, International Marketing<br/><br/><strong>How You'll CREATE<br/><br/></strong><ul><li>Manage all aspects of International marketing, product development &amp; catalog optimization from conception to completion on projects, activations and across your owned artist roster list</li><li>Add value at every level helping to maximize Global reach, consumption and revenues for key artists, projects and opportunities</li><li>Be the vital conduit between artist, management, repertoire owner and territories</li><li>Continued communication to repertoire owner &amp; mgmt. with international data/feedback to ensure planning, development and rollout of artist/project is always maximized &amp; truly Global</li><li>Co-ordination, creation and communication of marketing tools &amp; assets from repertoire teams</li><li>Responsible for the execution and review of territory marketing plans and management of project time lines from assigned roster.</li><li>Generate and distribute analytical project/activity information to relevant business areas to help guide decision making Globally</li><li>Create and implement innovative marketing approach to projects</li><li>Formulate budgets with department heads and allocate appropriate costs</li><li>Administer markets requests for tools and assets with appropriate repertoire centre</li><li>Ensure all physical and digital deadlines are met outside of home market</li><li>Assist with evaluating and forecasting project opportunities for release</li><li>Ensure creative output of content and repertoire that will generate meaningful revenues for worldwide territories</li><li>Be a conduit to our international markets across UMG’s storied catalog</li><li>Recognize and share best practice across the markets</li><li>Devise clever and innovative marketing opportunities &amp; strategies</li><li>Deal effectively with all production supply chain logistics &amp; queries to ensure no impact to release dates</li><li>Liaise closely with the Commercial Affairs &amp; New Business departments on campaigns to ensure widest possible exposure and effectiveness</li><li>Submit costed marketing plans for approval and manage campaigns within agreed budgetary limits</li><li>Ensure all information is accurately communicated to all departments regarding strategy, release plans, changes, developments etc.<br/><br/></li></ul><strong>Bring Your VIBE<br/><br/></strong><ul><li>Passion for music</li><li>Music industry marketing experience</li><li>Good communication skills (verbal and written)</li><li>A team player with creative ideas and solutions</li><li>Commercially focused and highly motivated, disciplined and organised with excellent time management skills</li><li>Desire and ability to drive projects from inception to completion</li><li>Flexible and capable of juggling responsibilities</li><li>Comfortable working under pressure and with a fast moving and rapidly developing roster</li><li>Good understanding of data analysis and insights to provide smart marketing opportunities and support decision making</li><li>Experience of liaising effectively with labels, Managers and Artists</li><li>Understanding of new music platforms and the best approach for each to maximize opportunities</li><li>Positive, proactive and pragmatic approach to any situation. Able to deal with problems as they may arise</li><li>Knowledgeable about current music and market trends</li><li>Excellent computer skills</li><li>Experience in the development of artist plans and strategies</li><li>Comfortable using data &amp; analytics to inform key decisions</li><li>Good understanding and knowledge of Universal’s catalog and repertoire</li><li>Knowledge of the international marketplace and current evolution</li><li>Strong understanding of social channels, media opportunities &amp; advertising formats</li><li>Good presentation skills</li><li>Good understanding of consumer insights &amp; segmentation practices</li><li>Competency in one or more foreign languages</li><li>Advanced skills in common software (e.g. MS Office / Keynote / Photoshop / etc.)</li><li>Experience of in-house IT applications (including budgeting &amp; invoice approval systems, sales information systems etc)<br/><br/></li></ul><strong>Perks Playlist<br/><br/></strong><ul><li>Be part of an entrepreneurial, global organization that values authenticity, drive, creativity, relationships, and a competitive spirit</li><li>Comprehensive medical, dental, vision, and FSA options, as well as:</li><ul><li>100% coverage for out-patient mental health services</li><li>Wellbeing reimbursements for fitness classes, spa treatments, meal services, travel, and so much more (up to $720/year)</li><li>A lifetime fertility support allowance of $30,000 to plan participants</li><li>Student Loan Repayment Assistance and Tuition Reimbursement</li><li>100% immediately vested 401(k) match on the first 5% of your contribution on eligible compensation<br/><br/></li></ul></ul><ul><li>Variety of ways to prioritize much-needed time away from work including:</li><ul><li>Flexible Paid Time Off (PTO) for exempt employees</li><li>3-weeks PTO for non-exempt employees</li><li>2-weeks paid Winter Break</li><li>10 Company Holidays (including Juneteenth and Wellbeing Day)</li><li>Summer Fridays (between Memorial Day and Labor Day)</li><li>Generous paid parental leave for every type of parent<br/></li></ul></ul>Check out our full overview of benefits on the Perks Playlist page of the career site.<br/><br/><strong>Disclaimer: This job description only provides an overview of job responsibilities that are subject to change.<br/><br/></strong><strong>Universal Music Group is an Equal Opportunity Employer<br/><br/></strong>We are an E-Verify employer in Alabama, Arizona, Georgia, Mississippi, North Carolina, South Carolina, Tennessee, and Utah.<br/><br/>For more information, please click on the following links.<br/><br/>E-Verify Participation Poster: <strong>English / Spanish<br/><br/></strong>E-Verify Right to Work Poster: <strong>English</strong> | <strong>Spanish<br/><br/></strong><strong>Job Category<br/><br/></strong>Marketing, Streaming &amp; Digital Media<br/><br/><strong>Salary Range<br/><br/></strong>$60,840- $143,550<br/><br/>The actual base salary offered depends on a variety of factors, which may include, as applicable, the qualifications of the individual applicant for the position, years of relevant experience, specific and unique skills, level of education attained, certifications or other professional licenses held, and the location in which the applicant lives and/or from which they will be performing the job. All candidates are encouraged to apply.", "salary": {"amount": "60,840- $143,550", "currency": "USD"}, "skills": ["Music", "Marketing", "Communication", "Teamwork", "Time Management", "Project Management", "Data Analysis", "Insights", "Music Platforms", "Social Media", "Advertising", "Presentation", "Consumer Insights", "Segmentation", "Foreign Languages", "MS Office", "Keynote", "Photoshop", "IT Applications", "Budgeting", "Invoice Approval", "Sales Information Systems"], "postedDate": "4 days ago", "benefits": "Be part of an entrepreneurial, global organization that values authenticity, drive, creativity, relationships, and a competitive spirit\nComprehensive medical, dental, vision, and FSA options, as well as:\n100% coverage for out-patient mental health services\nWellbeing reimbursements for fitness classes, spa treatments, meal services, travel, and so much more (up to $720/year)\nA lifetime fertility support allowance of $30,000 to plan participants\nStudent Loan Repayment Assistance and Tuition Reimbursement\n100% immediately vested 401(k) match on the first 5% of your contribution on eligible compensation\nVariety of ways to prioritize much-needed time away from work including:\nFlexible Paid Time Off (PTO) for exempt employees\n3-weeks PTO for non-exempt employees\n2-weeks paid Winter Break\n10 Company Holidays (including Juneteenth and Wellbeing Day)\nSummer Fridays (between Memorial Day and Labor Day)\nGenerous paid parental leave for every type of parent", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003547359"}