{"jobTitle": "Patient Navigator Lead - OBGYN (Westwood)", "company": {"name": "UCLA Health", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other, Information Technology, and Management", "industry": "Hospitals and Health Care", "description": "<strong>Qualifications<br/><br/></strong>Required:<br/><br/><ul><li>General knowledge of disease processes and patient treatment modalities. Knowledge and understanding of medical terminology.</li><li>Knowledge of office procedures including scheduling of procedures, phone procedures and maintaining appointment calendar. </li><li>Minimum of 5 years experience in patient care coordination role, preferably within OB/GYN. </li><li>Skill in performing tasks with frequent interruption and/or distractions.</li><li>Ability to establish and maintain cooperative working relationships with physicians, residents, research associates, fellows, students and staff, as well as officials within the university and outside agencies. Demonstrate tact and diplomacy, and ability to maintain confidentiality. </li><li>Skill in setting priorities which accurately reflect relative importance of job responsibilities.</li><li>Demonstrated ability to supervise employees, including selection, training, work assignment, performance review, providing constructive feedback.</li><li>Ability to appropriately and professionally convey information regarding patient care to the patient and family. </li><li>Demonstrated knowledge of scientific terminology. Working knowledge of laboratory practices and procedures. Skill in communicating with technical personnel. </li><li>Experience with varied computer hardware and software with proficiency in operating word processing, dictation and transcription equipment.</li><li>Knowledge of medical center procedures and EPIC/CareConnect system to schedule patients, obtain patient treatment and laboratory information.</li><li>Knowledge of insurance companies admission procedures and policies to inform physicians, staff and patients and complete pre-authorization requirements.</li><li>Knowledge of coding systems including ICD-9 and CPT codes for billing purposes.</li><li>Skill in performing basic bookkeeping transactions such as debiting, crediting and preparing deposit slips as required. </li><li>Writing skills to compose and edit logical, detailed, comprehensive and grammatically correct correspondence.</li></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4003744975"}