{"jobTitle": "Executive Assistant, Amazon Health Services", "company": {"name": "Amazon", "location": "Seattle, WA"}, "location": "Seattle, WA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "description": "The Worldwide Amazon Stores organization is looking for an Executive Assistant who wants to work in a fast-paced, exciting, and growing organization. We are looking for someone to support two Directors on our Health Stores & Tech team in Seattle, Washington. The ideal candidate for this role will index high on Earns Trust, Bias for Action and Learn and Be Curious. They need to be able to operate as part of a team, and thrive in ambiguity, while also being a self-starter and problem solver. This person will welcome opportunities to roll their sleeves up and work hard, while also having fun and making history.<br/><br/>This Executive Assistant will be responsible for handling confidential information and maintaining professionalism in dealing with senior executives. This candidate will help build a positive team environment and establish working relationships inside and outside of the group. Role responsibilities include extensive travel planning, external customer facing scheduling, planning and organizing events, managing multiple calendars, proactively identifying opportunities to support the broader HST organization that delivers org-wide impact for the success of the HST Team and provide in person/in office support. In addition to project ownership and support of two Directors (calendar management, travel, expenses etc.) this Executive Assistant will partner with the Lead EA for specific programming needs across HST including assisting with HST’s Space Management, project launches and onboarding new team members.<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> High school or equivalent diploma</li><li> 2+ years of senior level leadership support, or 1+ years of Amazon experience</li><li> Experience with Microsoft Office products and applications</li><li> Experience with Executive Level Calendar Management<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Bachelor's degree</li><li> Experience completing complex tasks quickly with little to no guidance and react with appropriate urgency to situations that require a quick turnaround</li><li> Experience prioritizing and handling multiple assignments at any given time while maintaining commitment to deadlines</li><li> Superior attention to detail and ability to meet tight deadlines</li><li> Strong organizational, communication, and interpersonal skills</li><li> Strong analytical skills</li><li> Demonstrated ability to design and improve processes</li><li> High level of integrity and discretion</li><li> Impeccable attention to detail<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $50,000/year in our lowest geographic market up to $107,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2736106", "jobFunction": "Administrative", "industry": "Software Development", "postedDate": "6 days ago", "skills": ["Microsoft Office", "Calendar Management", "Travel Planning", "Event Planning", "Organizational Skills", "Communication Skills", "Interpersonal Skills", "Analytical Skills", "Process Improvement"], "url": "https://www.linkedin.com/jobs/view/4003194990"}