{"jobTitle": "Store Manager | Westfield Topanga", "company": {"name": "lululemon", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "<strong>Requirements<br/><br/></strong><strong> Description &amp; Requirements <br/><br/></strong><strong>Who We Are<br/><br/></strong>lululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth-focused environment for our people.<br/><br/><strong>Job Summary<br/><br/></strong>As the ultimate leader of their store, a Store Manager is accountable for every aspect of the retail store performance, ensuring that all areas of the store are engaged, achieving key results, and that the store is delivering world-class guest experience. Store Managers are responsible for hiring and developing people. Store Managers are responsible for creating an environment and a store culture where people feel a deep sense of belonging and have the opportunity to grow. As a result, they ensure their store delivers quality guest experience in line with company values and directives (people experience, store operations, product, and community relationships).<br/><br/><strong>Core Responsibilities Of The Job<br/><br/></strong><strong>Leadership and People Management<br/><br/></strong><ul><li>Create and foster a respectful and inclusive team environment and culture by welcoming and celebrating differences to ensure a supportive, productive and fun experience for team members.</li><li>Establish a vision for the store, based on key metrics and initiatives, and cascade to all team members.</li><li>Manage the store’s hiring strategy to build a strong and diverse team that includes team members with various experiences, backgrounds, and skillsets to drive store operations.</li><li>Support ongoing learning and development of all team members consistently and equitably by providing direct feedback, coaching, mentoring, continuous development check-ins and leading performance management activities.</li><li>Address all employee concerns and issues, including knowing when to partner with internal support to take appropriate action.<br/><br/></li></ul><strong>Guest Experience And Community<br/><br/></strong><ul><li>Lead an exceptional guest (customer) experience on the floor through assessing the level of guest connection and technical product education and supporting team members to address gaps through feedback and coaching.</li><li>Manage and direct in-store team members to ensure optimal guest experience that values guests’ time and supports store operations.</li><li>Address emergent issues, including guest escalations and urgent requests.</li><li>Establish and increase brand awareness in the community by cultivating and maintaining inclusive relationships with local ambassadors, sweat leaders, community influencers and other external partners.</li><li>Plan and execute local, regional, and area driven Community projects and initiatives (e.g., local run club, International Day of Yoga).<br/><br/></li></ul><strong>Operations, Product, and Strategy<br/><br/></strong><ul><li>Drive overall store visual merchandising, product strategy, including product escalations, and execute company-driven product actions, projects, and initiatives.</li><li>Manage sell-through by monitoring product levels, ensuring accuracy of inventory counts, and organizing product deliveries in line with visual merchandising strategy. </li><li>Plan and execute high-level quarterly and seasonal planning for store with respect to strategy, budget, and labor (including recruiting and training/development).</li><li>Manage whole store profit and loss (P&amp;L) in accordance with goals (sales, budget, etc.).</li><li>Move dynamically and lead from the floor to assess and fulfill the needs of the business, team, and guests through coaching and developing team members.</li><li>Understand and adhere to people safety policies and procedures to maintain a safe work environment.</li><li>Perform work in accordance with applicable policies, procedures, and laws or regulations.<br/><br/></li></ul><strong>Budget Responsibility<br/><br/></strong><ul><li>Accountable for controllable budget; labor hours; annual sales plan target<br/><br/></li></ul><strong>People Management<br/><br/></strong><ul><li>Leadership role directly responsible for managing all other store leadership roles</li><li>Ultimately responsible for hiring and terminating all store employees<br/><br/></li></ul><strong>What We Look For<br/><br/></strong><ul><li>Inclusion &amp; Diversity: Creates/supports an inclusive environment that values/celebrates differences </li><li>Integrity: Behaves in an honest, fair, and ethical manner</li><li>Leadership: Is able and desires to lead and inspire others; motivates, empowers, develops, and directs people as they work </li><li>Decision Making/Problem Solving: Identifies opportunities for improvement; evaluates alternatives and makes effective, timely decisions</li><li>Drive/Entrepreneurship: Sets challenging, focused goals and is motivated and determined to meet or exceed them; is innovative and owns results</li><li>Team Building: Creates and develops teams that maximize accomplishments; encourages unique contributions and different perspectives</li><li>Strategic Thinking: Considers the lasting implications of decisions; Sets a plan and makes decisions aligned with company strategy, vision, and values</li><li>Change Management Leadership: Leads others through change processes and uncertainty</li><li>Business Acumen: Is able to quickly understand and address business information (e.g., profit and loss statements, budgets and sales forecasts, retail strategy and approaches)</li><li>Interactive Communication: Conveys information effectively and understands information shared while interacting with others<br/><br/></li></ul><strong>Job Requirements<br/><br/></strong><strong>Eligibility<br/><br/></strong><ul><li>Must be legally authorized to work in the country in which the store is located</li><li>Must have the ability to travel to assigned store with reliable transportation methods<br/><br/></li></ul><strong>Schedule/Availability<br/><br/></strong><ul><li>Work occurs on a variable schedule which could include early mornings, mornings, afternoons, evenings, late nights or overnights as well as weekends and holidays<br/><br/></li></ul><strong>Experience<br/><br/></strong><ul><li>1 year people management experience (including recruiting, hiring, and holding employees accountable to performance expectations)</li><li>1 year managing business operations and administration, including experience with retail scheduling and management of labor hours and managing projects or processes<br/><br/></li></ul><strong>Job Assets (i.e., nice to have; not required)<br/><br/></strong><ul><li>Education: High school diploma, GED, or equivalent</li><li>Education: Bachelor’s degree or equivalent</li><li>Experience: 2 years retail or sales specific management experience<br/><br/></li></ul><strong>Work Context (e.g., environment, interactions, physical)<br/><br/></strong><ul><li>Work occurs in an environment with bright lights and loud music</li><li>Work is accomplished as part of a team and also independently</li><li>Work may involve managing conflict or mediating problems between others or deescalating guest issues</li><li>Work involves reaching out to meet and build relationships with strangers/new people, and to strengthen existing community partnerships</li><li>Work is sometimes conducted on a computer or other technical devices, including to meet with others virtually</li><li>Work involves moving through a store for most of a shift to help guests and accomplish work, but can also involve sitting for extended periods of time (i.e., more than 1 hour)</li><li>Work may occasionally involve moving boxes weighing up to 30 lbs (13.6 kg)<br/><br/></li></ul><strong>Compensation And Benefits Package<br/><br/></strong>lululemon’s compensation offerings are grounded in a pay-for-performance philosophy that recognizes exceptional team performance. The base pay range for this position from <strong>$81,700 - $110,538/annually</strong>; the base pay offered is based on market location and may vary depending on job-related knowledge, skills, experience, and internal equity. This position has a target bonus of an additional <strong>30%</strong>, subject to certain requirements and the Company’s discretion, bringing the annual total target compensation range between <strong>$106,210 - $143,699/annually</strong>. As part of our total rewards offering, permanent employees in this position may be eligible for our competitive equity offerings, subject to program eligibility requirements.<br/><br/>At Lululemon, Investing In Our People Is a Top Priority. We Believe That When Life Works, Work Works. We Strive To Be The Place Where Inclusive Leaders Come To Develop And Enable All To Be Well. Recognizing Our Teams For Their Performance And Dedication, Other Components Of Our Total Rewards Offerings Include Support Of Career Development, Wellbeing, And Personal Growth<br/><br/><ul><li>Extended health and dental benefits, and mental health plans </li><li>Paid time off </li><li>Savings and retirement plan matching </li><li>Generous employee discount</li><li>Fitness &amp; yoga classes</li><li>Parenthood top-up</li><li>Extensive catalog of development course offerings </li><li>People networks, mentorship programs, and leadership series (to name a few)<br/><br/></li></ul>Note: The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.", "salary": {"amount": "81,700.00 - 110,538/annually", "currency": "USD"}, "postedDate": "4 days ago", "qualifications": {"required": "1 year people management experience (including recruiting, hiring, and holding employees accountable to performance expectations)\n1 year managing business operations and administration, including experience with retail scheduling and management of labor hours and managing projects or processes", "preferred": "Education: High school diploma, GED, or equivalent\nEducation: Bachelor’s degree or equivalent\nExperience: 2 years retail or sales specific management experience"}, "skills": [], "benefits": "Extended health and dental benefits, and mental health plans \nPaid time off \nSavings and retirement plan matching \nGenerous employee discount\nFitness & yoga classes\nParenthood top-up\nExtensive catalog of development course offerings \nPeople networks, mentorship programs, and leadership series (to name a few)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003535939"}