{"jobTitle": "Food & Beverage Director", "company": {"name": "Troon", "location": "Whittier, CA"}, "location": "Whittier, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Hospitality", "description": "California Country Club is excited to announce the exceptional career opportunity of a Food and Beverage Director. Qualified candidates will thrive in a hospitality environment and be highly focused on providing superior service to the the Members and Guests.<br/><br/>Salary Range from $70,000- $75,000 per year.<br/><br/><strong>Key Responsibilities of the Food and Beverage Director:<br/><br/></strong><ul><li> Assists with interviewing, hiring, training, planning, assigning, and directing work, evaluating performance, rewarding, and disciplining associates; addressing complaints and resolving problems. </li><li> Assists in the management of department members that may include, but is not limited to: Servers, Reservationist, Runners, Bartenders, Hosts, Banquet, Building Maintenance. </li><li> Assist with budget preparation in all Food and Beverage related areas. </li><li> Reviews current day’s business levels in all operations and assigns priorities as needed. </li><li> Relays pertinent information to key staff including, Executive Chef, Beverage Manager, Dining Manager, Executive Offices, Concierge, and Membership Office as needed. </li><li> Assists General Manager in monitoring success of Food and Beverage related departments and associates, including semi-annual performance reviews, as needed. </li><li> Conducts regular staff meetings with colleagues, subordinates and related parties. </li><li> Assures that effective orientation and training are given to each new associate. Assists in developing ongoing training programs. </li><li> Prepares and monitors quarterly revenue goals and expenses as well as generating various (weekly, monthly, quarterly, and annual) business volume reports and forecasts. </li><li> Responsible for pre-approving, receiving and ultimate inventory control for all Food and Beverage related areas. <br/><br/></li></ul><strong>Minimum Qualifications for the Food and Beverage Director:<br/><br/></strong><ul><li> Bachelor’s degree (BA) from four-year college or university; or four to six years related experience and/or training; or equivalent combination of education and experience. <br/><br/></li></ul><strong>Other Qualifications:<br/><br/></strong><ul><li> Knowledge hospitality POS system application, hardware, software and menu programing. </li><li> Experience in Multi-faceted Food and Beverage operations. <br/><br/></li></ul><strong>About Troon<br/><br/></strong>Troon started as one facility in 1990 and has since grown to become the world’s largest professional club management company. We offer careers around the world at all levels of golf operations, opportunities for professional development, growth opportunities and a comprehensive benefits package. Our goal is to create extraordinary guest and member experiences through personalized service, consistency, and uncompromising attention to detail. For more information about the Troon Experience, please visit https://www.troon.com/.", "postedDate": "3 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4003580996"}