{"jobTitle": "Human Resources Coordinator - 230129", "company": {"name": "Medix™", "location": "Los Angeles, CA", "industry": "Staffing and Recruiting and Human Resources Services"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "22.00/hr - 25.00/hr", "currency": "USD"}, "jobFunction": "Administrative and Human Resources", "industry": "Staffing and Recruiting and Human Resources Services", "description": "<strong>Position Summary:</strong><p>The Human Resources Coordinator will oversee the full-cycle recruitment process and collaborate with the Human Resources Manager to attract top talent. This role involves addressing daily recruitment queries and general HR inquiries, researching, sourcing, screening, and interviewing candidates, and facilitating their onboarding in line with organizational goals. The Coordinator will work closely with hiring managers to address immediate and future hiring needs.</p><p><br/></p><p><strong>Responsibilities:</strong></p><ul><li><strong>Talent Sourcing:</strong> Develop and maintain a diverse talent pipeline for current and future needs through various sourcing methods, including networking, social recruiting, advertising, and employee referrals.</li><li><strong>Recruitment Strategies:</strong> Create and implement recruitment strategies using diverse techniques such as internet mining, networking, and college outreach to build a pool of qualified candidates.</li><li><strong>Trend Analysis:</strong> Continuously evaluate recruitment trends, competitive analysis, and best practices to enhance recruitment outcomes.</li><li><strong>Application Management:</strong> Source, evaluate, and manage applications for both internal transfers and external candidates, ensuring compliance with affirmative action regulations.</li><li><strong>HR Support:</strong> Assist the HR department with employment status changes, benefits, safety, compliance, audits, and reporting.</li><li><strong>Candidate Experience:</strong> Ensure an exceptional candidate experience through timely follow-ups, feedback, and support during the recruitment and onboarding processes.</li><li><strong>Hiring Manager Support:</strong> Advise and guide hiring managers on talent acquisition processes.</li><li><strong>Industry Knowledge:</strong> Stay updated on developments in wages, benefits, and personnel practices relevant to market conditions and organizational practices.</li><li><strong>Compliance:</strong> Ensure recruitment and hiring activities comply with government regulations and organizational policies.</li><li><strong>Networking:</strong> Build positive relationships with colleges, associations, and professional organizations through participation in networking events and industry conferences.</li><li><strong>Interview Coordination:</strong> Schedule and coordinate phone, virtual, and in-person interviews.</li><li><strong>Reporting:</strong> Submit weekly activity reports to the HR Manager and meet weekly goals.</li><li><strong>Recruiting Meetings:</strong> Actively participate in weekly recruiting meetings with assigned managers.</li><li><strong>Data Analysis:</strong> Gather data, perform analysis, and generate advanced reports that are accurate and timely.</li><li><strong>Policy Updates:</strong> Update policies and procedures to enhance departmental efficiency and service quality.</li><li><strong>Training Materials:</strong> Assist in preparing educational materials for staff and management training.</li><li><strong>Orientation:</strong> Ensure all new staff complete required forms and policies and receive general orientation regarding personnel policies and union contracts.</li><li><strong>Volunteer Programs:</strong> Oversee volunteer and internship programs.</li><li><strong>Recruitment Efforts:</strong> Conduct recruitment for non-exempt personnel, students, and temporary employees, and manage new-employee orientations and career-pathing programs.</li><li><strong>HRIS Maintenance:</strong> Maintain HR information system records and compile reports from the database.</li><li><strong>System Accuracy:</strong> Ensure accurate data input into the applicant tracking system and HRIS.</li><li><strong>Regulatory Compliance:</strong> Maintain compliance with federal and state employment regulations.</li><li><strong>Continuous Learning:</strong> Pursue ongoing HR education and training as needed.</li><li><strong>Additional Duties:</strong> Perform other related duties as assigned.</li></ul><p><strong>Qualifications:</strong></p><ul><li>Bachelor’s degree in Human Resources, Industrial Psychology, Business Administration, or a related field.</li><li>PHR or other HR certifications preferred.</li><li>Minimum of two years of recruiting and HR experience, <strong>ideally in a healthcare setting.</strong></li><li>Bilingual in English and Spanish.</li><li>Strong oral and written communication skills with the ability to think analytically.</li><li>Knowledge of applicant tracking and HR information systems; experience with ADP preferred.</li><li>Proficiency in Microsoft Office, including Word and Excel.</li><li>Excellent organizational skills with attention to detail and the ability to multitask in a fast-paced environment.</li><li>Initiative to problem-solve with limited resources.</li><li>Exceptional knowledge of employment laws, recruitment, benefits, training, compliance, safety, and general HR practices.</li><li>Proof of up-to-date COVID-19 vaccinations, including primary series and booster dose when eligible.</li></ul><p></p>", "responsibilities": "The Human Resources Coordinator will oversee the full-cycle recruitment process and collaborate with the Human Resources Manager to attract top talent. This role involves addressing daily recruitment queries and general HR inquiries, researching, sourcing, screening, and interviewing candidates, and facilitating their onboarding in line with organizational goals. The Coordinator will work closely with hiring managers to address immediate and future hiring needs.", "qualifications": {"required": "Minimum of two years of recruiting and HR experience, ideally in a healthcare setting.", "preferred": "Bachelor’s degree in Human Resources, Industrial Psychology, Business Administration, or a related field., PHR or other HR certifications, Bilingual in English and Spanish."}, "skills": ["Talent Sourcing", "Recruitment Strategies", "Trend Analysis", "Application Management", "HR Support", "Candidate Experience", "Hiring Manager Support", "Industry Knowledge", "Compliance", "Networking", "Interview Coordination", "Reporting", "Recruiting Meetings", "Data Analysis", "Policy Updates", "Training Materials", "Orientation", "Volunteer Programs", "Recruitment Efforts", "HRIS Maintenance", "System Accuracy", "Regulatory Compliance", "Continuous Learning", "ADP", "Microsoft Office", "Word", "Excel"], "postedDate": "3 days ago", "benefits": "401(k), Dental insurance, Vision insurance, Medical insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003536565"}