{"jobTitle": "Operations Coordinator - Anesthesiology", "company": {"name": "UCLA Health", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Hospitals and Health Care", "description": "Occasionally work various hours or weekends, and travel to meet Department or Program requirements.  Work onsite 3-5 days a week. Basic knowledge and skill in accounting to complete basic University forms such as travel vouchers and requests for reimbursement. Knowledge of University reimbursement policies. Ability to manage short-term and long-term projects and committees. Ability to read and interpret documents to include University policies and procedures and Departmental manuals, memos, policies, and procedures. Skills to prepare forms, correspondence, and memos with moderate speed and accuracy to meet deadlines, including knowledge of different font styles and sizes and graphics to produce various professional effects. Demonstrated working knowledge and skill in using various computer programs such as Word, Excel, PowerPoint, Outlook email, Outlook calendar programs, Microsoft Teams, Microsoft Planner/Asana or other project management software, Box, Visio and basic database software. Knowledge of basic medical terminology, symbols, and its usage. Ability to extract information and data required from manuscripts, abstracts, and articles for print or re-arrange format to comply with printing agency style. Ability to conduct online library searches. Skill in making travel arrangements including knowledge of travel modes, reservations techniques, air and ground transportation and time zone changes. Ability to prioritize assignments from multiple faculty members to complete work in a timely manner under the pressure of deadlines, changes in assignments and competing requirements. Skill in working as a team in order to assist as a backup when needed. Skill in performing duties with frequent interruptions and/or distractions. Ability to maintain confidentiality of records and discussions. Ability to establish and maintain cooperative working relationships with coworkers, faculty, trainees, University representatives, patients and the public. Ability to arrange appointments, schedules and multiple calendars without conflict. Ability to discern which calls or visitors can and should be handled by the incumbent or referred to appropriate manager or faculty member. Ability to compose routine and complex drafts from verbal instructions and/or discussion of business and medical correspondence and memos. Ability to proofread documents for completeness and content.", "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003744055"}