{"jobTitle": "Buyer Assistant", "company": {"name": "MINISO USA", "location": "West Covina, CA"}, "location": "West Covina, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "26/hr", "currency": "USD"}, "jobFunction": "Supply Chain, Product Management, and Analyst", "industry": "Retail", "description": "MINISO is a lifestyle retail brand established in 2013 with a wide range of quality, innovative and affordable products. Delighting and enhancing customers’ everyday needs and experience throughout its current global network of 4,200 stores over 80 countries. MINISO believes in exceptional customer service, adorable products and dedicates to bring customers “MINI price, BIG surprise” when shopping at MINISO.  Responsibilities include, but are not limited to: Assist merchandise manager and buying team in overall procurement tasks both from HQ and local vendors. Assist merchandise manager and buying team with product sourcing, sampling, assortment and communication Assist merchandise manager and buying team to analyze and maintain suppliers and products information. Assist merchandise manager and buying team to solve the purchase order issue, confirmation, follow up and potential discrepancies resolution. Assist merchandise manager and buying team to coordinate with HQ, warehouse, operations, logistics, finance, marketing, and other related departments to accomplish vendor/product introduction, goods receiving, expense approval, product launch, promotion. Assist merchandise manager and buying team to work with vendors to improve lead time along with cost, profit, quality, delivery and supply. Deliver weekly/monthly purchase order report to Merchandise Manager and Buyers that indicates all merchandise key indicators and the invoice number for all closed orders. Assist merchandise manager and buying team for new product planning, monthly budget and category planning of your responsible categories. Ability to become an in-house expert in the OA, SAP, POS system and all related programs in relation to merchandising. Comply with the Merchandise KPI and dedicate to help improve the turnover, SKU and PM result of your category Other related ad-hoc projects and assignments upon request.  Pay: $26/hr Location: West Covina, CA - fully onsite M-F  Requirements and qualifications: Bachelor's Degree in Business, Supply Chain Management preferred. 1 years’ working experience in procurement, merchandising or category related position in retail industry. Highly proficient with MS Excel for analytics and reporting, OA/SAP experience will be a valuable asset. Demonstrated good problem-solving, and multi-task skills. Excellent communication skills to work with internal and external parties. Ability to work cross functionally with team in various locations and time zone, including Canada brunch and headquarter. Must be detailed oriented, and willingness to put out your best of work. Be able to adapt well in a rapidly changed environment and maintain composure under pressure; adjust and react fast to the changing market demand or business strategy. Strong Attention to detail and analytical skills. Possess strong team player skills with entrepreneurship and passion. Mandarin/English verbal and written language proficiency highly desired", "responsibilities": "Assist merchandise manager and buying team in overall procurement tasks both from HQ and local vendors. Assist merchandise manager and buying team with product sourcing, sampling, assortment and communication Assist merchandise manager and buying team to analyze and maintain suppliers and products information. Assist merchandise manager and buying team to solve the purchase order issue, confirmation, follow up and potential discrepancies resolution. Assist merchandise manager and buying team to coordinate with HQ, warehouse, operations, logistics, finance, marketing, and other related departments to accomplish vendor/product introduction, goods receiving, expense approval, product launch, promotion. Assist merchandise manager and buying team to work with vendors to improve lead time along with cost, profit, quality, delivery and supply. Deliver weekly/monthly purchase order report to Merchandise Manager and Buyers that indicates all merchandise key indicators and the invoice number for all closed orders. Assist merchandise manager and buying team for new product planning, monthly budget and category planning of your responsible categories. Ability to become an in-house expert in the OA, SAP, POS system and all related programs in relation to merchandising. Comply with the Merchandise KPI and dedicate to help improve the turnover, SKU and PM result of your category Other related ad-hoc projects and assignments upon request.", "qualifications": {"required": "Bachelor's Degree in Business, Supply Chain Management preferred. 1 years’ working experience in procurement, merchandising or category related position in retail industry. Highly proficient with MS Excel for analytics and reporting, OA/SAP experience will be a valuable asset. Demonstrated good problem-solving, and multi-task skills. Excellent communication skills to work with internal and external parties. Ability to work cross functionally with team in various locations and time zone, including Canada brunch and headquarter. Must be detailed oriented, and willingness to put out your best of work. Be able to adapt well in a rapidly changed environment and maintain composure under pressure; adjust and react fast to the changing market demand or business strategy. Strong Attention to detail and analytical skills. Possess strong team player skills with entrepreneurship and passion.", "preferred": "Mandarin/English verbal and written language proficiency highly desired"}, "skills": ["Procurement", "Merchandising", "Supply Chain Management", "MS Excel", "OA/SAP", "Communication", "Problem Solving", "Multi-tasking", "Teamwork", "Entrepreneurship", "Mandarin", "English"], "postedDate": "6 days ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003175242"}