{"jobTitle": "Senior Purchasing Manager", "company": {"name": "Shabkt Global", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing and Supply Chain", "industry": "Wholesale", "description": "<strong>Company Description</strong><p><br/></p><p>Premier destination for top-quality industrial spare parts with detailed descriptions and high-quality spare parts. </p><p><br/></p><p> <strong>Role Description</strong></p><p> </p><p>This is a full-time hybrid role for a Senior Purchasing Manager at Shabkt Global. The Senior Purchasing Manager will be responsible for overseeing the company's purchasing activities, negotiating with suppliers, managing vendor relationships, and developing procurement strategies. Some remote work is acceptable for this role.</p><p><br/></p><p> <strong>Qualifications</strong></p><p> </p><ul><li>Purchasing Management, Negotiation, and Vendor Management skills</li><li>Experience in developing procurement strategies and supply chain management</li><li>Strong analytical and problem-solving abilities</li><li>Excellent organizational and communication skills</li><li>Ability to collaborate effectively with cross-functional teams</li><li>Proficiency in procurement software and tools</li><li>Knowledge of regulatory requirements and compliance in purchasing</li><li>Bachelor's degree in Business Administration, Supply Chain Management, or related field</li></ul>", "responsibilities": null, "qualifications": {"required": "Purchasing Management, Negotiation, and Vendor Management skills, Experience in developing procurement strategies and supply chain management, Strong analytical and problem-solving abilities, Excellent organizational and communication skills, Ability to collaborate effectively with cross-functional teams, Proficiency in procurement software and tools, Knowledge of regulatory requirements and compliance in purchasing, Bachelor's degree in Business Administration, Supply Chain Management, or related field", "preferred": null}, "skills": ["Purchasing Management", "Negotiation", "Vendor Management", "Procurement Strategies", "Supply Chain Management", "Analytical Skills", "Problem Solving", "Organizational Skills", "Communication Skills", "Collaboration", "Procurement Software", "Regulatory Requirements", "Compliance"], "postedDate": "3 days ago", "applicationDeadline": null, "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4003577261"}