{"jobTitle": "Senior Director, Brand Partnerships (West)", "company": {"name": "Doing Things", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Internet Publishing", "description": "At Doing Things, our process is unique, but our purpose is clear. We connect consumers across the world through humor and happiness. Doing Things is responsible for the funniest, most shareable, and culturally relevant memes and video content on the Internet. The company is making ordinary life relatable, humorous and entertaining through a portfolio that includes some of the most popular brands built on Instagram, including Middle Class Fancy, Shithead Steve, Overheard, Recess Therapy, Bob Does Sports and Animals Doing Things, among others. Through its IP, Doing Things fuels consumer products, branded content, video licensing, publishing and original entertainment across digital and linear TV.<br/><br/>Founded in 2017, Doing Things touts more than 35+ unique brands and delivers more than 100 pieces of original and curated content daily to an audience of more than 80 million followers across Instagram, Facebook, TikTok, YouTube and Snap. This includes the company’s fast-growing direct-to-consumer products business, featuring comedic apparel and accessories based on what’s trending, as well as our Breezy golf apparel line.<br/><br/>Today, Doing Things is looking to expand its team as we extend our reach to bring smiles to millions of new community members across the globe.<br/><br/>Job Description:<br/><br/>We are seeking a Senior Director, Brand Partnerships to join our fast-growing Brand Partnerships team at Doing Things (DT). As a member of the team, you will be responsible for driving revenue growth through partnerships with the world’s top advertisers and their agency teams. You will represent the Doing Things brand within the advertising community on the West Coast to help establish DT as a key player in the space.<br/><br/>In addition to your creativity, curiosity, and hunger to succeed, the ideal candidates will have experience working with both brands and their agencies to bring innovative content partnerships to life, especially on social. Candidates should be comfortable working in a startup environment and bring an upbeat, positive attitude to the table every day.<br/><br/>This is a remote role, but the ideal candidate is based in the LA or SF area. This role reports to the VP, Brand Partnerships (West).<br/><br/>Responsibilities:<br/><br/><ul><li>Responsible for revenue goals which include deepening existing business and generating new business as well</li><li>Prospect, pitch, and attract new business (both client direct and agency)</li><li>Responsible for managing the day-to-day responsibilities with agencies and clients</li><li>Provide strategic market expertise and POV to both clients and internal teams</li><li>Ensure clients receive superior customer service and campaign results</li><li>Understand the client needs around initiatives and develop solutions that meet these needs to accelerate the win rate in ad sales business</li><li>Manage accounts from pre-sale through post sale analysis</li><li>Help develop go-to-market sales strategy and internal process for the company</li><li>Identify opportunities and innovative approaches to drive revenue growth for the company<br/><br/></li></ul>Qualifications:<br/><br/><ul><li>5+ years of digital ad sales experience in custom, social and/or native</li><li>Relationships in digital &amp; social media at both the client and agency, with ability to independently build a large pipeline</li><li>Extensive experience and contacts within the gaming and tech/telco verticals preferred</li><li>Motivated team player who consistently strives to exceed goals and push revenue expectations</li><li>Ability to thrive in a fast-paced, dynamic work environment</li><li>An entrepreneurial spirit</li><li>A self-starter; ability to work very independently, but also fit into a strong team environment</li><li>Excellent communication, negotiation and presentation skills</li><li>Strong understanding of the digital and social media landscape<br/><br/></li></ul>What We Offer:<br/><br/>At Doing Things, you make an immediate impact. Doing Things is a start-up made up of smart, talented and driven people looking for other potential team members with the same attitude of innovation and excellence. We offer incredible opportunities to learn and work on projects that are at the forefront of the internet media landscape and are transforming digital advertising. We offer competitive compensation that includes cutting edge work and the opportunity to join a rapidly growing startup with a proven product.<br/><br/>Individual compensation varies based on job related factors, including business needs, experience, level of responsibility, and qualifications.<br/><br/>EOE<br/><br/>At Doing Things, we don’t just accept differences - we celebrate them, we support them, and we thrive on them for the benefit of our employees, our brands and our community. Doing Things is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.<br/><br/>Disclaimer<br/><br/>Doing Things does not interview candidates via email and job offers are only extended after a thorough interview process involving phone and/or video interviews. If you receive a suspicious email regarding a position with Doing Things and/or a job offer, please do not respond. Forward that email to hr@doingthings.com.<br/><br/>Powered by JazzHR<br/><br/>phNbVi6HpD", "responsibilities": "<ul><li>Responsible for revenue goals which include deepening existing business and generating new business as well</li><li>Prospect, pitch, and attract new business (both client direct and agency)</li><li>Responsible for managing the day-to-day responsibilities with agencies and clients</li><li>Provide strategic market expertise and POV to both clients and internal teams</li><li>Ensure clients receive superior customer service and campaign results</li><li>Understand the client needs around initiatives and develop solutions that meet these needs to accelerate the win rate in ad sales business</li><li>Manage accounts from pre-sale through post sale analysis</li><li>Help develop go-to-market sales strategy and internal process for the company</li><li>Identify opportunities and innovative approaches to drive revenue growth for the company<br/><br/></li></ul>", "qualifications": {"required": "5+ years of digital ad sales experience in custom, social and/or native, Relationships in digital &amp; social media at both the client and agency, with ability to independently build a large pipeline, Motivated team player who consistently strives to exceed goals and push revenue expectations, Ability to thrive in a fast-paced, dynamic work environment, An entrepreneurial spirit, A self-starter; ability to work very independently, but also fit into a strong team environment, Excellent communication, negotiation and presentation skills, Strong understanding of the digital and social media landscape<br/><br/>", "preferred": "Extensive experience and contacts within the gaming and tech/telco verticals preferred"}, "skills": ["Digital Ad Sales", "Social Media", "Business Development", "Sales", "Client Management", "Agency Management", "Strategic Marketing", "Customer Service", "Revenue Growth", "Go-to-Market Strategy", "Digital Media", "Social Media Marketing"], "postedDate": "1 week ago", "benefits": "At Doing Things, you make an immediate impact. Doing Things is a start-up made up of smart, talented and driven people looking for other potential team members with the same attitude of innovation and excellence. We offer incredible opportunities to learn and work on projects that are at the forefront of the internet media landscape and are transforming digital advertising. We offer competitive compensation that includes cutting edge work and the opportunity to join a rapidly growing startup with a proven product.<br/><br/>Individual compensation varies based on job related factors, including business needs, experience, level of responsibility, and qualifications.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4003372840"}