{"jobTitle": "F-35 Manager Supply Chain Programs 3", "company": {"name": "Northrop Grumman", "industry": "Defense and Space Manufacturing", "location": "Redondo Beach, CA"}, "location": "Redondo Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "164,300 - 246,500", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Defense and Space Manufacturing", "description": "Requisition ID: R10167979<br/><br/><ul><li>Category: Global Supply Chain</li><li>Location: Redondo Beach, California, United States of America | Palmdale, California, United States of America</li><li>Clearance Type: None</li><li>Telecommute: No- Teleworking not available for this position</li><li>Shift: 1st Shift (United States of America)</li><li>Travel Required: Yes, 50% of the Time</li><li>Relocation Assistance: Relocation assistance may be available</li><li>Positions Available: 1<br/><br/></li></ul>At Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation's history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work — and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history.<br/><br/><strong>Northrop Grumman Aeronautics Systems</strong> has an opening for a <strong>Global</strong> <strong>Supply Chain Program Manager 3 </strong>to join our team of qualified, diverse individuals within our Global Supply Chain Organization. This leadership role is located in office <strong>on-site </strong><strong>at either Palmdale, California, El Segundo, California or Redondo Beach, California. <br/><br/></strong>We offer flexible work arrangements, 9/80* work schedule with every other Friday off, phenomenal learning opportunities, exposure to a wide variety of projects and customers, and a very friendly team environment. We are looking for self-motivated, proactive, and goal-oriented people to help us grow our services and become even better at what we do.<br/><br/>Our Leaders at Northrop Grumman live our values daily and encourage our teams to do the same. We do the right thing: upholding the highest ethical standards and facilitating a safe and respectful environment that attracts, retains, and inspires a diverse and engaged team. We do what we promise: holding yourself and others accountable to meet predictable and balanced results. We commit to shared success: operating as OneNG and removing barriers for our teams. Finally, We pioneer: setting a vision that shapes the future and inspires others.<br/><br/>This role is for a F-35 GSC Program Manager 3 and will be responsible, accountable and have the authority for the operational efficiency and strategy of the Spares, TFE, Support Equipment and Production Procurement Execution in support of the GSC statement of work (SOW) for the F-35 Program. This role is part of the GSC Program Management team and will be challenged to resolve issues and implement solutions, in a quick fast-paced environment – including process improvements, tools, metrics, data integration, and coordination and collaboration with key GSC and program stakeholders.<br/><br/><strong>Job Description<br/><br/></strong><ul><li>Work with the GSC functional homerooms and ensure successful execution of Procurement suppliers in support of the F-35 Program</li><li>Responsible for timely closure of assigned actions, projects, initiatives and efforts for GSC in support of the IPT goals and expectations</li><li>Primary GSCPM liaison to F-35 program management and all functional GSC teams for General Procurement related activity</li><li>Support the F-35 IPTs to ensure General Procurement suppliers are supporting quoted lead times, contractual delivery dates, Master Repair Agreements (MRA) and other IPT objectives</li><li>Work with General Procurement supplier management teams to develop, execute, and track negotiation strategies and performance to budget baseline</li><li>Perform roles and responsibilities related to Control Account Manager (CAM) and Earned Value Management (EVM) for General Procurement Support Equipment parts.</li><li>With a focus on General Procurement suppliers, own or delegate with oversight all risk and issue related activity in TRIO; facilitating meetings across all relevant teams to identify issues, risks, establish mitigation plans, and perform activities related to issue recovery planning</li><li>Work with the GSC functional homerooms and establish the GSC training strategy, plan facilitators and milestone completion status and health</li><li>Ability to travel international and domestic up to 40%<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>Bachelor’s Degree with at least 8 years of experience in supply chain management, procurement, subcontracts OR a Master’s Degree with at least 6 years of experience in supply chain management, procurement subcontracts OR High School Diploma/Equivalent with at least 10 years of experience in supply chain management, procurement, subcontracts</li><li>Must have a minimum of 4 years experience leading a team</li><li>Must have program costs and/or schedule experience, CAM experience</li><li>Must have the ability obtain and maintain a DoD Secret level clearance within a reasonable amount of time as determined by the Company to meet its business needs<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Have the ability to prepare and present Executive-level presentations</li><li>Have a minimum of 2 years of experience with FAR and DFARS<br/><br/></li></ul><strong>Salary Range: </strong>$164,300 - $246,500<br/><br/>The above salary range represents a general guideline; however, Northrop Grumman considers a number of factors when determining base salary offers such as the scope and responsibilities of the position and the candidate's experience, education, skills and current market conditions.<br/><br/>Employees may be eligible for a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business.<br/><br/>The application period for the job is estimated to be 20 days from the job posting date. However, this timeline may be shortened or extended depending on business needs and the availability of qualified candidates.<br/><br/>Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit. U.S. Citizenship is required for all positions with a government clearance and certain other restricted positions.", "responsibilities": "This role is for a F-35 GSC Program Manager 3 and will be responsible, accountable and have the authority for the operational efficiency and strategy of the Spares, TFE, Support Equipment and Production Procurement Execution in support of the GSC statement of work (SOW) for the F-35 Program. This role is part of the GSC Program Management team and will be challenged to resolve issues and implement solutions, in a quick fast-paced environment – including process improvements, tools, metrics, data integration, and coordination and collaboration with key GSC and program stakeholders.", "qualifications": {"required": "Bachelor’s Degree with at least 8 years of experience in supply chain management, procurement, subcontracts OR a Master’s Degree with at least 6 years of experience in supply chain management, procurement subcontracts OR High School Diploma/Equivalent with at least 10 years of experience in supply chain management, procurement, subcontracts\nMust have a minimum of 4 years experience leading a team\nMust have program costs and/or schedule experience, CAM experience\nMust have the ability obtain and maintain a DoD Secret level clearance within a reasonable amount of time as determined by the Company to meet its business needs", "preferred": "Have the ability to prepare and present Executive-level presentations\nHave a minimum of 2 years of experience with FAR and DFARS"}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Employees may be eligible for a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003107218"}