{"jobTitle": "Planner/Scheduler 1 (45081)", "company": {"name": "Haas Automation, Inc.", "industry": "Machinery Manufacturing", "size": "Not specified", "location": "Oxnard, CA"}, "location": "Oxnard, CA", "jobType": "Regular Full Time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$21.00 - $33.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Machinery Manufacturing", "description": "As the largest machine tool builder in the western world, we need world-class talent in all of our departments. And we’re not just looking for people for the production floor. Haas is a very vertically integrated company, with a wide range of high-tech career opportunities available. The Planner/Scheduler 1 is responsible for performing routine planning and scheduling activities within operations departments at Haas.", "responsibilities": "Scheduling of sales orders, perform sales order changes and swaps of customer orders, Engineering Release (ER) implementation and associated activities, coordinate with Sales staff, maintenance of the production schedule, analyze basic problems that arise from the floor, releasing and scheduling of production orders, proactive addressing of alerts, capacity analysis, manual allocation of materials, creating and maintenance of BOM structures and routings, COGI management, cycle counting and verification of proper part consumption, general support for the manufacturing floor and other departments.", "qualifications": {"required": "Proficient in the use of Enterprise Resource Planning (ERP) Software, basic MRP knowledge, knowledge of Engineering Releases (ERs), experienced in the maintenance of the production schedule, knowledgeable in top-level machine variants, general knowledge of the shop and operational uniqueness of each department.", "preferred": "Some courses completed in Business/Supply Chain from a college or university is required, plus an additional 1+ years related experience."}, "skills": ["ERP Software", "MRP knowledge", "Engineering Releases", "Production scheduling", "BOM management"], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4003606158"}