{"jobTitle": "Sr. Manufacturing Engineering Manager", "company": {"name": "Stanley Black & Decker, Inc.", "industry": "Appliances, Electrical, and Electronics Manufacturing, Industrial Machinery Manufacturing, and Manufacturing", "location": "Brea, CA", "size": ""}, "location": "Brea, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "115,500.00/yr - 162,000.00/yr", "currency": "USD"}, "jobFunction": "Engineering", "industry": "Appliances, Electrical, and Electronics Manufacturing, Industrial Machinery Manufacturing, and Manufacturing", "description": "Sr. Manufacturing Engineering Manager – Brea, CA<br/><br/><strong>Make Your Mark. Shape Your Future.<br/><br/></strong>It takes great people to achieve greatness. People with a sense of purpose and integrity. People with a relentless pursuit of excellence. People who care about making things better For Those Who Make The World™. Sound like you? Join our top-notch team of more than 50,000 diverse and high-performing professionals globally who are making their mark on some of the world’s most beloved brands, including DEWALT®, BLACK+DECKER®, CRAFTSMAN®, STANLEY®, CUB CADET®, and HUSTLER®.<br/><br/><strong>The Job<br/><br/></strong>As a Sr. Manufacturing Engineering Manager, you’ll be part of our Engineering team working as an onsite employee. You’ll get to:<br/><br/><br/><ul><li>Lead the Manufacturing and Project Engineering team to deliver high quality technical output on time, focusing on accountability, efficiency, and learning; support the site and division strategies and initiatives. </li><li>Responsible for creating and maintaining adequate manufacturing procedure and processes; establish and enhance robust machining methods and tooling required for production; maintain accurate manufacturing standards. </li><li>Assist management with direct oversight of the manufacturing department's daily operations. Establish metrics and monitor team productivity; track and develop plans to improve employee utilization and efficiency. </li><li>Develop and implement a cross-training plan and maintain workforce skill level to meet business requirements; and conduct employee performance reviews/evaluations and development discussions to ensure professional growth. </li><li>Manage the department budget including staffing levels and overtime recommendations. </li></ul><li><br/><br/><br/></li>Lead efforts to identify root cause and instill the culture of problem solving; make appropriate process changes, and implementation of sustainable short/long term corrective and preventive actions; reduce or eliminate recurrence of quality issues and minimize scrap/rework costs.<br/><br/><strong>The Person<br/><br/></strong>You love to learn and grow and be acknowledged for your valuable contributions. You’re not intimidated by innovation. Wouldn’t it be great if you could do your job and do a world of good? In fact, you embrace it. You also have:<br/><br/><br/><ul><li>BS degree in Mechanical, Electrical, Aerospace or System Engineering or related technical field. </li><li>Six (6) years minimum experience as a Manufacturing Engineer or equivalent role. </li><li>Three (3) years minimum of manager/leadership experience in a manufacturing setting. </li><li>Ability to research, compile and analyze data effectively for reports or decision making. </li><li>Strong working knowledge of Six Sigma and Lean tools and methodologies. </li><li>Machining, metal-forming or complex assembly experience. <br/><br/><br/></li></ul><strong>The Details<br/><br/><br/></strong><ul><li>Competitive salary</li><li>Medical, dental, life, vision, wellness program, disability, 401(k), Employee Stock Purchase Plan, paid time off and tuition reimbursement. </li><li>Discounts on Stanley Black &amp; Decker tools and other partner programs. <br/><br/><br/></li></ul><strong>And More<br/><br/></strong>We want our company to be a place you’ll want to be – and stay. Being part of our team means you’ll get to:<br/><br/><br/><ul><li>Grow: Be part of our global company with 20+ brands to grow and develop your skills along multiple career paths. </li><li>Learn: Have access to a wealth of learning resources, including our digital learning portal. </li><li>Belong: Experience an awesome place to work, where we have mutual respect and a great appreciation for diversity, equity, and inclusion. </li><li>Give Back: Help us continue to make positive changes locally and globally through volunteerism, giving back, and sustainable business practices. <br/><br/><br/></li></ul>The base pay range for this position in California is $115,500.00 – 162,000.00 per year. Pay is based on market location and may vary depending on job-related knowledge, skills, and experience. A sign-on payment may be provided as part of the compensation package, in addition to a full range of medical, financial, and/or other benefits, dependent on the position offered. Applicants should apply via Stanley Black and Decker’s internal or external careers site.<br/><br/><strong><em>We Don’t Just Build The World, We Build Innovative Technology Too.<br/><br/></em></strong>Joining the Stanley Black &amp; Decker team means working in an innovative, tech-driven and highly collaborative team environment supported by over 58,000 professionals in 60 countries across the globe. Here, you’ll get the unique chance to impact some of the world’s most iconic brands including STANLEY TOOLS, DEWALT, CRAFTSMAN, MAC TOOLS and Black + Decker. Your ideas and solutions have the potential to reach millions of customers as we work together to write the next chapter in our history. Come build with us and take your career to new heights.<br/><br/><strong>Who We Are<br/></strong>We’re the World’s largest tool company. We’re industry visionaries. We’re solving problems and advancing the manufacturing trade through innovative technology and our Industry 4.0 Initiative. We are committed to ensuring our state-of-the-art “smart factory” products and services provide greater quality to our customers &amp; greater environmental and social value to our planet. We are unique in that we have a rich and storied history dating back to 1843, but that hasn't stopped us from evolving into a vibrant, diverse, global growth company.<br/><br/><strong>Benefits &amp; Perks<br/></strong>You’ll get a competitive salary and a comprehensive benefits plan that includes medical, dental, life, vision, wellness program, disability, retirement benefits, Employee Stock Purchase Plan, Paid Time Off, including paid vacation, holidays &amp; personal days, and tuition reimbursement. And, of course, discounts on Stanley Black &amp; Decker tools and products and well as discount programs for many other vendors and partners.<br/><br/><strong>What You’ll Also Get<br/></strong>Career Opportunity: Career paths aren’t linear here. Being part of our global company with 60+ brands gives you the chance to grow and develop your skills along multiple career paths.<br/><br/><strong>Learning &amp; Development: <br/><br/></strong>Our lifelong learning philosophy means you’ll have access to a wealth of state-of-the-art learning resources, including our Lean Academy and online university (where you can get certificates and specializations from renowned colleges and universities).<br/><br/><strong>Diverse &amp; Inclusive Culture:<br/><br/></strong>We pride ourselves on being an awesome place to work. We respect and embrace differences because that’s how the best work gets done. You’ll find we like to have fun here, too.<br/><br/><strong>Purpose-Driven Company:<br/><br/></strong>You’ll help us continue to make positive changes in the local communities where we work and live as well as in the broader world through volunteerism, giving back and sustainable business practices.<br/><br/><strong>EEO Statement:<br/><br/></strong>All qualified applicants to Stanley Black &amp; Decker are considered for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran’s status or any other protected characteristic.<br/><br/>If you require reasonable accommodation to complete an application or access our website, please contact us at (860) 827-3923 or at accommodations@sbdinc.com. Due to volume, we cannot respond to unrelated inquiries about the status of a completed application or resetting an account password.<br/><br/>Know Your Rights: Workplace discrimination is illegal (eeoc.gov)<br/><br/>", "responsibilities": "As a Sr. Manufacturing Engineering Manager, you’ll be part of our Engineering team working as an onsite employee. You’ll get to:<br/><br/><br/><ul><li>Lead the Manufacturing and Project Engineering team to deliver high quality technical output on time, focusing on accountability, efficiency, and learning; support the site and division strategies and initiatives. </li><li>Responsible for creating and maintaining adequate manufacturing procedure and processes; establish and enhance robust machining methods and tooling required for production; maintain accurate manufacturing standards. </li><li>Assist management with direct oversight of the manufacturing department's daily operations. Establish metrics and monitor team productivity; track and develop plans to improve employee utilization and efficiency. </li><li>Develop and implement a cross-training plan and maintain workforce skill level to meet business requirements; and conduct employee performance reviews/evaluations and development discussions to ensure professional growth. </li><li>Manage the department budget including staffing levels and overtime recommendations. </li></ul><li><br/><br/><br/></li>Lead efforts to identify root cause and instill the culture of problem solving; make appropriate process changes, and implementation of sustainable short/long term corrective and preventive actions; reduce or eliminate recurrence of quality issues and minimize scrap/rework costs.", "qualifications": {"required": "BS degree in Mechanical, Electrical, Aerospace or System Engineering or related technical field. \nSix (6) years minimum experience as a Manufacturing Engineer or equivalent role. \nThree (3) years minimum of manager/leadership experience in a manufacturing setting. \nAbility to research, compile and analyze data effectively for reports or decision making. \nStrong working knowledge of Six Sigma and Lean tools and methodologies. \nMachining, metal-forming or complex assembly experience.", "preferred": ""}, "skills": ["Six Sigma", "Lean", "Manufacturing", "Engineering", "Project Management", "Machining", "Metal Forming", "Assembly"], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "Competitive salary, Medical, dental, life, vision, wellness program, disability, 401(k), Employee Stock Purchase Plan, paid time off and tuition reimbursement. \nDiscounts on Stanley Black &amp; Decker tools and other partner programs.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003164625"}