{"jobTitle": "Account Manager (Digital Ad Agency)", "company": {"name": "Collier.Simon", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Collier.Simon is an independent, full-service creative agency in the Los Angeles/Hollywood area. As a data-driven creative shop, we are looking for individuals who strive to push creative boundaries and drive success for our clients through well-informed hypothesis, smart strategy and innovative thought leadership.<br/><br/>We are currently looking for a sharp, energetic, well-organized Account Manager with 2-4 years of marketing / advertising experience to join our team.<br/><br/>You must…<br/><br/><ul><li>Have hands-on experience supporting on social and digital campaigns</li><li>Be adept at working quickly and multi-tasking</li><li>Be comfortable interfacing with clients</li><li>Have outstanding communication skills (written and presentation)</li><li>Be comfortable working remotely on West Coast hours<br/><br/></li></ul><strong>What You'll Do<br/><br/></strong><ul><li>Manage the day-to-day progress and development of all client projects</li><li>Communicate effectively and professionally with key client contacts</li><li>Develop and monitor project timelines</li><li>Provide administrative and client service support on assigned accounts</li><li>Work with art directors, copywriters, external agencies and other client service team members to ensure work is done on time, within project budgets and exceeds expectations</li><li>Help review, evaluate, and critique creative ideas/output, to ensure that work meets brand and project strategies/objectives, client requests, and agency quality standards</li><li>Develop project statements of work and internal creative briefs in collaboration with the Account Lead</li><li>Help develop, edit, and fine-tune client presentations, creative decks, new business proposals, case studies</li><li>Manage client assets and key project information in support of creative work</li><li>Document discussions during client meetings and key internal meetings</li><li>Actively participate in strategic planning sessions, brainstorms and creative meetings with a point of view</li><li>Keep apprised of clients’ brands/products/services/marketing developments and general trends/happenings in advertising<br/><br/></li></ul>WHAT YOU’LL NEED:<br/><br/><ul><li>2-4 years of marketing or advertising experience in an agency environment</li><li>Strong communication skills- both written and verbal</li><li>Ability to manage time and load balance</li><li>Strong attention to detail and timeliness – ability to adhere to (and enforce) strict timelines</li><li>Proactive nature—always thinking a step ahead, get-it-done attitude</li><li>Dependability in execution of work and as member of the team</li><li>Strong interpersonal skills; able to effectively interface with internal/external teams</li><li>Enthusiastic, solution-oriented attitude in accepting work/new challenges<br/><br/></li></ul>This is a remote position. Candidates located in Southern California are preferred as there will be regular in-person meetings with clients and agency partners in LA and SoCal area.<br/><br/>Please note: We will only review candidates who include a cover letter sharing their experience as an Account Manager in a creative agency.<br/><br/><strong>Benefits<br/><br/></strong>We offer a comprehensive benefits package, including healthcare, 401K, and vacation/PTO policies, which will be discussed in detail during the interview process.<br/><br/>Collier.Simon provides equal employment opportunity to all individuals regardless of their race, color, creed, religion, gender, age, sexual orientation, national origin, disability, veteran status, or any other characteristic protected by state, federal, or local law.<br/><br/>Attention Job Seekers: Please be wary of recruitment and hiring scams. Collier.Simon will never ask you to pay an application fee, equipment fee, or to provide any other type of banking information. If you have any concerns about whether the communications you’ve received are legitimate, please don’t hesitate to reach out to us at hello@colliersimon.com.<br/><br/>Powered by JazzHR<br/><br/>qOU840iw0H", "responsibilities": "<ul><li>Manage the day-to-day progress and development of all client projects</li><li>Communicate effectively and professionally with key client contacts</li><li>Develop and monitor project timelines</li><li>Provide administrative and client service support on assigned accounts</li><li>Work with art directors, copywriters, external agencies and other client service team members to ensure work is done on time, within project budgets and exceeds expectations</li><li>Help review, evaluate, and critique creative ideas/output, to ensure that work meets brand and project strategies/objectives, client requests, and agency quality standards</li><li>Develop project statements of work and internal creative briefs in collaboration with the Account Lead</li><li>Help develop, edit, and fine-tune client presentations, creative decks, new business proposals, case studies</li><li>Manage client assets and key project information in support of creative work</li><li>Document discussions during client meetings and key internal meetings</li><li>Actively participate in strategic planning sessions, brainstorms and creative meetings with a point of view</li><li>Keep apprised of clients’ brands/products/services/marketing developments and general trends/happenings in advertising<br/><br/></li></ul>", "qualifications": {"required": "2-4 years of marketing or advertising experience in an agency environment, Strong communication skills- both written and verbal, Ability to manage time and load balance, Strong attention to detail and timeliness – ability to adhere to (and enforce) strict timelines, Proactive nature—always thinking a step ahead, get-it-done attitude, Dependability in execution of work and as member of the team, Strong interpersonal skills; able to effectively interface with internal/external teams, Enthusiastic, solution-oriented attitude in accepting work/new challenges<br/><br/>", "preferred": ""}, "skills": ["Social Media Marketing", "Digital Marketing", "Communication", "Client Management", "Project Management"], "postedDate": "1 week ago", "benefits": "We offer a comprehensive benefits package, including healthcare, 401K, and vacation/PTO policies, which will be discussed in detail during the interview process.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4003369874"}