{"jobTitle": "Export/Distribution Specialist", "company": {"name": "Elwood Staffing Services, Inc.", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Not specified", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "$27.90 / hour", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Contract-To-Hire Opportunity\n\nCompany Profile\n\n- Global Automotive Manufacturer\n- Began production in 1982 at the Marysville, OH location\n- State of the art plant, employs over 9,000 employees\n- Manufacture 680,000 vehicles per year and more than a million engines a year\n\nWhat's in it for you?\n\nElwood Professional associates are eligible for a comprehensive and competitive benefits package plus an exclusive savings program, including:\n\n- Medical/Vision/Dental/Rx plans\n- Holiday Pay\n- Teladoc (online care)\n- Referral Bonus Incentive\n- And More!\n\nExport/Distribution Specialist Details\n\n- Contract to Hire position\n- $27.90 / hour\n- First Shift (Monday through Friday from 08:00am to 05:00pm)\n- Customer service activities (Conduct monthly video conference calls, Distributor and Genpo visits, researching, analyzing, and providing ETA’s, coordinating orders. Daily communication, and understanding of customer market situation. Work with internal departments to expedite and address customer regulatory requirements, etc.)\n- Overall Export Service Level & Inter-Regional S/L @ N+2\n- New Model parts availability (ensure parts shipped on time for launch)\n- Export BO and CBO management (BO reduction, release, and recovery) and weekly presentations to executives\n- Reporting and special projects\n- Work with part centers and ECS Logistics to ensure shipments are processed and shipped on a timely basis\n- W37 Program (obtain forecasts, submit to IPC, track performance, CAPDo, annual review)", "responsibilities": "Customer service activities (Conduct monthly video conference calls, Distributor and Genpo visits, researching, analyzing, and providing ETA’s, coordinating orders. Daily communication, and understanding of customer market situation. Work with internal departments to expedite and address customer regulatory requirements, etc.) Overall Export Service Level & Inter-Regional S/L @ N+2 New Model parts availability (ensure parts shipped on time for launch) Export BO and CBO management (BO reduction, release, and recovery) and weekly presentations to executives Reporting and special projects Work with part centers and ECS Logistics to ensure shipments are processed and shipped on a timely basis W37 Program (obtain forecasts, submit to IPC, track performance, CAPDo, annual review)", "qualifications": {"required": "BA/BS degree in Business or equivalent required, Equivalent work experience in a business environment in lieu of a degree required, 2+ years of experience in export customer service or related field required, Bilingual - Spanish required", "preferred": "Proficiency in MS Office Suite preferred"}, "skills": ["Customer Service", "Export Management", "Logistics Coordination", "Bilingual - Spanish", "MS Office Suite"], "postedDate": "5 days ago", "applicationDeadline": "Not specified", "benefits": "Medical/Vision/Dental/Rx plans, Holiday Pay, Teladoc (online care), Referral Bonus Incentive, And More!", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4003531321"}