{"jobTitle": "Warehouse Admin/Receptionist", "company": {"name": "Kelly", "location": "Vernon, CA"}, "location": "Vernon, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "General Business", "industry": "Staffing and Recruiting", "description": "WAREHOUSE ADMIN in Vernon, CA<br/><br/>TEMP TO HIRE!!!<br/><br/>Payrate: $21.00 hour<br/><br/>Shift: Monday-Friday: 7am-4pm or 8am-5pm<br/><br/>Responsible for accurate and efficient handling of all incoming and outgoing calls as well as customer service.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li> Replaces receptionist during breaks (handles all incoming calls efficiently; handles incoming and outgoing faxes as required; handles and distributes all incoming mail and/or officer courier packages (while replacing receptionist)</li><li> Prepare and distribute daily reports</li><li> Assisting the warehouse with data entry of BOLs and invoices into the system<br/><br/></li></ul>Please apply and send me your most updated resume if your INDEED one is not up to date. STES817@KELLYSERVICES.COM. You can also reach me at 562-512-0339.<br/><br/>Thank you!<br/><br/>As part of our promise to talent, Kelly supports those who work with us through a variety of benefits, perks, and work-related resources. Kelly offers eligible employees voluntary benefit plans including medical, dental, vision, telemedicine, term life, whole life, accident insurance, critical illness, a legal plan, and short-term disability. As a Kelly employee, you will have access to a retirement savings plan, service bonus and holiday pay plans (earn up to eight paid holidays per benefit year), and a transit spending account. In addition, employees are entitled to earn paid sick leave under the applicable state or local plan. Click here for more information on benefits and perks that may be available to you as a member of the Kelly Talent Community.<br/><br/>Get a complete career fit with Kelly®.<br/><br/>You’re looking to keep your career moving onward and upward, and we’re here to help you do just that. Our staffing experts connect you with top companies for opportunities where you can learn, grow, and thrive. Jobs that fit your skills and experience, and most importantly, fit right on your path of where you want to go in your career.<br/><br/><strong>About Kelly<br/><br/></strong>Work changes everything. And at Kelly, we’re obsessed with where it can take you. To us, it’s about more than simply accepting your next job opportunity. It’s the fuel that powers every next step of your life. It’s the ripple effect that changes and improves everything for your family, your community, and the world. Which is why, here at Kelly, we are dedicated to providing you with limitless opportunities to enrich your life—just ask the 300,000 people we employ each year.<br/><br/>Kelly Services is proud to be an Equal Employment Opportunity and Affirmative Action employer. We welcome, value, and embrace diversity at all levels and are committed to building a team that is inclusive of a variety of backgrounds, communities, perspectives, and abilities. At Kelly, we believe that the more inclusive we are, the better services we can provide. Requests for accommodation related to our application process can be directed to Kelly’s Human Resource Knowledge Center. Kelly complies with the requirements of California’s state and local Fair Chance laws. A conviction does not automatically bar individuals from employment. Kelly participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.<br/><br/>", "responsibilities": "Responsible for accurate and efficient handling of all incoming and outgoing calls as well as customer service.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li> Replaces receptionist during breaks (handles all incoming calls efficiently; handles incoming and outgoing faxes as required; handles and distributes all incoming mail and/or officer courier packages (while replacing receptionist)</li><li> Prepare and distribute daily reports</li><li> Assisting the warehouse with data entry of BOLs and invoices into the system<br/><br/></li></ul>", "postedDate": "5 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4003494544"}