{"jobTitle": "Manager, Public Relations", "company": {"name": "Whatnot", "industry": "Technology, Information and Internet and Internet Marketplace Platforms", "size": "Not specified", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$155,000/year - $165,000/year", "currency": "USD"}, "jobFunction": "Public Relations", "industry": "Technology, Information and Internet and Internet Marketplace Platforms", "description": "Whatnot is the largest livestream shopping platform in North America and Europe to buy, sell, and discover the things you love. We’re building the future of ecommerce, bringing together community, shopping and entertainment. We are committed to our values, and as a remote co-located team, we operate out of hubs within the US, UK, Ireland, Poland, and Germany today. We’re innovating in the fast-paced world of live auctions from fashion, beauty, electronics to collectibles like trading cards, comic books, and even live plants. Whatnot has something for everyone. And, we’re growing. Whatnot has been one of the fastest growing marketplaces and we’re hiring forward-thinking problem solvers across all functional areas. The Communications team at Whatnot works across all areas of the business in both a proactive and reactive capacity and helps to shape and protect external and internal perceptions of Whatnot. We’re hiring for an experienced PR Manager to lead Trust & Safety, while supporting Corporate and Product-related priorities. As the Manager, Public Relations, you will be responsible for leading Trust & Safety communications while executing our corporate and product communications strategies. You’ll be an integral part of the team in supporting Whatnot’s brand and reputation, including media relations, crisis communications and external communications: Lead Trust & Safety Comms: Work cross-functionally with Policy, Commerce, Trust & Safety, and Legal to ensure we educate our community and the broader public around important policy topics and changes, from communications plans to partnering with Policy to develop content. Manage company response for crisis and navigate high-profile escalations in real-time with key stakeholders. Own Media Relations: Build relationships with key reporters while establishing Whatnot as a key resource, develop pitch angles that support and protect our broader business narratives, and create thought leadership opportunities for our spokespeople that will further position Whatnot as a trusted platform. Execute Corporate and Product Comms: Help drive brand awareness for Whatnot by regularly educating the press about what we do, driving thought leadership for our spokespeople, and leveraging company data and insights to move our key business and product narratives forward. Develop product messaging, blog posts, proactive pitches, case studies, and thought leadership narratives to spotlight the platform’s growth, innovation and new features. Team members in this role are required to be within commuting distance of our San Francisco, Los Angeles, or New York hubs.", "responsibilities": "Lead Trust & Safety Comms, Own Media Relations, Execute Corporate and Product Comms", "qualifications": {"required": "6+ years of Public Relations or corporate communications and product communications experience", "preferred": "Experience working on Trust & Safety issues and crisis management, A strong understanding of the tech or e-commerce and policy landscape, Experience collaborating with product teams to distill complex language into a digestible narrative, Strong project management capabilities including planning, prioritizing and execution, Exceptional writing skills, ability to quickly message complex topics for multiple audiences, Experience forging relationships and working cross-functionally with marketing, Trust & Safety, product, legal, and policy teams, High-growth startup, marketplace or creator-focused platform experience preferred."}, "skills": ["Public Relations", "Crisis Management", "Media Relations", "Project Management", "Communication Strategies"], "postedDate": "3 days ago", "applicationDeadline": "Not specified", "benefits": "Flexible Time off Policy and Company-wide Holidays (including a spring and winter break), Health Insurance options including Medical, Dental, Vision, Work From Home Support, Care benefits, Retirement; 401k offering for Traditional and Roth accounts in the US (employer match up to 4% of base salary) and Pension plans internationally, Parental Leave.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4003991480"}