{"jobTitle": "Demand Planner", "company": {"name": "Henkel", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00 - $100,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Chemical Manufacturing and Manufacturing", "description": "At Henkel, you can build on a strong legacy and leading positions in both industrial and consumer businesses to reimagine and improve life every day. If you love challenging the status quo, join our community of over 47.000 pioneers around the globe. Our teams at Henkel Consumer Brands continuously drive the evolution in dynamic categories: Laundry & Home Care and Hair. With our trusted brands, including Persil and Schwarzkopf, our cutting-edge technologies and our disruptive solutions, you will have countless opportunities to explore new paths and develop your skills. Grow within our future-led businesses, our diverse and vibrant culture and find a place where you simply belong. All to leave your mark for more sustainable growth.<br/><br/><strong>Dare to make an impact?<br/><br/></strong><strong> Your Role<br/><br/></strong><ul><li>Maintain detailed item level base business forecasts in volume and value and proactively anticipate and track risks and opportunities to the forecast. </li><li>Work closely with Sales and Marketing to analyze quantitative and qualitative inputs to the forecast such as trade promotion plans, competitive impacts, new item launches, and cannibalization in the development and delivery of the monthly demand plan. </li><li>Lead a monthly drumbeat of meetings as part of the Sales and Operations Planning process, coordinating cross functionally between sales, marketing, finance and operations. </li><li>Improve forecast accuracy to drive improvement in KPIs such as service level and inventory carry. </li><li>Originate and implement continuous improvements to the demand planning and S&OP processes. </li><li>Support the company’s culture and business mission by promoting communication, teamwork, and the respectful treatment of all individuals. <br/><br/></li></ul><strong> YOUR SKILLS <br/><br/></strong><ul><li>Bachelor’s degree is required. </li><li>2+ years of experience in a Demand Planning or similar role is required. </li><li>Excellent organizational and time-management abilities and the ability to influence and collaborate with personnel at all organizational levels. </li><li>Demonstrated leadership and process improvement skills (proven ability to identify, conduct root cause analysis and take action to fix issues). </li><li>Excellent analytical and problem-solving skills. </li><li>Proficient in Excel and PowerPoint. </li><li>Knowledge of integrated business management processes. SAP experience preferred. <br/><br/></li></ul>The salary for this role is $80,000.00 - $100,000.00. This is the range that we in good faith anticipate relying on when setting wages for this position. We may ultimately pay more or less than the posted range and this range. This salary range may also be modified in the future.<br/><br/>Henkel does not accept unsolicited resumes from search firms or employment agencies. Unsolicited referrals and resumes are considered Henkel property and therefore, Henkel will not pay a fee for any placement resulting from the receipt of an unsolicited referral. At Henkel's request only, preferred vendors may be invited to refer talent for specific open positions. In these cases, a fully-executed agreement with Henkel must be in place and current.<br/><br/>At Henkel, we come from a broad range of backgrounds, perspectives, and life experiences. We believe the uniqueness of all our employees is the power in us. Become part of the team and bring your uniqueness to us! We welcome all applications across different races, colors, religions, sexes, national origins, disabilities, veteran statuses, ages, sexual orientations, gender identities and expressions, and other legally protected characteristics.", "responsibilities": "Maintain detailed item level base business forecasts in volume and value and proactively anticipate and track risks and opportunities to the forecast. \nWork closely with Sales and Marketing to analyze quantitative and qualitative inputs to the forecast such as trade promotion plans, competitive impacts, new item launches, and cannibalization in the development and delivery of the monthly demand plan. \nLead a monthly drumbeat of meetings as part of the Sales and Operations Planning process, coordinating cross functionally between sales, marketing, finance and operations. \nImprove forecast accuracy to drive improvement in KPIs such as service level and inventory carry. \nOriginate and implement continuous improvements to the demand planning and S&OP processes. \nSupport the company’s culture and business mission by promoting communication, teamwork, and the respectful treatment of all individuals.", "qualifications": {"required": "Bachelor’s degree is required. \n2+ years of experience in a Demand Planning or similar role is required. \nExcellent organizational and time-management abilities and the ability to influence and collaborate with personnel at all organizational levels. \nDemonstrated leadership and process improvement skills (proven ability to identify, conduct root cause analysis and take action to fix issues). \nExcellent analytical and problem-solving skills. \nProficient in Excel and PowerPoint. \nKnowledge of integrated business management processes. SAP experience preferred.", "preferred": "SAP experience"}, "skills": ["Demand Planning", "Sales and Operations Planning", "Forecasting", "KPI", "Process Improvement", "Communication", "Teamwork", "Excel", "PowerPoint", "SAP"], "postedDate": "5 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003359205"}