{"jobTitle": "Senior Human Resources Business Partner", "company": {"name": "PIH Health", "location": "Whittier, CA", "industry": "Hospitals and Health Care"}, "location": "Whittier, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "92,955.20/yr - 153,358.41/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Hospitals and Health Care", "description": "Tracking Code<br/><br/>23089-977<br/><br/>Job Location<br/><br/>12401 Washington Blvd., Whittier, California<br/><br/>Category<br/><br/>Professional<br/><br/>Reporting to the Director of Human Resources, the Sr. Human Resources Business Partner, under minimal direction, will provide comprehensive HR support in the areas of talent management, recruitment/staffing, compensation and benefits, training and development, performance management, and employee relations, and employment law/compliance. This role will partner and consult with the Corporate Team, HR team, and functional leaders to serve as a strategic business partner to ensure high-quality HR administration. The position will entail multi-client responsibility and may require travel for occasional leadership and employee meetings.<br/><br/>PIH Health is a nonprofit, regional healthcare network that serves approximately 3 million residents in the Los Angeles County, Orange County and San Gabriel Valley region. The fully integrated network is comprised of PIH Health Downey Hospital, PIH Health Good Samaritan Hospital, PIH Health Whittier Hospital, 37 outpatient medical office buildings, a multispecialty medical (physician) group, home healthcare services and hospice care, as well as heart, cancer, digestive health, orthopedics, women’s health, urgent care and emergency services. The organization is nationally recognized for excellence in patient care and patient experience, and the College of Healthcare Information Management Executives (CHIME) has identified PIH Health as one of the nation’s top hospital systems for best practices, cutting-edge advancements, quality of care and healthcare technology. For more information, visit PIHHealth.org or follow us on Facebook, Twitter, or Instagram.<br/><br/><strong>Required Skills<br/><br/></strong><ul><li>Expert ability to conduct and complete objective investigations, document findings and make recommendations.</li><li>Ability to handle details of a highly confidential and critical nature.</li><li>Expert ability to communicate verbally and in writing.</li><li>Expert ability to facilitate discussions between management and staff.</li><li>Expert ability to establish and maintain interpersonal relationships with diverse groups of individuals (business leaders, legal counsel, colleagues, and the staff at all levels).</li><li>Extensive knowledge of applicable state and federal employment and labor laws</li><li>Solid knowledge of software applications including Microsoft Word, PowerPoint, Excel, Email, and HRIS.</li><li>Solid knowledge of all human resources disciplines.</li><li>Solid ability to manage conflict and exercise good judgment in selecting methods and techniques for obtaining.</li><li>Ability to make formal presentations on a variety of related leadership/human resources topics, ability to influence leaders and establish collaborative partnerships; strong strategic planning and operational implementation skills, ability to effectively manage dynamic projects with multiple priorities; ability to work collaboratively with a variety of people and team members to ensure strong leadership, coaching and consulting skills. Knowledge and experience with teaching and training, use of A/V equipment, and adult-learning techniques.</li><li>Excellent organizational, planning, and time management skills</li><li>Basic knowledge of contracts and legal documents to interpret information.<br/><br/></li></ul><strong>Required Experience<br/><br/></strong><strong>Required:<br/><br/></strong><ul><li>8+ years of experience managing the HR function in a generalist role</li><li>3+ years of Healthcare Human Resources experience, supporting at least 500 employees or more</li><li>BA or BS degree from an accredited college or university or equivalent work experience</li><li>Significant experience resolving complex employee relations issues</li><li>Excellent communication (written and verbal) and interpersonal skills</li><li>Seasoned consulting skills and advanced negotiator with all levels of the organization</li><li>Strong computer skills including intermediate or above the knowledge of Microsoft Office Programs</li><li>Ability to think systemically and consult strategically with all levels of managers and leaders</li><li>Knowledge of state and federal employment laws and regulations, including experience responding to complaints issued through federal and state government agencies</li><li>Managerial courage; able to have effective critical conversations, using diplomacy and tact to diffuse high tension situations effectively</li><li>High-level collaboration &amp; teamwork skills</li><li>Ability to work under pressure with multiple deadlines and stakeholders in a fast-paced environment</li><li>Strong interpersonal skills</li><li>Proficient with Microsoft Office Suite applications including Intermediate Excel, Word, PowerPoint, and Outlook.</li><li>Can exercise a high degree of professionalism and diplomacy in interactions with all levels of the organization</li><li>Excellent judgment and self-awareness</li><li>Ability to develop thorough talent planning and management solutions</li><li>Advanced understanding of employee engagement and retention strategies<br/><br/></li></ul><strong>Preferred:<br/><br/></strong><ul><li>Organizational Development experience</li><li>Labor relations experience</li><li>Union experience</li><li>Master’s Degree in Human Resources or related field</li><li>PHR/SPHR/SHRMP-CP/SHRM-SCP<br/><br/></li></ul>Minimum Salary<br/><br/>$92,955.20<br/><br/>Maximum Salary<br/><br/>$153,358.40", "responsibilities": "Reporting to the Director of Human Resources, the Sr. Human Resources Business Partner, under minimal direction, will provide comprehensive HR support in the areas of talent management, recruitment/staffing, compensation and benefits, training and development, performance management, and employee relations, and employment law/compliance. This role will partner and consult with the Corporate Team, HR team, and functional leaders to serve as a strategic business partner to ensure high-quality HR administration. The position will entail multi-client responsibility and may require travel for occasional leadership and employee meetings.", "qualifications": {"required": "Expert ability to conduct and complete objective investigations, document findings and make recommendations. Ability to handle details of a highly confidential and critical nature. Expert ability to communicate verbally and in writing. Expert ability to facilitate discussions between management and staff. Expert ability to establish and maintain interpersonal relationships with diverse groups of individuals (business leaders, legal counsel, colleagues, and the staff at all levels). Extensive knowledge of applicable state and federal employment and labor laws Solid knowledge of software applications including Microsoft Word, PowerPoint, Excel, Email, and HRIS. Solid knowledge of all human resources disciplines. Solid ability to manage conflict and exercise good judgment in selecting methods and techniques for obtaining. Ability to make formal presentations on a variety of related leadership/human resources topics, ability to influence leaders and establish collaborative partnerships; strong strategic planning and operational implementation skills, ability to effectively manage dynamic projects with multiple priorities; ability to work collaboratively with a variety of people and team members to ensure strong leadership, coaching and consulting skills. Knowledge and experience with teaching and training, use of A/V equipment, and adult-learning techniques. Excellent organizational, planning, and time management skills Basic knowledge of contracts and legal documents to interpret information.<br/><br/>8+ years of experience managing the HR function in a generalist role 3+ years of Healthcare Human Resources experience, supporting at least 500 employees or more BA or BS degree from an accredited college or university or equivalent work experience Significant experience resolving complex employee relations issues Excellent communication (written and verbal) and interpersonal skills Seasoned consulting skills and advanced negotiator with all levels of the organization Strong computer skills including intermediate or above the knowledge of Microsoft Office Programs Ability to think systemically and consult strategically with all levels of managers and leaders Knowledge of state and federal employment laws and regulations, including experience responding to complaints issued through federal and state government agencies Managerial courage; able to have effective critical conversations, using diplomacy and tact to diffuse high tension situations effectively High-level collaboration & teamwork skills Ability to work under pressure with multiple deadlines and stakeholders in a fast-paced environment Strong interpersonal skills Proficient with Microsoft Office Suite applications including Intermediate Excel, Word, PowerPoint, and Outlook. Can exercise a high degree of professionalism and diplomacy in interactions with all levels of the organization Excellent judgment and self-awareness Ability to develop thorough talent planning and management solutions Advanced understanding of employee engagement and retention strategies<br/><br/>", "preferred": "Organizational Development experience Labor relations experience Union experience Master’s Degree in Human Resources or related field PHR/SPHR/SHRMP-CP/SHRM-SCP<br/><br/>"}, "skills": ["HRIS", "Talent Management", "Recruitment", "Compensation and Benefits", "Training and Development", "Performance Management", "Employee Relations", "Employment Law", "Compliance", "Strategic Planning", "Operational Implementation", "Leadership", "Coaching", "Consulting", "Conflict Management", "Microsoft Office", "Excel", "Word", "PowerPoint", "Outlook", "Talent Planning", "Employee Engagement", "Retention Strategies", "Organizational Development", "Labor Relations", "Union Experience"], "postedDate": "3 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003632110"}