{"jobTitle": "Car Delivery Driver", "company": {"name": "Insomnia Cookies", "industry": "Restaurants", "size": "Not specified", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$20.00/hr plus tips", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Restaurants", "description": "As a Car Delivery Driver at our UCLA store located at 945 Westwood BLVD, Los Angeles CA 90024, you are our “Boots on the ground!”, and the main face that our Insomniacs see outside of the bakery! You give the word “Delivery” a whole new meaning by delivering the Cookie Magic to our fans wherever they are.\n\nSOME OUR SWEET DELIVERY DRIVER PERKS:\n- Starting off at $20.00/hr plus tips\n- Pay on Demand (why wait until the end of the week…get paid your earned wages at the end of the day!)\n- Small but busy delivery zones\n- Paid vacation and sick time off\n- Flexible part-time work schedules\n- Pet insurance for your furry loved ones\n- Job stability with a rapidly growing and reputable company\n- Achievable growth/promotion opportunities\n- FREE cookies with every shift!\n\nWHAT WILL I DO AS A DELIVERY DRIVER?\n- Check orders for quality and accuracy before they leave the store\n- Deliver our cookies, milk and ice cream to our loyal fan base, in a timely and safe fashion\n- Provide quality customer service through positive and professional interaction with customers whether in-person or by phone\n- Use Insomnia’s delivery app to approved company standards and provide accurate status updates to customers\n\nDESIRED SKILLS/EXPERIENCE:\n- Excellent time management and organizational skills\n- Knowledge of the 2-mile radius surrounding the store is a plus!\n- Must have your own car, license, valid registration, and valid insurance\n- Must be able to pass a motor vehicles background check\n- Must have a smartphone with data plan\n- Must be legally eligible to work in the United States\n- Must be 18 years or older to be employed\n\nAbout us:\nInsomnia Cookies was founded in a college dorm room by then-student, Seth Berkowitz. Fast forward 20 years and so... many....cookies... later, our innovative bakery + delivery concept has become a cult brand known for its rabid following of cookie lovers who crave Insomnia’s warm, delicious delivery all day and late into the night. With an expanding footprint of over 290 stores globally, an experiential, “sweet-easy” concept as the brand’s flagship in Philadelphia, Pa. (where Insomnia Cookies is headquartered), and a rapidly-growing nationwide shipping and gifting portfolio... Insomnia Cookies is revolutionizing the cookie game by truly \"Imagining What’s Possible\"!", "responsibilities": "Check orders for quality and accuracy before they leave the store; Deliver our cookies, milk and ice cream to our loyal fan base, in a timely and safe fashion; Provide quality customer service through positive and professional interaction with customers whether in-person or by phone; Use Insomnia’s delivery app to approved company standards and provide accurate status updates to customers.", "qualifications": {"required": "Must have your own car, license, valid registration, and valid insurance; Must be able to pass a motor vehicles background check; Must have a smartphone with data plan; Must be legally eligible to work in the United States; Must be 18 years or older to be employed.", "preferred": "Excellent time management and organizational skills; Knowledge of the 2-mile radius surrounding the store is a plus!"}, "skills": ["Excellent time management", "Organizational skills", "Customer service", "Knowledge of local area", "Valid driver's license", "Smartphone with data plan"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Paid vacation and sick time off; Flexible part-time work schedules; Pet insurance; Job stability; Growth opportunities; Free cookies with every shift!", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4003112210"}