{"jobTitle": "Coordinator - Bilingual Mandarin / Hybrid Remote", "company": {"name": "RemoteWorker US", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Master all the clinical pretzels and be able to distribute GC among the IP/agents based on their preferences and clinical requirements.</li><li>Update clinical protocol and agent preference and create a demographic pool for match</li><li>Oversee the matches and prioritize IP/agents as needed</li><li>Consult with intended parents to understand their preferences and needs.</li><li>Match intended parents with suitable surrogates, taking into account the preferences and needs of both parties.</li><li>Facilitate communication between intended parents and surrogates, ensuring a positive and supportive relationship throughout the surrogacy process.</li><li>Provide support and explanation to intended parents throughout the matching stage, including completing the initial consultation, initiating match video conferencing, coordinating and scheduling GC medical screening, GC psychological evaluation, and legal</li><li>Maintain accurate and confidential records of all matches and communications.</li><li>Stay up-to-date with current surrogacy laws and regulations, and ensure that all matches comply with legal requirements.</li><li>Master all the clinical protocols and oversee and match process, improve Intended parent's satisfaction, and reduce the number of a failed match</li><li>Ensure surrogate's profiles are completed with care and high standard and meet IP satisfaction<br/><br/></li></ul><strong>Requirements:<br/><br/></strong><ul><li>Strong sourcing and interviewing skills Excellent communication, negotiation, and interpersonal skills</li><li>Familiarity with IVF, Surrogacy field</li><li>Prior experience as an intended parent, surrogate, or egg donor or experience working in the surrogacy industry is strongly preferred</li><li>High attention to detail and ability to multitask/prioritize</li><li>Critical thinking and problem-solving capability</li><li>Ability to work in a fast-paced environment with time-sensitive work deadlines</li><li>Familiarity utilizing client databases</li><li>Team player; comfortable working in an interdisciplinary environment</li><li>Takes initiative to work independently</li><li>Goal-oriented<br/><br/></li></ul><strong>If you have a passion for helping families grow and a commitment to ethical and professional practices, we want to hear from you! Apply now to join our team.<br/><br/></strong><strong><strong>Benefits<br/><br/></strong></strong><ul><li>$19 - $23/hr, based on skills and experience</li><li>Competitive benefits package for our full-time employees includes:</li><li>Health insurance</li><li>Paid time off</li><li>401(k)</li><li>Weekend availability<br/><br/></li></ul><strong>Schedule:<br/><br/></strong><ul><li>8-hour shift<br/><br/></li></ul><strong>Company Description<br/><br/></strong>Joy of Life starts gestational surrogate journeys at the center of our focus, which serves the best interests of both surrogates and intended parents with the ultimate goal of creating families. For over 6 years, we’ve helped couples and singles fulfill their dreams of parenthood by helping bring more than 200 babies into this world... and counting. Our approach is intimate, caring, and professional. Seeking independent, self-driven, and highly empathetic talent to join our family in building a long-term career in the field of Surrogacy Management Services. The IP Match Facilitator is responsible for the successful matching of intended parents with surrogates and helps to coordinate matches between intended parents and surrogates. This position is ideal for someone who is customer-service oriented and has high emotional intelligence, along with strong organizational skills.<br/><br/><strong>Company Description<br/><br/></strong>Joy of Life starts gestational surrogate journeys at the center of our focus, which serves the best interests of both surrogates and intended parents with the ultimate goal of creating families. For over 6 years, we’ve helped couples and singles fulfill their dreams of parenthood by helping bring more than 200 babies into this world... and counting. Our approach is intimate, caring, and professional. Seeking independent, self-driven, and highly empathetic talent to join our family in building a long-term career in the field of Surrogacy Management Services. The IP Match Facilitator is responsible for the successful matching of intended parents with surrogates and helps to coordinate matches between intended parents and surrogates. This position is ideal for someone who is customer-service oriented and has high emotional intelligence, along with strong organizational skills.", "postedDate": "3 days ago", "skills": ["Sourcing", "Interviewing", "Communication", "Negotiation", "Interpersonal Skills", "IVF", "Surrogacy", "Customer Service", "Emotional Intelligence", "Organizational Skills"], "url": "https://www.linkedin.com/jobs/view/4003250407"}