{"jobTitle": "Cookie Delivery Driver", "company": {"name": "Insomnia Cookies", "industry": "Restaurants", "size": "Not specified", "location": "Riverside, CA"}, "location": "Riverside, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$20.00/hr plus tips", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Restaurants", "description": "Insomnia Cookies is one of the fastest growing, late-night, sweet indulgence companies in the country, and we are set to open our newest store in Riverside, CA later this year! At the present time, we are actively interviewing Delivery Drivers for our store located at 1299 University Ave Ste 103, Riverside, CA 92507. As a Delivery Driver, you are our “Boots on the ground!”, and the main face that our Insomniacs see outside of the bakery! You give the word “Delivery” a whole new meaning by delivering the Cookie Magic to our fans wherever they are. Check out some of our content vids to learn more! Who We Are! Insomnia Cookies Timeline Core Values SOME OUR SWEET DELIVERY DRIVER PERKS: Pay-on-Demand (no longer do you have to wait until the end of the week. Get paid daily for your total shift earnings from the day before!) Starting off at $20.00/hr plus tips Small but busy delivery zone Paid vacation and sick time off Flexible part-time work schedules Pet insurance for your furry loved ones Ability to enroll in our nationwide GasBuddy discounted fuel program Ability to enroll in our nationwide Jiffy Lube car maintenance program Job stability with a rapidly growing and reputable company Achievable growth/promotion opportunities FREE cookies with every shift! WHAT WILL I DO AS A DELIVERY DRIVER? Check orders for quality and accuracy before they leave the store Deliver our cookies, milk and ice cream to our loyal fan base, in a timely and safe fashion Provide quality customer service through positive and professional interaction with customers whether in-person or by phone Use Insomnia’s delivery app to approved company standards and provide accurate status updates to customers DESIRED SKILLS/EXPERIENCE: Excellent time management and organizational skills Knowledge of the 2-mile radius surrounding the store is a plus! Must have your own car, license, valid registration, and valid insurance Must be able to pass a motor vehicles background check Must have a smartphone with data plan Must be legally eligible to work in the United States Must be 18 years or older to be employed About us: Insomnia Cookies was founded in a college dorm room by then-student, Seth Berkowitz. Fast forward 20 years and so... many....cookies... later, our innovative bakery + delivery concept has become a cult brand known for its rabid following of cookie lovers who crave Insomnia’s warm, delicious delivery all day and late into the night. With an expanding footprint of over 290 stores globally, an experiential, “sweet-easy” concept as the brand’s flagship in Philadelphia, Pa. (where Insomnia Cookies is headquartered), and a rapidly-growing nationwide shipping and gifting portfolio... Insomnia Cookies is revolutionizing the cookie game by truly \"Imagining What’s Possible\"!", "responsibilities": "Check orders for quality and accuracy before they leave the store. Deliver our cookies, milk and ice cream to our loyal fan base, in a timely and safe fashion. Provide quality customer service through positive and professional interaction with customers whether in-person or by phone. Use Insomnia’s delivery app to approved company standards and provide accurate status updates to customers.", "qualifications": {"required": "Must have your own car, license, valid registration, and valid insurance. Must be able to pass a motor vehicles background check. Must have a smartphone with data plan. Must be legally eligible to work in the United States. Must be 18 years or older to be employed.", "preferred": "Knowledge of the 2-mile radius surrounding the store is a plus! Excellent time management and organizational skills."}, "skills": ["Excellent time management", "Organizational skills", "Customer service", "Delivery driving"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Pay-on-Demand, Paid vacation and sick time off, Flexible part-time work schedules, Pet insurance, GasBuddy discounted fuel program, Jiffy Lube car maintenance program, FREE cookies with every shift.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4003105888"}