{"jobTitle": "Fiscal Assistant", "company": {"name": "South Coast Air Quality Management District", "location": "Diamond Bar, CA", "industry": "Government Administration"}, "location": "Diamond Bar, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "postedDate": "6 days ago", "description": "South Coast Aqmd And Job Overview<br/><br/><strong> ABOUT SOUTH COAST AQMD <br/><br/></strong>South Coast Air Quality Management District (South Coast AQMD) is one of the largest and most technologically sophisticated environmental regulatory agencies in the Nation. We serve a four-county region that includes large areas of Los Angeles, Orange County, Riverside and San Bernardino counties, including the Coachella Valley, which is home to more than 17 million people. South Coast AQMD's headquarters is located in Diamond Bar, 30 miles east of downtown Los Angeles, at the junction of the 57 and 60 freeways. With a highly diverse \"Clean Air Team\" of over 850 employees, an annual budget of $211.4 million, and a state-of-the art air quality laboratory, our mission is to ensure clean air and a healthy environment. South Coast AQMD is an organization you can be proud to work for -- we make a difference in the quality of life in Southern California!<br/><br/><strong>About This Position<br/><br/></strong>The South Coast AQMD is seeking qualified candidates for our Fiscal Assistant position in the Finance division. From this recruitment process, we expect to establish an eligible list from which current and future vacancies may be filled, during the life of the list.<br/><br/>Our Fiscal Assistant is an experienced, journey-level class with responsibility for performing a variety of clerical accounting or fiscal purchasing assignments of moderate difficulty, within established procedures and without close supervision. We need candidates who are flexible, eager to learn, enjoy new challenges, and willing to accept a wide variety of assignments.<br/><br/>Fiscal Assistants in Cash Management are responsible for daily tasks such as, receiving and posting cash, check, and credit card payments in the accounts receivable system, opening and sorting mail, filing all cash receipts and supporting documents, providing documentation to the Billing Services unit, reconciling end-of-day batch reports, preparing Miscellaneous Cash Receipts log, and reconciling daily lock box cash postings for exceptions. Additional tasks may include weekly printing of accounts payable checks, preparing necessary documents for issuing manual refunds, logging incoming and outgoing loose checks, and participating in the annual fixed asset inventory process.<br/><br/>Fiscal Assistants in Accounting/Accounts Payable are responsible for daily tasks such as examining the accuracy of the invoice, verifying the proper approval of the invoice, recalculating the sales tax based on the current sales tax rate, checking coding of the invoice to the appropriate expense account, matching the invoice to the purchase order or contract, processing the invoice in PeopleSoft, matching the voucher posting report, reviewing the credit card statement, preparing daily cash deposit and preparing journal entries as needed. Additional tasks may include communicating with vendors and communicating with the employees in the other departments within the South Coast AQMD. Fiscal Assistants are heavily involved in the fiscal year end process and providing information to the external financial statement auditors.<br/><br/><strong>EXAMPLE OF DUTIES<br/><br/></strong>The general Example of Duties for this classification are highlighted below, for full description of duties please refer to the job description linked here .<br/><br/><ul><li> Prepares, maintains, reviews, and processes fiscal documents related to accounts receivable, accounts payable, payroll, and purchasing invoicing records. </li><li> Compiles and recomputes bills, vouchers, invoices, requisitions, and purchase orders. </li><li> Reviews fiscal documents and processes claims against the South Coast AQMD by checking for arithmetical accuracy. </li><li> Verifies claims against billing and other supporting documents and determines adherence to prescribed clerical accounting practices and procedures. </li><li> Assists in the preparation and processing of the South Coast AQMD payroll. </li><li> Compiles fiscal and statistical data to prepare standardized reports. Posts transactions manually or by computer or data-entry terminal to subsidiary ledgers and journals. </li><li> Verifies and balances accounts and other fiscal records. Contacts South Coast AQMD employees or vendors to obtain and/or clarify information concerning payroll, purchasing matters, claims or payments. </li><li> Traces , locates, and reconciles discrepancies and makes adjustments to appropriate accounts. </li><li> Operates a computer, typewriter, calculator, and a variety of automated data processing office equipment. </li><li> Sorts , batches, and codes material for data entry. </li><li> Enters , updates, and retrieves information from a computerized recordkeeping system. </li><li> May assist in taking physical inventory of fixed assets or verifying the accuracy of stock and equipment accounts by balancing receipts, invoices, and statements. </li><li> Reconciles property listings or invoices and prepares statistical reports reflecting inventory. </li><li> Contacts vendors and or representatives to resolve invoicing differences. <br/><br/></li></ul><strong>Minimum And Desirable Qualifications<br/><br/></strong><strong> DESIRABLE QUALIFICATIONS <br/><br/></strong>In addition to the Minimum Qualifications , which follow, the most competitively qualified candidates will possess:<br/><br/><ul><li> A bachelor's degree from an accredited college or university in accounting, finance, business administration or a closely related field. </li><li> At least one (1) year of full-time experience working in a financial or accounting environment; preferably at a public agency. </li><li> Proficiency with PeopleSoft Financial Systems or an equivalent automated accounting system, and Microsoft Office Suite (Excel, Word, Outlook). </li><li> Experience processing, recording and maintaining a variety of fiscal and statistical records. </li><li> Demonstrated ability to meet deadlines with accuracy and attention to detail. </li><li> Excellent communication skills and the ability to maintain positive working relationships with others. <br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><strong>Option I:</strong> One (1) year as an Office Assistant for South Coast AQMD<br/><br/><ul><li>OR- <br/><br/></li></ul><strong>Option II: </strong>Two (2) years performing clerical work.<br/><br/><strong> SUBSTITUTION: </strong> Completion of 18 semester (27 quarter) units from an accredited college or university in fiscal recordkeeping, accounting, business math, or a closely related field, or completion of 360 hours of training from a recognized occupational training program in any of the above-listed areas may substitute for up to one year of the experience required under Option II.<br/><br/><strong>Other Important Information<br/><br/></strong><strong> APPLICATION PACKETS MUST INCLUDE <br/><br/></strong>A completed employment application covering at least the past 10 years of employment history (or longer if you have other relevant experience), and your entire South Coast AQMD employment history if you are a South Coast AQMD employee. Up to four references which include the names and phone numbers of your present and past supervisors or managers, and/or college professors or persons for whom you have directly provided services, <strong> not peers </strong>. Responses to the Supplemental Questionnaire (SQ). The SQ is a form of written test, and will be evaluated as such. Your responses should be well written, clear, concise, and directly responsive to the question. An unofficial copy of your transcripts (or equivalency evaluation if your education was obtained outside the U.S.), documenting all qualifying education claimed, submitted as an attachment to your online application* .<br/><br/><ul><li>You MUST submit acceptable documentation for all education claimed on your application. Acceptable documentation consists of an unofficial copy of your transcripts/equivalency evaluation attached to your application . At a later date, candidates under final consideration will be required to arrange for original, official transcripts (or equivalency evaluation, if applicable) to be mailed directly from their college/university to South Coast AQMD, documenting all education claimed on their application.<br/><br/></li></ul><strong>Job applications must be completely filled out. </strong> A resume cannot be substituted for the required information. Be sure to detail any education, training or other relevant coursework that would make you a particularly strong candidate.<br/><br/><strong> THE SELECTION PROCESS <br/><br/></strong>Application packets, including responses to the Supplemental Questionnaire, will first be screened, and the most competitively qualified candidates will be invited to a multiple-choice examination, to be rated on a pass/fail basis. Candidates who pass the exam will advance to the next step in the process, which may include a panel interview (weighted at 100%). (Please note that all exams/interviews will be conducted remotely).<br/><br/>Following the exam and/or interviews, a ranked eligible list is expected to be created, from which current and future vacancies may be filled, during the 6-12 month life of the list. Only those who demonstrate at each successive step of the selection process that they are among the most competitively qualified will be advanced to the next step. (Meeting the minimum qualifications does not guarantee an invitation to future steps in the process.)<br/><br/>Important note for potential candidates who do not have the continued and unrestricted right to work full time in the United States: If you currently, or will in the future, require sponsorship (i.e., H1-B Visa) in order to maintain your right to work in the United States, please be aware that decisions regarding sponsorship for maintaining a right to work in the United States are made on a case-by-case basis. You are welcome to participate in this recruitment process, but there is no guarantee that a job offer with the requested sponsorship will be made to you.<br/><br/>South Coast AQMD reserves the right to add, delete, or modify any elements of the selection process as deemed appropriate, based on the number and quality of applicants at each step.<br/><br/>Candidates who may need accommodations during the selection process must call the Human Resources Department at least one week prior to any test dates.<br/><br/>If you have any questions regarding this recruitment, please contact the Human Resources Department at (909) 396-2800.<br/><br/><strong>Office Clerical &amp; Maintenance Employee Benefit Overview<br/><br/></strong><strong> BENEFIT <br/><br/></strong><strong>Description<br/><br/></strong><strong> Monthly Benefit Allotment <br/><br/></strong>$1,912.00, to purchase medical, dental, and life insurance, with unused portion paid to you as cash. Insurance coverage becomes effective on the first of themonth following completion of 30 days of continuous service. Dependent children may be covered to age 26 on medical, dental and vision plans.<br/><br/><strong> Medical Health Plans <br/><br/></strong>Blue Shield PPO<br/><br/>Blue Shield PPO Savings Plus 2250 (High Deductible Plan)<br/><br/>Blue Shield HMO<br/><br/>Kaiser HMO<br/><br/>Kaiser HSA HMO 1500 (High Deductible Plan)<br/><br/><strong> Dental Plans <br/><br/></strong>Delta Dental PPO (without orthodontic benefits)<br/><br/>Delta Dental PPO (with orthodontic benefits for children only)<br/><br/>DeltaCare (PMI) Dental<br/><br/><strong> Vision Plan <br/><br/></strong>EyeMed - Optional<br/><br/><strong> Life Insurance <br/><br/></strong>$10,000 Term Life Insurance<br/><br/>(Optional additional life insurance, paid by you, at 1X, 2X, or 3X your salary)<br/><br/><strong> Employee Assistance Program (EAP) <br/><br/></strong>Claremont EAP, powered by Uprise Health. EAP benefits are available to all employees and their families at no cost to you. EAP offers confidential advice, support and practical solutions to real-life issues. Services available: confidential therapy, 24-hour crisis help and online peer support groups.<br/><br/><strong> Accidental Death &amp; Dismemberment <br/><br/></strong>Optional<br/><br/><strong> Section 125 <br/><br/></strong>Optional Plans (Medical Reimbursement; Dependent Care)<br/><br/><strong> Work Schedule <br/><br/></strong>Four 10-hour days, Tuesday through Friday<br/><br/><strong> Vacation <br/><br/></strong>80 hours per year, increasing to 120 after five years<br/><br/><strong> Holidays <br/><br/></strong>13 paid holidays per year<br/><br/><strong> Sick Leave <br/><br/></strong>100 hours per year<br/><br/><strong>Other Leaves<br/><br/></strong>Bereavement; Jury Duty; Military; Witness<br/><br/><strong> Tuition Reimbursement <br/><br/></strong>Reimbursed up to $5,000 per year<br/><br/><strong>Deferred Compensation (457 Plan)<br/><br/></strong>Optional (Employee may contribute up to the IRS maximum). South Coast AQMD matches, dollar for dollar up to $300 per year for the regular plan.<br/><br/><strong> Retirement <br/><br/></strong>2.5% @ 67 defined benefit plan - Applies to employees hired on or after January 1, 2013 who, at time of hire, were not members of the San Bernardino County Employees' Retirement Association (SBCERA) or another public employee retirement system through which reciprocity may be established.<br/><br/>2.0% @ 55 defined benefit plan - Applies to employees who, prior to January 1, 2013, were active members of SBCERA or another public employee retirement system through which reciprocity may be established.<br/><br/>Employees pay only the Medicare portion of Social Security.<br/><br/><strong>01/01/2024<br/><br/></strong>Closing Date/Time: 9/6/2024 11:59 PM Pacific", "jobFunction": "Other", "industry": "Government Administration", "skills": ["PeopleSoft", "Microsoft Office Suite", "Excel", "Word", "Outlook", "Fiscal Recordkeeping", "Accounting", "Business Math"], "url": "https://www.linkedin.com/jobs/view/4003487276"}