{"jobTitle": "Bookkeeper[75714]", "company": {"name": "Onward Search", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$50.00/hr - $55.00/hr", "currency": "USD"}, "jobFunction": "Accounting/Auditing", "industry": "Writing and Editing and Non-profit Organizations", "description": "Onward Search is hiring a Part-Time Bookkeep/Accountant. Must be located in Los Angeles, CA but this is a remote role. You will play a pivotal role in managing the financial operations of the non-profit organization. 25 hours a week, on-going contract. Must have experience using Stripe.", "responsibilities": "Key Responsibilities:\n\n* Develop and maintain comprehensive budgets in alignment with the organization's strategic goals and objectives.\n* Collaborate with department heads to gather financial data and assess budgetary needs.\n* Monitor budget performance and provide regular reports to stakeholders, highlighting variances and recommending corrective actions as needed.\n* Conduct financial analysis to support decision-making processes and identify areas for improvement.\n* Manage day-to-day accounting activities, including accounts payable/receivable, payroll processing, and general ledger maintenance.\n* Perform month-end and year-end closing procedures, ensuring accuracy and compliance with regulatory requirements.\n* Prepare financial statements, reports, and presentations for internal and external stakeholders.\n* Assist with grant management, including budgeting, reporting, and compliance tracking.\n* Stay informed about relevant accounting standards, regulations, and best practices in the non-profit sector.", "qualifications": {"required": "Bachelor’s degree in accounting, Finance, or related field; CPA or equivalent certification preferred.\nProven experience in financial management, budgeting, and accounting, preferably within the non-profit sector.\nStrong proficiency in financial analysis tools and accounting software (e.g., QuickBooks, NetSuite, Microsoft Excel).\nExperience using payment service providers (Stripe)\nExcellent analytical skills with the ability to interpret complex financial data and generate actionable insights.\nDetail-oriented mindset with a commitment to accuracy and compliance.\nEffective communication and interpersonal skills, with the ability to collaborate across teams and communicate financial concepts to non-financial stakeholders.\nSelf-motivated and proactive with a demonstrated ability to prioritize tasks and meet deadlines in a fast-paced environment.\nCommitment to the mission and values of the non-profit organization", "preferred": ""}, "skills": ["Stripe", "QuickBooks", "NetSuite", "Microsoft Excel", "Financial Analysis", "Budgeting", "Accounting", "Financial Management", "Non-profit"], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4003521822"}