{"jobTitle": "Sales Development Representative", "company": {"name": "UST", "location": "Aliso Viejo, CA"}, "location": "Aliso Viejo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "70,000.00/yr - 85,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "IT Services and IT Consulting", "description": "<strong>Role Description<br/><br/></strong><strong>Who We Are:<br/><br/></strong>Born digital, UST transforms lives through the power of technology. We walk alongside our clients and partners, embedding innovation and agility into everything they do. We help them create transformative experiences and human-centered solutions for a better world.<br/><br/>UST is a mission-driven group of 29,000+ practical problem solvers and creative thinkers in more than 30 countries. Our entrepreneurial teams are empowered to innovate, act nimbly, and create a lasting and sustainable impact for our clients, their customers, and the communities in which we live.<br/><br/>With us, you’ll create a boundless impact that transforms your career—and the lives of people across the world.<br/><br/>Visit us at UST.com.<br/><br/><strong>You Are<br/><br/></strong>Someone who can deploy various prospecting/lead generation approaches across target accounts nationally. The Sales Development Representative will act as a pivotal part of our sales team by generating new leads, nurturing relationships with potential clients, and contributing directly to the company's growth. Your role will be to seek new business opportunities for the Business Applications practices at UST by contacting and developing relationships with potential customers.<br/><br/><strong>The Opportunity<br/><br/></strong><ul><li> Qualify leads from marketing campaigns as sales opportunities.</li><li> Contact potential clients through various outreach methods</li><li> Generate leads and build relationships by nurturing prospects.</li><li> Manage and maintain a pipeline of interested prospects and engage sales executives for the next steps.</li><li> Build long-term trusting relationships with clients to qualify leads as sales opportunities.</li><li> Proactively seek new business opportunities in the market.</li><li> Set up meetings or calls between (prospective) clients and Sales Leadership (Business Development Manager and Practice Directors)</li><li> Report to the Business Development Manager on (weekly/monthly/quarterly) basis.</li><li> Identify prospects' needs and suggest appropriate products/services.</li><li> Stay up-to-date with new products/services and new pricing/payment plans</li><li> Achieve set number of KPI’s</li><li> Build and refresh/update Go-To-Market materials<br/><br/></li></ul><strong>What You Need<br/><br/></strong><ul><li> At least 3 yrs experience prospecting new clients</li><li> At least 3 yrs experience cold calling</li><li> At least 3 yrs experience sales lead generation</li><li> Knowledge of Enterprise Applications, ServiceNow, Salesforce<br/><br/></li></ul>Compensation can differ depending on factors including but not limited to the specific office location, role, skill set, education, and level of experience. UST provides a reasonable range of compensation for roles that may be hired in various U.S. markets as set forth below.<br/><br/><strong>Role Location: </strong>Remote<br/><br/><strong>Compensation Range</strong>: $70,000-$85,000<br/><br/>In addition to base pay, a successful employee in this role will be eligible to earn commissions. Please ask the recruiter for more information about the commission plan for this role when you are scheduled for an interview.<br/><br/>Certain regular employees may have the potential for quarterly incentive-based bonuses and or commissions depending on role.<br/><br/><strong>Benefits<br/><br/></strong>Full-time, regular employees accrue a minimum of 10 days of paid vacation per year, receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year), 10 paid holidays, and are eligible for paid bereavement leave and jury duty. They are eligible to participate in the Company’s 401(k) Retirement Plan with employer matching. They and their dependents residing in the US are eligible for medical, dental, and vision insurance, as well as the following Company-paid Employee Only benefits: basic life insurance, accidental death and disability insurance, and short- and long-term disability benefits. Regular employees may purchase additional voluntary short-term disability benefits, and participate in a Health Savings Account (HSA) as well as a Flexible Spending Account (FSA) for healthcare, dependent child care, and/or commuting expenses as allowable under IRS guidelines. Benefits offerings vary in Puerto Rico.<br/><br/>Part-time employees receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year) and are eligible to participate in the Company’s 401(k) Retirement Plan with employer matching.<br/><br/>Full-time temporary employees receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year) and are eligible to participate in the Company’s 401(k) program with employer matching. They and their dependents residing in the US are eligible for medical, dental, and vision insurance.<br/><br/>Part-time temporary employees receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year).<br/><br/>All US employees who work in a state or locality with more generous paid sick leave benefits than specified here will receive the benefit of those sick leave laws.<br/><br/><strong>What We Believe<br/><br/></strong>We proudly embrace the values that have shaped UST since day one. We build our culture of Humility, Humanity, and Integrity. These values inspire us to nurture a people-first, human centric culture that fosters diversity, prioritizes sustainable solutions, and keeps our people and clients at the forefront of all decisions.<br/><br/><strong>Humility<br/><br/></strong>We will listen, learn, be empathetic and help selflessly in our interactions with everyone.<br/><br/><strong>Humanity<br/><br/></strong>Through business, we will better the lives of those less fortunate than ourselves.<br/><br/><strong>Integrity<br/><br/></strong>We honor our commitments and act with responsibility in all our relationships.<br/><br/><strong>Equal Employment Opportunity Statement<br/><br/></strong>UST is an Equal Opportunity Employer.<br/><br/>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or any other applicable characteristics protected by law. We will consider qualified applicants with arrest or conviction records in accordance with state and local laws and “fair chance” ordinances.<br/><br/>UST reserves the right to periodically redefine your roles and responsibilities based on the requirements of the organization and/or your performance.<br/><br/>#ust<br/><br/>#uststat<br/><br/><strong>Skills<br/><br/></strong>Prospecting New Clients,Cold Calling,Sales Lead Generation,Enterprise Applications<br/><br/>", "responsibilities": "<ul><li> Qualify leads from marketing campaigns as sales opportunities.</li><li> Contact potential clients through various outreach methods</li><li> Generate leads and build relationships by nurturing prospects.</li><li> Manage and maintain a pipeline of interested prospects and engage sales executives for the next steps.</li><li> Build long-term trusting relationships with clients to qualify leads as sales opportunities.</li><li> Proactively seek new business opportunities in the market.</li><li> Set up meetings or calls between (prospective) clients and Sales Leadership (Business Development Manager and Practice Directors)</li><li> Report to the Business Development Manager on (weekly/monthly/quarterly) basis.</li><li> Identify prospects' needs and suggest appropriate products/services.</li><li> Stay up-to-date with new products/services and new pricing/payment plans</li><li> Achieve set number of KPI’s</li><li> Build and refresh/update Go-To-Market materials<br/><br/></li></ul>", "qualifications": {"required": "At least 3 yrs experience prospecting new clients, At least 3 yrs experience cold calling, At least 3 yrs experience sales lead generation, Knowledge of Enterprise Applications, ServiceNow, Salesforce", "preferred": ""}, "skills": ["Prospecting New Clients", "Cold Calling", "Sales Lead Generation", "Enterprise Applications"], "postedDate": "3 days ago", "benefits": "Full-time, regular employees accrue a minimum of 10 days of paid vacation per year, receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year), 10 paid holidays, and are eligible for paid bereavement leave and jury duty. They are eligible to participate in the Company’s 401(k) Retirement Plan with employer matching. They and their dependents residing in the US are eligible for medical, dental, and vision insurance, as well as the following Company-paid Employee Only benefits: basic life insurance, accidental death and disability insurance, and short- and long-term disability benefits. Regular employees may purchase additional voluntary short-term disability benefits, and participate in a Health Savings Account (HSA) as well as a Flexible Spending Account (FSA) for healthcare, dependent child care, and/or commuting expenses as allowable under IRS guidelines. Benefits offerings vary in Puerto Rico.<br/><br/>Part-time employees receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year) and are eligible to participate in the Company’s 401(k) Retirement Plan with employer matching.<br/><br/>Full-time temporary employees receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year) and are eligible to participate in the Company’s 401(k) program with employer matching. They and their dependents residing in the US are eligible for medical, dental, and vision insurance.<br/><br/>Part-time temporary employees receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year).<br/><br/>All US employees who work in a state or locality with more generous paid sick leave benefits than specified here will receive the benefit of those sick leave laws.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4003522810"}