{"jobTitle": "IT SPECIALIST (SYSADMIN)", "company": {"name": "U.S. Army CECOM", "industry": "Armed Forces", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Information Technology", "industry": "Armed Forces", "description": "Job Summary\n\nPlease limit your resume to 5 pages. If more than 5 pages are submitted, only the first 5 pages will be reviewed to determine your eligibility/qualifications. This is a Direct Hire Authority (DHA) solicitation utilizing the DHA for DHA - Business & Technical Management Career Path (AcqDemo only) to recruit and appoint qualified candidates to positions in the competitive service.\n\nJob Description\n\n- Responsible for discussing and helping the customer with their business requirements for a wide range of system and process improvement projects.\n- As well as support complex daily operations within one of the following SAP modules: FI, SD, MM, WM, SCP, PS, MT, PLM, BPM, PM, DFPS, HR, Security BPM, and MRM.\n- Responsible to meet with the customer and other system stakeholders for requirements management and alignment with the overall mission and process.\n- Responsible for ensuring the solution matches the requirements by consulting with multiple business process owners to identify, define and document business needs and objectives, current business processes, and procedures.\n- Review the functional specs written by other business analyst and provide feedback before going out for customer approval.\n- Coordinate with technical management to ensure translation of the functional requirements into technical ones are executed properly.\n- Performs complex master data and transactional SAP system configuration for standard SAP solutions within the FI, SD, MM, WM, SCP, PS, MT, PLM, BPM, and MRM modules.\n- Will work closely with other business analysts and the development team for solutions that cannot be accomplished through standard SAP configurations.\n- The incumbent will be responsible to work with and peer review all documents, created by junior business analysts and provide feedback.\n- Documents include functional specs, configuration documentation, test scripts, training decks and manuals, and any other documentation created.\n- Perform complex functional and technical trouble shooting to resolve basic production support issues. He/she will work closely with the business process owners, technical team(s), other functional teams, and lead to resolve and document issue.\n- Introduces SAP \"best practices\" in the areas of FI, SD, MM, WM, SCP, PS, MT, PLM, PM, DFPS, HR, Security, BPM, and MRM to the customer and work alongside the change management team in order to roll out daily operations/support.", "responsibilities": "Responsible for discussing and helping the customer with their business requirements for a wide range of system and process improvement projects. As well as support complex daily operations within one of the following SAP modules: FI, SD, MM, WM, SCP, PS, MT, PLM, BPM, PM, DFPS, HR, Security BPM, and MRM. Responsible to meet with the customer and other system stakeholders for requirements management and alignment with the overall mission and process. Responsible for ensuring the solution matches the requirements by consulting with multiple business process owners to identify, define and document business needs and objectives, current business processes, and procedures. Review the functional specs written by other business analyst and provide feedback before going out for customer approval. Coordinate with technical management to ensure translation of the functional requirements into technical ones are executed properly. Performs complex master data and transactional SAP system configuration for standard SAP solutions within the FI, SD, MM, WM, SCP, PS, MT, PLM, BPM, and MRM modules. Will work closely with other business analysts and the development team for solutions that cannot be accomplished through standard SAP configurations. The incumbent will be responsible to work with and peer review all documents, created by junior business analysts and provide feedback. Documents include functional specs, configuration documentation, test scripts, training decks and manuals, and any other documentation created. Perform complex functional and technical trouble shooting to resolve basic production support issues. He/she will work closely with the business process owners, technical team(s), other functional teams, and lead to resolve and document issue. Introduces SAP \"best practices\" in the areas of FI, SD, MM, WM, SCP, PS, MT, PLM, PM, DFPS, HR, Security, BPM, and MRM to the customer and work alongside the change management team in order to roll out daily operations/support.", "qualifications": {"required": "US Citizens In order to qualify, you must meet the experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. To qualify for an IT Specialist position, you must have IT-related experience demonstrating each of the four competencies listed below based on the grade level required of the position being filled: 1) Attention to Detail - Is thorough when performing work and conscientious about attending to detail. 2) Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services. 3) Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. 4) Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. AND In addition to the competencies, have one year of specialized experience with the following:1. Evaluating system software configurations needed to support System Applications and Products (SAP) applications or customized integration of business computer systems;2. Solving technical issues related to major SAP applications; and3. Working with Stakeholders to translate needs into functional requirements or create functional and technical specification documents ensuring a comprehensive design.", "preferred": "Not specified"}, "skills": [], "postedDate": "6 days ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4003762049"}