{"jobTitle": "Entry Level Communications Associate", "company": {"name": "Think Tell Junction", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-Time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$52,480 to $57,890", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Staffing and Recruiting", "description": "Job Title: Entry Level Communications Associate<br/><br/>Company: Think Tell Junction<br/><br/>Location: Los Angeles, CA<br/><br/>Job Type: Full-Time (40 hours per week)<br/><br/>Salary: $52,480 to $57,890 per year<br/><br/>About Us: At Think Tell Junction, we understand the significance of staying connected in today's fast-paced world. We are thrilled to welcome you to a realm where communication transcends boundaries, and every conversation is an enriching experience. Join our innovative team and be part of a company that values creativity, collaboration, and the power of effective communication.<br/><br/>Job Description: We are looking for a highly motivated and detail-oriented Entry Level Communications Associate to join our team. In this role, you will support our communications department in developing and implementing internal and external communication strategies. This is an excellent opportunity for an individual looking to launch their career in communications and gain valuable experience in a dynamic and supportive environment.<br/><br/>Responsibilities:<br/><br/><ul><li> Assist in drafting, editing, and distributing communications materials such as press releases, newsletters, and social media posts.</li><li> Support the planning and execution of communication campaigns and events.</li><li> Monitor and respond to media inquiries and assist in maintaining media contact lists.</li><li> Help manage the company’s social media accounts, including content creation and community engagement.</li><li> Conduct research to support communication strategies and provide insights on industry trends.</li><li> Collaborate with team members to ensure consistent messaging across all platforms.</li><li> Assist in maintaining internal communication systems and tools.<br/><br/><br/></li></ul>Qualifications:<br/><br/><ul><li> Bachelor’s degree in Communications, Public Relations, Journalism, or a related field.</li><li> Strong written and verbal communication skills.</li><li> Creative thinker with the ability to generate engaging content.</li><li> Attention to detail and ability to manage multiple tasks simultaneously.</li><li> Familiarity with social media platforms and digital communication tools.</li><li> Ability to work independently and as part of a team.</li><li> Strong organizational and time management skills.</li><li> Willingness to learn and adapt in a fast-paced environment.<br/><br/><br/></li></ul>Benefits:<br/><br/><ul><li> Competitive salary ranging from $52,480 to $57,890 per year.</li><li> Health, dental, and vision insurance.</li><li> Paid time off and holidays.</li><li> Professional development and training opportunities.</li><li> Collaborative and inclusive work environment.</li><li> Opportunities for career growth and advancement.<br/><br/><br/></li></ul>Join Think Tell Junction and be part of a team that values innovation, creativity, and the power of communication. Apply now and help us connect the world through meaningful conversations.<br/><br/>How to Apply: Interested candidates are invited to submit their resume and a cover letter detailing their qualifications and interest in the position to [email address].<br/><br/>We look forward to hearing from you!", "responsibilities": "Assist in drafting, editing, and distributing communications materials such as press releases, newsletters, and social media posts. Support the planning and execution of communication campaigns and events. Monitor and respond to media inquiries and assist in maintaining media contact lists. Help manage the company’s social media accounts, including content creation and community engagement. Conduct research to support communication strategies and provide insights on industry trends. Collaborate with team members to ensure consistent messaging across all platforms. Assist in maintaining internal communication systems and tools.", "qualifications": {"required": "Bachelor’s degree in Communications, Public Relations, Journalism, or a related field. Strong written and verbal communication skills. Creative thinker with the ability to generate engaging content. Attention to detail and ability to manage multiple tasks simultaneously. Familiarity with social media platforms and digital communication tools. Ability to work independently and as part of a team. Strong organizational and time management skills. Willingness to learn and adapt in a fast-paced environment.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Competitive salary ranging from $52,480 to $57,890 per year. Health, dental, and vision insurance. Paid time off and holidays. Professional development and training opportunities. Collaborative and inclusive work environment. Opportunities for career growth and advancement.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4003439165"}