{"jobTitle": "Associate Planner", "company": {"name": "ANINE BING", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "70,000.00/yr - 80,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Retail Apparel and Fashion", "description": "ANINE BING is looking for an Associate Planner to join our team in Los Angeles.<br/><br/>The Associate Planner will work closely with cross-functional partners in managing the inventory for the Retail and China revenue channels.<br/><br/>The ideal candidate thrives in a dynamic environment and excels at multitasking and prioritizing. With exceptional communication skills and a keen eye for detail, you will play a crucial role in ANINE BING's growth. As the Associate Planner, you'll collaborate closely with our buying, allocation, production, operations, and retail teams to drive success.<br/><br/>This role is based out of our Los Angeles HQ and will report to the Senior Planning Manager - DTC. <br/><br/>Responsibilities<br/><br/><ul><li>Drive the financial success of the business by maintaining the ideal inventory levels by channel with a focus on optimizing our global retail stores (North America, EU and China)</li><li>Present recommendations and other analysis to the team related to driving short term and long term business goals</li><li>Run daily, weekly and monthly performance and inventory reports and share insights with the team</li><li>Analyze size selling to correctly order and maintain the optimal size curves by location</li><li>Identify risks and opportunities by product and location in our retail stores; move inventory between regions, channels and stores to fill need</li><li>Ensure consistent safety stock on key items in partnership with the Planning Manager</li><li>Additional ad hoc projects and responsibilities as required to support the Planning, Buying, and Allocation departments<br/><br/></li></ul>Required Skills<br/><br/><ul><li>Bachelor’s degree and 3+ years in merchandise planning or related experience</li><li>Strong knowledge in Microsoft Office, must have advanced Excel skills</li><li>Solid analytical and critical thinking skills</li><li>Excellent time management and organizational skills</li><li>Ability to collaborate, adaptable, and willingness to continually learn<br/><br/></li></ul>Benefits &amp; Perks<br/><br/><ul><li>Work/Life Balance: Flexible work schedules, Unlimited/ flexible time off, paid holidays throughout the year, and extra days off in the summer</li><li> Wellness: ANINE BING covers 75% of costs for your medical, dental, and vision insurance and offers an array of other benefits for you and your dependents, including a generous parental leave program</li><li> And more: Generous employee discount and wardrobe<br/><br/></li></ul>Compensation<br/><br/><ul><li> The anticipated base salary range for this role is $70,000 - $80,000<br/><br/></li></ul>Working at ANINE BING<br/><br/>ANINE BING seeks to empower its employees by providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Diversity and inclusion is critical to our success as a global brand, and we seek to recruit, develop, and retain the most talented people from a diverse candidate pool.<br/><br/>More About ANINE BING<br/><br/>ANINE BING is a Los Angeles-based fashion house started in 2012 that blends elements of Scandinavian simplicity with American energy to offer modern wardrobe essentials for women seeking a timeless yet rebellious approach to everyday style. Since its launch, ANINE BING has built a global brand represented across 90+ countries, including brick-and-mortar retail stores in cities worldwide.<br/><br/>Headquartered in Los Angeles, ANINE BING has over 200 employees and is backed by key investors, which include Index Ventures founder Danny Rimer (Facebook, Dropbox, Roblox, Net-A-Porter), Greycroft Partners founder Dana Settle (Bumble, Cuyana, Farfetch), and Felix Capital founder Frederic Court (Goop, Farfetch, Vitrue, Dailymotion).", "responsibilities": "Drive the financial success of the business by maintaining the ideal inventory levels by channel with a focus on optimizing our global retail stores (North America, EU and China)\nPresent recommendations and other analysis to the team related to driving short term and long term business goals\nRun daily, weekly and monthly performance and inventory reports and share insights with the team\nAnalyze size selling to correctly order and maintain the optimal size curves by location\nIdentify risks and opportunities by product and location in our retail stores; move inventory between regions, channels and stores to fill need\nEnsure consistent safety stock on key items in partnership with the Planning Manager\nAdditional ad hoc projects and responsibilities as required to support the Planning, Buying, and Allocation departments", "qualifications": {"required": "Bachelor’s degree and 3+ years in merchandise planning or related experience\nStrong knowledge in Microsoft Office, must have advanced Excel skills\nSolid analytical and critical thinking skills\nExcellent time management and organizational skills\nAbility to collaborate, adaptable, and willingness to continually learn"}, "skills": ["Microsoft Office", "Excel", "Merchandise Planning", "Inventory Management", "Retail", "Analysis", "Communication", "Time Management", "Organization"], "postedDate": "2 days ago", "benefits": "Work/Life Balance: Flexible work schedules, Unlimited/ flexible time off, paid holidays throughout the year, and extra days off in the summer\nWellness: ANINE BING covers 75% of costs for your medical, dental, and vision insurance and offers an array of other benefits for you and your dependents, including a generous parental leave program\nAnd more: Generous employee discount and wardrobe", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4003170428"}