{"jobTitle": "Senior Associate, Quality Assurance for Manufacturing & Quality Control", "company": {"name": "FUJIFILM Diosynth Biotechnologies", "location": "Thousand Oaks, CA", "industry": "Biotechnology Research"}, "location": "Thousand Oaks, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Quality Assurance", "industry": "Biotechnology Research", "description": "<strong>The work we do at FDB has never been more important—and we are looking for talented candidates to join us. We are growing our locations, our capabilities, and our teams, and looking for passionate, mission-driven people like you who want to make a real difference in people’s lives. Join our new FDBC facility in Thousand Oaks, CA and help manufacture the next cell therapy in partnership with some of the most innovative biopharma companies across the globe. We are proud to cultivate a culture that will fuel your passion, energy and drive - what we call Genki. </strong> The Senior Associate, Quality Assurance for MFG/QC, supports and provides quality oversight to MFG and QC operations and identifies and drives continuous improvements. This role is instrumental in ensuring supply to patients by ensuring CGMP requirements are met for Clinical and Commercial material produced at Fujifilm Diosynth Biotechnologies California (FDBC). This position interacts cross-functionally with Manufacturing, Quality Control, Supply Chain, Validation, and with FDB Clients to ensure on time delivery is met.<br/><br/><strong> External US <br/><br/></strong><strong> The work we do at FDB has never been more important—and we are looking for talented candidates to join us. We are growing our locations, our capabilities, and our teams, and looking for passionate, mission-driven people like you who want to make a real difference in people’s lives. Join our new FDBC facility in Thousand Oaks, CA and help manufacture the next cell therapy in partnership with some of the most innovative biopharma companies across the globe. We are proud to cultivate a culture that will fuel your passion, energy and drive - what we call Genki. <br/><br/></strong>The Senior Associate, Quality Assurance for MFG/QC, supports and provides quality oversight to MFG and QC operations and identifies and drives continuous improvements. This role is instrumental in ensuring supply to patients by ensuring CGMP requirements are met for Clinical and Commercial material produced at Fujifilm Diosynth Biotechnologies California (FDBC). This position interacts cross-functionally with Manufacturing, Quality Control, Supply Chain, Validation, and with FDB Clients to ensure on time delivery is met.<br/><br/>Reports to: Senior Manager, QA for Manufacturing<br/><br/>Location: Thousand Oaks, CA (On-site job)<br/><br/><strong> Primary Responsibilities: <br/><br/></strong><ul><li> Provide quality oversight ensuring CGMP requirements are met for Clinical and Commercial material. </li><li> Independently perform and manage batch record review activities for production including, but not limited to, review of batch records, media records, material reconciliation, labeling and other documents. </li><li> Support Out of Specification/Trend investigations </li><li> Serve as quality contact and support for minor deviations, CAPA implementation, change control records, or other quality records, as needed. </li><li> Support batch disposition activities including closure of quality records and approval of Certificates of Analysis. </li><li> Draft and revise SOPs, work instructions, and other controlled documents. </li><li> Supports internal audits and inspections. </li><li> Performs other duties as assigned. </li><li> Work independently under general supervision and direction. <br/><br/></li></ul><strong> Physical Requirements: <br/><br/></strong>Subject to extended periods of sitting and/or standing, vision to monitor, and moderate noise levels. Work is generally performed in a manufacturing and office environment.<br/><br/><strong> Qualifications: <br/><br/></strong><ul><li> Experience in manufacturing operations and quality assurance/quality control in a cell therapy company (preferred). </li><li> Knowledgeable of aseptic techniques and clean room practices. </li><li> Experience with USP and EP compendial testing. </li><li> Experience with analytical method validation, data integrity and compliance. </li><li> Strong understanding of Quality Management Systems: deviations, CAPA, Change control. </li><li> Attention to detail with strong analytical and problem-solving skills. </li><li> Strong independent judgment and decision-making abilities </li><li> Able to obtain gown certification and gain entry to manufacturing areas. </li><li> Must possess excellent verbal and written communication skills; good interpersonal skills. </li><li> Flexibility in working schedule, i.e., off hours, second shift, weekend. </li><li> Demonstrate ability to work in a team environment to develop, implement and deliver on goals. <br/><br/></li></ul><strong> Education and Professional Experience: <br/><br/></strong><ul><li> Master of Science with 0-2 years of relevant experience; OR Bachelor of Science with 2+ years of relevant experience; OR Associates Degree with 4+ years of experience; OR high school diploma with 7+ years of experience. </li><li> Minimum of 2 years+ of related Pharmaceutical or Biotech industry experience in GMP regulated Biologics or Pharmaceutical environment preferred. </li><li> Experience with Contract Manufacturing Organizations is a plus. <br/><br/></li></ul><strong> Salary and Benefits: <br/><br/></strong><ul><li> $40 to $50 per hour, depending on experience </li><li> Medical, Dental and Vision </li><li> Life Insurance </li><li> 401k </li><li> Paid Time Off <br/><br/></li></ul><strong> Join us! FDB is advancing tomorrow’s medicine, impassioning employees to chase the impossible and continually expand their potential. We are a company of emboldened goal seekers – driven by an innate desire to better ourselves, our families, our workplace, our company, our community, and the world at large. <br/><br/></strong>FDBC is an equal opportunity employer to all, regardless of age, ancestry, color, disability (mental and physical), exercising the right to family care and medical leave, gender, gender expression, gender identity, genetic information, marital status, religious creed, sex (includes pregnancy, childbirth, breastfeeding, and related medical conditions), and sexual orientation and any other status protected by state or federal law.<br/><br/>To all agencies: Please, no phone calls or emails to any employee of FUJIFILM about this requisition. All resumes submitted by search firms/employment agencies to any employee at FUJIFILM via-email, the internet or in any form and/or method will be deemed the sole property of FUJIFILM, unless such search firms/employment agencies were engaged by FUJIFILM for this requisition and a valid agreement with FUJIFILM is in place. In the event a candidate who was submitted outside of the FUJIFILM agency engagement process is hired, no fee or payment of any kind will be paid.", "responsibilities": "The Senior Associate, Quality Assurance for MFG/QC, supports and provides quality oversight to MFG and QC operations and identifies and drives continuous improvements. This role is instrumental in ensuring supply to patients by ensuring CGMP requirements are met for Clinical and Commercial material produced at Fujifilm Diosynth Biotechnologies California (FDBC). This position interacts cross-functionally with Manufacturing, Quality Control, Supply Chain, Validation, and with FDB Clients to ensure on time delivery is met.", "qualifications": {"required": "Experience in manufacturing operations and quality assurance/quality control in a cell therapy company (preferred). Knowledgeable of aseptic techniques and clean room practices. Experience with USP and EP compendial testing. Experience with analytical method validation, data integrity and compliance. Strong understanding of Quality Management Systems: deviations, CAPA, Change control. Attention to detail with strong analytical and problem-solving skills. Strong independent judgment and decision-making abilities Able to obtain gown certification and gain entry to manufacturing areas. Must possess excellent verbal and written communication skills; good interpersonal skills. Flexibility in working schedule, i.e., off hours, second shift, weekend. Demonstrate ability to work in a team environment to develop, implement and deliver on goals.", "preferred": "Master of Science with 0-2 years of relevant experience; OR Bachelor of Science with 2+ years of relevant experience; OR Associates Degree with 4+ years of experience; OR high school diploma with 7+ years of experience. Minimum of 2 years+ of related Pharmaceutical or Biotech industry experience in GMP regulated Biologics or Pharmaceutical environment preferred. Experience with Contract Manufacturing Organizations is a plus."}, "skills": ["CGMP", "GMP", "Quality Assurance", "Quality Control", "Manufacturing", "Aseptic Techniques", "Clean Room Practices", "USP", "EP", "Analytical Method Validation", "Data Integrity", "Compliance", "Quality Management Systems", "Deviations", "CAPA", "Change Control", "Problem Solving", "Communication", "Teamwork"], "postedDate": "6 days ago", "benefits": "$40 to $50 per hour, depending on experience Medical, Dental and Vision Life Insurance 401k Paid Time Off", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003173356"}