{"jobTitle": "Limousine Service Dispatcher/Reservationist (AM Shift)", "company": {"name": "My Limousine Service", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Ground Passenger Transportation", "description": "<strong>Job Description<br/><br/></strong>Looking for a Career? 43 years in business, a global pandemic and still going strong!<br/><br/>Well-established Limousine Service based in North Hollywood seeks a Dispatcher/Reservation Agent Mon, Tues, Wed and Friday 6am-2:15pm (total 33 hours per week) with opportunity to cover shifts and work additional hours.<br/><br/>Benefits include: Vacation and Personal Days after a probationary period + medical insurance.<br/><br/>Candidates *MUST* have strong customer service and communication skills in the Limousine<br/><br/>industry or a related field such as Courier, Hotel, Fleet Vehicles.<br/><br/>Livery Coach software experience is a plus!<br/><br/>As one of the premiere limousine services in Southern California, we have dispatchers in our office 24/7/365.<br/><br/>We provide paid training and offer a great, professional but casual environment!<br/><br/>This job requires someone with a strong ability to multi-task, and a keen attention to detail. As the key liaison between our clients and chauffeurs, you will need to handle many details and coordinate the activities of our fast-paced office as well as the movements of up to a few dozen vehicles simultaneously.<br/><br/>DUTIES:<br/><br/><ul><li> Communicate with clients, including high profile corporate executives and celebrities in a clear, positive and professional manner. </li><li> Give price quotes and recommend the most efficient pick-up time and vehicle to suit the client's needs and geography. </li><li> Input reservations into our system many times while you are on the phone with a client. </li><li> Route, schedule and coordinate the vehicles. </li><li> Remain in regular contact with chauffeurs. </li><li> Regularly check airline schedules for any changes to flight arrivals. </li><li> Resolve dispatch related chauffeur issues and coordinate resolutions with senior management. </li><li> Light accounting and other paperwork. </li><li> Perform miscellaneous projects as needed. </li><li> Excellent oral and written communication skills. </li><li> Computer literate. Must type a minimum of 40wpm</li><li> Ability to handle multiple tasks. </li><li> Ability to work as a team player. </li><li> Must be superior problem solver, detail oriented, quick-thinker. </li><li> Thorough knowledge of the Los Angeles and Southern CA area. </li><li> Work well under pressure in a fast-paced work environment. </li><li> Must pass a pre-employment background check. </li><li> Positive references are a MUST and will be contacted. </li><li> Must sign a confidentiality contract. </li><li> Previous limousine service or similar (courier, etc.) experience a plus</li><li> *MUST** have prior relative experience: Limousine, Courier, Transportation, Travel Agency, Hotel. <br/><br/></li></ul>!!!!!! Please DO NOT APPLY if you do not have relative experience !!!!!!", "postedDate": "3 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003631563"}