{"jobTitle": "HYBRID Director of Talent Acquisition & Operations", "company": {"name": "Jobot", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$130,000.00/yr - $180,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Construction, Civil Engineering, and Industrial Machinery Manufacturing", "description": "Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!<br/><br/>Job details<br/><br/><strong>If you want to work on an HR Team with the best people, high ethics, excellent customer service and room to grow in your career, then apply for this important Director, Talent and Operations role!<br/><br/></strong>This Jobot Job is hosted by Jennifer Thomas<br/><br/>Are you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.<br/><br/>Salary $130,000 - $180,000 per year<br/><br/><strong>A Bit About Us<br/><br/></strong>We are a Nationwide Healthcare Organization assisting people with their healthcare needs for over 100 years. We truly care about everyone who who we help and do all that we can to assist them with their health issues, questions or concerns. We have medical and non-medical partners, which operate numerous healthcare facilities across the U.S. We also partner with organizations, globally. The company provides a variety of health services, as well as continually researching health technology to better their practices.<br/><br/><strong><br/><br/><strong>Why join us?<br/><br/><br/></strong></strong><ul><li>Excellent and Competitive Compensation! </li><li>100% paid benefits (including 401K match and profit sharing).</li><li>Path for growth.</li><li>Parties, lunches and events!</li><li>The nicest people to work with and a positive team environment!</li><li>Stable organization.<br/><br/></li></ul>CORE COMPETENCIES<br/><br/><ul><li> Welcoming Anticipates customer requirements and gives high priority to customer satisfaction and service. Handles problems quickly and efficiently. Maintains a pleasant, positive and professional approach. Embraces opportunities to help team members, stakeholders, and other departments.</li><li> Equitable Creating equitable access and opportunity for all through education, practicing inclusive behavior, elevating others’ voices, creating spaces for honest conversation, and listening without judgment. Values and uplifts our collective diversity within in our agency.</li><li> Confidential Respects the information shared by our patients, employees, and vendors and maintains appropriate confidentiality. Follows all policies and laws that protect private &amp; privileged information.</li><li> Accessible Is available and approachable to others, open-minded, fair and non-defensive. Appreciates constructive feedback and is a team player. Demonstrates good listening skills.</li><li> Respectful Values diversity and treats everyone with dignity and courtesy. Dependable and courteous of other people’s time and commitments.</li><li> Empathetic Demonstrates interest and understanding in other people’s feelings, attitudes and reasoning. Maintains an open and non-judgmental demeanor that is patient, flexible, and understanding.<br/><br/></li></ul><strong>Job Details<br/><br/></strong>The Director of Talent Acquisition and Operations partners with the Vice President of Human Resources in all phases of Human Resources Administration with emphasis on Operations and Talent Acquisition and assists in managing employee communication to drive the Human Resources strategic initiatives to meet or exceed business goals and objectives. Provides management support to a high-performing, comprehensive Human Resources department. Provides high level of consultative skills and customer service to employees and managers at all levels within the organization. Work as a strategic partner with the VP of HR and senior management to understand future and current workforce needs.<br/><br/><strong>Job Duties And Responsibilities<br/><br/></strong><ul><li> Ensure that the Human Resources Department has an internal and external reputation of competency, fairness, confidentiality, and the highest level of customer service.</li><li> Ensure employment practices and policies comply with federal, state laws, and assist supervisors in the interpretation and understanding of the organization’s employment policies.</li><li> Ensure compliance with Federal, State, and local labor laws and regulations. </li><li> Manage recruitment efforts by developing, honing, and executing the strategic recruitment plan through effective utilization of recruitment best practices and direction of the recruitment team. </li><li> Responsible for day-to-day management of talent acquisition and HR operations teams.</li><li> Contributes as subject matter expert to the development of skills in hiring managers through tools and training on interviewing, selection, etc. </li><li> Assist in managing the development, implementation, and administration of compensation programs for the organization. </li><li> Conduct periodic salary reviews to ensure competitive salaries and compensation structure for all employees.</li><li> Manage HR technology initiatives including system optimizations to ATS (iCIMS is desired). </li><li> Support special projects and events as required. <br/><br/></li></ul><strong>Education/Minimum Requirements<br/><br/></strong><ul><li> Bachelor’s Degree required. Master’s degree preferred.</li><li> A minimum of 7-10 years of Human Resources Department (Talent Acquisition) experience.</li><li> A minimum of 4-5 years of Supervisory/Management experience.</li><li> A minimum of 2-4 years of experience working in the Healthcare Industry (corporate side). A mix of Agency and Corporate side is ok.<br/><br/></li></ul>Supervisory Experience<br/><br/><ul><li> Demonstrated ability as an effective leader, including coaching and team-building skills.</li><li> Strong written, verbal, and interpersonal skills.</li><li> Budgeting experience.</li><li> Excellent strategic planning skills.</li><li> Must be self-motivated and can work without direct supervision.<br/><br/></li></ul>Licensure and/or Certification Requirements<br/><br/><ul><li> PHR and/or SPHR certification a plus.<br/><br/></li></ul><strong>Other Requirements<br/><br/></strong><ul><li> Must have a demonstrated ability to gather information, analyze data, implement, and monitor effective processes, and make decisions autonomously.</li><li> Demonstrated ability to protect and maintain confidentiality of employee information.<br/><br/></li></ul>Interested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.<br/><br/><strong>Want to learn more about this role and Jobot?<br/><br/></strong>Click our Jobot logo and follow our LinkedIn page!<br/><br/>", "responsibilities": "The Director of Talent Acquisition and Operations partners with the Vice President of Human Resources in all phases of Human Resources Administration with emphasis on Operations and Talent Acquisition and assists in managing employee communication to drive the Human Resources strategic initiatives to meet or exceed business goals and objectives. Provides management support to a high-performing, comprehensive Human Resources department. Provides high level of consultative skills and customer service to employees and managers at all levels within the organization. Work as a strategic partner with the VP of HR and senior management to understand future and current workforce needs.", "qualifications": {"required": "Bachelor’s Degree required. Master’s degree preferred.\nA minimum of 7-10 years of Human Resources Department (Talent Acquisition) experience.\nA minimum of 4-5 years of Supervisory/Management experience.\nA minimum of 2-4 years of experience working in the Healthcare Industry (corporate side). A mix of Agency and Corporate side is ok.", "preferred": "Demonstrated ability as an effective leader, including coaching and team-building skills.\nStrong written, verbal, and interpersonal skills.\nBudgeting experience.\nExcellent strategic planning skills.\nMust be self-motivated and can work without direct supervision.\nPHR and/or SPHR certification a plus.\nMust have a demonstrated ability to gather information, analyze data, implement, and monitor effective processes, and make decisions autonomously.\nDemonstrated ability to protect and maintain confidentiality of employee information."}, "skills": [], "postedDate": "3 days ago", "applicationDeadline": "", "benefits": "Excellent and Competitive Compensation! \n100% paid benefits (including 401K match and profit sharing).\nPath for growth.\nParties, lunches and events!\nThe nicest people to work with and a positive team environment!\nStable organization.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4003296912"}