{"jobTitle": "Accounting Clerk", "company": {"name": "Pacific Palms Resort", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "23.00/hr - 25.00/hr", "currency": "USD"}, "jobFunction": "Accounting/Auditing and Finance", "industry": "Staffing and Recruiting", "description": "This position pay ranges from $23.00 to $25.00/hour depending on experience. Perform accounting administrative duties, and additional clerical duties as assigned. Assist in both A/R & A/P with responding to charge backs and reconciling statements.<br/><br/>Accounting is a vital department, responsible for all financial decisions and functions on the property.<br/><br/>Responsibilities:<br/><br/><ul><li> Key Responsibilities Distribute accounting mail Post payments for direct bill, miscellaneous, and membership accounts Post advance deposit payments, log incoming contracts Maintain neat and organized files Review contents of daily Flash, make corrections, and maintain flash back up and statistical files Submit audited daily flash reports to owners Set up each new months flash report budget and prior actual information Produce and distribute copies of financial and statistical reports at month end. Separate monthly statements and produce dunning letters for credit manager to sign. Monitor incoming payments for membership renewals Print zero balance statements for accounts receivable Assist with credit card retrieval and charge back processing Handle correspondence and communication to customers and management regarding billing and payment matters. Assist Credit Manager in productreports for financial statements. Record and forward monthly departmental meeting minutes to H/R. Offer timely, accurate and friendly response to all guest and employee requests. Respond to customer and member inquires in a timely manner Always practice legendary service Protect the assets of the property. Maintain professional appearance and behavior when in contact with customers and co-workers. Follow policies and procedures in training manuals and employee handbook. Recognize that despite all efforts the company makes, the ultimate responsibility for employee health and safety rests directly with the individual. It is a condition of employment for all employees to conduct their duties in a safe and healthful manner. Always remember we are in partnership with our clients, fellow employees and investors to provide quality service and profitability. Any and all reasonable requests of management<br/><br/><br/></li></ul>Qualifications:<br/><br/><ul><li> Microsoft Office, Data Plus and Opera a plus but required.</li><li> Basic mathematical skills necessary to understand Debit/Credit Filing System Must know how to use 10 key Must understand Microsoft Windows Have good knowledge of computer systems</li><li> We are an equal opportunity employer and prohibit discrimination/harassment without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.</li></ul>", "postedDate": "5 days ago", "skills": ["Microsoft Office", "Data Plus", "Opera", "Debit/Credit Filing System", "10 key", "Microsoft Windows", "computer systems"], "url": "https://www.linkedin.com/jobs/view/4003434772"}