{"jobTitle": "Human Resource Business Partner - Remote | WFH", "company": {"name": "Get.It Recruit - Administrative", "location": "Walnut, CA"}, "location": "Walnut, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Human Resources Services", "description": "Are you a passionate and experienced Human Resource Business Partner (HRBP) looking for a dynamic role where you can make a significant impact? We're excited to invite you to join our team in a hybrid role that blends onsite and remote work. In this position, you'll play a crucial role in shaping our workplace culture, supporting our employees, and driving innovative HR initiatives across multiple companies. You'll work closely with our CEO and collaborate with our diverse leadership team to deliver effective and tailored HR solutions. If you're enthusiastic about growth, people-centered strategies, and creating a positive work environment, we'd love to hear from you!<br/><br/><strong>Key Responsibilities<br/><br/></strong>Onboarding &amp; Orientation: Lead the onboarding process for new hires, including orientation sessions, completing paperwork, and setting up training schedules.<br/><br/>Employee Benefits: Manage employee benefits programs and be the go-to person for any benefits-related questions.<br/><br/>Performance Management: Oversee performance management processes such as goal setting, evaluations, and coaching to help employees thrive.<br/><br/>HR Guidance: Provide expert advice and support to managers and employees on HR policies, procedures, and best practices.<br/><br/>Policy Development: Create and implement HR policies and initiatives that foster a positive, inclusive work environment.<br/><br/>Culture &amp; Engagement: Champion our company culture by organizing and promoting initiatives that boost employee engagement and satisfaction.<br/><br/>Employee Relations: Handle employee relations matters with professionalism and confidentiality, including resolving conflicts and managing disciplinary actions.<br/><br/>Compliance: Keep accurate HR records and ensure compliance with all relevant employment laws and regulations.<br/><br/>Recruitment Collaboration: Work with the recruitment team to streamline the hiring process and improve time-to-hire.<br/><br/>Industry Trends: Stay updated on industry trends and best practices to continuously enhance our HR processes and strategies.<br/><br/><strong>Qualifications<br/><br/></strong>Bachelor's degree in Human Resources, Business Administration, or a related field.<br/><br/>At least 5 years of experience in an HR generalist role with a proven track record of leading HR initiatives.<br/><br/>Strong knowledge of employment laws and regulations.<br/><br/>Excellent interpersonal and communication skills, both verbal and written.<br/><br/>Ability to multitask and prioritize effectively.<br/><br/>Experience in promoting a positive and inclusive work culture.<br/><br/>Strong problem-solving skills and confidence to challenge the status quo when needed.<br/><br/>Ability to collaborate effectively with diverse leadership teams.<br/><br/>Flexibility to work both onsite and remotely in a hybrid role.<br/><br/><strong>Equal Opportunity Employer<br/><br/></strong>We are committed to providing equal employment opportunities to all individuals without regard to race, religion, color, sex (including childbirth, breastfeeding, and related medical conditions), national origin, citizenship status, uniform service member status, pregnancy, age, genetic information, disability, or any other protected status in accordance with all applicable federal, state, and local laws. This commitment extends to all aspects of our employment practices, including recruiting, hiring, discipline, termination, promotions, transfers, compensation, benefits, training, leaves of absence, and other terms and conditions of employment.", "responsibilities": "Onboarding &amp; Orientation: Lead the onboarding process for new hires, including orientation sessions, completing paperwork, and setting up training schedules.<br/><br/>Employee Benefits: Manage employee benefits programs and be the go-to person for any benefits-related questions.<br/><br/>Performance Management: Oversee performance management processes such as goal setting, evaluations, and coaching to help employees thrive.<br/><br/>HR Guidance: Provide expert advice and support to managers and employees on HR policies, procedures, and best practices.<br/><br/>Policy Development: Create and implement HR policies and initiatives that foster a positive, inclusive work environment.<br/><br/>Culture &amp; Engagement: Champion our company culture by organizing and promoting initiatives that boost employee engagement and satisfaction.<br/><br/>Employee Relations: Handle employee relations matters with professionalism and confidentiality, including resolving conflicts and managing disciplinary actions.<br/><br/>Compliance: Keep accurate HR records and ensure compliance with all relevant employment laws and regulations.<br/><br/>Recruitment Collaboration: Work with the recruitment team to streamline the hiring process and improve time-to-hire.<br/><br/>Industry Trends: Stay updated on industry trends and best practices to continuously enhance our HR processes and strategies.", "qualifications": {"required": "Bachelor's degree in Human Resources, Business Administration, or a related field.<br/><br/>At least 5 years of experience in an HR generalist role with a proven track record of leading HR initiatives.<br/><br/>Strong knowledge of employment laws and regulations.<br/><br/>Excellent interpersonal and communication skills, both verbal and written.<br/><br/>Ability to multitask and prioritize effectively.<br/><br/>Experience in promoting a positive and inclusive work culture.<br/><br/>Strong problem-solving skills and confidence to challenge the status quo when needed.<br/><br/>Ability to collaborate effectively with diverse leadership teams.<br/><br/>Flexibility to work both onsite and remotely in a hybrid role."}, "skills": [], "postedDate": "3 days ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4003523843"}