{"jobTitle": "Purchasing Specialist", "company": {"name": "UCLA Health", "industry": "Hospitals and Health Care", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$28.30 - $54.74 hourly", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Hospitals and Health Care", "description": "We are looking for a detail-oriented Procurement Specialist to provide essential purchasing support across departments, divisions, research labs, and other units. As the primary point of contact for procurement needs, you will oversee, coordinate, and report on all purchasing activities, ensuring seamless operations and alignment with University policies. Your key responsibilities will include processing purchases, managing travel support, and handling reimbursement requests for faculty and staff. Additionally, you will serve as a vital liaison between campus units and vendors, ensuring timely and accurate processing of purchases and payments. This role is crucial in maintaining efficient procurement processes and supporting the smooth functioning of our academic and research endeavors.", "responsibilities": "Processing purchases, managing travel support, and handling reimbursement requests for faculty and staff.", "qualifications": {"required": "Analytical skills necessary to evaluate the cost effectiveness of purchasing options. Ability to read and interpret terms and conditions of contracts. Working level of proficiency in the use of standard spreadsheet and word processing software. Ability to set priorities and complete ongoing tasks with competing deadlines, with frequent interruptions, with high degree of accuracy.", "preferred": "Bachelor's Degree or equivalent combination of education and experience; 1 - 3 years Purchasing."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "UCLA Health welcomes all individuals, without regard to race, sex, sexual orientation, gender identity, religion, national origin or disabilities, and we proudly look to each person’s unique achievements and experiences to further set us apart.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4003436709"}