{"jobTitle": "Supervisor Materials Mgmt", "company": {"name": "Dignity Health", "location": "Oxnard, CA"}, "location": "Oxnard, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Hospitals and Health Care", "description": "<strong>Overview<br/><br/></strong>St. John’s Regional Medical Center located in Oxnard California is a recognized as a Top 250 Hospital in the Nation and as one of America’s 100 Best Hospitals for Cardiac Care by Healthgrades. St. John’s Regional is a part of Dignity Health’s Southern California Division and is a member of CommonSpirit Health the largest not-for-profit health care system in the nation boasting an integrated network of top quality hospitals with physicians from the most prestigious medical schools and comprehensive outpatient services - all recognized for quality safety and service. Each hospital is supported by an active philanthropic Foundation to help meet the growing health care needs of our communities. Learn more at www.dignityhealth.org/StJohnsRegional.<br/><br/><strong>Supervisor Materals Management - Materials Management <br/><br/></strong><strong>St. John's Regional Medical Center<br/><br/></strong><strong>St. John's Regional Medical Center</strong> is seeking a highly motivated and experienced <strong>Supervisor, Materials Management </strong>to join our growing team. This role is responsible for overseeing all aspects of materials management, ensuring efficient and cost-effective operations while maintaining high levels of accuracy and customer satisfaction.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Supervise a team of materials management personnel, including warehouse staff, inventory control specialists, and purchasing agents.</li><li>Develop and implement inventory control strategies to optimize inventory levels, minimize waste, and ensure timely availability of materials.</li><li>Oversee the procurement process, including sourcing, negotiation, and contract management.</li><li>Supervise warehouse operations, including receiving, storing, picking, packing, and shipping of materials.</li><li>Identify and implement process improvements to enhance efficiency, reduce costs, and improve overall performance.</li><li>Ensure compliance with all relevant regulations, policies, and procedures.</li><li>Prepare and analyze reports on inventory levels, purchasing activity, and warehouse performance.</li><li>Manage the materials management budget and ensure cost-effective operations.</li><li>Provide training and development opportunities for team members to enhance their skills and knowledge.<br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>High School Diploma with five (5) years Materials Management or Accounts Payable experience or Associate’s degree with two (2) years Materials Management or Accounts Payable.</li><li>Minimum of one (1) years’ experience in Materials Management or Accounts Payable within a healthcare organization.</li><li>Minimum of three (3) years’ experience in invoice resolution working with requisitioners, vendors and Accounts Payable.<br/><br/><br/></li></ul><strong>Pay Range<br/><br/></strong>$34.50 - $42.03 /hour", "responsibilities": "Supervise a team of materials management personnel, including warehouse staff, inventory control specialists, and purchasing agents. Develop and implement inventory control strategies to optimize inventory levels, minimize waste, and ensure timely availability of materials. Oversee the procurement process, including sourcing, negotiation, and contract management. Supervise warehouse operations, including receiving, storing, picking, packing, and shipping of materials. Identify and implement process improvements to enhance efficiency, reduce costs, and improve overall performance. Ensure compliance with all relevant regulations, policies, and procedures. Prepare and analyze reports on inventory levels, purchasing activity, and warehouse performance. Manage the materials management budget and ensure cost-effective operations. Provide training and development opportunities for team members to enhance their skills and knowledge.", "qualifications": {"required": "High School Diploma with five (5) years Materials Management or Accounts Payable experience or Associate’s degree with two (2) years Materials Management or Accounts Payable. Minimum of one (1) years’ experience in Materials Management or Accounts Payable within a healthcare organization. Minimum of three (3) years’ experience in invoice resolution working with requisitioners, vendors and Accounts Payable."}, "skills": [], "postedDate": "3 days ago", "salary": {"amount": "34.50 - 42.03", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003662644"}