{"jobTitle": "Chief Operating Officer (Property Management)", "company": {"name": "Jobot", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$170,000.00/yr - $190,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Human Resources Services, Technology, Information and Internet, and Hospitals and Health Care", "description": "Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!<br/><br/>Job details<br/><br/><strong>$180K + 40K Bonus<br/><br/></strong>This Jobot Job is hosted by Scott Filbin<br/><br/>Are you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.<br/><br/>Salary $170,000 - $190,000 per year<br/><br/><strong>A Bit About Us<br/><br/></strong>Fast growing real estate investment company specializing in the acquisition and development of multifamily and residential real estate properties across the Western United States. Highly active company with a strong deal pipeline.<br/><br/><strong><br/><br/><strong>Why join us?<br/><br/><br/></strong></strong><ul><li> Longstanding, family owned real estate investment and management company in growth mode </li><li> Very active pipeline with strong financial backing</li><li> Strong management and executive team focused on mentorship and development</li><li> Fun, team-oriented culture<br/><br/></li></ul><strong>Job Details<br/><br/></strong>Position Overview The Chief Operating Officer (COO) will play a pivotal role in the strategic direction and day-to-day operations of our company. Reporting directly to the CEO, the COO will be responsible for overseeing all operational functions, optimizing efficiency, and ensuring the delivery of exceptional service to our clients and tenants. This is a key leadership position that requires a visionary leader with a proven track record of success in property management or related industries.<br/><br/>Key Responsibilities<br/><br/><ul><li> Operational Leadership Provide strategic direction and leadership to the operational teams, including property management, maintenance, leasing, and administrative functions.</li><li> Process Optimization Identify opportunities to streamline processes, improve efficiency, and reduce costs throughout the organization.</li><li> Client and Tenant Satisfaction Ensure the highest level of service delivery to clients and tenants, maintaining strong relationships and addressing any concerns or issues promptly and effectively.</li><li> Financial Management Work closely with the finance team to develop and manage budgets, analyze financial performance, and make data-driven decisions to drive profitability.</li><li> Risk Management Implement policies and procedures to mitigate risk, ensure compliance with regulatory requirements, and safeguard the company's assets.</li><li> Team Development Recruit, develop, and mentor a high-performing team, fostering a culture of collaboration, innovation, and continuous improvement.</li><li> Strategic Planning Collaborate with the executive team to develop and execute strategic initiatives that support the company's growth objectives and enhance its competitive position in the market.</li><li> Technology Integration Evaluate and implement technology solutions to enhance operational efficiency, improve communication, and streamline processes.</li><li> Vendor Management Oversee vendor relationships and contracts, negotiating favorable terms and ensuring the quality and cost-effectiveness of services.</li><li> Performance Measurement Establish KPIs and metrics to monitor performance across all operational areas, regularly analyzing results and implementing corrective actions as needed.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Bachelor's degree in business administration, real estate management, or a related field; MBA or equivalent preferred.</li><li> Proven experience in a senior leadership role within the property management industry, with a strong track record of success in operational management.</li><li> In-depth knowledge of property management best practices, industry trends, and regulatory requirements.</li><li> Exceptional leadership and communication skills, with the ability to inspire and motivate teams to achieve their full potential.</li><li> Strategic thinker with a results-oriented mindset and the ability to drive change and innovation.</li><li> Strong financial acumen, with the ability to analyze financial data, develop budgets, and make informed business decisions.</li><li> Demonstrated ability to build and maintain strong relationships with clients, tenants, vendors, and other stakeholders.</li><li> Proficiency in technology tools and platforms used in property management, such as property management software, CRM systems, and financial reporting tools.</li><li> Strong problem-solving skills and the ability to effectively manage complex issues and crises as they arise.<br/><br/></li></ul>Interested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.<br/><br/><strong>Want to learn more about this role and Jobot?<br/><br/></strong>Click our Jobot logo and follow our LinkedIn page!<br/><br/>", "responsibilities": "Provide strategic direction and leadership to the operational teams, including property management, maintenance, leasing, and administrative functions. Identify opportunities to streamline processes, improve efficiency, and reduce costs throughout the organization. Ensure the highest level of service delivery to clients and tenants, maintaining strong relationships and addressing any concerns or issues promptly and effectively. Work closely with the finance team to develop and manage budgets, analyze financial performance, and make data-driven decisions to drive profitability. Implement policies and procedures to mitigate risk, ensure compliance with regulatory requirements, and safeguard the company's assets. Recruit, develop, and mentor a high-performing team, fostering a culture of collaboration, innovation, and continuous improvement. Collaborate with the executive team to develop and execute strategic initiatives that support the company's growth objectives and enhance its competitive position in the market. Evaluate and implement technology solutions to enhance operational efficiency, improve communication, and streamline processes. Oversee vendor relationships and contracts, negotiating favorable terms and ensuring the quality and cost-effectiveness of services. Establish KPIs and metrics to monitor performance across all operational areas, regularly analyzing results and implementing corrective actions as needed.", "qualifications": {"required": "Bachelor's degree in business administration, real estate management, or a related field; MBA or equivalent preferred. Proven experience in a senior leadership role within the property management industry, with a strong track record of success in operational management. In-depth knowledge of property management best practices, industry trends, and regulatory requirements. Exceptional leadership and communication skills, with the ability to inspire and motivate teams to achieve their full potential. Strategic thinker with a results-oriented mindset and the ability to drive change and innovation. Strong financial acumen, with the ability to analyze financial data, develop budgets, and make informed business decisions. Demonstrated ability to build and maintain strong relationships with clients, tenants, vendors, and other stakeholders. Proficiency in technology tools and platforms used in property management, such as property management software, CRM systems, and financial reporting tools. Strong problem-solving skills and the ability to effectively manage complex issues and crises as they arise.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003502071"}