{"jobTitle": "Administrative Assistant", "company": {"name": "MCI", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Outsourcing and Offshoring Consulting", "description": "Remote Work-at-Home<br/><br/><strong> JOB TYPE <br/><br/></strong>Full-Time<br/><br/><strong> PAY TYPES <br/><br/></strong>Salary<br/><br/><strong> SALARY <br/><br/></strong>Commensurate<br/><br/><strong>Position Overview<br/><br/></strong>MCI is a leading Business Process Outsourcing (BPO) company that specializes in delivering tailored solutions to meet the diverse needs of our clients. With a commitment to excellence and a focus on innovation, we have established ourselves as a trusted partner in the industry.<br/><br/>We are seeking an Administrative Assistant to provide support to our leadership team. As an Administrative Assistant you will perform a variety of administrative and clerical tasks. This is an excellent job with many learning and advancement opportunities.<br/><br/>The ideal candidate for this role should have an excellent command of the English language, be highly organized and reliable, and have a strong work ethic and attention to detail. Prior administrative experience is recommended but not required.<br/><br/>To be considered for this role, you must complete a full application on our company careers page, including all screening questions and a brief pre-employment test.<br/><br/><ul><li> <br/><br/></li></ul>_<br/><br/><strong>Key Responsibilities<br/><br/></strong><strong> POSITION RESPONSIBILITIES <br/><br/></strong><ul><li> Perform a variety of administrative duties </li><li> Answer emails and phone calls </li><li> Provide real-time scheduling support by booking appointments and preventing conflicts </li><li> Create content to post on the company's Social Media Channels </li><li> Prepare presentations according to the instructions given </li><li> Make travel arrangements, such as booking flights, cars, hotel, and restaurant reservations </li><li> Maintain polite and professional communication via phone, e-mail, and mail </li><li> Anticipate the needs of others to ensure their seamless and positive experience </li><li> Handle sensitive information in a confidential manner <br/><br/></li></ul><strong>Candidate Qualifications<br/><br/></strong><strong>WONDER IF YOU ARE A GOOD FIT FOR THIS POSITION?<br/><br/></strong>All positive, driven, and confident applicants are encouraged to apply. Ideal candidates for this position are highly motivated and dedicated.<br/><br/><ul><li> 1 year of experience preferred </li><li> High School Diploma or equivalent </li><li> Exceptional time management skills and ability to multi-task and prioritize work </li><li> Strong attention to detail </li><li> Excellent organizational and planning skills </li><li> Working knowledge of Microsoft Office including Outlook, Excel, Word &amp; PowerPoint </li><li> Have a wired, high-speed internet connection (Download speed of 20Mbps+) </li><li> Ability to type swiftly and accurately (20+ words a minute) <br/><br/></li></ul><strong> CONDITIONS OF EMPLOYMENT <br/><br/></strong><strong> All MCI Locations <br/><br/></strong><ul><li> Must be authorized to work in the country where the job is based. <br/><br/></li></ul><strong> Subject to the program and location of the position <br/><br/></strong><ul><li> Must be willing to submit up to a LEVEL II background and/or security investigation with a fingerprint. Job offers are contingent on background/security investigation results. </li><li> Must be willing to submit to drug screening. Job offers are contingent on drug screening results. <br/><br/></li></ul><strong>Compensation Details<br/><br/></strong><strong> WANT AN EMPLOYER THAT VALUES YOUR CONTRIBUTION? <br/><br/></strong>Standard starting compensation is commensurate with experience. Yearly reviews are conducted based on tenure and performance.<br/><br/><strong>Physical Requirements<br/><br/></strong>This job operates in a professional office environment. While performing the duties of this job, the employee will be largely sedentary and will be required to sit/stand for long periods while using a computer and telephone headset. The employee will be regularly required to operate a computer and other office equipment, including a phone, copier, and printer. The employee may occasionally be required to move about the office to accomplish tasks, reach in any direction, raise or lower objects, move objects from place to place, hold onto objects, and move or exert force up to forty (40) pounds.<br/><br/><strong> REASONABLE ACCOMMODATION <br/><br/></strong>Consistent with the Americans with Disabilities Act (ADA), it is the policy of MCI and its affiliates to provide reasonable accommodations when requested by a qualified applicant or employee with a disability unless such accommodations would cause undue hardship. The policy regarding requests for reasonable accommodation applies to all aspects of employment. If reasonable accommodations are needed, please contact Human Resources.<br/><br/><strong> DIVERSITY AND EQUALITY <br/><br/></strong>At MCI and its subsidiaries, we embrace differences and believe diversity benefits our employees, company, customers, and community. All aspects of employment at MCI are based solely on a person's merit and qualifications. MCI maintains a work environment free from discrimination, where employees are treated with dignity and respect. All employees are responsible for fulfilling MCI's commitment to a diverse and equal-opportunity work environment.<br/><br/>MCI does not discriminate against any employee or applicant on the basis of age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations, and ordinances. MCI will consider qualified applicants with criminal histories for employment in a manner consistent with local and federal requirements.<br/><br/>MCI will not tolerate discrimination or harassment based on any of these characteristics. We adhere to these principles in all aspects of employment, including recruitment, hiring, training, compensation, promotion, benefits, social and recreational programs, and discipline. In addition, MCI's policy is to provide reasonable accommodation to qualified employees with protected disabilities to the extent required by applicable laws, regulations, and ordinances where an employee works.<br/><br/><strong>About Mci (parent Company)<br/><br/></strong>MCI helps customers take on their CX and DX challenges differently, creating industry-leading solutions that deliver exceptional experiences and drive optimal performance. MCI assists companies with business process outsourcing, staff augmentation, contact center customer services, and IT Services needs by providing general and specialized hosting, software, staff, and services.<br/><br/>In 2019, Marlowe Companies Inc. (MCI) was named by Inc. Magazine as Iowa's Fastest Growing Company in the State of Iowa and was named the 452nd Fastest Growing Privately Company in the USA, making the coveted top 500 for the first time. MCI's subsidiaries had previously made Inc. Magazine's List of Fastest-Growing Companies 15 times, respectively. MCI has ten business process outsourcing service delivery facilities in Georgia, Florida, Texas, New Mexico, California, Kansas, Nova Scotia, South Africa, and the Philippines.<br/><br/>Driving modernization through digitalization, MCI ensures clients do more for less. MCI is the holding company for a diverse lineup of tech-enabled business services operating companies. MCI organically grows, acquires, and operates companies that have synergistic products and services portfolios, including but not limited to Automated Contact Center Solutions (ACCS), customer contact management, IT Services (IT Schedule 70), and Temporary and Administrative Professional Staffing (TAPS Schedule 736), Business Process Management (BPM), Business Process Outsourcing (BPO), Claims Processing, Collections, Customer Experience Provider (CXP), Customer Service, Digital Experience Provider (DXP), Account Receivables Management (ARM), Application Software Development, Managed Services, and Technology Services, to mid-market, Federal &amp; enterprise partners. MCI now employs 10,000+ talented individuals with 150+ diverse North American client partners across the following MCI brands: MCI BPO, MCI BPOaaS, MarketForce, GravisApps, Gravis Marketing, MarchEast, Mass Markets, MCI Federal Services (MFS), OnBrand24, The Sydney Call Center, Valor Intelligent Processing (VIP), BYC Aqua, EastWest BPO, TeleTechnology, and Vinculum.<br/><br/><strong> DISCLAIMER <br/><br/></strong>The purpose of the above job description is to provide potential candidates with a general overview of the role. It's not an all-inclusive list of the duties, responsibilities, skills, and qualifications required for the job. You may be asked by your supervisors or managers to perform other duties. You will be evaluated in part based on your performance of the tasks listed in this job description.<br/><br/>The employer has the right to revise this job description at any time. This job description is not an employment contract, and either you or the employer may terminate employment at any time for any reason.<br/><br/><strong> REGARDING COVID-19 <br/><br/></strong>As an employer supporting critical Federal, State, Provincial, and Commercial clients, we have taken steps to ensure that we remain operational while taking every precaution possible to prevent the spread of COVID-19 and keep our employees safe.<br/><br/>Measures include social distancing for those working on-site, frequent deep cleaning and disinfecting of workstations and common areas, daily contactless temperature checks for those essential employees working on-site, travel policies limiting travel and mandatory quarantine, reporting and quarantine processes and policies for those exposed, and requesting masks to be worn when on-site employees are not at their workstation.<br/><br/>For more information on MCI’s response to COVID-19 please visit www.mci.world/covid-19 .", "responsibilities": "<strong> POSITION RESPONSIBILITIES <br/><br/></strong><ul><li> Perform a variety of administrative duties </li><li> Answer emails and phone calls </li><li> Provide real-time scheduling support by booking appointments and preventing conflicts </li><li> Create content to post on the company's Social Media Channels </li><li> Prepare presentations according to the instructions given </li><li> Make travel arrangements, such as booking flights, cars, hotel, and restaurant reservations </li><li> Maintain polite and professional communication via phone, e-mail, and mail </li><li> Anticipate the needs of others to ensure their seamless and positive experience </li><li> Handle sensitive information in a confidential manner <br/><br/></li></ul>", "qualifications": {"required": "All positive, driven, and confident applicants are encouraged to apply. Ideal candidates for this position are highly motivated and dedicated.<br/><br/><ul><li> 1 year of experience preferred </li><li> High School Diploma or equivalent </li><li> Exceptional time management skills and ability to multi-task and prioritize work </li><li> Strong attention to detail </li><li> Excellent organizational and planning skills </li><li> Working knowledge of Microsoft Office including Outlook, Excel, Word &amp; PowerPoint </li><li> Have a wired, high-speed internet connection (Download speed of 20Mbps+) </li><li> Ability to type swiftly and accurately (20+ words a minute) <br/><br/></li></ul>", "preferred": "Must be authorized to work in the country where the job is based. <br/><br/>"}, "skills": ["Microsoft Office", "Outlook", "Excel", "Word", "PowerPoint"], "postedDate": "5 days ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4003508287"}