{"jobTitle": "HR Generalist Payroll Specialist", "company": {"name": "Jooble", "location": "South Gate, CA"}, "location": "South Gate, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Software Development", "description": "<strong>We are promoting this job opportunity as provided by a third party, the employer. In case of your interest in this job opportunity and for more details please click on \"Apply\" button below, which will take you to the employer's website<br/><br/></strong>Manpower is hiring for an HR Generalist who will also process payroll! I have you have experience in all facets of HR as well as full cycle payroll and multi state tax, please read on.<br/><br/><strong>What’s In It For You<br/><br/></strong><ul><li> Temp to Hire</li><li>65K - 75K based on experience</li><li> Located in South Gate, CA <br/><br/></li></ul><strong>Job Summary<br/><br/></strong>The Human Resource Generalist will run the daily functions of the Human Resource (HR) department including hiring and interviewing staff, administering pay, benefits, and leave, and enforcing company policies and practices.<br/><br/><strong>Essential Job Duties &amp; Responsibilities<br/><br/></strong><ul><li> Processes payroll for approximately 200 employees in multi-states.</li><li> Responsible for payroll compliance (taxes, audits, 401K, etc.)</li><li> Assists with Recruitment, interviews, and facilitates the hiring of qualified job applicants for open positions; collaborates with departmental managers to understand skills and competencies required for openings.</li><li> Conducts or acquires background checks and employee eligibility verifications.</li><li> Executes new hire orientation and employee recognition programs.</li><li> Performs routine tasks required to administer and execute human resource programsincluding but not limited to compensation, benefits, and leave; disciplinary matters; disputes and investigations; performance and talent management; productivity, recognition, and morale; occupational health and safety; and training and development.</li><li> Handles employment-related inquiries from applicants, employees, and supervisors, referring complex and/or sensitive matters to the appropriate staff.</li><li> Attends and participates in employee disciplinary meetings, terminations, and investigations.</li><li> Maintains compliance with federal, state, and local employment laws and regulations, and recommended best practices; reviews policies and practices to maintain compliance.</li><li> Maintains knowledge of trends, best practices, regulatory changes, and new technologies in payroll and employment law.</li><li> Performs other duties as assigned. <br/><br/></li></ul>EDUCATION<br/><br/><ul><li> Bachelor’s degree in human resources, Business Administration, or a related field required.</li><li> SHRM certification a plus. <br/><br/></li></ul>SKILLS AND EXPERIENCE<br/><br/><ul><li> At least 3 years of Payroll processing experience- Paylocity highly preferred</li><li> Knowledge of payroll laws and compliance requirement</li><li> Multi-State payroll knowledge a plus</li><li> Excellent verbal and written communication skills- Bilingual (English/Spanish) a must.</li><li> Excellent interpersonal, negotiation, and conflict resolution skills.</li><li> Excellent organizational skills and attention to detail.</li><li> Excellent time management skills with a proven ability to meet deadlines.</li><li> Strong analytical and problem-solving skills.</li><li> Ability to prioritize tasks and to delegate them when appropriate.</li><li> Ability to act with integrity, professionalism, and confidentiality.</li><li> Thorough knowledge of employment-related laws and regulations.</li><li> Proficient with Microsoft Office Suite or related software.</li><li> Proficiency with or the ability to quickly learn the organizations HRIS and talent management systems.</li></ul>", "responsibilities": "The Human Resource Generalist will run the daily functions of the Human Resource (HR) department including hiring and interviewing staff, administering pay, benefits, and leave, and enforcing company policies and practices.", "qualifications": {"required": "At least 3 years of Payroll processing experience- Paylocity highly preferred, Knowledge of payroll laws and compliance requirement, Multi-State payroll knowledge a plus, Excellent verbal and written communication skills- Bilingual (English/Spanish) a must., Excellent interpersonal, negotiation, and conflict resolution skills., Excellent organizational skills and attention to detail., Excellent time management skills with a proven ability to meet deadlines., Strong analytical and problem-solving skills., Ability to prioritize tasks and to delegate them when appropriate., Ability to act with integrity, professionalism, and confidentiality., Thorough knowledge of employment-related laws and regulations., Proficient with Microsoft Office Suite or related software., Proficiency with or the ability to quickly learn the organizations HRIS and talent management systems.", "preferred": "Bachelor’s degree in human resources, Business Administration, or a related field required., SHRM certification a plus."}, "skills": ["Payroll", "HR", "Paylocity", "Multi-State Payroll", "Communication", "Bilingual", "English", "Spanish", "Interpersonal", "Negotiation", "Conflict Resolution", "Organizational", "Time Management", "Analytical", "Problem Solving", "Prioritization", "Delegation", "Integrity", "Professionalism", "Confidentiality", "Employment Law", "Microsoft Office", "HRIS", "Talent Management"], "postedDate": "3 days ago", "url": "https://www.linkedin.com/jobs/view/4003668553"}