{"jobTitle": "Supervisor of Operations (Large Group/Alternate Funding) REMOTE", "company": {"name": "Warner Pacific Insurance Services", "location": "Westlake Village, CA"}, "location": "Westlake Village, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Insurance", "description": "REMOTE POSITION<br/><br/>The Supervisor of Operations is primarily responsible for day-to-day supervision of 20+ employees in Operations which include: Multi-Market Analysts, Multi-Market Support Specialists, and Auditors who support Medical and Ancillary Large Group and Small/Large Group Alternate Funding. As a member of the leadership team and an exempt employee, this individual is expected to devote the majority of his/her time to managing the performance and workload of the Department’s staff including making recommendations about hiring, termination and other employment decisions, train new department members, coach, counsel and evaluate performance of direct reports utilizing performance management processes as needed. Plan and execute employee engagement activities that foster a high performing culture, and focus on the development of employees to optimize their performance. Establish best practices for optimal workflows to maximize resources. Maintain lines of communication with Sales, IT, and other departments to ensure internal and external customer support issues are addressed efficiently and effectively. Establish proactive processes for diagnosing issues, tracking status, and providing resolution. The Supervisor of Quoting will report to the Sr. Director of Operations, although he/she is expected to perform with a minimal amount of supervision and to exercise outstanding judgment, communication skills and analytical reasoning in all aspects of job performance.<br/><br/><strong>Overview Of Responsibilities<br/><br/></strong><ul><li>Initiate, evaluate and balance/reallocate case load assignments as necessary to help staff members achieve Department and individual performance objectives </li><li>Continually evaluate work environment to identify and make recommendations about areas in which procedures and processes can be improved and assist in formulating and implementing new and existing processes, procedures and policies as applied in the various Department’s</li><li>Review audit results and provide quarterly feedback to the staff members </li><li>Identify and work cooperatively with Human Resources as necessary to resolve employee relations, complaints and other interpersonal communication issues in a timely and professional manner</li><li>Identify staff development needs and provide/coordinate necessary training and skill development for members of the Department</li><li>Compile reporting based on RFP and sales activity by regions, carriers, sales consultants, employees, etc. </li><li>Work with Human Resources to evaluate and process vacation and leave requests; maintain vacation calendar and Department roster in current status and modify staffing assignments and workloads as necessary to accommodate such absences</li><li>Assure timely receipt and correction of timesheets for Department personnel as necessary</li><li>Compile and conduct all Departmental staff reviews as required. Currently, the Supervisor is required to submit reviews to the Sr. Director of Operations for review/input at least three weeks in advance of due date for reviews and to conduct all staff reviews within one (1) week of annual anniversary dates (unless circumstances require otherwise, in which case, the Supervisor should apprise the Senior Vice President of Operations of such circumstances) </li><li>Respond promptly to all internal and external communications, such as client or management e-mails and phone messages, ideally within no more than 2-4 hours of receipt</li><li>Handle elevated broker/quote issues in a timely fashion, generally within 24 hours, and provide timely follow up to affected parties regarding status</li><li>Participate in and complete other Department management projects as assigned in an efficient, cooperative and timely fashion</li><li>Identify topics and prepare materials for, and make training and other presentations at Departmental staff meetings</li><li>Achieve unit performance objectives as established</li><li>Mentor and train staff members; provide performance counseling and appropriate feedback; and recommend/ implement disciplinary measures as needed</li><li>Provide supervisory back-up or assistance in other areas within the Department/Company as requested</li><li>Perform all other duties and responsibilities as reasonably assigned from time to time by the Company or its designated representatives<br/><br/></li></ul><strong>Expected Leadership Qualities<br/><br/></strong><ul><li>Ability to treat all applicants, employees and customers fairly and with respect and to communicate with other employees consistently in a dignified, positive fashion in order to encourage and achieve maximum performance results while earning respect and admiration of subordinates, co-workers and superiors</li><li>Ability to effectively communicate performance expectations and objectives and job requirements to subordinates and co-workers in a clear, effective and consistent manner to assist in their professional development</li><li>Ability to lead by example and to regularly review, understand, comply with and enforce all policies and procedures, including those regarding punctuality, attendance and harassment and discrimination prevention </li><li>Ability to embrace change with a positive attitude and to motivate others in the Department to do the same</li><li>Ability to maintain and foster positive, open communication channels with all affiliated internal service areas (including sales reps), brokers and carriers</li><li>Ability to demonstrate consistent, outstanding judgment, honesty and integrity in all aspects of job performance, including hiring, disciplinary and other recommendations and day-to-day supervisory and case assignment responsibilities<br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>Ability to work additional hours beyond regular work schedules as necessary during our peak season to meet commitments to our customers and business needs (including weekends &amp; holidays)</li><li>Minimum of a High School Diploma; advanced education or degree preferred</li><li>3-5 years in a Supervisor or Manager role with successful track record managing sales and /or operations teams (15 or more employees) </li><li>Excellent communication skills (written and verbal) with history of effectively communicating clearly and timely to multiple audiences </li><li>Experience leading and motivating staff, utilizing performance management process in a multi-team environment</li><li>Extensive background in recruiting, interviewing, hiring, and on-boarding of new employees </li><li>Demonstrates strong creative problem solving; strong interpersonal and relationship-building skills with the ability to negotiate and influence others in a positive manner</li><li>May require occasional in/out of state multi day travel </li><li>Demonstrated ability to maintain a pleasant, cordial, and professional demeanor when negotiating with senior management, management, coworkers, carriers and customers</li><li>Demonstrated ability to successfully prioritize and remain calm and professional when faced with requests, demands and deadlines </li><li>Demonstrate consistent, outstanding judgment, honesty and integrity in all aspects of job performance/management ability<br/><br/></li></ul><strong>Compensation<br/><br/></strong><ul><li>Annual Salary Range*: $87,075 - $116,100 per year </li><li>Actual compensation may vary from posting based on work experience, education and/or skill level. </li><li>* The hourly or salary range is the range Warner Pacific in good faith believes is the range of possible compensation for this role at the time of this posting. The Company may ultimately pay more or less than the posted range. This range may be modified in the future. No amount is considered to be wages or compensation until such amount is earned, vested, and determinable under the terms and conditions of the applicable policies and plans. The amount and availability of any bonus, commission, benefits, or any other form of compensation and benefits that are allocable to a particular employee remains in the Company's sole discretion unless and until paid and may be modified at the Company’s sole discretion, consistent with the law. </li><li>We offer a range of market-competitive benefits that include merit increases, paid holidays, Paid Time Off, medical, dental, vision, short- and long-term disability benefits, 401(k) + match, and life insurance.</li></ul>", "responsibilities": "The Supervisor of Operations is primarily responsible for day-to-day supervision of 20+ employees in Operations which include: Multi-Market Analysts, Multi-Market Support Specialists, and Auditors who support Medical and Ancillary Large Group and Small/Large Group Alternate Funding. As a member of the leadership team and an exempt employee, this individual is expected to devote the majority of his/her time to managing the performance and workload of the Department’s staff including making recommendations about hiring, termination and other employment decisions, train new department members, coach, counsel and evaluate performance of direct reports utilizing performance management processes as needed. Plan and execute employee engagement activities that foster a high performing culture, and focus on the development of employees to optimize their performance. Establish best practices for optimal workflows to maximize resources. Maintain lines of communication with Sales, IT, and other departments to ensure internal and external customer support issues are addressed efficiently and effectively. Establish proactive processes for diagnosing issues, tracking status, and providing resolution. The Supervisor of Quoting will report to the Sr. Director of Operations, although he/she is expected to perform with a minimal amount of supervision and to exercise outstanding judgment, communication skills and analytical reasoning in all aspects of job performance.", "qualifications": {"required": "Ability to work additional hours beyond regular work schedules as necessary during our peak season to meet commitments to our customers and business needs (including weekends & holidays)\nMinimum of a High School Diploma; advanced education or degree preferred\n3-5 years in a Supervisor or Manager role with successful track record managing sales and /or operations teams (15 or more employees) \nExcellent communication skills (written and verbal) with history of effectively communicating clearly and timely to multiple audiences \nExperience leading and motivating staff, utilizing performance management process in a multi-team environment\nExtensive background in recruiting, interviewing, hiring, and on-boarding of new employees \nDemonstrates strong creative problem solving; strong interpersonal and relationship-building skills with the ability to negotiate and influence others in a positive manner\nMay require occasional in/out of state multi day travel \nDemonstrated ability to maintain a pleasant, cordial, and professional demeanor when negotiating with senior management, management, coworkers, carriers and customers\nDemonstrated ability to successfully prioritize and remain calm and professional when faced with requests, demands and deadlines \nDemonstrate consistent, outstanding judgment, honesty and integrity in all aspects of job performance/management ability", "preferred": ""}, "skills": [], "postedDate": "6 days ago", "benefits": "We offer a range of market-competitive benefits that include merit increases, paid holidays, Paid Time Off, medical, dental, vision, short- and long-term disability benefits, 401(k) + match, and life insurance.", "remoteWork": "Yes", "salary": {"amount": "87,075 - 116,100", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4003067019"}