{"jobTitle": "Logistics Coordinator", "company": {"name": "Multiquip Inc.", "location": "Cypress, CA"}, "location": "Cypress, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Construction", "description": "<strong>Why Work At Multiquip?</strong> Multiquip Inc has been in business for 50 years, with our parent company ITOCHU International Inc. ranks 71 out of the Fortune Global 500 companies to work for. We are one of the largest, diversified manufacturers and suppliers of excellent quality products. Multiquip’s comprehensive product portfolio includes light to medium construction equipment, power generators, and lighting. Join our team!\n\nWe are looking for a dedicated individual to join our logistics team. The Logistics Coordinator is responsible for the inventory transfer and receipt of parts and units to the different warehouses, salesman field stock, and customers. The candidate must have a service-oriented attitude and the ability to work with several teams within the organization.\n\n<strong>Essential Duties and Responsibilities:</strong>\n\n* Review transfer requests from Service-Plus Parts and Construction Equipment (CE), create transfer orders andshipping deliveries and coordinate the shipment with MQ warehouses.\n* Keep track of the transfer shipment's status and coordinate the inventory receipts with Service Plus staff\n* Keep track of the consignment transfer shipment, obtain receipt acknowledgment, and process consignment inventory receipts.\n* Keep track of the Service Plus Parts and CE units' backorders and print the deliveries as inventory becomes available.\n* Maintain and update Canada Parts blanket backorders transfer Purchase Order (PO), create transfer deliveries, and coordinate the shipment with MQ warehouses.\n* Responsible for reviewing, coordinating, and releasing Sales Orders on delivery blocks and credit holds and creating deliveries for shipping.\n* Maintain reports and shared files to monitor and organize work activities\n* Perform other duties assigned by the In-Stock lead\n* Follow Multiquip JSox policies, procedures, and guidelines.\n\n\n\n<strong>Education and Work Experience Requirements:</strong>\n\n* Bachelor's Degree in Supply Chain/Logistics/Operation or 3 Plus years of experience in Distribution/Fulfillment.\n* Knowledge of SAP systems is a plus\n* Excellent communication and problem-solving skills\n* Ability to use Microsoft Office Suite (Excel, Word, PowerPoint, Outlook).\n\n\n\n<strong>Physical Requirements:</strong>\n\n* The physical demands described here represent those that an employee must meet to perform the essential functions of this job successfully. Reasonable accommodations may be made to enable individuals with disabilities to perform essential functions.\n* While performing the duties of this job, the employee is frequently required to stand, walk; sit; use hands to finger, handle, or feel; reach with hands and arms; climb or balance; stoop, kneel, or crouch, and talk or hear. \n* The employee must occasionally lift and move up to 50 pounds with or without assistance.", "postedDate": "2 days ago", "skills": ["SAP", "Microsoft Office Suite", "Communication", "Problem Solving"], "url": "https://www.linkedin.com/jobs/view/4003599345"}