{"jobTitle": "Senior Operations Manager", "company": {"name": "Stellant Systems, Inc.", "industry": "Defense and Space Manufacturing, Aviation and Aerospace Component Manufacturing, and Appliances, Electrical, and Electronics Manufacturing", "size": "51-200 employees", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$130,000.00 - $165,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Defense and Space Manufacturing, Aviation and Aerospace Component Manufacturing, and Appliances, Electrical, and Electronics Manufacturing", "description": "Stellant Systems, a premier manufacturer of critical power amplification products where our technologies and products are unparalleled in the industry. We specialize in the manufacture of microwave devices for ground-based, airborne and satellite communications, industrial and medical equipment, and radar; we are the only U.S. supplier of space-qualified Traveling Wave Tube and Traveling Wave Tube Amplifiers. We combine cutting-edge technology with world-class engineering teams to deliver innovative solutions.", "responsibilities": "Have an Aerospace/Defense production pedigree and background. Space experience preferred. Establishing production flow lines that yield visual management and predictable outputs. Increasing first pass yield (FPY) metrics that result in cost savings to the affected programs. Driving significant and sustainable on-time delivery (OTD) performance. Building a culture across the factory that supports workforce engagement, retention and efficiency improvements. Developing cross-functional relationships in the organization that support a “one team” approach to operational execution across the business. Serve as key leader of the manufacturing team providing leadership and strategy execution for responsible manufacturing team and day-to-day operations. Lead, engage and continuously develop all team members. Meet functional requirements of staffing, training, talent development, engagement, retention, and overall management of area of responsibility. Ensure a healthy and safe working environment and comply with federal and state regulations through collaboration with environmental, health and safety staff. Establish and maintain an effective and clearly defined training plan for area(s) of responsibility. Meet functional organization and business annual operation plan targets. Lead Manufacturing/Operations processes as appropriate to ensure tools, processes, and staff are competitive and applicable to the business needs. Develop Manufacturing/Process Technology roadmap and required capital planning. Support pursuits and proposals in the business, including review/approval and the generation of production schedules to support proposal efforts and Basis of Estimates (BOEs) as needed. Communicate production strategies broadly to expedite adoption and institutionalization of best practices. Provide strong executive communication and presentation skills. Deliver progress and production reports to executive team members routinely and as requested. Perform other related duties as assigned.", "qualifications": {"required": "A minimum of five (5+) years of relevant experience in an operations leadership capacity with emphasis on Aerospace/Defense end-use products. 10+ years manufacturing experience in Aerospace/Defense industry, Vacuum Device or Microwave Component industry experience preferred. BS Engineering/Science/Math with MS or MBA preferred. Experience with high-reliability assembly processes for highly engineered products. Possess a working knowledge of the cultural issues impacting lean implementation and demonstrated success of overcoming these issues. Experience deploying new production lines and establishing product line-based flow lines. Experience in applying best practice FMEA/DFMA/DTC methodologies. Experience in lean manufacturing implementation - Six Sigma Green/Black Belt Certification a plus.", "preferred": "Experience leading within a union facility. A background within, and understanding of, Traveling Wave Tube (TWT) products and related regulatory compliance (eg: AS9100) is viewed as an advantage. Experience in DC, RF, thermal vacuum and vibration test processes. Background in the development/LRIP manufacturing efforts is preferred. Standard use of MES, PDM and MRP. Demonstrated ability to successfully manage multiple tasks simultaneously while maintaining high quality and focus on the details. The ability to work in a fast-moving environment under tight schedules and coordinate multiple tasks effectively."}, "skills": ["Aerospace", "Defense", "Lean Manufacturing", "Six Sigma", "Operations Management"], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4003609101"}