{"jobTitle": "Practice Manager, RDOG - Ophthalmology", "company": {"name": "UCLA Health", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "experienceLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "<strong>Qualifications<br/><br/></strong>REQUIRED:<br/><br/><ul><li>Working knowledge of ophthalmology terminology.</li><li>Skill in projecting and monitoring income trends on the basis of existing revenue and cost data. </li><li>Experience with managing patient care activities in a medical practice or hospital facility. </li><li>Experience with and thorough understanding of medical billing procedures. </li><li>Experience in accounting principles including budget and revenue analysis. </li><li>Ability to identify and define complex problems and develop and implement solutions for quality and process improvement. </li><li>Strong organizational and prioritization skills to effectively coordinate and promote the patient care activities of the Divisions. </li><li>Experience in supervising a staff including organizing workflow to accomplish established objectives, delegating responsibility, training staff, evaluating staff effectiveness and administering necessary discipline while adhering to negotiated personnel contracts. </li><li>Skill in setting goals which accurately reflect the relative importance of job responsibilities and the strategic priorities of the Divisions. Computer and writing skills sufficient to develop financial and administrative reporting systems and to compose correspondence that communicates analytically, logically and concisely using correct grammar, punctuation and spelling. </li><li>Ability to follow through with assignments independently. </li><li>Verbal skills sufficient to promote pleasant and effective interactions with patients, staff, doctors, and the public. </li><li>Ability to perform under the stress of frequent interruptions and/or distractions. </li><li>Working knowledge to effectively manage and report Division collections, employee time and attendance and manage risk within University policies, procedures and operational resources. </li><li>Skill in supervising staff including organizing workflow to accomplish established objectives, training staff and evaluating staff effectiveness. </li><li>Skill in setting priorities which accurately reflect the relative importance of job responsibilities. </li><li>Familiarity with surgery scheduling systems, preferably in ophthalmology. </li><li>Working knowledge of current third party payor systems including managed care and governmental programs; familiarity with current patient billing practices. </li><li>Strong organizational skills to effectively coordinate the patient care activities of the division. </li><li>Excellent interpersonal skills including the ability to deal effectively with patients who are under stress. </li><li>Familiarity with computerized patient appointment scheduling system, preferably PDM system. </li><li>Familiarity with CareConnect. </li><li>Ability to follow-through with tasks under minimal supervision and ability to prioritize work effectively. <br/><br/></li></ul><strong>Preferred<br/><br/></strong><ul><li>Ability to organize and maintain patient records efficiently.</li><li>Ability to perform under stress of frequent interruptions and/or distractions.</li></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4003752168"}