{"jobTitle": "Accounting Assistant II - Accounts Payable", "company": {"name": "El Camino College", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "4,955.00/mo - 6,338.00/mo", "currency": "USD"}, "jobFunction": "Accounting/Auditing and Finance", "industry": "Higher Education", "description": "El Camino College<br/><br/>Accounting Assistant II - Accounts Payable<br/><br/>Req: C2425-001<br/><br/>Division: Fiscal Services<br/><br/>Close Date: Friday, August 30, 2024 at 3:00 p.m.<br/><br/>Complete job description and application available online at: https://elcamino.igreentree.com/css_classified<br/><br/><strong>Basic Function<br/><br/></strong>Under the direction of an assigned supervisor, prepare, maintain and review a variety of records, reports and documents related to accounts payable, accounts receivable, financial aid or an assigned instructional division budget.<br/><br/>The Accounting Assistant II class operates with more freedom to act in more difficult or complex accounts with more direct accountability for a set of accounts. Incumbents in the Accounting Assistant I class perform routine financial record-keeping tasks under close supervision according to prescribed methods and procedures. The Accounting Assistant III classification is assigned a broader, more complex set of accounts involving a complete program or functional responsibility with considerable interaction with other accounting or program personnel and the responsibility for checking or verifying the work of other accounting personnel.<br/><br/>REPRESENTATIVE DUTIES<br/><br/>Perform responsible clerical accounting duties in accounts payable, financial aid, accounts receivable or other assigned accounting area.<br/><br/>Assist in the preparation, maintenance and control of an instructional division budget; determine fund availability in various accounts and recommend adjustments as needed.<br/><br/>Receive, count, receipt, disburse and maintain records related to the collection and disbursement of large amounts of cash.<br/><br/>Total, record and account for tuition and other fees collected with cash registers and data terminals.<br/><br/>Prepare, process, verify and review financial documents related to the assigned function, detect and correct errors and data discrepancies.<br/><br/>Open, maintain, balance, adjust, reconcile and close assigned accounts as required.<br/><br/>Reconcile bank statements, balance cash, order currency and prepare cash for bank deposit.<br/><br/>Review financial documents for completeness, accuracy and compliance with established procedures.<br/><br/>Prepare and maintain records, files, lists and reports related to the assignment.<br/><br/>Operate a personal computer or computer terminal to enter and update information generate records and reports; operate office equipment including typewriter, calculator, copier and cash register.<br/><br/>Compute and send delinquency notices; collect for insufficient (NSF) checks and prepare routine correspondence related to assigned function.<br/><br/>Prepare budget projections and annual recommendations regarding budget requirements; perform budget and administrative support duties in an assigned instructional division.<br/><br/>Perform related duties as assigned.<br/><br/><strong>Job Qualifications<br/><br/></strong>Education and Experience:<br/><br/>Any combination equivalent to: graduation from high school and two years of cash record-keeping, clerical accounting or budget maintenance experience.<br/><br/><strong>Other Qualifications<br/><br/></strong>Knowledge/Areas of Expertise:<br/><br/>Methods, practices and terminology used in financial record-keeping and simple bookkeeping procedures.<br/><br/>Budget preparation, maintenance and control.<br/><br/>Methods and techniques of recording, receiving and disbursing cash.<br/><br/>Operation of a personal computer or computer terminal.<br/><br/>Modern Office practices, procedures and equipment.<br/><br/>Operation of a cash register.<br/><br/><strong>Abilities/Skills<br/><br/></strong>Perform responsible clerical accounting or budget-related duties in an assigned functional area.<br/><br/>Prepare, maintain, adjust and control an instructional division budget.<br/><br/>Receive, count, receipt and maintain records related to large amounts of cash collected or disbursed.<br/><br/>Make change quickly and accurately.<br/><br/>Operate a computer terminal and other office equipment according to assigned area.<br/><br/>Add, subtract, multiply and divide quickly and accurately.<br/><br/>Learn the bookkeeping procedures and clerical operations in an assigned area.<br/><br/>Type at an acceptable rate of speed.<br/><br/>Understand and follow oral and written directions.<br/><br/>Establish and maintain cooperative and effective relationships with others.<br/><br/>Interact professionally and politely with the general public.<br/><br/><strong>Licenses And Other Requirements<br/><br/></strong>May require a valid California driver's license.<br/><br/><strong>Working Conditions<br/><br/></strong>Typical office setting.<br/><br/>Dexterity of hands and fingers to operate a keyboard.<br/><br/>Exchange information in person and on the telephone.<br/><br/>Sit for extended periods of time.<br/><br/>Lift and carry up to 25 lbs.<br/><br/>Move from one work area to another as needed.<br/><br/>High volume telephone usage.<br/><br/>Extensive computer work.<br/><br/>CLOSING DATE: Friday, August 30, 2024 at 3:00 p.m.<br/><br/>Starting salary is $4,955 per month.<br/><br/>Generally, new employees start at the first step on the salary schedule. Advanced salary placement may be considered on a case-by-case basis. Salary increases are granted on the first day of the month following each year of service, until Step F is reached ($6,338 per month). Employees contribute 8% of their earnings toward the Public Employees Retirement System (PERS).<br/><br/>Employees contribute 8% of their earnings toward the Public Employees Retirement System (PERS).<br/><br/>CONDITIONS OF EMPLOYMENT<br/><br/>This is a full-time, twelve-month position subject to a probationary period. The standard work week is 40 hours of scheduled duty per week of not more than five consecutive work days. Schedule may vary to include hours outside of the normal work schedule and weekends depending on operational need.<br/><br/>Offer and acceptance of employment is subject to verification of all information provided on the employment application, credential(s), and transcripts. Candidates selected for employment must agree to be fingerprinted, submit Certificate of Completion of the Tuberculosis Risk Assessment and/or Examination, provide proof of eligibility for employment in the United States, and present a valid Social Security card upon hire.<br/><br/>ADA ACCOMMODATIONS<br/><br/>Applicants with disabilities requiring special accommodations must contact the ADA Compliance Officer at least five (5) working days prior to the final filing date: ADA Job Applicant Accommodation Request (maxient.com)<br/><br/>BENEFIT HIGHLIGHTS<br/><br/>Health, Life, Dental and Vision Insurance<br/><br/>The College provides a diversified insured benefit program for all full-time employees, including medical, dental, vision and life insurance. Dependent medical, dental, and vision insurance is available, toward which both the College and the employee contribute.<br/><br/>Sick Leave and Disability<br/><br/>Paid sick leave is granted equal to one day for each month of service. Sick leave days may be accumulated indefinitely.<br/><br/>Retirement<br/><br/>Full-time employees contribute a percentage of their regular salary to the Public Employees Retirement System (PERS) and Social Security. Previous employment performed in a different public retirement system may allow eligibility to continue in the same retirement system.<br/><br/>Summer Work Hours<br/><br/>During the summer, employees work eight 32-hour work weeks with full pay.<br/><br/>TO APPLY<br/><br/>An applicant must submit the following by the closing date:<br/><br/>Online application: http://www.elcamino.edu/jobs<br/><br/><strong>Cover Letter Describing How Applicant Meets The Qualifications.<br/><br/></strong>Resume including educational background, professional experience, and related personal development and accomplishments.<br/><br/>Pertinent transcripts (PDF format only) as stated in the required qualifications. (Unofficial computer-generated academic records/transcripts must include the name of the institution and degrees awarded to be acceptable.) Multiple page transcripts must be loaded as ONE PDF document.<br/><br/>Foreign Transcripts: Transcripts issued outside the United States of America require a course-by-course analysis with an equivalency statement from a certified transcript evaluation service verifying the degree equivalency to that of an accredited institution within the USA. For information on transcript evaluation services, please visit: http://www.ctc.ca.gov/credentials/leaflets/cl635.pdf.<br/><br/>IMPORTANT NOTE: Documents submitted or uploaded for a previous position cannot be reused for other positions. You must submit the required documents for each position you apply for by the closing date. Failure to do so will result in an incomplete application. Applications with an incomplete status will not receive consideration. You may check the status of your application online.<br/><br/>If you need assistance you may call 310-660-3593 Ext. 3807 between the hours of 8:00 a.m. and 4:00 p.m., Monday through Friday or by email at hr@elcamino.edu.<br/><br/>Due to the large volume of calls received on closing dates, we highly recommend that you do not wait until the last day to apply so that we may assist you with questions or technical matters that may arise. Give yourself sufficient time to complete the profile, which may take 45 minutes or more. Positions close promptly at 3:00 p.m. PST (pacific standard time).<br/><br/>JEANNE CLERY ACT COMPLIANT<br/><br/>In accordance with the Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics Act, El Camino College has published an Annual Security Report, and all required statistical data. These publications include Clery crime statistics for the previous disability three years relevant to El Camino College classes and activities, in addition to institutional policies concerning campus safety and security. The information is also available in printed form in the lobby of the Police Department and in select locations on campus. Upon request, the Campus Police Department can provide or mail out copies of this publication. Contact them at 310-660-3100.<br/><br/>EL CAMINO COLLEGE IS AN EQUAL OPPORTUNITY EMPLOYER<br/><br/>The El Camino Community College District is committed to providing an educational and employment environment in which no person is subjected to discrimination on the basis of actual or perceived race, color, ancestry, national origin, religion, creed, age (over 40), (mental or physical), sex, gender (including pregnancy and childbirth), sexual orientation, gender identity, gender expression, medical condition, genetic information, marital status, military and veteran status, or retaliation; or on any other basis as required by state and federal law. Abilities/Skills: Perform responsible clerical accounting or budget-related duties in an assigned functional area. Prepare, maintain, adjust and control an instructional division budget. Receive, count, receipt and maintain records related to large amounts of cash collected or disbursed. Make change quickly and accurately. Operate a computer terminal and other office equipment according to assigned area. Add, subtract, multiply and divide quickly and accurately. Learn the bookkeeping procedures and clerical operations in an assigned area. Type at an acceptable rate of speed. Understand and follow oral and written directions. Establish and maintain cooperative and effective relationships with others. Interact professionally and politely with the general public. Licenses or Other Requirements: May require a valid California driver’s license.", "responsibilities": "Perform responsible clerical accounting duties in accounts payable, financial aid, accounts receivable or other assigned accounting area.\n\nAssist in the preparation, maintenance and control of an instructional division budget; determine fund availability in various accounts and recommend adjustments as needed.\n\nReceive, count, receipt, disburse and maintain records related to the collection and disbursement of large amounts of cash.\n\nTotal, record and account for tuition and other fees collected with cash registers and data terminals.\n\nPrepare, process, verify and review financial documents related to the assigned function, detect and correct errors and data discrepancies.\n\nOpen, maintain, balance, adjust, reconcile and close assigned accounts as required.\n\nReconcile bank statements, balance cash, order currency and prepare cash for bank deposit.\n\nReview financial documents for completeness, accuracy and compliance with established procedures.\n\nPrepare and maintain records, files, lists and reports related to the assignment.\n\nOperate a personal computer or computer terminal to enter and update information generate records and reports; operate office equipment including typewriter, calculator, copier and cash register.\n\nCompute and send delinquency notices; collect for insufficient (NSF) checks and prepare routine correspondence related to assigned function.\n\nPrepare budget projections and annual recommendations regarding budget requirements; perform budget and administrative support duties in an assigned instructional division.\n\nPerform related duties as assigned.", "qualifications": {"required": "Any combination equivalent to: graduation from high school and two years of cash record-keeping, clerical accounting or budget maintenance experience.", "preferred": ""}, "skills": ["Financial Record-Keeping", "Bookkeeping", "Budget Preparation", "Budget Maintenance", "Budget Control", "Cash Handling", "Computer Operation", "Office Practices", "Office Procedures", "Office Equipment", "Cash Register Operation", "Data Entry", "Report Generation", "Typing", "Communication", "Interpersonal Skills", "Customer Service"], "postedDate": "1 week ago", "applicationDeadline": "Friday, August 30, 2024 at 3:00 p.m.", "benefits": "Health, Life, Dental and Vision Insurance\n\nThe College provides a diversified insured benefit program for all full-time employees, including medical, dental, vision and life insurance. Dependent medical, dental, and vision insurance is available, toward which both the College and the employee contribute.\n\nSick Leave and Disability\n\nPaid sick leave is granted equal to one day for each month of service. Sick leave days may be accumulated indefinitely.\n\nRetirement\n\nFull-time employees contribute a percentage of their regular salary to the Public Employees Retirement System (PERS) and Social Security. Previous employment performed in a different public retirement system may allow eligibility to continue in the same retirement system.\n\nSummer Work Hours\n\nDuring the summer, employees work eight 32-hour work weeks with full pay.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003184213"}