{"jobTitle": "Business Development Manager", "company": {"name": "Jobot", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$120,000.00 - $160,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Manufacturing, Machinery Manufacturing, and Computers and Electronics Manufacturing", "description": "Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!<br/><br/>Job details<br/><br/><strong>World Leading Space Robotics Start Up Company - Great Pay, Insurance, 401k + match, PTO!<br/><br/></strong>This Jobot Job is hosted by Jacob Grijalva<br/><br/>Are you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.<br/><br/>Salary $120,000 - $160,000 per year<br/><br/><strong>A Bit About Us<br/><br/></strong>World Leading Space Robotics Start Up Company !<br/><br/>Looking to hire a Business Development Manager with 3+ years experience in BD or sales, 1 year working directly for a Pre Series B Startup Company!<br/><br/><strong><br/><br/><strong>Why join us?<br/><br/><br/></strong></strong>Medical insurance<br/><br/>Vision insurance<br/><br/>Dental insurance<br/><br/>401(k)<br/><br/>Disability insurance<br/><br/><strong>Job Details<br/><br/></strong>Job Details<br/><br/>We are seeking a dynamic and experienced Business Development Manager to join our team in the Manufacturing industry. This is a permanent position that will play a pivotal role in our organization's growth and expansion. The successful candidate will be responsible for driving new business opportunities, developing and implementing strategic plans, and fostering relationships with key stakeholders in the space and defense industry. This role is ideal for a strategic thinker with a proven track record in product sales and business development in a pre-series start-up environment.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Develop and implement strategic business development plans to drive growth and increase market share in the space and defense industry.</li><li> Establish and maintain relationships with key stakeholders, including government agencies, clients, and potential partners.</li><li> Identify new business opportunities and conduct market research to understand industry trends and competitive landscape.</li><li> Lead and manage the sales process from prospecting to closing deals, ensuring customer satisfaction and repeat business.</li><li> Collaborate with internal teams to develop and improve product offerings based on customer feedback and market trends.</li><li> Prepare and present business proposals and presentations to potential clients and partners.</li><li> Monitor and report on sales performance and business development activities.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Bachelor's degree in Business Administration, Science, Engineering.</li><li> Minimum of 5 years of experience in Business Development or a related role preferable with a Pre-Series B Startup</li><li> Prior experience working with government agencies and in the space and defense industry.</li><li> Proven track record in product sales and managing business development activities in a pre-series start-up environment.</li><li> Exceptional communication, negotiation, and relationship-building skills.</li><li> Strong strategic thinking and analytical skills, with the ability to identify business opportunities and make informed decisions.</li><li> Self-motivated and results-driven, with the ability to work independently and as part of a team.</li><li> Proficiency in using CRM software and other sales tools.</li><li> Willingness to travel as required for client meetings and industry events.<br/><br/></li></ul>Join our team and contribute to our vision of becoming a global leader in the manufacturing industry. We offer a competitive salary, comprehensive benefits, and a challenging yet rewarding work environment. If you have the skills and experience we're looking for, we'd love to hear from you.<br/><br/>Interested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.<br/><br/><strong>Want to learn more about this role and Jobot?<br/><br/></strong>Click our Jobot logo and follow our LinkedIn page!<br/><br/>", "responsibilities": "Develop and implement strategic business development plans to drive growth and increase market share in the space and defense industry. Establish and maintain relationships with key stakeholders, including government agencies, clients, and potential partners. Identify new business opportunities and conduct market research to understand industry trends and competitive landscape. Lead and manage the sales process from prospecting to closing deals, ensuring customer satisfaction and repeat business. Collaborate with internal teams to develop and improve product offerings based on customer feedback and market trends. Prepare and present business proposals and presentations to potential clients and partners. Monitor and report on sales performance and business development activities.", "qualifications": {"required": "Bachelor's degree in Business Administration, Science, Engineering. Minimum of 5 years of experience in Business Development or a related role preferable with a Pre-Series B Startup. Prior experience working with government agencies and in the space and defense industry. Proven track record in product sales and managing business development activities in a pre-series start-up environment. Exceptional communication, negotiation, and relationship-building skills. Strong strategic thinking and analytical skills, with the ability to identify business opportunities and make informed decisions. Self-motivated and results-driven, with the ability to work independently and as part of a team. Proficiency in using CRM software and other sales tools. Willingness to travel as required for client meetings and industry events."}, "skills": [], "postedDate": "3 days ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Disability insurance", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4003293829"}