{"jobTitle": "Investigation QA, Flex I&O", "company": {"name": "Amazon", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "35,000.00/year - 71,400.00/year", "currency": "USD"}, "jobFunction": "Project Management, Management, and Product Management", "industry": "Software Development", "description": "Amazon Flex Investigation and Offboarding (Flex I&O) is seeking a candidate to audit the investigation cases received. This pivotal role involves meticulously auditing cases for the Flex I&O team, ensuring compliance is not only achieved but consistently maintained at the highest standards. The ideal candidate will embody a relentless commitment to raising the quality and performance bar, demonstrating an appropriate sense of urgency and adaptability in response to evolving business needs.<br/><br/>Key job responsibilities<br/><br/><ul><li> Conduct thorough audits of Flex I&O cases to ensure stringent compliance and uphold high standards.</li><li> Identify both positive and negative trends through expert analysis, proposing solutions and improvements to enhance team performance and quality.</li><li> Maintain an unwavering focus on detail and exhibit self-motivation in all tasks.</li><li> Adapt swiftly to changing business dynamics while maintaining high-quality output.</li><li> Collaborate effectively with team members, leveraging strong interpersonal skills to drive continuous improvement.<br/><br/></li></ul><strong>Required Skills And Attributes<br/><br/></strong><ul><li> A strong sense of urgency and adaptability to navigate changing business needs.</li><li> Exceptional attention to detail, ensuring accuracy and compliance in all audits.</li><li> Action-oriented with a flexible problem-solving mindset.</li><li> Excellent interpersonal skills, fostering a collaborative team environment.<br/><br/></li></ul>Join us as a Quality Analyst and play a crucial role in elevating the standards of our Flex Investigation and Offboarding team, ensuring we continually exceed expectations and achieve operational excellence.<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li>Flex I &amp; O specialist or 6 months experience as a Quality Analyst</li><li>6 months experience in GSOC/EXR/LMIR as a Quality Analyst</li><li>Must be in Good Standing.</li><li>Must be in the United States<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong>Bilingual (Hindi, Spanish, Japanese)<br/><br/>Familiarity with process improvement methodologies and data analysis<br/><br/>Possesses strong interpersonal skills, strong self-motivation and enthusiasm<br/><br/>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Pursuant to the Los Angeles Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $35,000/year in our lowest geographic market up to $71,400/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC - A57<br/><br/>Job ID: A2734540", "responsibilities": "Conduct thorough audits of Flex I&O cases to ensure stringent compliance and uphold high standards. Identify both positive and negative trends through expert analysis, proposing solutions and improvements to enhance team performance and quality. Maintain an unwavering focus on detail and exhibit self-motivation in all tasks. Adapt swiftly to changing business dynamics while maintaining high-quality output. Collaborate effectively with team members, leveraging strong interpersonal skills to drive continuous improvement.", "qualifications": {"required": "Flex I &amp; O specialist or 6 months experience as a Quality Analyst\n6 months experience in GSOC/EXR/LMIR as a Quality Analyst\nMust be in Good Standing.\nMust be in the United States", "preferred": "Bilingual (Hindi, Spanish, Japanese)\nFamiliarity with process improvement methodologies and data analysis\nPossesses strong interpersonal skills, strong self-motivation and enthusiasm"}, "skills": ["Quality Assurance", "Compliance", "Auditing", "Analysis", "Problem Solving", "Teamwork", "Communication", "Adaptability", "Detail Oriented", "Self-Motivation"], "postedDate": "6 days ago", "benefits": "Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003194988"}