{"jobTitle": "Warehouse Manager (Mandarin)", "company": {"name": "IntelliPro", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "<strong>Job Title - Inventory Control Specialist (ICQA)<br/><br/></strong><strong>Location - Los Angeles, CA <br/><br/></strong><strong>Full time<br/><br/></strong><strong>Salary - $85k - $98k benefits + Bonus<br/><br/>Bilingual - Fluent in English and Mandarin - \"Proficiency in Mandarin is preferred as the successful candidate will be required to communicate with business partners in China.\"<br/><br/></strong><strong>Job description: <br/><br/></strong><strong>Key Skills : Quality management within the warehouse setting, training, inventory variance analysis, internal quality improvement project, etc<br/><br/></strong><ul><li>Successful candidates for the role of Inventory Control QA associate possess a combination of strong analytical skills, attention to detail, and excellent problem-solving abilities.</li><li>They have a keen eye for spotting discrepancies and are adept at conducting thorough investigations to identify the root causes.</li><li>Proficiency in utilizing inventory management systems and software is essential, as these tools play a crucial role in recording and tracking inventory data accurately.</li><li>Effective communication skills are paramount in this role, as Inventory Control QA associates need to collaborate with cross-functional teams to resolve issues.</li><li>Must be able to clearly communicate their findings, propose solutions, and work together with others to implement necessary changes.</li><li>Ability to work under pressure and meet tight deadlines is also important, as inventory management requires swift action to prevent disruptions in the supply chain.<br/><br/></li></ul>About Us:<br/><br/>Founded in 2009, IntelliPro stands as a global leader in talent acquisition and HR solutions. Our commitment to delivering unparalleled service to clients, fostering employee growth, and building enduring partnerships sets us apart. With a dynamic presence in the USA, China, Canada, Singapore, Philippines, UK, India, Netherlands, and Germany, we continue to lead the way in global talent solutions.<br/><br/>IntelliPro, a global leader in connecting individuals with rewarding employment opportunities, is dedicated to understanding your career aspirations. As an Equal Opportunity Employer, IntelliPro values diversity and does not discriminate based on race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, disability, or any other legally protected group status. Moreover, our Inclusivity Commitment emphasizes embracing candidates of all abilities and ensures that our hiring and interview processes accommodate the needs of all applicants. Learn more about our commitment to diversity and inclusivity at https://intelliprogroup.com/.<br/><br/>Compensation: The pay offered to a successful candidate will be determined by various factors, including education, work experience, location, job responsibilities, certifications, and more. Additionally, IntelliPro provides a comprehensive benefits package, all subject to eligibility", "postedDate": "4 days ago", "skills": ["Quality management", "Inventory variance analysis", "Internal quality improvement project", "Inventory management systems", "Software", "Communication", "Problem-solving"], "url": "https://www.linkedin.com/jobs/view/4003023033"}