{"jobTitle": "Human Resources Business Partner-Nursing", "company": {"name": "UCLA Health", "location": "Los Angeles, CA", "industry": "Hospitals and Health Care"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "86,900.00/yr - 197,300.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Hospitals and Health Care", "description": "<strong>Description<br/><br/></strong>Reporting to the Senior Human Resources Business Partner (SBP), the Human Resources Business Partner (BP) works closely with leaders and managers to advance HR strategy, programs and initiatives. In this role, you will support and coach leaders in developing high performing teams, monitoring critical people analytics and supporting a highly engaged workforce. You will collaborate with the Centers of Excellence (CoE) to leverage central HR services to execute programs and initiatives for their business units.<br/><br/>Some of the main duties of this role are as follows:<br/><br/><ul><li>Support business strategy and results within their business unit(s) through executing talent management and workforce strategies</li><li>Maintain a deep understanding of business operations and strategy in order to manage and monitor effective HR strategies and practice within the business unit </li><li>Gather metrics and uses data analytics to understand and identify business issues and drive recommendations</li><li>Partner with leaders and managers on people practices to advance talent and enhance team performance</li><li>Monitor organization performance and identify organizational capabilities required to execute the business strategy</li><li>Coach business leaders in the delivery of results through talent and workforce management</li><li>Work with Business or Function leadership to translate business needs into HR requirements (programs, people initiatives, succession planning, workforce planning)<br/><br/></li></ul>Salary offers are determined based on various factors including, but not limited to, qualifications, experience, and equity. The full salary range for this position is $86,900 to $197,300 annually. The budgeted salary range that the University reasonably expects to pay for this position is approximately $110,000-$135,000 annually.", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4003740911"}