{"jobTitle": "Warehouse Supervisor", "company": {"name": "Jobot", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$75,000.00 - $85,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Manufacturing, Machinery Manufacturing, and Computers and Electronics Manufacturing", "description": "Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!<br/><br/>Job details<br/><br/><strong>Shipping Supervisor - Leader in Food and Beverage Industry<br/><br/></strong>This Jobot Job is hosted by Jamal Elkhateib<br/><br/>Are you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.<br/><br/>Salary $75,000 - $85,000 per year<br/><br/><strong>A Bit About Us<br/><br/></strong>We are a leading food manufacturing company with a long history of producing high-quality food products for over 75 years. Our commitment to quality and innovation has allowed us to maintain a strong reputation in the industry as being one of the largest food processors on the west coast. We offer a wide range of food products, all made from the freshest ingredients and processed using the latest technology.<br/><br/>As a company that values its employees, we provide a supportive work environment that encourages personal and professional growth. We offer competitive compensation packages, health benefits, and opportunities for career advancement.<br/><br/><strong><br/><br/><strong>Why join us?<br/><br/><br/></strong></strong>401(k) matching<br/><br/>Dental insurance<br/><br/>Employee assistance program<br/><br/>Employee discount<br/><br/>Flexible spending account<br/><br/>Health insurance<br/><br/>Health savings account<br/><br/>Life insurance<br/><br/>Paid time off<br/><br/>Vision insurance<br/><br/>Annual/Performance Bonuses<br/><br/><strong>Job Details<br/><br/></strong>Job Details<br/><br/>We are currently seeking a highly motivated, detail-oriented Shipping Supervisor to join our dynamic finance team. This is a permanent, full-time position that offers a unique opportunity to leverage your manufacturing, logistics, or freight experience in a fast-paced, high-growth environment. The Shipping Supervisor will play a crucial role in overseeing our shipping operations, ensuring all processes are efficient, cost-effective, and in compliance with company policies and regulations.<br/><br/><strong>Responsibilities<br/><br/></strong>As a Shipping Supervisor, you will be entrusted with the following responsibilities<br/><br/><ul><li> Oversee and manage all aspects of shipping activities, ensuring compliance with domestic and international shipping regulations.</li><li> Coordinate with various departments to ensure timely and accurate delivery of goods.</li><li> Implement operational policies and procedures to enhance efficiency and productivity within the shipping department.</li><li> Monitor shipping costs, timelines, and productivity, identifying opportunities for improvement.</li><li> Resolve any shipping-related issues or discrepancies in a timely and effective manner.</li><li> Maintain accurate records of all shipping activities, including tracking information, costs, and delivery timelines.</li><li> Train, supervise, and evaluate shipping staff, fostering a collaborative and high-performance work environment.</li><li> Stay updated on the latest industry trends, regulations, and best practices related to shipping and logistics.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>The ideal candidate for the Shipping Supervisor position will possess the following qualifications<br/><br/><ul><li> A minimum of 5 years of experience in manufacturing, logistics, or freight, preferably within the food and beverage industry</li><li> Proven experience in a supervisory or managerial role, demonstrating strong leadership and team management skills.</li><li> Comprehensive knowledge of domestic and international shipping regulations and procedures.</li><li> Excellent problem-solving skills, with the ability to resolve shipping-related issues effectively.</li><li> Strong organizational and multitasking skills, with the ability to manage multiple shipping activities simultaneously.</li><li> Proficiency in using shipping software and other related IT systems.</li><li> Excellent communication skills, both written and verbal, with the ability to effectively communicate with team members, other departments, and external parties.</li><li> A Bachelor’s degree in Business Administration, Logistics, or a related field is preferred.<br/><br/></li></ul>This exciting role offers the opportunity to make a significant impact on our company's efficiency and productivity. If you are a driven professional with a passion for logistics and a knack for leadership, we would love to hear from you. Apply today to join our dynamic team!<br/><br/>Interested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.<br/><br/><strong>Want to learn more about this role and Jobot?<br/><br/></strong>Click our Jobot logo and follow our LinkedIn page!<br/><br/>", "responsibilities": "As a Shipping Supervisor, you will be entrusted with the following responsibilities<br/><br/><ul><li> Oversee and manage all aspects of shipping activities, ensuring compliance with domestic and international shipping regulations.</li><li> Coordinate with various departments to ensure timely and accurate delivery of goods.</li><li> Implement operational policies and procedures to enhance efficiency and productivity within the shipping department.</li><li> Monitor shipping costs, timelines, and productivity, identifying opportunities for improvement.</li><li> Resolve any shipping-related issues or discrepancies in a timely and effective manner.</li><li> Maintain accurate records of all shipping activities, including tracking information, costs, and delivery timelines.</li><li> Train, supervise, and evaluate shipping staff, fostering a collaborative and high-performance work environment.</li><li> Stay updated on the latest industry trends, regulations, and best practices related to shipping and logistics.<br/><br/></li></ul>", "qualifications": {"required": "A minimum of 5 years of experience in manufacturing, logistics, or freight, preferably within the food and beverage industry\nProven experience in a supervisory or managerial role, demonstrating strong leadership and team management skills.\nComprehensive knowledge of domestic and international shipping regulations and procedures.\nExcellent problem-solving skills, with the ability to resolve shipping-related issues effectively.\nStrong organizational and multitasking skills, with the ability to manage multiple shipping activities simultaneously.\nProficiency in using shipping software and other related IT systems.\nExcellent communication skills, both written and verbal, with the ability to effectively communicate with team members, other departments, and external parties.", "preferred": "A Bachelor’s degree in Business Administration, Logistics, or a related field is preferred."}, "skills": [], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "401(k) matching\nDental insurance\nEmployee assistance program\nEmployee discount\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nVision insurance\nAnnual/Performance Bonuses", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003297822"}