{"jobTitle": "Virtual Administrative Assistant - PT Flex Schedule", "company": {"name": "RemoteWorker US", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/>We are seeking a part-time detail-oriented individual to work as part of a team for two executive level principals and assist in the management, maintenance and updating of their contact databases. The ideal candidate will possess a keen eye for detail, strong organizational skills, and the ability to handle confidential information discreetly.<br/><br/>Key Responsibilities:<br/><br/><ul><li>Maintain and update contact information within Salesforce for two executives.</li><li>Add links to LinkedIn profiles and upload contact photos in Salesforce.</li><li>Tag and categorize contacts into different groups for targeted communications.</li><li>Track and update attendance for various events, including social, philanthropic, and political gatherings.</li><li>Assist in generating and refining invite lists for events based on contact interactions and familiarity with the database.</li><li>Ensure the accuracy and completeness of contact data.</li><li>Work closely with executive assistants to verify and input new contact details.</li><li>Provide regular reports on the status and integrity of contact data.</li><li>Identify and rectify data inconsistencies and errors.</li><li>Collaborate with IT for Salesforce troubleshooting and updates.<br/><br/></li></ul>Required Skills and Qualifications:<br/><br/><ul><li>Salesforce certification is highly desirable.</li><li>College degree required.</li><li>1-2 years of experience in data management or administrative support, preferably with Salesforce.</li><li>Proficiency in Salesforce CRM, MS Office, particularly Excel.</li><li>Excellent attention to detail, organizational, and time-management skills.</li><li>Strong communication and interpersonal abilities.</li><li>Ability to responsibly handle confidential information.</li><li>Adaptability to work in a dynamic environment.<br/><br/></li></ul>Preferred Skills:<br/><br/><ul><li>Experience with Salesforce CRM and understanding its features and capabilities.</li><li>Familiarity with data management principles and database systems.</li><li>Previous experience in an administrative role supporting executive staff.</li></ul>", "postedDate": "3 days ago", "skills": ["Salesforce", "Excel", "Data Management", "Administrative Support", "Communication", "Interpersonal Skills", "Time Management", "Confidentiality"], "url": "https://www.linkedin.com/jobs/view/4003245877"}