{"jobTitle": "Peer Navigator", "company": {"name": "UCLA Health", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "30.53 - 40.30", "currency": "USD"}, "jobFunction": "Other, Information Technology, and Management", "industry": "Hospitals and Health Care", "description": "Peer Linkage and Re-engagement of Women of Color with HIV is an intervention to support HIV-positive women of color to become peer leaders and support other HIV-positive women of color to engage in and maintain HIV care. Women of color living with HIV are recruited to be trained as peer leaders to conduct outreach to potential clients, assist clients in linking to or re-engaging in care, provide appointment reminders, and assist with transportation to appointments, accompany clients to appointments, and provide coaching and emotional support to enable clients to sustain engagement in care and navigate the health care system.<br/><br/>Peer Navigators are trained to develop a care plan with clients to help address unmet basic needs among clients through connections to housing, employment, food, and transportation services. Following enrollment, Peer Navigators work with clients to achieve the following intervention milestones within 6-12 months: 1) attend two medical care visits with a primary care provider, 2) complete one lab visit, 3) attend at least two visits with a case manager. The Peer Navigation program will work with clients to resolve any factors that may be preventing them from becoming engaged or retained in treatment and/or adhering to treatment. The Peer Navigator will also assist in developing a more robust framework of engagement and retention, including the utilization of data systems to identify out-of-care clients, and outreach materials and tools to engage new clients – or re-engage current clients – in care.<br/><br/><ul><li>This is a part-time, 18 month, limited appointment that may convert to career.<br/><br/></li></ul>Pay Range: $30.53 - $40.30 Hourly", "postedDate": "1 month ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003752140"}