{"jobTitle": "Growth Product Manager - Remote", "company": {"name": "RemoteWorker US", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Product Management and Marketing", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/>Numerade is on a mission to level the playing field in education. <strong>This is your opportunity to join a venture-backed startup early and build something remarkable at the intersection of education and technology.<br/><br/></strong><ul><li>Since launch in 2019, we have helped over 200 million students gain confidence in STEM subjects, from algebra to quantum mechanics and more.</li><li>We've built the world's largest STEM video library.</li><li>We've raised over $26M in funding through series A (check out the article here)</li><li>Our goal is to become the #1 ed-tech learning platform!<br/><br/></li></ul>We're excited to add a Growth Product Manager to our team to help drive revenue for the company. You will partner very closely with our Head of Product, founders, CEO, exec team to hit very aggressive revenue goals.<br/><br/>If you want to have an outsized impact on the trajectory of a company to scale the benefits of tutoring to 2B students globally, work in a lightning fast paced environment, where growth is only limited by your own self-imposed ceilings, this might be the role for you.<br/><br/>You'll own the overall funnel optimization. This is an exciting role for someone looking to work in a collaborative, fast-paced environment and be a key player within a dynamic team focused on driving revenue.<br/><br/><li>Key Responsibilities:</li><li>Define and execute the company's growth strategy.</li><li>Lead cross-functional teams to implement and manage growth initiatives.</li><li>Optimize the revenue funnel, applying tactics for customer acquisition, retention, and upsell.</li><li>Use data-driven decision-making to identify and execute on opportunities for product improvement.</li><li>Required Skills:</li><ul><li>Strong analytical skills, with a focus on key metrics and data analysis to drive decisions.</li><li>High creativity and problem-solving ability to identify growth opportunities and conduct tests.</li><li>Experience with marketing, product development, and enhancing user experience to manage and direct the product's market fit.</li><li>Ability to work effectively with various teams, including engineering, marketing, and sales, fostering collaboration and driving toward common goals.</li><li>Qualifications:</li><ul><li>A minimum of 3 years of proven experience in growth product management for consumer subscription startups/companies. </li><li>Proficient in data analysis tools and methodologies.</li><li>Outstanding communication skills, capable of aligning various stakeholders with the growth objectives.</li><li>An entrepreneurial outlook; extremely comfortable in a \"startup\" environment. </li><li>Willingness to get your hands dirty so you can learn the intricacies of what works / what does not. <br/></li></ul></ul>This role requires a candidate who can balance strategic oversight with practical execution skills, often needing to experiment quickly and iterate on strategies to discover what most effectively drives product growth. The position also demands significant teamwork and cross-functional cooperation to align product features with user needs and business objectives effectively.<br/><br/><strong>Articles and recognition:<br/><br/></strong>We were selected as one of the best 150 Edtech companies in the world by ASU &amp; GSV:<br/><br/>Check out our blog to learn more about us!<br/><br/><strong>Be authentic. Come as you are:</strong> Numerade is an equal opportunity workplace and an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please let us know.<br/><br/>Numerade is a remote-first company.", "postedDate": "1 week ago", "skills": ["Data Analysis", "Product Management", "Marketing", "Product Development", "User Experience", "Data-Driven Decision Making", "Growth Strategy", "Customer Acquisition", "Retention", "Upsell", "Cross-Functional Collaboration", "Communication", "Entrepreneurial", "Startup Environment"], "url": "https://www.linkedin.com/jobs/view/4003247746"}