{"jobTitle": "Influencer Marketing Intern LA", "company": {"name": "Cider", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Internship", "employmentType": "Internship", "experienceLevel": "Internship", "jobFunction": "Marketing", "industry": "Retail Apparel and Fashion", "description": "Responsibilities:\n\nWeekly Order Placing + PR Box Send-Outs: Place weekly seeding orders and manage monthly PR box send-outs.\nDaily Macro Influencer Outreach: Conduct daily outreach to macro influencers for gifting.\nTrack Influencer Activities: Monitor and log influencer posts and key metrics; collaborate with teams to report on sales and impressions data from influencer posts\nUpdate Seeding Sheets: Perform weekly tracking from influencer posts; highlight content suitable for paid ads and ensure accuracy.\nManage Influencer Lists: Add and assess new influencers for potential collaborations; monitor and adjust the performance of existing influencers.\nResearch Competitors & Trends: Research competitor activities and document successful strategies; track emerging trends in influencer marketing; support in developing community and influencer events in key markets.\nHandle Influencer Gifting: Schedule and manage personalized gifts for influencers.\nEngage VIP Influencers: Research and add VIP influencers to the global list; develop engagement strategies for these influencers.\nEvent Preparation: Assist with planning and logistics for community and influencer events in LA.\n\nRequirements:\nPrevious internship experience in influencer marketing, event planning, or a related field.\nStrong communication and organizational skills.\nCreative thinker with the ability to generate innovative ideas informed by competitive analysis.\nExceptional attention to detail.\nProven event planning abilities.\nCapable of working independently and collaboratively in a fast-paced environment.\nFamiliarity with the Gen Z influencer landscape is a plus!\nProficiency in social media platforms\nAbility to manage multiple tasks and meet tight deadlines.\nAdaptability and willingness to learn new tools and platforms.\nStrong research skills to stay ahead of trending in the influencer and events space", "postedDate": "1 day ago", "skills": ["Influencer Marketing", "Event Planning", "Communication", "Organization", "Creative Thinking", "Competitive Analysis", "Attention to Detail", "Event Planning", "Social Media", "Research"], "url": "https://www.linkedin.com/jobs/view/4003609970"}