{"jobTitle": "Agency Event Producer", "company": {"name": "CyberCoders", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000.00/yr - $90,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing", "industry": "Entertainment Providers", "description": "<strong>Title:</strong> Event Producer<br/><br/><strong>Location:</strong> North Hollywood (ONSITE) Monday - Thursday with WFH on Fridays<br/><br/><strong>Salary:</strong> Up to $90k + bonus, benefits, etc.<br/><br/><strong>Position Purpose<br/><br/></strong>As an Event Producer, you will be key in delivering our promise of providing truly immersive and memorable event experience whether virtual or in person live events.<br/><br/>You will be responsible for managing all aspects of the event production including logistics, scheduling, budgeting, and overseeing the management of each event assigned to you.<br/><br/>You need to understand the current trends in events and stay on top of those to help keep our offerings current and exciting to clients.<br/><br/>You're a planner, organized, levelheaded leader with expertise in the production of B2B and B2C events, exhibits, and experiences and bringing them to life.<br/><br/>You are a proactive thinker and doer and help lead and work with various individuals and teams.<br/><br/>Most importantly, you are a hands-on team player who can also work independently. You are an integral part of a team that is responsible for the success of our brand and company.<br/><br/><strong>Traits<br/><br/></strong><ul><li>Organized and structured.</li><li>Detail oriented.</li><li>Sense of high standards.</li><li>Proactive, enthusiastic, and energetic.</li><li>Team player.</li><li>Creative and innovative.</li><li>Hardworking and dedicated.</li><li>Flexible attitude when dealing with all levels of workforce.<br/><br/></li></ul><strong>Primary Job Duties<br/><br/></strong><ul><li>Help manage the research, creation, and format of proposals.</li><li>Must work quickly, efficiently, and thoroughly to ensure that all production deadlines are met.</li><li>Collaborate with creative team to develop event design. </li><li>Participate in site inspections.</li><li>Be available to client and answer any questions they may have.</li><li>Make travel plans and team hotel arrangements.</li><li>Act as Communications Lead with client and ensure the account owner and Director of Production are in the loop on project status.Research and negotiate vendor services and pricing. </li><li>Create and maintain budget and target P&amp;L</li><li>Work with graphics department to develop event venue layouts.</li><li>Use MONDAY project management software to build task lists and manage duties.</li><li>Create and maintain contact list, production schedule, accounting forms, and all other necessary job documents.</li><li>Request contracts / invoices from vendors. Complete and submit check requests for payment. </li><li>Obtain samples (linens, drawings, etc.) as needed and send to client for approval.</li><li>Prior to event, distribute production schedule, vendor memo, and any other required documents to all involved parties.</li><li>Make any shipping arrangements, if needed</li><li>Procure permits and approvals as needed for venue, city, state officials.</li><li>Manage event payables and receivables.</li><li>Work with design and AV teams to manage virtual events.<br/><br/></li></ul><strong>ON-SITE<br/><br/></strong><ul><li>Act as point of contact for client, venue, and vendors</li><li>Supervise load-in/load-out.</li><li>Distribute elements such as linens, florals, etc., and assist hands-on with set-up as needed.</li><li>Event Producer should be able to comfortably lift 50 pounds. </li><li>Manage production schedule and make sure that everything is done in a timely manner.</li><li>Troubleshoot any issues that arise.</li><li>Monitor event and assist client to ensure everything is ready for event start. </li><li>Ensure that all strike teams are in place and the venue is secured and clean before leaving the event or turning it over to another producer for tear down. <br/><br/></li></ul><strong>POST-PRODUCTION<br/><br/></strong><ul><li>Review all final invoices with accounting. Request any outstanding invoices from vendors and submit check requests.</li><li>Submit any additional costs or credits that need to go on client final billing.</li><li>Reconcile final job summary worksheet and close file.</li><li>Write \"Thank You\" letters in conjunction with Account Executive.<br/><br/></li></ul><strong>GENERAL<br/><br/></strong><ul><li>This position reports to the Director of Production</li><li>This is a full-time position. Days and hours of work are generally Monday through Friday, 9:00am to 5:00pm. Evening and weekend work may be required as job duties demand.</li><li>This position is salaried and exempt under the FLSA.</li><li>This job operates in a professional office environment, and uses standard office equipment such as computers, phones, printers and filing or storage cabinetsAssist with general office, administrative, sales and marketing support when needed.</li><li>Help maintain a positive work environment - it is a small office so all employees must work well together towards a common goal.</li><li>Must be comfortable in working in office and onsite at in-person events.<br/><br/></li></ul><strong>Knowledge &amp; Skills<br/><br/></strong><ul><li>Excel, Word, Outlook, PowerPoint, Illustrator, Photoshop </li><li>Must have exceptional organizational and customer service skills. </li><li>Must have exceptional written and verbal communication skills.</li><li>Ability to multi-task and streamline processes and procedures.</li><li>Self-starter, self-motivated and solutions oriented.<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Full benefits covered for by company</li><li>Work from home on Fridays</li><li>Flex time when working events</li><li>Yearly company retreat</li><li>Growth opportunity</li><li>Great company culture<br/><br/></li></ul><strong>Email Your Resume In Word To<br/><br/></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br/><br/>jen.dorand@cybercoders.com<br/><br/><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : JF12-1816192 -- in the email subject line for your application to be considered.***<br/><br/></li></ul>Jen Dorand - Sr. Executive Recruiter<br/><br/>Applicants must be authorized to work in the U.S.<br/><br/><strong>CyberCoders is proud to be an Equal Opportunity Employer<br/><br/></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity or expression, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, status as a crime victim, disability, protected veteran status, or any other characteristic protected by law. CyberCoders will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. CyberCoders is committed to working with and providing reasonable accommodation to individuals with physical and mental disabilities. If you need special assistance or an accommodation while seeking employment, please contact a member of our Human Resources team to make arrangements.<br/><br/>", "responsibilities": "As an Event Producer, you will be key in delivering our promise of providing truly immersive and memorable event experience whether virtual or in person live events.<br/><br/>You will be responsible for managing all aspects of the event production including logistics, scheduling, budgeting, and overseeing the management of each event assigned to you.<br/><br/>You need to understand the current trends in events and stay on top of those to help keep our offerings current and exciting to clients.<br/><br/>You're a planner, organized, levelheaded leader with expertise in the production of B2B and B2C events, exhibits, and experiences and bringing them to life.<br/><br/>You are a proactive thinker and doer and help lead and work with various individuals and teams.<br/><br/>Most importantly, you are a hands-on team player who can also work independently. You are an integral part of a team that is responsible for the success of our brand and company.", "qualifications": {"required": "Must have exceptional organizational and customer service skills. \nMust have exceptional written and verbal communication skills.\nAbility to multi-task and streamline processes and procedures.\nSelf-starter, self-motivated and solutions oriented.", "preferred": null}, "skills": ["Excel", "Word", "Outlook", "PowerPoint", "Illustrator", "Photoshop"], "postedDate": "2 days ago", "applicationDeadline": null, "benefits": "Full benefits covered for by company\nWork from home on Fridays\nFlex time when working events\nYearly company retreat\nGrowth opportunity\nGreat company culture", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003657115"}