{"jobTitle": "VP of Ecommerce", "company": {"name": "Mattel, Inc.", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Management and Manufacturing", "industry": "Manufacturing, Design Services, and Entertainment Providers", "description": "CREATIVITY IS OUR SUPERPOWER. It’s our heritage and it’s also our future. Because we don’t just make toys. We create innovative products and experiences that inspire fans, entertain audiences and develop children through play. Mattel is at its best when every member of our team feels respected, included, and heard—when everyone can show up as themselves and do their best work every day. We value and share an infinite range of ideas and voices that evolve and broaden our perspectives with a reach that extends into all our brands, partners, and suppliers.<br/><br/><strong>The Opportunity:<br/></strong>Mattel, Inc., the #1 toy manufacturer in the world, is seeking a Vice President of ECommerce to provide leadership and direction to our ecommerce strategy and execution in order to enhance our owned and operated online channels for our extensive portfolio of legendary brands. We’re looking for an expert who can bring an innovative approach to extending our brand affinity and advocacy with consumers through our websites and direct to consumer business. The VP, Ecommerce is critical to the long-term strategy of Mattel. Bringing play to life through these channels and building direct relationships with our fans is an inherent part of our business and our purpose of empowering generations through play.<br/><br/>The VP will be accountable for digital marketing, merchandising, data and analytics, user experience, and site operations for Mattel Creations, Mattel Shop and AmericanGirl.com. This is a cross functional role overseeing a team responsible for delivering against the strategy and executing day-to-day online operations of the e-commerce platforms. In addition to management of the team, this leader will work across the company to ensure partners develop and evolve the capabilities need for a successful consumer centric digital business. This includes working with brand partners to develop product plans, finance and supply chain to develop capabilities and technology to implement the digital roadmap. At the same time this leader will ensure the business is consistently delivering the operating metrics and key performance drivers.<br/><br/>Ready to play with the most iconic toy brands in the industry?<br/><br/><strong>What Your Impact Will Be<br/><br/></strong><strong> Ecommerce Strategy, P&amp;L Management:<br/></strong><ul><li>Lead development and execution of ecommerce strategies, digital retail execution and business planning to drive sales and profit. Develop key product and brand moments and ensure all projects support the company strategy</li><li>Build, manage, and refine online assortment, price and merchandising presentation. Lead team in executing vision from concept to launch.</li><li>Maintain appropriate sell through and merchandising to support various business models, and forecasting all DTC product launches.</li><li>Responsible for developing and managing customer acquisition and retention strategies.<br/><br/></li></ul><strong> Team Leadership/Management:<br/></strong><ul><li>Provide inspirational leadership across the teams to ensure continued development of the organization</li><li>Establish and measure goals to drive continuous improvement of product, and experience. Empowering the team to test &amp; learn by measuring program effectiveness, providing insights on how to optimize in future.</li><li>Collaborate effectively across the organization with Global Brand Category teams, Global Franchise, Global Technology, and Commercial teams across the globe. You will report to the EVP &amp; Global Head of Direct to Consumer.<br/><br/></li></ul><strong>Digital Capability Development<br/><br/></strong><ul><li>Partner closely with Global Technology organization on platform updates and migrations ensuring successful site launches</li><li>Serve as a thought leader across the organization to define digital commerce capabilities and lead the collaboration of the digital roadmap across technology, finance, and supply chain.</li><li>Cultivate a culture of collaboration, test and learn, and digital innovation across key partners and stakeholders<br/><br/></li></ul><strong>What We’re Looking For<br/><br/></strong><ul><li>Ability to exert personal influence, build relationships, and collaborate effectively with functional teams and other key internal / external stakeholders</li><li>Strong leader that can inspire and motivate high performing teams to deliver strong results</li><li>Proven track record in running a successful DTC ecommerce business with significant year over year growth </li><li>Must have strong skills in strategy and planning, budget and P&amp;L management merchandising and marketing, and vendor selection and management </li><li>Be comfortable in ambiguity/start up/lean ways of working in a dynamic, high-growth environment </li><li>Key strength in data-driven analytics</li><li>Ideally 14+ years’ related ecommerce experience in consumer-packaged goods, toys, entertainment or mass-market retailer<br/><br/></li></ul><strong>Bonus Credentials:<br/></strong><ul><li> MBA or equivalent advanced degree</li><li> Toy Industry<br/><br/></li></ul>The position is based in El Segundo, CA.<br/><br/>Don’t meet every single requirement? At Mattel we are dedicated to building a diverse and inclusive workplace, so if you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyway. You may be just the right candidate for this or other roles.<br/><br/><strong>How We Work<br/><br/></strong>We are a purpose driven company aiming to empower generations to explore the wonder of childhood and reach their full potential. We live up to our purpose employing the following behaviors<br/><br/><ul><li>We collaborate Being a part of Mattel means being part of one team with shared values and common goals. Every person counts and working closely together always brings better results. Partnership is our process and our collective capabilities is our superpower.</li><li>We innovate At Mattel we always aim to find new and better ways to create innovative products and experiences. No matter where you work in the organization, you can always make a difference and have real impact. We welcome new ideas and value new initiatives that challenge conventional thinking.</li><li>We execute We are a performance-driven company. We strive for excellence and are focused on pursuing best-in-class outcomes. We believe in accountability and ownership and know that our people are at their best when they are empowered to create and deliver results.<br/><br/></li></ul><strong>Who We Are<br/><br/></strong>Mattel is a leading global toy and family entertainment company and owner of one of the most iconic brand portfolios in the world. We engage consumers and fans through our franchise brands, including Barbie, Hot Wheels, Fisher-Price, American Girl, Thomas &amp; Friends, UNO, Masters of the Universe, Matchbox, Monster High, MEGA and Polly Pocket, as well as other popular properties that we own or license in partnership with global entertainment companies. Our offerings include toys, content, consumer products, digital and live experiences. Our products are sold in more than 195 countries in collaboration with the world’s leading retail and ecommerce companies.<br/><br/>Mattel is recognized as a Great Place to Work™ and as one of Fast Company’s Best Workplaces for Innovators in 2022.<br/><br/>Visit us at https //jobs.mattel.com/ and www.instagram.com/MattelCareers .<br/><br/>Mattel is an Affirmative Action/Equal Opportunity Employer where we want you to bring your authentic self to work every day. We welcome all job seekers including minorities, females, veterans, military spouses, individuals with disabilities, and those of all sexual orientations and gender identities.<br/><br/>Videos to watch<br/><br/>The Culture at Mattel<br/><br/>Mattel Investor Highlights", "postedDate": "3 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4003632552"}