{"jobTitle": "Inventory Clerk", "company": {"name": "Aston Carter", "location": "Hacienda Heights, CA"}, "location": "Hacienda Heights, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "<strong>Job Duties<br/><br/></strong><ul><li>Process orders</li><li>Respond to customer/vendor emails</li><li>Cycle counts</li><li>Inventory Management</li><li>Review the accuracy of incoming orders, collect and input orders submitted via fax, email, voicemail or online order entry transmission</li><li>Ensure the accuracy of outgoing entered orders</li><li>Deal professionally on the phone, on email and in person with customers, vendors and fellow employees</li><li>Resolve customer issues promptly</li><li>Print labels<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>1+ year of inventory experience</li><li>Ability to do multiple cross-functional job duties</li><li>Proficient in Microsoft Excel</li><li>Excellent communication skills, both written and verbal.</li><li>Ability to analyze data<br/><br/></li></ul><strong>About Aston Carter<br/><br/></strong>Aston Carter provides world-class corporate talent solutions to thousands of clients across the globe. Specialized in accounting, finance, human resources, talent acquisition, procurement, supply chain and select administrative professions, we extend the capabilities of industry-leading companies. We draw on our deep recruiting expertise and expansive network to meet the evolving needs of our clients and talent community with agility and excellence. With offices across the U.S., Canada, Asia Pacific and Europe, Aston Carter serves many of the Fortune 500. We are proud to be a ClearlyRated Best of Staffing® double diamond winner for both client and talent service.<br/><br/>Diversity, Equity &amp; Inclusion<br/><br/>At Aston Carter, Diversity And Inclusion Are a Bridge Towards The Equity And Success Of Our People. DE&amp;I Are Embedded Into Our Culture Through<br/><br/><ul><li>Hiring diverse talent</li><li>Maintaining an inclusive environment through persistent self-reflection</li><li>Building a culture of care, engagement, and recognition with clear outcomes</li><li>Ensuring growth opportunities for our people<br/><br/></li></ul>The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.<br/><br/>If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email astoncarteraccommodation@astoncarter.com for other accommodation options.", "postedDate": "6 days ago", "skills": ["Microsoft Excel", "Communication", "Inventory Management", "Order Processing", "Customer Service", "Data Analysis"], "url": "https://www.linkedin.com/jobs/view/4003398606"}