{"jobTitle": "COO w/ growing Behavioral Medical Practice", "company": {"name": "Jobot", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$175,000.00/yr - $200,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Human Resources Services, Technology, Information and Internet, and Hospitals and Health Care", "description": "Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!<br/><br/>Job details<br/><br/><strong>Are you looking to join a scaling medical practice as a VP of Operations?<br/><br/></strong>This Jobot Job is hosted by Lisa Loguidice<br/><br/>Are you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.<br/><br/>Salary $175,000 - $200,000 per year<br/><br/><strong>A Bit About Us<br/><br/></strong>Our client is a privately held expanding mental health Medical Practice based in the San Fernando Valley.<br/><br/><strong><br/><br/><strong>Why join us?<br/><br/><br/></strong></strong>Cutting Edge Leadership Team<br/><br/>Hybrid Scheduling<br/><br/>Collaborative Management Approach<br/><br/><strong>Job Details<br/><br/></strong>Our client is a privately held expanding mental health Medical Practice seeking a visionary and dynamic COO to join our team. This is a permanent position that offers a fantastic opportunity to make a significant impact on our organization, helping to shape our future and ensure our ongoing success. The COO will be responsible for overseeing the daily operations of our practice, ensuring that our services are efficient, effective, and meet the highest standards of patient care. This role is critical to our continued growth and success, and we are looking for a candidate who is as passionate about healthcare as we are.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Oversee the daily operations of our medical practice, ensuring that all aspects of our services are running smoothly and efficiently.</li><li> Develop and implement operational policies and procedures to improve efficiency and effectiveness.</li><li> Manage the Profit &amp; Loss (P&amp;L) of our practice, ensuring that we are financially sustainable and able to continue our growth trajectory.</li><li> Work closely with our medical and administrative staff to ensure that we are providing the highest quality of care to our patients.</li><li> Identify opportunities for improvement and innovation, and lead initiatives to implement these changes.</li><li> Ensure compliance with all relevant regulations and standards, maintaining our reputation for excellence and integrity.</li><li> Lead, motivate, and develop our operations team, fostering a culture of collaboration and excellence.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>The successful candidate will have<br/><br/><ul><li> A minimum of 5 years of experience in operations management within the healthcare industry, with a proven track record of success.</li><li> Extensive knowledge of healthcare operations, including the development and implementation of operational policies and procedures.</li><li> Experience managing the P&amp;L of a healthcare organization or department, with a strong understanding of financial management principles and practices.</li><li> Exceptional leadership and team management skills, with the ability to inspire and motivate a diverse team.</li><li> Excellent problem-solving skills, with a knack for identifying opportunities for improvement and the ability to implement effective solutions.</li><li> A deep commitment to patient care, with a passion for improving the healthcare experience for our patients.</li><li> Strong communication and interpersonal skills, with the ability to build strong relationships with staff, patients, and other stakeholders.</li><li> A Bachelor's degree in Healthcare Administration, Business, or a related field. A Master's degree is preferred.<br/><br/></li></ul>This is an exciting opportunity for a seasoned healthcare operations professional to make a significant impact on our growing practice. If you are passionate about healthcare and have the skills and experience to drive our operations to new heights, we would love to hear from you.<br/><br/>Interested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.<br/><br/><strong>Want to learn more about this role and Jobot?<br/><br/></strong>Click our Jobot logo and follow our LinkedIn page!<br/><br/>", "responsibilities": "Oversee the daily operations of our medical practice, ensuring that all aspects of our services are running smoothly and efficiently. Develop and implement operational policies and procedures to improve efficiency and effectiveness. Manage the Profit & Loss (P&L) of our practice, ensuring that we are financially sustainable and able to continue our growth trajectory. Work closely with our medical and administrative staff to ensure that we are providing the highest quality of care to our patients. Identify opportunities for improvement and innovation, and lead initiatives to implement these changes. Ensure compliance with all relevant regulations and standards, maintaining our reputation for excellence and integrity. Lead, motivate, and develop our operations team, fostering a culture of collaboration and excellence.", "qualifications": {"required": "A minimum of 5 years of experience in operations management within the healthcare industry, with a proven track record of success. Extensive knowledge of healthcare operations, including the development and implementation of operational policies and procedures. Experience managing the P&L of a healthcare organization or department, with a strong understanding of financial management principles and practices. Exceptional leadership and team management skills, with the ability to inspire and motivate a diverse team. Excellent problem-solving skills, with a knack for identifying opportunities for improvement and the ability to implement effective solutions. A deep commitment to patient care, with a passion for improving the healthcare experience for our patients. Strong communication and interpersonal skills, with the ability to build strong relationships with staff, patients, and other stakeholders.", "preferred": "A Bachelor's degree in Healthcare Administration, Business, or a related field. A Master's degree is preferred."}, "skills": [], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "Cutting Edge Leadership Team\nHybrid Scheduling\nCollaborative Management Approach", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003295854"}