{"jobTitle": "Procurement IT&T Manager", "company": {"name": "PwC", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing and Supply Chain", "industry": "Accounting, Financial Services, and Business Consulting and Services", "description": "<strong>Specialty/Competency: </strong>IFS - Finance<br/><br/><strong>Industry/Sector: </strong>Not Applicable<br/><br/><strong>Time Type: </strong>Full time<br/><br/><strong>Travel Requirements: </strong>Up to 20%<br/><br/>A career in Procurement, within Internal Firm Services, will provide you with the opportunity to develop and manage the procurement of all goods and services required by PwC for operational and strategic purposes. As a part of the team, you’ll assist in developing our standard practices and compliance infrastructure, managing relationships for both internal clients and suppliers to aid in the strategic selection of suppliers, supplier diversity, and contract negotiations. As part of our team, you’ll be responsible for the acquisition of services and capital equipment and goods. We serve as the relationship manager for both internal clients and suppliers by seeking appropriate solutions for all sourcing needs, creating, reviewing, and negotiating contractual arrangements through thought leadership, subject matter specialisation, and strategic advising.<br/><br/>To really stand out and make us fit for the future in a constantly changing world, each and every one of us at PwC needs to be a purpose-led and values-driven leader at every level. To help us achieve this we have the PwC Professional; our global leadership development framework. It gives us a single set of expectations across our lines, geographies and career paths, and provides transparency on the skills we need as individuals to be successful and progress in our careers, now and in the future.<br/><br/><strong>Responsibilities<br/><br/></strong>As a Manager, you'll work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution. PwC Professional skills and responsibilities for this management level include but are not limited to:<br/><br/><ul><li>Develop new skills outside of comfort zone.</li><li>Act to resolve issues which prevent the team working effectively.</li><li>Coach others, recognise their strengths, and encourage them to take ownership of their personal development.</li><li>Analyse complex ideas or proposals and build a range of meaningful recommendations.</li><li>Use multiple sources of information including broader stakeholder views to develop solutions and recommendations.</li><li>Address sub-standard work or work that does not meet firm's/client's expectations.</li><li>Use data and insights to inform conclusions and support decision-making.</li><li>Develop a point of view on key global trends, and how they impact clients.</li><li>Manage a variety of viewpoints to build consensus and create positive outcomes for all parties.</li><li>Simplify complex messages, highlighting and summarising key points.</li><li>Uphold the firm's code of ethics and business conduct.<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><strong>Job Requirements and Preferences:<br/><br/></strong><strong>Minimum Degree Required<br/><br/></strong>High School Diploma<br/><br/><strong>Minimum Year(s) Of Experience<br/><br/></strong>5 year(s) of procurement and/or vendor management or PwC experience<br/><br/><strong>Preferred Qualifications<br/><br/></strong><strong>Degree Preferred:<br/><br/></strong>Bachelor Degree<br/><br/><strong>Preferred Knowledge/Skills<br/><br/></strong>Demonstrates extensive-level, abilities success with managing the identification and addressing of client needs:<br/><br/><ul><li>Showcasing experience in the development, implementation, and execution of procurement strategies;</li><li>Demonstrating ability to collaborate with strategy &amp; sourcing leaders and peers to implement bidding and contracting processes that are consistent across commodities and that result in verifiable savings, increased controllable spend, increased diverse supplier spend, and other supply chain improvements;</li><li>Driving the bidding process to capitalize on eCommerce opportunities and facilitating effective long-term supplier relationship and contract management;</li><li>Transitioning of new and renegotiated contracts to the managed services team and routinely exchanging relevant commodity and/or supplier performance information (such Service Level Agreements (SLAs) and related supplier performance metrics) to improve future bid work and supplier compliance with contract terms and conditions;</li><li>Writing and conducting to complex RFx's (Requests for Proposal (RFP), Requests for Quotation (RFQ), and Requests for Information (RFI)) in related commodity areas on a global, cluster, and/or local basis;</li><li>Managing sourcing projects in accordance with Firm guidelines and compliance with arm's length, transparent, and fair bidding processes;</li><li>Collaborating with the Procurement Legal team to incorporate Procurement template content into contracts and RFx's and seeks requirements and input from customers;</li><li>Consulting with technical subject matter specialists on the Legal team, Independence Office, and other Finance support teams and helping increase awareness of Procurement practices and policies;</li><li>Demonstrating and applying enhanced negotiation skills at various levels internally and in the supplier community;</li><li>Contributing to the development and support implementation of strategies for procurement categories and related sub-categories, ensuring alignment with Firm strategy and key imperatives;</li><li>Understanding and utilizing best practice methods and measures to ensure that the optimum balance of cost and quality is achieved in all contracts;</li><li>Participating in the development of performance metrics and reporting on them; and,</li><li>Coaching and developing senior associate level procurement staff.<br/><br/></li></ul>Learn more about how we work: https://pwc.to/how-we-work<br/><br/>PwC does not intend to hire experienced or entry level job seekers who will need, now or in the future, PwC sponsorship through the H-1B lottery, except as set forth within the following policy: https://pwc.to/H-1B-Lottery-Policy.<br/><br/>All qualified applicants will receive consideration for employment at PwC without regard to race; creed; color; religion; national origin; sex; age; disability; sexual orientation; gender identity or expression; genetic predisposition or carrier status; veteran, marital, or citizenship status; or any other status protected by law. PwC is proud to be an affirmative action and equal opportunity employer.<br/><br/>For positions based in San Francisco, consideration of qualified candidates with arrest and conviction records will be in a manner consistent with the San Francisco Fair Chance Ordinance.<br/><br/>Applications will be accepted until the position is filled or the posting is removed, unless otherwise set forth on the following webpage. Please visit this link for information about anticipated application deadlines: https://pwc.to/us-application-deadlines<br/><br/>The salary range for this position is: $73,000 - $240,000, plus individuals may be eligible for an annual discretionary bonus. Actual compensation within the range will be dependent upon the individual's skills, experience, qualifications and location, and applicable employment laws. PwC offers a wide range of benefits, including medical, dental, vision, 401k, holiday pay, vacation and more. To view our benefits at a glance, please visit the following link: https://pwc.to/benefits-at-a-glance<br/><br/>", "responsibilities": "As a Manager, you'll work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution. PwC Professional skills and responsibilities for this management level include but are not limited to:<br/><br/><ul><li>Develop new skills outside of comfort zone.</li><li>Act to resolve issues which prevent the team working effectively.</li><li>Coach others, recognise their strengths, and encourage them to take ownership of their personal development.</li><li>Analyse complex ideas or proposals and build a range of meaningful recommendations.</li><li>Use multiple sources of information including broader stakeholder views to develop solutions and recommendations.</li><li>Address sub-standard work or work that does not meet firm's/client's expectations.</li><li>Use data and insights to inform conclusions and support decision-making.</li><li>Develop a point of view on key global trends, and how they impact clients.</li><li>Manage a variety of viewpoints to build consensus and create positive outcomes for all parties.</li><li>Simplify complex messages, highlighting and summarising key points.</li><li>Uphold the firm's code of ethics and business conduct.<br/><br/></li></ul>", "qualifications": {"required": "High School Diploma<br/><br/>5 year(s) of procurement and/or vendor management or PwC experience", "preferred": "Bachelor Degree<br/><br/>Demonstrates extensive-level, abilities success with managing the identification and addressing of client needs:<br/><br/><ul><li>Showcasing experience in the development, implementation, and execution of procurement strategies;</li><li>Demonstrating ability to collaborate with strategy &amp; sourcing leaders and peers to implement bidding and contracting processes that are consistent across commodities and that result in verifiable savings, increased controllable spend, increased diverse supplier spend, and other supply chain improvements;</li><li>Driving the bidding process to capitalize on eCommerce opportunities and facilitating effective long-term supplier relationship and contract management;</li><li>Transitioning of new and renegotiated contracts to the managed services team and routinely exchanging relevant commodity and/or supplier performance information (such Service Level Agreements (SLAs) and related supplier performance metrics) to improve future bid work and supplier compliance with contract terms and conditions;</li><li>Writing and conducting to complex RFx's (Requests for Proposal (RFP), Requests for Quotation (RFQ), and Requests for Information (RFI)) in related commodity areas on a global, cluster, and/or local basis;</li><li>Managing sourcing projects in accordance with Firm guidelines and compliance with arm's length, transparent, and fair bidding processes;</li><li>Collaborating with the Procurement Legal team to incorporate Procurement template content into contracts and RFx's and seeks requirements and input from customers;</li><li>Consulting with technical subject matter specialists on the Legal team, Independence Office, and other Finance support teams and helping increase awareness of Procurement practices and policies;</li><li>Demonstrating and applying enhanced negotiation skills at various levels internally and in the supplier community;</li><li>Contributing to the development and support implementation of strategies for procurement categories and related sub-categories, ensuring alignment with Firm strategy and key imperatives;</li><li>Understanding and utilizing best practice methods and measures to ensure that the optimum balance of cost and quality is achieved in all contracts;</li><li>Participating in the development of performance metrics and reporting on them; and,</li><li>Coaching and developing senior associate level procurement staff.<br/><br/></li></ul>"}, "skills": [], "postedDate": "2 days ago", "benefits": "PwC offers a wide range of benefits, including medical, dental, vision, 401k, holiday pay, vacation and more.", "remoteWork": "No", "salary": {"amount": "73,000 - 240,000", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4004379002"}