{"jobTitle": "Human Resources Coordinator", "company": {"name": "eTeam", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Associate", "salary": {"amount": "26.00/hr - 36.00/hr", "currency": "USD"}, "jobFunction": "Administrative, Education, and Human Resources", "industry": "Broadcast Media Production and Distribution and Entertainment Providers", "description": "<strong>Job title: Program Coordinator</strong><p><strong>Location: Universal City, CA</strong></p><p><strong>Duration: 2 Months HYBRID 4 days a week in office</strong></p><p><br/></p><p><strong>Qualifications:</strong></p><ul><li>Associate's degree in Business Administration, Office Management, or a related field (Bachelor's degree preferred but not required)</li><li>1-2 years of experience in a project coordinator role, preferably in a corporate technical environment</li><li>Proficiency in MS Office Suite (Word, Excel, PowerPoint) and basic data management tools</li><li>Strong organizational and multitasking skills</li><li>Excellent verbal and written communication skills</li><li>Ability to maintain confidentiality and handle sensitive information</li><li>Exceptional attention to detail, exhibiting high accuracy in data and document</li><li>Strong editorial skills and the ability to identify and remediate errors in data and documents</li></ul><p><br/></p><p><strong>Key Skills/Strengths:</strong></p><ul><li>Excellent communication skills – Listening, writing, presenting, and facilitating across functions and levels, both internal and external to client</li><li>Ability to prioritize tasks and manage time effectively in a fast-paced environment</li><li>Self-motivation; proactive approach to problem-solving and improving administrative processes</li><li>Can-do attitude: Detail-oriented with strong organizational skills</li><li>Ability to work independently as well as part of a team</li></ul><p><br/></p><p><strong>Responsibilities:</strong></p><ul><li>Project Management/Coordination of the <strong>Workplace Violence Prevention Program</strong>, including the review and maintenance of accurate records for training, incidents, and inspections, as well as fielding questions and requests related to the program.</li><li>Perform high-volume data entry tasks, ensuring the accuracy and completeness of all information.</li><li>Provide general administrative support, including scheduling meetings, preparing reports, and answering emails.</li><li>Ensure all records are up-to-date and easily accessible for auditing and reporting purposes.</li><li>Identify opportunities to streamline administrative processes and improve efficiency.</li></ul><p></p>", "responsibilities": "Project Management/Coordination of the Workplace Violence Prevention Program, including the review and maintenance of accurate records for training, incidents, and inspections, as well as fielding questions and requests related to the program. Perform high-volume data entry tasks, ensuring the accuracy and completeness of all information. Provide general administrative support, including scheduling meetings, preparing reports, and answering emails. Ensure all records are up-to-date and easily accessible for auditing and reporting purposes. Identify opportunities to streamline administrative processes and improve efficiency.", "qualifications": {"required": "Associate's degree in Business Administration, Office Management, or a related field (Bachelor's degree preferred but not required), 1-2 years of experience in a project coordinator role, preferably in a corporate technical environment, Proficiency in MS Office Suite (Word, Excel, PowerPoint) and basic data management tools, Strong organizational and multitasking skills, Excellent verbal and written communication skills, Ability to maintain confidentiality and handle sensitive information, Exceptional attention to detail, exhibiting high accuracy in data and document, Strong editorial skills and the ability to identify and remediate errors in data and documents", "preferred": "Bachelor's degree"}, "skills": ["Project Management", "Data Entry", "Administrative Support", "Microsoft Office Suite", "Communication", "Organization", "Multitasking", "Confidentiality", "Attention to Detail", "Editorial Skills"], "postedDate": "3 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004461402"}