{"jobTitle": "Patient Coordinator - Full-Time", "company": {"name": "ExpertMRI", "industry": "Medical Practices", "size": "Not specified", "location": "Fullerton, CA"}, "location": "Fullerton, CA", "jobType": "Full-Time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$21.00", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Medical Practices", "description": "Join our dedicated team! One Source Medical Diagnostics is the provider of administrative and support services to Expert MRI, a radiology group. We’re dedicated to delivering exceptional imaging diagnostic services through our state-of-the-art imaging centers. Join our team and be part of an organization committed to making a positive impact on the lives of our patients and community. We are currently seeking a Full-Time Patient Coordinator. Schedule - Monday, Tuesday Wednesday, Saturday, Sunday 8:30 am to 5:00 pm. Pay Rate - $21.00 per hour. Role Overview: The Patient Coordinator is a vital member of our team, serving as the initial contact for patients and ensuring a seamless administrative experience. In this role, you will facilitate patient access to necessary imaging diagnostics, enhancing their care journey and supporting our mission of delivering outstanding diagnostic services.", "responsibilities": "Welcome and assist patients, managing reception duties, scheduling, and ensuring smooth processing for imaging diagnostics. Deliver outstanding customer service, maintaining operational efficiency and achieving key performance indicators. Handle administrative tasks effectively, including inventory management, data entry, and comprehensive reporting. Collaborate with technologists and medical staff to coordinate schedules and optimize patient flow. Uphold strict confidentiality standards, ensuring the integrity and privacy of all patient information.", "qualifications": {"required": "At least one year of experience in healthcare administration or customer service, with a background in health, administration, or a related field. Proficiency with computer systems, including MS Office, and can efficiently manage data entry at 40 WPM. Understanding of medical and radiological terminology, with preference given to those familiar with diagnostic imaging processes. Bilingual in English and Spanish preferred (will consider non-bilingual candidates). Understanding of HIPAA regulations. Holds a valid driver’s license and is open to traveling to different locations as needed.", "preferred": ""}, "skills": [], "postedDate": "5 days ago", "applicationDeadline": "", "benefits": "Medical, Dental, and Vision, Life Insurance, AD&D Coverage, Short-Term and Long-Term Disability, Employee Assistance, Paid Time Off, Paid Sick Time, Paid Holidays, 401(k)", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4004141868"}