{"jobTitle": "Marketing Communications Coordinator", "company": {"name": "Mela Group Inc", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Advertising Services", "description": "Want to work with fearless innovators, visionaries, and community-minded people who challenge the status quo? Well, We do too!<br/><br/>We are more than just a Marketing and Sales firm. We are a team of unorthodox Marketing Communications professionals who craft an extraordinary tale to connect with consumers and bring a brand story to life. Our marketing strategies aren’t a trend or a moment; they are a movement. And we’re leading it, but we can’t teach it alone!<br/><br/>Our firm is searching far and wide for a Marketing Communications Coordinator who can assist in our team skyrocketing our client’s brand recognition. Our main objective is to provide every team member with support, opportunity, and an inclusive environment. We believe everyone deserves a fair chance and a chance to allow their creative juices to flourish. Our firm would be far behind the pack without new and innovative ideas.<br/><br/><strong>Marketing Communications Coordinator Responsibilities<br/><br/></strong><ul><li>Provide strategic direction on communications strategy, support customer communications, programs, and sales initiatives</li><li>Work with marketing communications coordinator team, sales executives, customers, and others to support and deliver external communications</li><li>Manage marketing campaigns, executions, and strategy</li><li>Meet with the team daily to cover sales expectancies, goals, promotions, products, and brand information to stay on top of trends </li><li>Compile accurate customer information and square feedback on customer satisfaction </li><li>Prepare and present marketing campaigns to potential new clients with a confident and professional manager <br/><br/></li></ul><strong>Marketing Communications Coordinator Requirements<br/><br/></strong><ul><li>Degree in marketing, communications, sales, advertising, or business </li><li>Experience as a Marketing Communications Coordinator, Advertising, Events, Sales, or Promotions Specialist </li><li>Strong verbal communication skills</li><li>Must be detail-oriented and have strong organizational skills</li><li>Ability to multi-task and think quickly on one’s feet using independent judgment</li><li>Must be highly self-motivated and outgoing<br/><br/></li></ul>Powered by JazzHR<br/><br/>", "postedDate": "2 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004945840"}