{"jobTitle": "Planning Manager", "company": {"name": "Safran", "location": "Garden Grove, CA"}, "location": "Garden Grove, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "115,000.00/yr - 140,000.00/yr", "currency": "USD"}, "jobFunction": "Manufacturing, Management, and Production", "industry": "Aviation and Aerospace Component Manufacturing and Motor Vehicle Manufacturing", "description": "POWERED BY TEAMWORK. Are you ready to be part of a team that drives big ideas and even bigger wins? At Safran, we believe in the power of both collaboration and individual contributions. We understand that it takes diverse perspectives, problem-solving skills, dependability, and trust to push each other forward and achieve great success. For us, working here is more than just a job; it's a passion. There's the unique opportunity to lead the way in aerospace and defense and contribute to creating a safer and more sustainable world.\n<br/>\nWe trust our employees to bring bold ideas to build the future of aerospace together, contributing to our ranking by TIME as the leading Aerospace & Defense company on the 2023 World's Best Companies list (#59 on the full list). Join our team and become part of the group that's making amazing things happen on the ground and in the skies. Together, we'll proudly step back and say, “We did that”.\n<br/>\nIn the role of Manager, Planning you'll play a pivotal part on our Supply Chain team.\n<br/>\nThe planning manager will lead a team of planning professionals and will be responsible for all aspects of scheduling, planning and inventory activities. Some key areas of activities include: developing a production plan, plan workflow and schedules, monitor status and ensure customer delivery requirements and sales and operations planning(S&OP).\n<br/>\nSummary of Duties:\n• Implement, execute and maintain world class strategies for planning, scheduling, inventory and customer satisfaction.\n• Oversee production planning and management activities within the business unit.\n• Develop production plan, budget and timeliness according to production specifications.\n• Determine production requirements based on plant capacity and production specifications.\n• Communication of needs and objectives to the planning team along with training, developing, mentoring and assisting team members is essential.\n• Plan work flow and schedules for production departments.\n• Monitor production status and ensure timely delivery.\n• Identify delays and accordingly adjust schedules to meet deadlines.\n• Establishes and maintains premier customer service.\n• Assist in production risk assessment and mitigation activities.\n• Planning Manager manages planners to ensure they:\n• Analyze engineering documents and generate bills of materials (BOM) accordingly\n• Plan all materials on dock at kit due dates and deliver requisitions on time to purchasing\n• Release & order work orders for in house fabrication and assembly parts.\nTravel specificity\nSome travelling may also be required from time to time.\nAdditional description\nSafran Cabin headquarters are in Huntington Beach, California, with a global presence of over 11,000 employees at 36 sites. Site locations are in the United States, Mexico, Brazil, Canada, Germany, France, Czech Republic, the Netherlands, Tunisia and Thailand. Safran Cabin serves over 400 airlines and leasing companies globally and delivers to all airframe OEM manufacturers with a heritage spanning over 80 years in the industry.\n<br/>\nDiscover Safran Cabin through our videos: Safran Cabin (safran-group.com)\n<br/>\n• Your Career: Safran is committed to providing internal mobility to our employees. We operate globally so the sky is the limit of where your Safran journey can take you.\n• Your Development: Safran employees have free access to Safran University courses and external tuition reimbursement for approved programs or certifications.\n• Your Benefits: Our suite of comprehensive benefits include health care (medical, dental and vision), life insurance, 401(k) savings plans with company match, paid time off, Safran Perks with BenefitHub – Employee Discounts & Rewards Marketplace for consumer products/services and more!\n• Management roles may be eligible for a bonus in accordance with the terms of the applicable incentive plan.\n<br/>\nThe expected salary range for this position is between $91,780 - $134,230 USD. Actual compensation will be determined based on experience, education, and other factors permitted by law.\nCandidate skills & requirements\nAt Safran Cabin, diversity & inclusion is a source of richness that adds quality of life, performance, and innovation. We welcome diverse contributions and provide equal employment opportunity to all individuals regardless of race, color, religion, sex/gender, sexual orientation, gender identity/gender expression, marital status, pregnancy, age, national origin, ancestry, disability/medical condition, military or veteran status, citizenship status, genetic characteristics or information, or any other characteristic protected by applicable federal, state, and local laws.\n<br/>\nWe seek service-oriented team players with strong interpersonal skills and a positive attitude, adaptable to our innovative and evolving environment.\n<br/>\nAcross all team members, we are looking for the following attributes:\n· Team oriented\n· Process focused\n· Open & honest communication\n· Quality minded\n· Ability to persevere and honor commitments\n· Recognizes success\n· Executes with urgency\n· Creates solutions\n· Customer focused in everything we do\n<br/>\nQualifications:\nEducation: Bachelor's degree\nExperience:\n• 5 years of experience in progressive planning, scheduling and inventory management experience in aerospace, automotive or mechanical manufacturing environment with the ability to lead and influence others.\n• 2-5 years of experience leading teams\nComputer Skills:\n• Experience working with MRP/ERP systems\n• Basic knowledge Microsoft Office (Word, Excel, PowerPoint)\nOther Skills:\n• Strong written and verbal business communications abilities, must be comfortable delivering information to all levels of the organization including senior leadership.\n• Working knowledge of business finance skills and abilities\n• Understanding of S&OP, planning, scheduling and inventory management\n• Problem solving, well organized, detailed oriented and accurate.\n<br/>\nAdditional Preferred Skills: (not required)\n• Bachelor's degree in supply chain, business management or operations\n• APICS CPIM and/or ISM certifications\n• Experience in AS/ISO standards quality management experience.\n• Problem solving skills (Six Sigma Green Belt, etc…)\n<br/>\nThis job posting has been designed to indicate the general nature and level of work performed by an employee within this position. The actual duties, responsibilities and qualifications may vary based on assignment or group.", "responsibilities": "The planning manager will lead a team of planning professionals and will be responsible for all aspects of scheduling, planning and inventory activities. Some key areas of activities include: developing a production plan, plan workflow and schedules, monitor status and ensure customer delivery requirements and sales and operations planning(S&OP).", "qualifications": {"required": "Education: Bachelor's degree\nExperience:\n• 5 years of experience in progressive planning, scheduling and inventory management experience in aerospace, automotive or mechanical manufacturing environment with the ability to lead and influence others.\n• 2-5 years of experience leading teams\nComputer Skills:\n• Experience working with MRP/ERP systems\n• Basic knowledge Microsoft Office (Word, Excel, PowerPoint)\nOther Skills:\n• Strong written and verbal business communications abilities, must be comfortable delivering information to all levels of the organization including senior leadership.\n• Working knowledge of business finance skills and abilities\n• Understanding of S&OP, planning, scheduling and inventory management\n• Problem solving, well organized, detailed oriented and accurate.", "preferred": "• Bachelor's degree in supply chain, business management or operations\n• APICS CPIM and/or ISM certifications\n• Experience in AS/ISO standards quality management experience.\n• Problem solving skills (Six Sigma Green Belt, etc…)"}, "skills": ["MRP/ERP systems", "Microsoft Office", "S&OP", "planning", "scheduling", "inventory management", "problem solving", "teamwork", "communication", "quality", "leadership", "finance"], "postedDate": "5 days ago", "benefits": "Our suite of comprehensive benefits include health care (medical, dental and vision), life insurance, 401(k) savings plans with company match, paid time off, Safran Perks with BenefitHub – Employee Discounts & Rewards Marketplace for consumer products/services and more!", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4004343491"}