{"jobTitle": "Second Assistant to Fashion Influencer", "company": {"name": "The Grapevine Agency", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "Up to $75K DOE", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Retail Apparel and Fashion, Entertainment Providers, and Wellness and Fitness Services", "description": "Second Assistant to Influencer &amp; Lead Executive Assistant\nLocation: Encino, CA\nSalary: Up to $75K DOE\n<br/>\nA prominent influencer and entrepreneur with a rapidly growing empire is seeking a Second Assistant to join their dynamic team. With business ventures spanning clothing, podcasting, speaking engagements, a jewelry line, and an upcoming book deal, the principal is expanding her support staff to maintain and elevate her multifaceted brand.\n<br/>\nThe ideal candidate is proactive, detail-oriented, and knowledgeable about the social media landscape and its related industries. This role requires a versatile individual capable of managing administrative tasks, running errands, and contributing to the continued growth of the influencer’s brand.\n<br/>\nKey Responsibilities:\n<ul><li>Ensure the principal is prepared for daily meetings and engagements.</li><li>Run errands, manage deliveries, and provide personal assistance as needed.</li><li>Assist in maintaining and growing the influencer’s social media presence, including content creation, posting, and engagement, under the guidance of the Lead Executive Assistant.</li><li>Support the organization of events, product launches, and other business-related activities.</li><li>Maintain a well-organized environment in the office and during events.</li><li>Be involved in strategizing and planning for business expansion.</li><li>Conduct research and assist in planning new ventures.</li><li>Collaborate closely with the Lead Executive Assistant to ensure seamless operations and effective communication across all business verticals.</li></ul><br/>\nQualifications:\n1-2 years of experience in a similar role, preferably within the influencer, entertainment, or fashion industries.\nStrong organizational skills, attention to detail, and the ability to multitask in a fast-paced environment.\nProficiency in social media platforms and content management.\nAbility to anticipate needs and take initiative.\nExcellent verbal and written communication skills.\nComfortable using various digital tools and platforms, including social media, email management systems, and project management tools.\nWillingness to work flexible hours, including evenings and weekends, as required by the influencer’s schedule.\nAbility to handle confidential information with professionalism and integrity.\n", "postedDate": "3 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004877801"}