{"jobTitle": "Interior Design Consultant", "company": {"name": "RH", "location": "Thousand Oaks, CA"}, "location": "Thousand Oaks, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "17.00/hr - 35.00/hr", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Design Services, Hospitality, and Furniture and Home Furnishings Manufacturing", "description": "RH at its core is about taste, and we believe the idea of scaling taste is large and far reaching.<br/><br/>The RH brand attracts the best designers, artisans, manufacturers and talent in our industry, scaling and rendering their work more valuable across our integrated platform, enabling us to curate the most compelling collection of luxury home furnishings in the world. We are moving the brand beyond curating and selling products to conceptualizing and selling spaces by building an ecosystem of products, places, services and spaces that elevates and establishes the RH brand as a global thought leader, taste and place maker.<br/><br/>At RH we believe deeply that the \"right\" people are our greatest asset. We value people with high energy, who possess the ability to energize others. People who are smart, creative and have a point of view. People who see the answer in every problem, versus those who see the problem in every answer. People who are driven, determined and won't take \"no\" for an answer. We value team players, people who are more concerned with what's right, rather than who's right.<br/><br/>Design Consultants play an integral role in providing luxury service by assessing the needs of walk-in clientele in the RH Gallery. They will work in collaboration and partnership with RH Interior Design to ensure the clients' design needs are met and their expectations exceeded. Our Design Consultants are innovators with an entrepreneurial spirit and a passion for building and maintaining relationships.<br/><br/><strong>Your Responsibilities<br/><br/></strong><ul><li>Live Our Vision, Values and Beliefs every day</li><li>Provide a luxury experience for RH clientele through product expertise and elevated service</li><li>Qualify and educate potential clients on services offered by RH Interior Design</li><li>Own all phases of the client experience from initial contact through product delivery</li><li>Grow and maintain a strong client base</li><li>Ensure fiscal goals are achieved</li><li>Represent the RH lifestyle brand through communication, personal appearance and professionalism</li><li>Maintain a strong interest in the luxury and Design industry</li><li>Support visual and quality standards within the Gallery<br/><br/></li></ul><strong>Our Requirements<br/><br/></strong><ul><li>Experience within a Design firm or high-end furniture and luxury retail preferred</li><li>Art, Architecture or Interior Design and relevant experience preferred</li><li>People and relationship driven</li><li>Strategic and mental agility</li><li>Highly organized</li><li>Collaborative</li><li>Results-oriented</li><li>Excellent verbal and written communication skills</li><li>Proficiency with Mac Operating System, IOS devices, Microsoft Office and Google Applications<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li>Ability to lift and mobilize small to medium items up to 25 lbs. while utilizing appropriate equipment and techniques</li><li>Ability to maneuver effectively around Gallery floor, stock room and office</li><li>Position entails prolonged standing, twisting, stooping, kneeling, squatting, bending and climbing</li><li>Licensed to drive preferred</li><li>Ability to travel locally or out of state<br/><br/></li></ul><strong>About Us<br/><br/></strong>RH is an equal opportunity employer and does not discriminate against any applicant on the basis of race, color, religion, national origin, gender, marital status, age, disability, sexual orientation, military/veteran status, or any other status protected by federal or state law or local ordinance.<br/><br/>At RH, we are committed to promoting pay equity. Rate of pay is determined based on each individual's experience, qualifications, and the geographic location of the role.", "responsibilities": "Live Our Vision, Values and Beliefs every day\nProvide a luxury experience for RH clientele through product expertise and elevated service\nQualify and educate potential clients on services offered by RH Interior Design\nOwn all phases of the client experience from initial contact through product delivery\nGrow and maintain a strong client base\nEnsure fiscal goals are achieved\nRepresent the RH lifestyle brand through communication, personal appearance and professionalism\nMaintain a strong interest in the luxury and Design industry\nSupport visual and quality standards within the Gallery", "qualifications": {"required": "Experience within a Design firm or high-end furniture and luxury retail preferred\nArt, Architecture or Interior Design and relevant experience preferred\nPeople and relationship driven\nStrategic and mental agility\nHighly organized\nCollaborative\nResults-oriented\nExcellent verbal and written communication skills\nProficiency with Mac Operating System, IOS devices, Microsoft Office and Google Applications", "preferred": "Ability to lift and mobilize small to medium items up to 25 lbs. while utilizing appropriate equipment and techniques\nAbility to maneuver effectively around Gallery floor, stock room and office\nPosition entails prolonged standing, twisting, stooping, kneeling, squatting, bending and climbing\nLicensed to drive preferred\nAbility to travel locally or out of state"}, "skills": ["Design", "Luxury Retail", "Customer Service", "Sales", "Communication", "Relationship Building", "Product Knowledge", "Microsoft Office", "Google Applications"], "postedDate": "2 days ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4004613413"}