{"jobTitle": "Human Resource Generalist", "company": {"name": "FLAG Solutions LLC", "location": "Fullerton, CA"}, "location": "Fullerton, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Staffing and Recruiting", "description": "<strong>Job Description<br/><br/></strong><strong>About Us:<br/><br/></strong>FLAG is a dynamic and innovative company dedicated to excellence in the industries we serve. Our Fullerton office is expanding, and we’re seeking a talented HR Generalist to join our team. We offer a collaborative environment where your expertise will be valued, and your professional growth is encouraged.<br/><br/><strong>Job Summary:<br/><br/></strong>As an HR Generalist at FLAG, you will play a crucial role in supporting our employees and management team. You’ll be responsible for a variety of HR functions, including recruitment, employee relations, benefits administration, and compliance. This position requires a hands-on professional with strong communication skills and a deep understanding of HR best practices.<br/><br/><strong>Key Responsibilities:<br/><br/></strong><ul><li>Recruitment and Onboarding: Manage full-cycle recruitment, including job postings, candidate screenings, interviews, and onboarding of new employees. </li><li>Employee Relations: Act as a point of contact for employee concerns, ensuring a positive workplace culture and addressing issues promptly. </li><li>Benefits Administration: Administer employee benefits programs, including health insurance, retirement plans, and wellness initiatives. </li><li>HR Compliance: Ensure company compliance with federal, state, and local employment laws and regulations, maintaining up-to-date records and policies. </li><li>Performance Management: Support managers in the performance review process, providing guidance and documentation as needed. </li><li>Training and Development: Identify training needs and facilitate professional development opportunities for employees. </li><li>HR Reporting: Prepare and analyze HR metrics and reports to support decision-making processes. <br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Bachelor’s degree in Human Resources, Business Administration, or a related field. </li><li>3+ years of experience in an HR Generalist role or similar HR capacity. </li><li>Strong knowledge of HR practices, labor laws, and employee relations. </li><li>Excellent communication and interpersonal skills. </li><li>Proficient in HRIS systems and Microsoft Office Suite. </li><li>Ability to handle confidential information with discretion and integrity. </li><li>PHR or SHRM-CP certification is a plus. <br/><br/></li></ul><strong>Why Join Us?<br/><br/></strong><ul><li>Competitive salary and comprehensive benefits package. </li><li>Opportunity to be part of a growing team in a collaborative and supportive environment. </li><li>Career advancement and professional development opportunities. </li><li>Work in a dynamic and fast-paced industry. <br/><br/></li></ul><strong>How to Apply:<br/><br/></strong>If you’re a proactive and driven HR professional looking to make an impact, we’d love to hear from you! Please submit your resume and a brief cover letter outlining your qualifications and interest in the role.", "responsibilities": "Manage full-cycle recruitment, including job postings, candidate screenings, interviews, and onboarding of new employees. Act as a point of contact for employee concerns, ensuring a positive workplace culture and addressing issues promptly. Administer employee benefits programs, including health insurance, retirement plans, and wellness initiatives. Ensure company compliance with federal, state, and local employment laws and regulations, maintaining up-to-date records and policies. Support managers in the performance review process, providing guidance and documentation as needed. Identify training needs and facilitate professional development opportunities for employees. Prepare and analyze HR metrics and reports to support decision-making processes.", "qualifications": {"required": "Bachelor’s degree in Human Resources, Business Administration, or a related field. 3+ years of experience in an HR Generalist role or similar HR capacity. Strong knowledge of HR practices, labor laws, and employee relations. Excellent communication and interpersonal skills. Proficient in HRIS systems and Microsoft Office Suite. Ability to handle confidential information with discretion and integrity.", "preferred": "PHR or SHRM-CP certification"}, "skills": ["HRIS", "Recruitment", "Employee Relations", "Benefits Administration", "HR Compliance", "Performance Management", "Training and Development", "HR Reporting"], "postedDate": "2 days ago", "benefits": "Competitive salary and comprehensive benefits package. Opportunity to be part of a growing team in a collaborative and supportive environment. Career advancement and professional development opportunities. Work in a dynamic and fast-paced industry.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004404794"}