{"jobTitle": "Manufacturing Manager - Ohio", "company": {"name": "DMC Recruitment Group", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Los Angeles Metropolitan Area"}, "location": "Ashtabula, Ohio", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Manufacturing", "industry": "Building Materials", "description": "Our client is seeking a Plant Improvement and R&D Manufacturing Manager to lead and manage plant improvement and R&D projects in the building materials sector. This role focuses on enhancing production processes, overseeing various improvement initiatives, and ensuring alignment with company goals for efficiency, quality, and cost-effectiveness.", "responsibilities": "The Plant Improvement and R&D Manufacturing Manager will develop and implement strategies to improve production processes and manage related projects. Responsibilities include scoping, justifying, and designing activities aimed at enhancing plant availability, capacity, and reducing costs. The role involves negotiating with vendors for optimal pricing on equipment and services and allocating resources effectively within budget constraints. The manager will track quality metrics to ensure high standards, document project results in technical reports, and provide mentorship to team members. They will ensure that products meet specifications and cost targets, support root cause analysis, and oversee validation testing on new designs. Maintaining design control documentation and developing test methods to evaluate product performance are also key aspects of the role. Additionally, the manager will lead the development of new materials and components, implement cost reduction initiatives, and supervise team members while providing guidance and support. Experience in the building materials industry, particularly with doors and windows, would be considered an asset.", "qualifications": {"required": "A Bachelor’s or Master’s degree in Mechanical/Manufacturing Engineering or a related field is required.", "preferred": "The ideal candidate will have at least 3 years of experience in R&D, Manufacturing, or Process Improvement roles, with strong skills in multitasking, budgeting, and leadership. A Lean or Six Sigma Green Belt certification is preferred. Proficiency in AutoCAD, Microsoft Office, and project management software is required. Experience in the building materials industry, especially with doors and windows, is a valuable asset."}, "skills": ["R&D", "Manufacturing", "Process Improvement", "Budgeting", "Leadership", "AutoCAD", "Microsoft Office", "Project Management"], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4004618072"}