{"jobTitle": "Distribution Operations Supervisor - (Seasonal)", "company": {"name": "Best Buy", "industry": "Retail", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "The Distribution Operations Supervisor provides functional systems expertise and training to distribution center employees that leads to a safe, accurate, and productive environment. As the main point of contact in the absence of their manager, this role will be asked to lead in a dynamic way, requiring flexibility in multiple areas of operation. They expand their skillset to different areas such as general warehouse worker, warehouse clerical administration, and quality control functions. This is also considered an individual contributor role that includes working alongside the team to accomplish the daily goals for each shift when workload dictates.\n\nAt Best Buy, we are obsessed with building long term relationships with our customers. Every team member should feel empowered to deliver a world-class and unique experience based on what each customer needs.\n\nKey Responsibilities\n\nHelps drive a positive customer experience by building relationships, exhibiting empathy, and providing solutions to their needs.\nContributes to the production plan by working in a productive function each shift.\nPrepares the staffing plan for the day, ensuring that workload and labor hours are distributed appropriately for the volume of the day.\nConducts daily start up meetings which include safety topics, staffing assignments, and warm up activities.\nMonitors labor and makes staffing moves to ensure the team is trending towards the labor plan for the day.\nIdentifies coaching opportunities with the team to ensure proper techniques are consistently being utilized.\nPlays a critical role in onboarding, training, and validating knowledge of new and existing employees.\nResolves complex customer, system, and inventory-related issues as needed while proactively equipping employees with skills and tools necessary to address customer and operational challenges.\nSets the example for the rest of the team by following all safety, operational, and cultural best practices.\nProactively seeks out developmental opportunities to further advance leadership skillset for future advancement opportunities within the organization.\nAttends leadership meetings and contributes to the leadership vision for the building.\nProvides leadership to the entire building team including setting clear expectations, giving direction, mentoring.\nParticipates in talent management including coaching and corrective action process, interviewing and hiring process, and monthly 1 on 1 meetings.\nPerforms opening and closing responsibilities including carrying keys, using the alarm code, and responding to alarm calls when the building is closed.\nConducts routine safety procedures, including screening questions, temperature checks, safety assessment observations, and action planning.\nResponds to immediate safety and employee concerns while serving as the single point of contact within the facility.\n\nBasic Qualifications\n\nOne year of operations experience or leadership experience\nAbility to multitask in a fast-paced environment\nBeginner level proficiency with all Microsoft Office Suite software applications (i.e. Outlook, Word, Excel, and PowerPoint)\nAbility to work in a team environment\nAbility to work a flexible schedule including holidays, nights, and weekends\n\nPreferred Qualifications\n\nOne year of supervisory or leadership experience\nAssociate degree or higher in business or related field\n\nBest Buy is an equal opportunity employer.\n\nApplication deadline: Minimum of 5 days from the posting date. You can find that date above the job title at the top of the page.", "responsibilities": "Helps drive a positive customer experience by building relationships, exhibiting empathy, and providing solutions to their needs. Contributes to the production plan by working in a productive function each shift. Prepares the staffing plan for the day, ensuring that workload and labor hours are distributed appropriately for the volume of the day. Conducts daily start up meetings which include safety topics, staffing assignments, and warm up activities. Monitors labor and makes staffing moves to ensure the team is trending towards the labor plan for the day. Identifies coaching opportunities with the team to ensure proper techniques are consistently being utilized. Plays a critical role in onboarding, training, and validating knowledge of new and existing employees. Resolves complex customer, system, and inventory-related issues as needed while proactively equipping employees with skills and tools necessary to address customer and operational challenges. Sets the example for the rest of the team by following all safety, operational, and cultural best practices. Proactively seeks out developmental opportunities to further advance leadership skillset for future advancement opportunities within the organization. Attends leadership meetings and contributes to the leadership vision for the building. Provides leadership to the entire building team including setting clear expectations, giving direction, mentoring. Participates in talent management including coaching and corrective action process, interviewing and hiring process, and monthly 1 on 1 meetings. Performs opening and closing responsibilities including carrying keys, using the alarm code, and responding to alarm calls when the building is closed. Conducts routine safety procedures, including screening questions, temperature checks, safety assessment observations, and action planning. Responds to immediate safety and employee concerns while serving as the single point of contact within the facility.", "qualifications": {"required": "One year of operations experience or leadership experience, Ability to multitask in a fast-paced environment, Beginner level proficiency with all Microsoft Office Suite software applications (i.e. Outlook, Word, Excel, and PowerPoint), Ability to work in a team environment, Ability to work a flexible schedule including holidays, nights, and weekends", "preferred": "One year of supervisory or leadership experience, Associate degree or higher in business or related field"}, "skills": [], "postedDate": "3 days ago", "applicationDeadline": "Minimum of 5 days from the posting date", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4004224066"}