{"jobTitle": "Planning Coordinator", "company": {"name": "Classic Home, Inc.", "location": "Irwindale, CA"}, "location": "Irwindale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Furniture and Home Furnishings Manufacturing", "description": "<strong>Job Description<br/><br/></strong><strong>Job Summary:<br/><br/></strong>The Planning Coordinator plays a crucial role in ensuring seamless operations across various departments by managing invoice tracking, purchase order (PO) maintenance, and cross-collaboration with customer service and sales associates. The role also supports ERP systems and supply planning processes to enhance overall efficiency and accuracy.<br/><br/><strong>Key Responsibilities:<br/><br/></strong><strong>Invoice Tracking and Management:<br/><br/></strong><ul><li>Monitor and track invoices to ensure timely processing and payment. </li><li>Reconcile discrepancies between invoices and purchase orders. </li><li>Coordinate with the finance team to resolve any invoice-related issues. <br/><br/></li></ul><strong>Purchase Order (PO) Maintenance:<br/><br/></strong><ul><li>Create, update, and maintain purchase orders in the ERP system. </li><li>Ensure POs are accurately matched with corresponding invoices and delivery receipts. </li><li>Communicate with suppliers and internal teams to address any PO issues or changes. <br/><br/></li></ul><strong>Customer Service Cross-Collaboration:<br/><br/></strong><ul><li>Work closely with the customer service team to address customer inquiries related to orders, shipments, and returns. </li><li>Provide timely updates to customer service regarding order status and inventory levels. </li><li>Assist in resolving any issues that impact customer satisfaction. <br/><br/></li></ul><strong>Sales Associate Cross-Collaboration:<br/><br/></strong><ul><li>Collaborate with sales associates to ensure alignment between sales orders and inventory availability. </li><li>Support sales teams with accurate order fulfillment and timely delivery. </li><li>Communicate any potential delays or issues to the sales team and provide solutions. <br/><br/></li></ul><strong>ERP System Support:<br/><br/></strong><ul><li>Assist in the maintenance and troubleshooting of the ERP system related to order processing, inventory management, and reporting. </li><li>Provide training and support to team members on ERP-related processes and functionalities. </li><li>Work with IT and ERP vendors to address and resolve system issues or updates. <br/><br/></li></ul><strong>Supply Planning Support:<br/><br/></strong><ul><li>Support supply planning by providing accurate and timely data related to inventory levels, sales forecasts, and order status. </li><li>Collaborate with the supply chain team to ensure optimal inventory levels and avoid stockouts or overstock situations. </li><li>Assist in the analysis of supply chain performance metrics and contribute to process improvements. <br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Education: Bachelor’s degree in Business Administration, Supply Chain Management, or a related field. </li><li>Experience: 2-4 years of experience in a planning, operations, or administrative role, preferably within a manufacturing or retail environment. </li><li>Skills:</li><li>Proficiency in ERP systems, and MS Office Suite (Excel, Word, Outlook). </li><li>Strong analytical and problem-solving skills. </li><li>Excellent organizational and multitasking abilities. <br/><br/></li></ul><strong>Company Description<br/><br/></strong>Classic Home began when founder Harpal Singh started selling handwoven kilim rugs, believing that authentically crafted pieces made with honest materials could transform spaces and reshape how people live in them. Inspired by the rugs, Harpal searched for other pieces that embodied his values of quality and authenticity, always reshaping and refining his vision for what inspired spaces could be. Thirty years on, our search continues as does our commitment to sourcing pieces that transform, complete, and most of all, inspire your spaces.<br/><br/>Classic Home began when founder Harpal Singh started selling handwoven kilim rugs, believing that authentically crafted pieces made with honest materials could transform spaces and reshape how people live in them. Inspired by the rugs, Harpal searched for other pieces that embodied his values of quality and authenticity, always reshaping and refining his vision for what inspired spaces could be. Thirty years on, our search continues as does our commitment to sourcing pieces that transform, complete, and most of all, inspire your spaces.", "responsibilities": "The Planning Coordinator plays a crucial role in ensuring seamless operations across various departments by managing invoice tracking, purchase order (PO) maintenance, and cross-collaboration with customer service and sales associates. The role also supports ERP systems and supply planning processes to enhance overall efficiency and accuracy.", "qualifications": {"required": "Education: Bachelor’s degree in Business Administration, Supply Chain Management, or a related field. Experience: 2-4 years of experience in a planning, operations, or administrative role, preferably within a manufacturing or retail environment. Skills: Proficiency in ERP systems, and MS Office Suite (Excel, Word, Outlook). Strong analytical and problem-solving skills. Excellent organizational and multitasking abilities."}, "skills": ["ERP", "Excel", "Word", "Outlook", "Analytical Skills", "Problem Solving", "Organizational Skills", "Multitasking"], "postedDate": "4 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004419646"}