{"jobTitle": "Security Sales Specialist III, Google Cloud", "company": {"name": "Google", "location": "Houston, TX"}, "location": "Houston, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "129,000.00/yr - 194,000.00/yr", "currency": "USD"}, "jobFunction": "Sales, Advertising, and Customer Service", "industry": "Information Services and Technology, Information and Internet", "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Addison, TX, USA; Houston, TX, USA.Minimum qualifications:<br/><br/>\n<ul><li>Bachelor's degree or equivalent practical experience.</li><li>10 years of experience in a sales role in the enterprise software or cloud space.</li><li>Experience selling to clients in the enterprise cybersecurity or IT field.<br/><br/></li></ul>Preferred qualifications:<br/><br/>\n<ul><li>Experience carrying and exceeding strategic business goals in a sales role.</li><li>Experience supporting long-term executive relationships, and developing territories/accounts from scratch, while ensuring customer success, adoption and expansion.</li><li>Experience prioritizing, planning, and organizing solution-based sales activity within complex sales cycles, including qualifying high value accounts and leveraging our partner ecosystem.</li><li>Experience working with internal/external teams, including account teams, technical leads, procurement, and legal, to inventory existing software estate, build business cases for transformation with implementation plans, and close agreements.</li><li>Knowledge of market trends, products, and solutions in cloud and cybersecurity.<br/><br/></li></ul>About The Job<br/><br/>\nAs a Security Sales Specialist, you will help us grow our cybersecurity business by building and expanding relationships with new and existing customers. In this role, you will work with customers to deliver true business value, demonstrate product functionality, and provide a comprehensive overview of key business use cases. You will lead day-to-day relationships with cross-functional team members and external customers, leading with empathy, while identifying innovative ways to multiply your impact and the impact of the team as a whole to drive overall value for Google Cloud.<br/><br/>\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.<br/><br/>\nThe US base salary range for this full-time position is $129,000-$194,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/>\nResponsibilities<br/><br/>\n<ul><li> Build relationships with customers as a subject matter expert and trusted advisor, managing complex business cycles, identifying solution use cases, and influencing long-term strategic direction of accounts. </li><li>Deliver against quota and achieve or exceed strategic business and growth goals while forecasting and reporting your territory’s business.</li><li>Work with Google accounts and cross-functional teams (e.g., Customer Engineering, Marketing, Customer Success, Product, Engineering, Channels) to develop go-to-market strategies, drive pipeline and business growth, close agreements, understand the perspective of the customer, and provide excellent prospect and customer experience.</li><li>Construct and execute an effective territory development plan.</li><li>Work with multiple customers and opportunities simultaneously, understanding each customer’s technology footprint and strategy, growth plans, business drivers, competitors, and how they can transform their business using our technologies.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li> Build relationships with customers as a subject matter expert and trusted advisor, managing complex business cycles, identifying solution use cases, and influencing long-term strategic direction of accounts. </li><li>Deliver against quota and achieve or exceed strategic business and growth goals while forecasting and reporting your territory’s business.</li><li>Work with Google accounts and cross-functional teams (e.g., Customer Engineering, Marketing, Customer Success, Product, Engineering, Channels) to develop go-to-market strategies, drive pipeline and business growth, close agreements, understand the perspective of the customer, and provide excellent prospect and customer experience.</li><li>Construct and execute an effective territory development plan.</li><li>Work with multiple customers and opportunities simultaneously, understanding each customer’s technology footprint and strategy, growth plans, business drivers, competitors, and how they can transform their business using our technologies.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience.\n10 years of experience in a sales role in the enterprise software or cloud space.\nExperience selling to clients in the enterprise cybersecurity or IT field.", "preferred": "Experience carrying and exceeding strategic business goals in a sales role.\nExperience supporting long-term executive relationships, and developing territories/accounts from scratch, while ensuring customer success, adoption and expansion.\nExperience prioritizing, planning, and organizing solution-based sales activity within complex sales cycles, including qualifying high value accounts and leveraging our partner ecosystem.\nExperience working with internal/external teams, including account teams, technical leads, procurement, and legal, to inventory existing software estate, build business cases for transformation with implementation plans, and close agreements.\nKnowledge of market trends, products, and solutions in cloud and cybersecurity."}, "skills": [], "postedDate": "14 hours ago", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4004741795"}