{"jobTitle": "Director of Human Resources", "company": {"name": "Innovative Integrated Health", "location": "Anaheim, CA", "industry": "Staffing and Recruiting"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Human Resources", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/>About the Director of Human Resources<br/><br/>The Director of Human Resources is a full-time position that oversees and directs all human resources functions and programs related to employment, compensation, benefits, employee relations and engagement. This position is responsible for developing organizational strategies, providing analysis and making recommendations to accomplish organizational objectives. The Director of Human Resources has full supervisory responsibility for an 8 person human resources department in our 3 current sites.<br/><br/>Who We Are<br/><br/>Innovative Integrated Health is a healthcare organization whose mission is to enable underserved and multicultural senior communities to live independently at home and within their communities for as long as possible with no out-of-pocket cost. Through our Program of All-Inclusive Care for the Elderly (PACE), we have been providing our participants with comprehensive health and social supports that are proven to effectively manage chronic conditions and to reduce the risk for premature institutionalization.<br/><br/>We currently have sites in Orange County, Fresno and Bakersfield and are preparing to open a new site within the next 18 months.<br/><br/>Our Core Values<br/><br/><ul><li>Respect is at the core of our interactions.</li><li>Honesty and Integrity with every endeavor.</li><li>Patient-centered care aligned with the participant’s values, beliefs and preferences. </li><li>Encouragement that motivates and empowers others to be the best they can be. </li><li>Quality care that is efficient, transformative and innovative. <br/><br/></li></ul>Location and Schedule<br/><br/>This is a hybrid position with the option to work 2 remote days per week. Monthly travel to all locations is required.<br/><br/>Compensation And Benefits<br/><br/>The compensation for this position is $140,000 - $160,000 and is eligible for the following benefits:<br/><br/><ul><li>Discretionary bonus</li><li>Medical insurance</li><li>Dental and vision insurance</li><li>Life insurance</li><li>401(k) retirement plan with match</li><li>Paid vacation</li><li>Paid holidays</li><li>Paid sick leave</li><li>Professional development opportunities<br/><br/></li></ul>Essential Position Responsibilities<br/><br/><ul><li>Serve as a strategic business partner to the leadership team by providing leadership and guidance on organizational structure and staff utilization.</li><li>Serve as an advisor to all supervisory employees to educate and train on human resources policies, procedures and performance management.</li><li>Full supervisory responsibility, development and training of the human resources team.</li><li>Manage employee relations including resolving employee concerns, answering questions and conducting investigations.</li><li>Develop recruitment plans and oversee full-cycle recruiting.</li><li>Oversee employee programs and services to support organizational morale and employee engagement. </li><li>Maintain knowledge of DHCS/CMS requirements.</li><li>Maintain compliance with federal, state and local legislation.</li><li>Complete annual compensation survey and evaluation of employee compensation.</li><li>Develop and implement a performance evaluation program. </li><li>Review policies, procedures and practices to ensure legal compliance and to protect the organization from liability.</li><li>Oversight of Payroll and Benefits Coordination.</li><li>Assist with staff training and development.</li><li>Other responsibilities as assigned.<br/><br/></li></ul>Education And Experience<br/><br/><ul><li>At least 6 years of human resources management experience.</li><li>At least 3 years of supervisory experience is required. </li><li>Bachelor’s Degree in a related field and/or equivalent work experience is required. Master’s degree preferred.</li><li>At least 1 year of healthcare experience preferred</li><li>PHR/SPHR or SHRM-CP/SHRM-SCP designation preferred.</li><li>Health plan experience preferred.</li><li>Current CPR/BLS certification preferred.<br/><br/></li></ul>Qualifications<br/><br/><ul><li>Extensive knowledge of California employment laws and the ability to interpret those laws.</li><li>Ability to effectively present information and respond to questions from management and employees.</li><li>Experience coaching, supporting and guiding leaders within the company on a variety of employee relations issues.</li><li>High level of confidentiality and discretion.</li><li>Excellent written and verbal communication skills.<br/><br/></li></ul>What’s Next?<br/><br/>Thank you for your interest in the Director of Human Resources opportunity with Innovative Integrated Health! Please submit your resume and cover letter for consideration. We are unable to accept direct inquiries about this position (i.e. phone calls, emails).", "responsibilities": "Serve as a strategic business partner to the leadership team by providing leadership and guidance on organizational structure and staff utilization.Serve as an advisor to all supervisory employees to educate and train on human resources policies, procedures and performance management.Full supervisory responsibility, development and training of the human resources team.Manage employee relations including resolving employee concerns, answering questions and conducting investigations.Develop recruitment plans and oversee full-cycle recruiting.Oversee employee programs and services to support organizational morale and employee engagement. Maintain knowledge of DHCS/CMS requirements.Maintain compliance with federal, state and local legislation.Complete annual compensation survey and evaluation of employee compensation.Develop and implement a performance evaluation program. Review policies, procedures and practices to ensure legal compliance and to protect the organization from liability.Oversight of Payroll and Benefits Coordination.Assist with staff training and development.Other responsibilities as assigned.", "qualifications": {"required": "At least 6 years of human resources management experience.At least 3 years of supervisory experience is required. Bachelor’s Degree in a related field and/or equivalent work experience is required. Master’s degree preferred.At least 1 year of healthcare experience preferred", "preferred": "PHR/SPHR or SHRM-CP/SHRM-SCP designation preferred.Health plan experience preferred.Current CPR/BLS certification preferred."}, "skills": [], "postedDate": "1 day ago", "benefits": "Discretionary bonusMedical insuranceDental and vision insuranceLife insurance401(k) retirement plan with matchPaid vacationPaid holidaysPaid sick leaveProfessional development opportunities", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4004367193"}