{"jobTitle": "Warehouse Associate / Freight Handler / Unloader", "company": {"name": "humano LLC", "location": "Chino, CA"}, "location": "Chino, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Strategy/Planning and Information Technology", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "<strong>Job Summary<br/><br/></strong>Humano is currently seeking motivated Warehouse Associates/Freight Handlers/Unloaders to join our team at our Chino, CA warehouse location. As a Warehouse Associate/Freight Handler/Unloader, you will be responsible for unloading containers by hand, sorting items, loading them onto push carts, and loading outbound trailers. This role does not involve heavy machinery and requires the ability to lift up to 50lbs on an ongoing basis for extended periods.<br/><br/><ul><li>Please Note-This is not a Travel Team Site-Candidates must live local**<br/><br/></li></ul><strong><em>Humano offers Daily Pay! Payroll is bi-weekly, with the option to access earnings instantly! Work and access funds same day! See job details below!<br/><br/></em></strong><strong>Responsibilities<br/><br/></strong><ul><li> Unload containers manually and efficiently</li><li> Sort items and place them onto push carts</li><li> Load outbound trailers with sorted items</li><li> Collaborate with the warehouse team to ensure a clean and safe work environment<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Previous experience in a warehouse or physical labor role preferred, but not mandatory-willing to train!</li><li> Ability to lift up to 50lbs on an ongoing basis</li><li> Strong attention to detail and ability to work efficiently</li><li> Excellent teamwork and communication skills<br/><br/></li></ul><strong>Shift And Compensation<br/><br/></strong><ul><li> Shift:</li><li>1st shift, Monday to Friday 7:00am-3:30pm- Compensation: This is a production pay position, with the opportunity to earn between $19-$23 per hour based on efficiency. The minimum hourly wage is $17.<br/><br/></li></ul><strong>Company Overview<br/><br/></strong>At Humano, we are a third-party warehouse provider that prides ourselves on employing the happiest and most dedicated individuals in the industry. Our team consists of athletes, laborers, and hardworking professionals who strive to support our communities. From unloading, receiving, loading, operating equipment, order selecting, palletizing, and general warehouse work, we handle it all. We believe in maintaining a clean and safe work environment and prioritize teamwork.<br/><br/><strong>Application Process And Equal Employment Opportunity<br/><br/></strong>Interested candidates should apply online at www.humano.net. Please note that this position is not a travel team role, and candidates must reside locally in Oregon.<br/><br/>To apply for this position, please visit our website at www.humano.net. We are an equal opportunity employer and embrace diversity in our workforce. We conduct pre-employment background checks, drug screens, E-Verify, and possibly other verifications as part of our hiring process. Applicants must be 18 years of age or older to be eligible to apply for this position", "responsibilities": "Unload containers manually and efficiently\nSort items and place them onto push carts\nLoad outbound trailers with sorted items\nCollaborate with the warehouse team to ensure a clean and safe work environment", "qualifications": {"required": "Previous experience in a warehouse or physical labor role preferred, but not mandatory-willing to train!\nAbility to lift up to 50lbs on an ongoing basis\nStrong attention to detail and ability to work efficiently\nExcellent teamwork and communication skills"}, "skills": [], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004347866"}