{"jobTitle": "Director of Human Resources", "company": {"name": "California Lutheran University", "industry": "Higher Education", "size": "Not specified", "location": "Thousand Oaks, CA"}, "location": "Thousand Oaks, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$130,000.00 - $150,000.00", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Higher Education", "description": "The mission of California Lutheran University is to educate leaders for a global society who are strong in character and judgment, confident in their identity and vocation, and committed to service and justice. Founded in 1959 in beautiful Ventura County, the university has an enrollment of about 4,000 undergraduate and graduate students who come from across the nation and around the world from a diversity of backgrounds, cultures and faiths. As a federally recognized Hispanic-Serving Institution, Cal Lutheran is looking for candidates with a dedication to and success in working in diverse communities. The university is committed to an inclusive learning and work environment that values individual differences and respects each persons dignity.", "responsibilities": "Lead and manage a people-focused office of Human Resources. Recruit, train, supervise, and retain the Human Resources staff, ensuring they utilize best practices and exude excellent customer service in a number of areas: talent acquisition, performance management, compensation, benefits administration, HR policies, employee relations, learning and development, HRIS, personnel operations, and legal compliance, etc.", "qualifications": {"required": "Any combination equivalent to: bachelor's degree in Human Resources, Organizational Development, Business, or related field and ten (10) years of progressively responsible leadership experience in multiple human resources functional areas.", "preferred": "Masters degree in Human Resources, Organizational Development, Business, or related field; SPHR/SHRM-SCP; Previous human resources leadership experience in higher education or related; Demonstrated leadership in a diverse environment."}, "skills": ["Human Resources Management", "Employee Relations", "Talent Acquisition", "Performance Management", "Compensation and Benefits Administration", "HR Compliance", "Organizational Development"], "postedDate": "5 days ago", "applicationDeadline": "9/8/2024", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4004822707"}