{"jobTitle": "Director of Warehouse Operations", "company": {"name": "Ardmore Home Design, Inc.", "industry": "Wholesale Furniture and Home Furnishings", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "100,000-120,000", "currency": "USD"}, "jobFunction": "Distribution", "industry": "Wholesale Furniture and Home Furnishings", "description": "<strong>About the Company </strong>\nArdmore Home Design (AHD), founded in 2008, is a privately-owned, fast-paced, entrepreneurial company where we value people with strong skills to make our products and processes better every day. We design, sell and distribute luxury home décor to interior designers as well as boutique/luxury retailers globally. The AHD family of wholesale brands includes Made Goods (flagship furniture made from unique materials); Pigeon & Poodle (home and bath accessories); Blue Pheasant (handcrafted tabletop products) and Thucassi (artisanal candles and fragrances). \n<br/>\n<strong>About the Position </strong>\nWe are seeking an experienced <strong>Director of Warehouse Operations </strong>to lead our distribution operation! The ideal candidate will be a professional with a passion for Warehouse Operations and who enjoys being out “on the floor”. This position is a hands-on role that will require a significant investment in the development of processes and procedures, hiring and training the right staff, organizing the warehouse functions, and helping our company develop a world-class experience for our customers. S/he must be a skilled executor of all warehouse functions, a cultural ambassador who will drive passion and instill enthusiasm within others. \n<br/>\nUnder the direction of the VP of Warehouse Operations, the Director of Warehouse Operations interacts with all warehouse personnel to carry out the strategic and tactical activities of the Warehouse Department. Key responsibilities include staff recruitment, employee development, KPI management, cost-improvement activities, and daily distribution operations. \nThe Director of Warehouse Operations is responsible for approximately 40 employees and oversees a 280,000 sq ft warehouse. The successful candidate must be a strong tactical leader who has the ability to craft, improve and maintain SOPs and also to use analytics to drive continuous improvement. \nThe warehouse operations follow a Monday through Friday, dayshift schedule with some variations as needed. \n<br/>\n<strong>Position Responsibilities </strong>\nOversee the Receiving, Shipping, and Returns process \n<ul><li>Receiving - completes intake of both ocean freight, domestic LTL & small parcel shipments, along with international shipments </li><li>Shipping - divided into two picking teams and two shipping teams (one each for small parcel and one each for FTL/LTL) </li><li>Complete QC inspection of products </li><li>Train staff on warehouse processes and validate proficiency </li><li>Listen to employee needs and engage with them in employee development activities </li><li>Help with career pathing and coaching for warehouse staff </li></ul><br/>\nManage the KPIs of the Warehouse \n<ul><li>Safety </li><li>Shipping accuracy </li><li>On-time shipment </li><li>Inventory accuracy – bin and total piece count </li><li>Labor cost – total spend and overtime % </li><li>Internal damage rate (re-packaging and inefficient packaging opportunities) </li><li>Packaging materials expense </li></ul><br/>\nDevelop Best Practices Utilizing Systems and Process \n<ul><li>Understand and become skilled in using the company ERP (including WMS and TMS) to improve operating efficiencies </li><li>Develop SOPs for all warehouse processes </li><li>Other duties and responsibilities may be assigned that fit within the warehouse functions. </li></ul><br/><br/>\n<strong>What we can do for you:</strong>\n<ul><li>Play a pivotal role in our company’s transformation and growth</li><li>Maintain work/life balance working for wholesale distribution business</li><li>Training and career development opportunities</li><li>3 weeks paid time off and 6 paid holidays per year</li><li>Relaxed and collaborative work environment</li><li>Up to 6% 401k employer contributions</li><li>Team building company sponsored events</li><li>Employee discount and bi-annual sample sale</li></ul><br/>\n<strong>Qualifications:</strong>\n<ul><li>· Bachelor’s degree preferred in supply chain, business, or other related fields </li><li>· Minimum five years of experience in Warehouse Operations Senior Manager or Director Level </li><li>· High level of proficiency in Microsoft Office, especially Excel </li><li>· In-depth understanding of packaging optimization and quality production </li></ul><br/><br/>\n<strong>Physical Requirements:</strong>\nThe physical demands described here are representative of those that are required by an employee to successfully perform the essential functions of this job. \nWhile performing the duties of this job, the employee is regularly required to talk or hear. The employee is frequently required to sit; stand; walk; use hands to finger, handle or feel; as well as reach with hands and arms. \nThe employee must frequently lift and/or move up to 15 pounds and occasionally lift and/or move up to 35 pounds. Specific vision abilities required by this job include close vision, distance vision, depth perception and ability to adjust focus. \n<ul><li>Ability to work in open environment with fluctuating temperatures and standard lighting.</li><li>Ability to work on computer and mobile phone for multiple hours; with frequent interruptions.</li><li>Required to use stairwells to attend meetings and engage with employees on multiple floors throughout building.</li></ul><br/>\n<strong>Other Considerations: </strong>\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice. Reasonable accommodations may be made to qualified individuals with disabilities to enable them to perform the essential functions of the role.\n<br/>\n<strong>Compensation</strong>\nStarting annual salary: $100,000-120,000. Exact compensation may vary based on skills, experience, and location.", "responsibilities": "Oversee the Receiving, Shipping, and Returns process \n<ul><li>Receiving - completes intake of both ocean freight, domestic LTL & small parcel shipments, along with international shipments </li><li>Shipping - divided into two picking teams and two shipping teams (one each for small parcel and one each for FTL/LTL) </li><li>Complete QC inspection of products </li><li>Train staff on warehouse processes and validate proficiency </li><li>Listen to employee needs and engage with them in employee development activities </li><li>Help with career pathing and coaching for warehouse staff </li></ul><br/>\nManage the KPIs of the Warehouse \n<ul><li>Safety </li><li>Shipping accuracy </li><li>On-time shipment </li><li>Inventory accuracy – bin and total piece count </li><li>Labor cost – total spend and overtime % </li><li>Internal damage rate (re-packaging and inefficient packaging opportunities) </li><li>Packaging materials expense </li></ul><br/>\nDevelop Best Practices Utilizing Systems and Process \n<ul><li>Understand and become skilled in using the company ERP (including WMS and TMS) to improve operating efficiencies </li><li>Develop SOPs for all warehouse processes </li><li>Other duties and responsibilities may be assigned that fit within the warehouse functions. </li></ul>", "qualifications": {"required": "Minimum five years of experience in Warehouse Operations Senior Manager or Director Level, High level of proficiency in Microsoft Office, especially Excel, In-depth understanding of packaging optimization and quality production", "preferred": "Bachelor’s degree preferred in supply chain, business, or other related fields"}, "skills": ["Warehouse Operations", "ERP", "WMS", "TMS", "SOPs", "Excel", "Packaging Optimization", "Quality Production"], "postedDate": "20 hours ago", "benefits": "3 weeks paid time off and 6 paid holidays per year, Relaxed and collaborative work environment, Up to 6% 401k employer contributions, Team building company sponsored events, Employee discount and bi-annual sample sale", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004720660"}