{"jobTitle": "Receptionist - State Farm Agent Team Member", "company": {"name": "State Farm Agent", "location": "Cerritos, CA"}, "location": "Cerritos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "40,000.00 - 60,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Insurance", "description": "Responsive recruiter<br/><br/><strong>Position Overview<br/><br/></strong>Are you a vibrant individual who thrives on providing exceptional customer experiences? Do you relish the opportunity to engage with the public and make a positive impact? If your answer is a resounding \"yes,\" then embarking on a career journey with a State Farm independent contractor agent might just be the perfect fit for you! Our agents are dedicated to promoting State Farm's premier insurance and financial service products, offering you the chance to become an integral part of a trusted brand.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Forge enduring customer relationships and proactively follow up to ensure continued satisfaction.</li><li>Employ a customer-centric, needs-based approach to guide clients through comprehensive insurance options, empowering them to make informed decisions.</li><li>Drive business growth by generating leads, coordinating appointments, and effectively marketing tailored products and services to meet diverse customer needs.<br/><br/></li></ul><strong>As an Agent Team Member, you will receive...<br/><br/></strong><ul><li>401k</li><li>Hourly pay plus commission/bonus</li><li>Health benefits</li><li>Paid time off (vacation and personal/sick days)</li><li>Flexible hours</li><li>Professional development</li><li>Abundant opportunities for career advancement within our agency</li><li>License reimbursement<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Genuine interest in marketing products and services that align with customer needs and preferences.</li><li>Exceptional communication skills across all channels - written, verbal, and attentive listening.</li><li>A people-centric mindset with a keen eye for detail.</li><li>Proactive problem-solving abilities, ensuring swift resolutions for customer inquiries.</li><li>Proficiency in learning and navigating computer functions efficiently.</li><li>Collaborative spirit, thriving in a dynamic team environment.<br/><br/></li></ul>If you are motivated to succeed and can see yourself in this role, please complete our application. We will follow up with you on the next steps in the interview process.<br/><br/>This position is with a State Farm independent contractor agent, not with State Farm Insurance Companies. Employees of State Farm agents must be able to successfully complete any applicable licensing requirements and training programs. State Farm agents are independent contractors who hire their own employees. State Farm agents’ employees are not employees of State Farm.<br/><br/>Compensation: $40,000.00 - $60,000.00 per year<br/><br/><strong>Do you want to work with someone who will help you achieve YOUR goals?<br/><br/></strong>If you want to work in an environment that is fun, challenging, and rewarding, then Jim Barr - State Farm Agent may be the right fit for you!<br/><br/><strong>About Our Agency<br/><br/></strong><ul><li>Our mission is to help people manage the risks of everyday life, recover from the unexpected and realize their dreams.</li><li>Our office is located in Cerritos, CA.</li><li>I have been a State Farm agent since 1988.</li><li>We have 40 years of combined insurance experience in our office.<br/><br/></li></ul><strong>Apply now and let us put you on the path to success.<br/><br/></strong><em>State Farm agents are independent contractors who hire their own employees. State Farm agents’ employees are not employees of State Farm. Agents are responsible for and make all employment decisions regarding their employees.</em>", "responsibilities": "Forge enduring customer relationships and proactively follow up to ensure continued satisfaction. Employ a customer-centric, needs-based approach to guide clients through comprehensive insurance options, empowering them to make informed decisions. Drive business growth by generating leads, coordinating appointments, and effectively marketing tailored products and services to meet diverse customer needs.", "qualifications": {"required": "Genuine interest in marketing products and services that align with customer needs and preferences. Exceptional communication skills across all channels - written, verbal, and attentive listening. A people-centric mindset with a keen eye for detail. Proactive problem-solving abilities, ensuring swift resolutions for customer inquiries. Proficiency in learning and navigating computer functions efficiently. Collaborative spirit, thriving in a dynamic team environment."}, "skills": [], "postedDate": "5 days ago", "benefits": "401k Hourly pay plus commission/bonus Health benefits Paid time off (vacation and personal/sick days) Flexible hours Professional development Abundant opportunities for career advancement within our agency License reimbursement", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004822894"}