{"jobTitle": "Supply Chain Specialist", "company": {"name": "SPECTRAFORCE", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Job Title - Supply Chain Specialist<br/><br/>Location - Frederick, MD 21704 / Santa Monica, CA 90404<br/><br/>Duration:- 09 Months<br/><br/>This a hybrid position (3 days onsite) based in our Frederick, Maryland location but also open to Santa Monica, CA location for qualified individuals.<br/><br/>Description<br/><br/><ul><li>As business process owner within the Material Domain, The Supply Chain Manager is responsible for overseeing requests for material master creation, changes and maintenance with respect to companywide processes and procedures for Commercial, Clinical and Raw Material Basic and Quality Master Data for GPLM, Oracle E Business Suite (EBS) and Kinaxis Rapid Response.</li><li>This position is the focal point for Material Master Data creation and maintenance and requires collaboration with multi-functional departments to develop master data business rules and processes that support operational efficiency throughout the organization.</li><li>This role will partner with various stakeholder groups to develop and manage data activities including data definition, establishing and managing data standards and processes, data quality management, transforming and readying Master data for use in current EBS system, boundary systems and analytical tools, and future SAP system.<br/><br/></li></ul>Additional responsibilities include:<br/><br/><ul><li>Responsibilities of the Supply Chain Specialist – Master Data Management Include:</li><li>Serve as an expert for master data creation and maintenance; provides support as required</li><li>Executes the Enterprise Data and Governance strategy; Master Data Management, Data Standardization &amp; Curation, Data Quality, Data Assurance, Data Discovery, Data Enablement and Data Usage for the enterprise</li><li>Foster stakeholder adherence to effective Data Management and Governance structure, policies, practices, tools, workflows and operations with extended teams</li><li>Drives continuous improvement of client data management through organizational and business process improvement projects.</li><li>Document issues and collaborate with business and IT team to troubleshoot issues and define solutions</li><li>Supports testing of material creation and workflow in the ERP system in accordance with scheduled timelines</li><li>Collaborates with groups authoring specifications for all Kite materials – raw materials, Subassemblies, cell banks, viral vectors, and finished products and approve specification documents</li><li>Monitor functional area data quality reports and metrics identifying master data errors and identify revisions to data quality reports, new tools and/or processes to proactively prevent, identify, monitor and correct master data errors to resolution</li><li>Supports smooth operations throughout product lifecycle by serving as center of expertise for maintaining Kite ERP-SCM Master Data attributes according to defined standards<br/><br/></li></ul>Required Education &amp; Experience<br/><br/><ul><li>6+ years of relevant experience in related field and a BS or BA; or 2+ years of relevant experience and a MA/MBA/MS;</li><li>Prior work experience in the Pharmaceutical, Life Sciences, or related medical or chemical manufacturing field</li><li>Prior work experience with GMP/GXP standards</li><li>BA/BS or MA/MS in Supply Chain, engineering or science discipline. or Industrial Engineering</li><li>Experience with the following systems/software: Kinaxis RapidResponse or other scheduling/planning tools.</li><li>Experience with ERP systems such as Oracle EBS, SAP or with GxP systems or other pharmaceutical product management systems</li><li>Self-motivated and able to drive cross functional alignment on master data practices</li><li>Ability to understand big picture planning and connect master data management impacts/risks<br/><br/></li></ul>Required Years of Experience: 6-8 years<br/><br/>Top 3 Required Skill Sets: Master data governance and maintenance, Supply Chain Planning, EBS and/or SAP expertise (master data and production planning)<br/><br/>Top 3 Nice to Have Skill Sets: Project management, Data Analysis, Functional Collaboration<br/><br/>Unique Selling Point of this role: Serves as an expert for Master data creation and maintenance. Orchestrates and establishes process governance<br/><br/>Task breakdown (by %): Execution of mater data activities including creation and maintenance (40%), Management of SOPs, owning Change control and deviations (20%), Obsoletion and metrics reporting (20%), Project and data migration support (20%)<br/><br/>Required Degree or Certification: Bachelors or Masters in Engineering, Supply Chain, Marketing<br/><br/>CPRA: The Company is committed to complying with the California Privacy Rights Act (“CPRA”) effective January 1, 2023; and all data privacy laws in the jurisdictions in which it recruits and hires employees. A Notice to California Job Applicants Regarding the Collection of Personal Information can be located on our website. Applicants with disabilities may access this notice in an alternative format by contacting NAhr@spectraforce.com . About Us: Established in 2004, SPECTRAFORCE® is one of the largest and fastest-growing diversity-owned staffing firms in the US. The growth of our company is a direct result of our global client service delivery model that is powered by our state-of-the-art A.I. proprietary talent acquisition platform, robust ISO 9001:2015/ISO 27001 certified processes, and strong and passionate client engaged teams. We have built our business by providing talent and project-based solutions, including Contingent, Permanent, and Statement of Work (SOW) services to over 140 clients in the US, Canada, Puerto Rico, Costa Rica, and India. Key industries that we service include Technology, Financial Services, Life Sciences, Healthcare, Telecom, Retail, Utilities and Transportation. SPECTRAFORCE is built on a concept of “human connection,” defined by our branding attitude of NEWJOBPHORIA®, which is the excitement of bringing joy and freedom to the work lifestyle so our people and clients can reach their highest potential. Learn more at: http://www.spectraforce.com<br/><br/>Benefits: SPECTRAFORCE offers ACA compliant health benefits as well as dental, vision, accident, critical illness, voluntary life, and hospital indemnity insurances to eligible employees. Additional benefits offered to eligible employees include commuter benefits, 401K plan with matching, and a referral bonus program. SPECTRAFORCE provides unpaid leave as well as paid sick leave when required by law.<br/><br/>Equal Opportunity Employer: SPECTRAFORCE is an equal opportunity employer and does not discriminate against any employee or applicant for employment because of race, religion, color, sex, national origin, age, sexual orientation, gender identity, genetic information, disability or veteran status, or any other category protected by applicable federal, state, or local laws. Please contact Human Resources at LOA@spectraforce.com if you require reasonable accommodation.<br/><br/>California Applicant Notice: SPECTRAFORCE is committed to complying with the California Privacy Rights Act (“CPRA”) effective January 1, 2023; and all data privacy laws in the jurisdictions in which it recruits and hires employees. A Notice to California Job Applicants Regarding the Collection of Personal Information can be located on our website. Applicants with disabilities may access this notice in an alternative format by contacting NAHR@spectraforce.com .<br/><br/>LA County, CA Applicant Notice: If you are selected for this position with SPECTRAFORCE, your offer is contingent upon the satisfactory completion of several requirements, including but not limited to, a criminal background check. We consider qualified applicants with arrest or conviction records for employment in accordance with all local ordinances and state laws, including the Los Angeles County Fair Chance Ordinance for Employers (FCO) and the California Fair Chance Act (FCA). The background check assessment will consider whether a criminal history could reasonably have a direct, adverse impact on the job-related safety, security, trust, regulatory compliance, or suitability for this role. Such findings may result in withdrawal of a conditional job offer.", "responsibilities": "As business process owner within the Material Domain, The Supply Chain Manager is responsible for overseeing requests for material master creation, changes and maintenance with respect to companywide processes and procedures for Commercial, Clinical and Raw Material Basic and Quality Master Data for GPLM, Oracle E Business Suite (EBS) and Kinaxis Rapid Response.\nThis position is the focal point for Material Master Data creation and maintenance and requires collaboration with multi-functional departments to develop master data business rules and processes that support operational efficiency throughout the organization.\nThis role will partner with various stakeholder groups to develop and manage data activities including data definition, establishing and managing data standards and processes, data quality management, transforming and readying Master data for use in current EBS system, boundary systems and analytical tools, and future SAP system.\n\nResponsibilities of the Supply Chain Specialist – Master Data Management Include:\nServe as an expert for master data creation and maintenance; provides support as required\nExecutes the Enterprise Data and Governance strategy; Master Data Management, Data Standardization & Curation, Data Quality, Data Assurance, Data Discovery, Data Enablement and Data Usage for the enterprise\nFoster stakeholder adherence to effective Data Management and Governance structure, policies, practices, tools, workflows and operations with extended teams\nDrives continuous improvement of client data management through organizational and business process improvement projects.\nDocument issues and collaborate with business and IT team to troubleshoot issues and define solutions\nSupports testing of material creation and workflow in the ERP system in accordance with scheduled timelines\nCollaborates with groups authoring specifications for all Kite materials – raw materials, Subassemblies, cell banks, viral vectors, and finished products and approve specification documents\nMonitor functional area data quality reports and metrics identifying master data errors and identify revisions to data quality reports, new tools and/or processes to proactively prevent, identify, monitor and correct master data errors to resolution\nSupports smooth operations throughout product lifecycle by serving as center of expertise for maintaining Kite ERP-SCM Master Data attributes according to defined standards", "qualifications": {"required": "6+ years of relevant experience in related field and a BS or BA; or 2+ years of relevant experience and a MA/MBA/MS;\nPrior work experience in the Pharmaceutical, Life Sciences, or related medical or chemical manufacturing field\nPrior work experience with GMP/GXP standards\nBA/BS or MA/MS in Supply Chain, engineering or science discipline. or Industrial Engineering\nExperience with the following systems/software: Kinaxis RapidResponse or other scheduling/planning tools.\nExperience with ERP systems such as Oracle EBS, SAP or with GxP systems or other pharmaceutical product management systems\nSelf-motivated and able to drive cross functional alignment on master data practices\nAbility to understand big picture planning and connect master data management impacts/risks", "preferred": null}, "skills": ["Master data governance and maintenance", "Supply Chain Planning", "EBS and/or SAP expertise (master data and production planning)", "Project management", "Data Analysis", "Functional Collaboration"], "postedDate": "4 weeks ago", "benefits": "SPECTRAFORCE offers ACA compliant health benefits as well as dental, vision, accident, critical illness, voluntary life, and hospital indemnity insurances to eligible employees. Additional benefits offered to eligible employees include commuter benefits, 401K plan with matching, and a referral bonus program. SPECTRAFORCE provides unpaid leave as well as paid sick leave when required by law.", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4004881461"}