{"jobTitle": "Coordinator, Human Resources", "company": {"name": "NBCUniversal", "location": "Universal City, CA", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "50,000 - 65,000", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "description": "We create world-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world-renowned theme parks and attractions through Universal Destinations &amp; Experiences. NBCUniversal is a subsidiary of Comcast Corporation.<br/><br/>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever-changing face of the world.<br/><br/><strong>Here We Can Offer You<br/><br/></strong><ul><li>An investment in your education &amp; development</li><li>A variety of benefits &amp; perks that focus on YOU, in helping to achieve the work/life balance you deserve</li><li>Generous paid time off</li><li>Deeply discounted rates on Xfinity</li><li>Annual Universal Parks tickets</li><li>Chances to see unique performances or attend once in a lifetime event<br/><br/></li></ul><strong>Job Description<br/><br/></strong><strong>Here you can:<br/><br/></strong>The Enterprise Engineering HR team at NBCUniversal is looking for a high-energy, results-driven and innovative HR Coordinator. The role is a perfect launch pad for someone interested in a career in HR providing experience in both generalist and specialist work.<br/><br/>We support the Operations and Technology business at NBCU with a rich history in Film &amp; TV as well as industry-leading Engineering products and services.<br/><br/>In this role, you will be the central nervous system of our HR team supporting our diverse group of employees. You will also have exposure to HR projects that span: onboarding, rewards and recognition, performance feedback, talent attraction and development, and HR’s business impact. In the day to day, you will help solve problems involving: Benefits, Payroll, Compensation, HR Operations, Talent Acquisition, Finance and Data Analytics.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Serve as primary expert for all HR systems and transactions to keep our business running</li><li>Keep Engineering and the HR team in compliance, up to date and ready for any task or project</li><li>Run as point person to onboard all new hires – getting the legal part done but also making for a great start to their new career</li><li>Manage and audit our HR data to ensure our HR systems, reports, and org charts are always up to date, accurate, and consistent across multiple business units</li><li> Be the data analyst able to generate meaningful metrics and tell a story with data as needed, for a complex organization of over 1000 people</li><li>Willingly and competently step into a project driver role as needed for HR team projects both local and company-wide</li><li>Bring your creativity to ideate and execute programs to communicate and engage our employees throughout their work-life</li><li>Keep the team ahead of the curve through proactive industry awareness and research<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>What you’ll need:<br/><br/></strong><ul><li>1+ years of work experience</li><li>Bachelor’s Degree OR equivalent work experience</li><li>Proficient knowledge of Microsoft Excel, PowerPoint, and Outlook<br/><br/></li></ul><strong>Come Join Us If You Are<br/><br/></strong><ul><li>Able to maintain confidentiality and use discretion</li><li>Strong in interpersonal &amp; communication skills with an ability to interact with people at all levels</li><li>Someone who demonstrates accountability, thinks critically, independently, and presents solutions</li><li>A self-starter who takes initiative</li><li>Resourceful and able to anticipate/see around corners</li><li>Able to adapt quickly in a fast-paced, dynamic work environment</li><li>Have excellent organizational skills</li><li>Process orientated, detail oriented, and have great follow through skills</li><li>Can prioritize responsibilities</li><li>Customer service orientated</li><li>Interested in a career in HR<br/><br/></li></ul><strong>Eligibility Requirements<br/><br/></strong><ul><li>Must be willing to work in Universal City, CA a minimum of 3 days/week</li><li>Must be willing to work overtime when required</li><li>Must be willing to travel for work related business if necessary<br/><br/></li></ul><strong>Hybrid</strong>: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.<br/><br/>This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $50,000 - $65,000.<br/><br/><strong>Additional Information<br/><br/></strong>NBCUniversal's policy is to provide equal employment opportunities to all applicants<br/><br/>and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation,<br/><br/>marital status, pregnancy, veteran status, membership in the uniformed services,<br/><br/>genetic information, or any other basis protected by applicable law.<br/><br/>NBCUniversal will consider for employment qualified applicants with criminal histories,<br/><br/>or arrest or conviction records, in a manner consistent with relevant legal<br/><br/>requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring<br/><br/>Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.<br/><br/>If you are a qualified individual with a disability or a disabled veteran, you have the<br/><br/>right to request a reasonable accommodation if you are unable or limited in your<br/><br/>ability to use or access nbcunicareers.com as a result of your disability. You can<br/><br/>request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.", "responsibilities": "The Enterprise Engineering HR team at NBCUniversal is looking for a high-energy, results-driven and innovative HR Coordinator. The role is a perfect launch pad for someone interested in a career in HR providing experience in both generalist and specialist work.<br/><br/>We support the Operations and Technology business at NBCU with a rich history in Film &amp; TV as well as industry-leading Engineering products and services.<br/><br/>In this role, you will be the central nervous system of our HR team supporting our diverse group of employees. You will also have exposure to HR projects that span: onboarding, rewards and recognition, performance feedback, talent attraction and development, and HR’s business impact. In the day to day, you will help solve problems involving: Benefits, Payroll, Compensation, HR Operations, Talent Acquisition, Finance and Data Analytics.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Serve as primary expert for all HR systems and transactions to keep our business running</li><li>Keep Engineering and the HR team in compliance, up to date and ready for any task or project</li><li>Run as point person to onboard all new hires – getting the legal part done but also making for a great start to their new career</li><li>Manage and audit our HR data to ensure our HR systems, reports, and org charts are always up to date, accurate, and consistent across multiple business units</li><li> Be the data analyst able to generate meaningful metrics and tell a story with data as needed, for a complex organization of over 1000 people</li><li>Willingly and competently step into a project driver role as needed for HR team projects both local and company-wide</li><li>Bring your creativity to ideate and execute programs to communicate and engage our employees throughout their work-life</li><li>Keep the team ahead of the curve through proactive industry awareness and research<br/><br/></li></ul>", "qualifications": {"required": "1+ years of work experience, Bachelor’s Degree OR equivalent work experience, Proficient knowledge of Microsoft Excel, PowerPoint, and Outlook", "preferred": null}, "skills": ["Microsoft Excel", "PowerPoint", "Outlook"], "postedDate": "1 day ago", "applicationDeadline": null, "benefits": "An investment in your education &amp; development, A variety of benefits &amp; perks that focus on YOU, in helping to achieve the work/life balance you deserve, Generous paid time off, Deeply discounted rates on Xfinity, Annual Universal Parks tickets, Chances to see unique performances or attend once in a lifetime event", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/4004395646"}