{"jobTitle": "Brand Manager", "company": {"name": "Circle", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$130,000.00 - $170,000.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Financial Services", "description": "Circle is a financial technology company at the epicenter of the emerging internet of money, where value can finally travel like other digital data — globally, nearly instantly and less expensively than legacy settlement systems. This ground-breaking new internet layer opens up previously unimaginable possibilities for payments, commerce and markets that can help raise global economic prosperity and enhance inclusion. Our infrastructure – including USDC, a blockchain-based dollar – helps businesses, institutions and developers harness these breakthroughs and capitalize on this major turning point in the evolution of money and technology.<br/><br/><strong>What you’ll be part of:<br/><br/></strong>Circle is committed to visibility and stability in everything we do. As we grow as an organization, we're expanding into some of the world's strongest jurisdictions. Speed and efficiency are motivators for our success and our employees live by our company values: Multistakeholder, Mindfulness, Driven by Excellence and High Integrity. Circlers are consistently evolving in a remote world where strength in numbers fuels team success. We have built a flexible and diverse work environment where new ideas are encouraged and everyone is a stakeholder.<br/><br/><strong>What you’ll be responsible for:<br/><br/></strong>Circle is seeking an experienced and highly motivated Brand Manager / Brand Specialist to join the Brand Strategy team. This position will define and develop brand messaging to help increase awareness, familiarity, and affinity with Circle brands and sub-brands, with a focus on emerging markets. The Senior Brand Manager should bring expertise developing brand strategies, messaging frameworks, and insights; an interest in emerging technologies and/or the financial technology/Web3 space; and a passion for building brands that are redefining the status quo. This role will shape Circle’s brand growth by conducting and interpreting research, developing strategic frameworks, and collaborating with internal stakeholders (across Marketing, Product, and Business teams) to guide marketing activations and implementation. The Senior Brand Manager should bring experience building global or emerging brands in the technology space, with a focus on new, disruptive technologies.<br/><br/><strong>What you’ll work on: <br/><br/></strong><ul><li>Develop brand messaging frameworks for Circle brands and sub-brands, focusing on international markets</li><li>Integrate regional insights and business objectives to inform narratives and positioning, creating fresh messaging approaches that connect with audience needs</li><li>Analyze brands across the ecosystem and adjacent technology landscape to inform positioning strategies</li><li>Manage implementation of messaging, collaborating with Marketing, Communications, Business, and Product to guide activations across channels, audiences, and touchpoints</li><li>Supervise and contribute to production of marketing content across web, events, organic and paid social, and print/digital campaigns</li><li>Work with Partner Marketing to guide partner brand activations, focusing on key strategic partners</li><li>Work with Integrated Campaigns to ensure the brand is appropriately represented in all campaigns work, across the funnel</li><li>Work with Influencer Marketing to enhance brand awareness and reach target audiences globally</li><li>Integrate insights from partners, campaign audiences, and content creators to inform future brand strategies</li><li>Collaborate with the Creative Lab to guide brand expression, driving clarity and consistency while elevating purpose and creating meaningful connections with audiences<br/><br/></li></ul><strong>You will aspire to our four core values:<br/><br/></strong><ul><li>Multistakeholder - you have dedication and commitment to our customers, shareholders, employees &amp; families, and local communities.</li><li>Mindful - you seek to be respectful, an active listener and to pay attention to detail. </li><li>Driven by Excellence - you are driven by our mission and our passion for customer success which means you relentlessly pursue excellence, that you do not tolerate mediocrity and you work intensely to achieve your goals. </li><li>High Integrity - you seek open and honest communication, and you hold yourself to very high moral and ethical standards. You reject manipulation, dishonesty, and intolerance.<br/><br/></li></ul><strong>What you’ll bring: <br/><br/></strong><ul><li>7-10 years’ experience in Brand Strategy, Integrated Marketing, and/or Product Marketing, with an emphasis on messaging and building global technology brands</li><li>Proven track record of developing and implementing successful brand strategies that drive growth</li><li>Exceptional writing ability, with the ability to adapt message and tone for a variety of audiences (as well as experience with both B2B and B2C)</li><li>Expertise in working with insights and data, building insights-backed strategies, measuring brand growth, and building internal reports</li><li>A history of positive working relationships with Creative teams, with experience collaborating to produce beautiful, groundbreaking, and resonant work</li><li>Excellent interpersonal communication and collaboration skills. A team player for whom no task is too great or too small.</li><li>A working understanding of or interest in the Web3/digital currency space preferred</li><li>A passion for learning new technologies</li><li>Agency experience preferred<br/><br/></li></ul><strong>Additional Information:<br/><br/></strong><ul><li>This position is eligible for day-one PERM sponsorship for qualified candidates.<br/><br/></li></ul><em>Circle is on a mission to create an inclusive financial future, with transparency at our core. We consider a wide variety of elements when crafting our compensation ranges and total compensation packages.<br/><br/></em><em>Starting pay is determined by various factors, including but not limited to: relevant experience, skill set, qualifications, and other business and organizational needs. Please note that compensation ranges may differ for candidates in other locations.<br/><br/></em><em>Base Pay Range: $130,000 - $170,000<br/><br/></em><em>Annual Bonus Target: 15%<br/><br/></em><em>Also Included: Equity &amp; Benefits (including medical, dental, vision and 401(k)). Circle has a discretionary vacation policy. We also provide 10 days of paid sick leave per year and 11 paid holidays per year in the U.S.<br/><br/></em>We are an <strong>equal opportunity employer</strong> and value diversity at Circle. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Additionally, Circle participates in the <strong>E-Verify Program</strong> in certain locations, as required by law.<br/><br/>", "responsibilities": "Circle is seeking an experienced and highly motivated Brand Manager / Brand Specialist to join the Brand Strategy team. This position will define and develop brand messaging to help increase awareness, familiarity, and affinity with Circle brands and sub-brands, with a focus on emerging markets. The Senior Brand Manager should bring expertise developing brand strategies, messaging frameworks, and insights; an interest in emerging technologies and/or the financial technology/Web3 space; and a passion for building brands that are redefining the status quo. This role will shape Circle’s brand growth by conducting and interpreting research, developing strategic frameworks, and collaborating with internal stakeholders (across Marketing, Product, and Business teams) to guide marketing activations and implementation. The Senior Brand Manager should bring experience building global or emerging brands in the technology space, with a focus on new, disruptive technologies.", "qualifications": {"required": "7-10 years’ experience in Brand Strategy, Integrated Marketing, and/or Product Marketing, with an emphasis on messaging and building global technology brands\nProven track record of developing and implementing successful brand strategies that drive growth\nExceptional writing ability, with the ability to adapt message and tone for a variety of audiences (as well as experience with both B2B and B2C)\nExpertise in working with insights and data, building insights-backed strategies, measuring brand growth, and building internal reports\nA history of positive working relationships with Creative teams, with experience collaborating to produce beautiful, groundbreaking, and resonant work\nExcellent interpersonal communication and collaboration skills. A team player for whom no task is too great or too small.", "preferred": "A working understanding of or interest in the Web3/digital currency space preferred\nA passion for learning new technologies\nAgency experience preferred"}, "skills": ["Brand Strategy", "Integrated Marketing", "Product Marketing", "Messaging", "Global Technology Brands", "Brand Strategies", "Growth", "Writing", "B2B", "B2C", "Insights", "Data", "Internal Reports", "Creative Teams", "Collaboration", "Web3", "Digital Currency", "New Technologies", "Agency Experience"], "postedDate": "4 days ago", "benefits": "Base Pay Range: $130,000 - $170,000<br/><br/>Annual Bonus Target: 15%<br/><br/>Also Included: Equity &amp; Benefits (including medical, dental, vision and 401(k)). Circle has a discretionary vacation policy. We also provide 10 days of paid sick leave per year and 11 paid holidays per year in the U.S.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4004491132"}