{"jobTitle": "Sr. Business Applications Analyst", "company": {"name": "Jobot Consulting", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Not Applicable", "salary": {"amount": "$55.00/hr - $65.00/hr", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Software Development, Technology, Information and Internet, and Technology, Information and Media", "description": "Want to learn more about this role and Jobot Consulting? Click our Jobot Consulting logo and follow our LinkedIn page!<br/><br/>Job details<br/><br/><strong>100% remote PST hours - Looking for strong Kronos Timekeeping and Scheduling application configuration and hopefully support the interfaces and reporting within the solution.<br/><br/></strong>This Jobot Consulting Job is hosted by Brett Walker<br/><br/>Are you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.<br/><br/>Salary $55 - $65 per hour<br/><br/><strong>A Bit About Us<br/><br/></strong>A leading healthcare system on the west coast looking for a strong Business Apps Analyst who specifically works within Kronos Timekeeping and Scheduling. Also, Kronos Work Force Central (WFC). \"We're looking for someone who can actually configure the applications and hopefully also support the interfaces and reporting within the solution.<br/><br/>Apply today!<br/><br/><strong><br/><br/><strong>Why join us?<br/><br/><br/></strong></strong>100% Remote Contract / PST Hours<br/><br/>6 Month initially contract with options to end long term<br/><br/>Possible CtH options if interested<br/><br/>Top Tier Benefits from Blue Cross<br/><br/>Apply today to learn more about this long term contract!<br/><br/><strong>Job Details<br/><br/></strong><ul><li> The Business Application Analyst, Senior will work with external vendors, system owners, community partners, contractors, and client leadership to design, develop, implement, and make operational Business Application information systems. </li><li> Focus for this specific position is Kronos Timekeeping and Scheduling. Specifically experience with Kronos Work Force Central (WFC). As an added plus, experience with UKG Pro Workforce Management (also known as Kronos Dimensions). However, since that product is relatively new it isn’t necessarily required. We’re looking for someone that can actually configure the applications and hopefully also support the interfaces and reporting within the solution.</li><li> This incumbent will identify, and document design specifications based on analysis/assessment of user needs and generate need-gap analyses. </li><li> This person will use knowledge to generate and develop system scope and objective, analyze, and evaluate existing or proposed systems and devise or modify procedures to solve problems using data processing. </li><li> Incumbent acts as an application administrator by ensuring data integrity, maintaining system security, extracting, analyzing, and transforming data, facilitating user/vendor communication, and managing software upgrades, implementations and/or conversions. </li><li> The incumbent also understands the functional workflow and processes of the Departments (s)he supports and maintains system functionality and design in support of workflow efficiency and user/department productivity.</li><li> Incumbent will analyze, plan, design, create and maintain intermediate to advance level reports leveraging client's various technologies including but not limited to SQL, QlikView, Lawson Business Intelligence, Infor Business Intelligence, and Kronos Genies. <br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li> 5+ years of relevant work experience </li><li> Bachelor’s Degree in Computer Science, Information Systems, Computer Engineering or related field or equivalent work experience of 9 years without Bachelor’s</li><li> 3+ years’ experience in IS Healthcare Setting </li><li> 2 years’ experience in full life cycle implementations (from scoping/planning, requirements gathering, design, development, testing and go-live support. </li><li> Experience with Kronos, Lawson, Oracle, PeopleSoft, Finance and/or Procurement/Supply chain<br/><br/></li></ul>Interested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.<br/><br/><strong>Want to learn more about this role and Jobot Consulting?<br/><br/></strong>Click our Jobot Consulting logo and follow our LinkedIn page!<br/><br/>", "responsibilities": "The Business Application Analyst, Senior will work with external vendors, system owners, community partners, contractors, and client leadership to design, develop, implement, and make operational Business Application information systems.  Focus for this specific position is Kronos Timekeeping and Scheduling. Specifically experience with Kronos Work Force Central (WFC). As an added plus, experience with UKG Pro Workforce Management (also known as Kronos Dimensions). However, since that product is relatively new it isn’t necessarily required. We’re looking for someone that can actually configure the applications and hopefully also support the interfaces and reporting within the solution. This incumbent will identify, and document design specifications based on analysis/assessment of user needs and generate need-gap analyses.  This person will use knowledge to generate and develop system scope and objective, analyze, and evaluate existing or proposed systems and devise or modify procedures to solve problems using data processing.  Incumbent acts as an application administrator by ensuring data integrity, maintaining system security, extracting, analyzing, and transforming data, facilitating user/vendor communication, and managing software upgrades, implementations and/or conversions.  The incumbent also understands the functional workflow and processes of the Departments (s)he supports and maintains system functionality and design in support of workflow efficiency and user/department productivity. Incumbent will analyze, plan, design, create and maintain intermediate to advance level reports leveraging client's various technologies including but not limited to SQL, QlikView, Lawson Business Intelligence, Infor Business Intelligence, and Kronos Genies. ", "qualifications": {"required": "5+ years of relevant work experience  Bachelor’s Degree in Computer Science, Information Systems, Computer Engineering or related field or equivalent work experience of 9 years without Bachelor’s 3+ years’ experience in IS Healthcare Setting  2 years’ experience in full life cycle implementations (from scoping/planning, requirements gathering, design, development, testing and go-live support.  Experience with Kronos, Lawson, Oracle, PeopleSoft, Finance and/or Procurement/Supply chain", "preferred": ""}, "skills": ["Kronos", "Lawson", "Oracle", "PeopleSoft", "Finance", "Procurement", "Supply Chain", "SQL", "QlikView", "Lawson Business Intelligence", "Infor Business Intelligence", "Kronos Genies"], "postedDate": "2 days ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4004940751"}