{"jobTitle": "Director of Contract Logistics", "company": {"name": "Kogeo 3PL", "location": "Riverside, CA"}, "location": "Riverside, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "100,000.00/yr - 130,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Job Summary:  The Director of Contract Logistics Business Development will be responsible for identifying and overseeing all of KOGEO’s new business opportunities in the North American Region. KOGEOS, target clientele are those within the Food and Beverage industry, including alcohol. The goal for the Director of Contract Logistics Business Development is to cultivate strong business relationships while increasing revenue and profitability. This position requires strong leadership skills, excellent communication skills, vigorous negotiation skills, an understanding of logistics processes and a strategic mindset.Salary:  100k---130kLocation: Hybrid remote and in office days in Riverside, CA  Scheduled--- Monday to FridayHours:  8:30am to 5pm  Responsibilities:  Building and maintaining relationships with prospects, vendors, and other internal partners to negotiate favorable terms and ensure growth targets are met.Identify areas of Business sales improvement by analyzing and monitoring key performance indicators (KPI’s).Collaborating with senior executives and managers to align the Business Development department with the overall business strategy and objectives.Managing sales team as well as giving motivation and strong leadership.Maintain and develop new business account relationships by educating yourself on the customers’ business needs.Amplify business opportunities by engaging with external partners, industry leaders and suppliers.Represent the Company in major networking events, conferences, expositions and business meetings.Remain competitive and innovative by improving commercial contracts/financials to maximize company profits.Increase business portfolio by engaging in standard processes, implementation, presentations.Create and maintain SOP for the Business Development team.Identify potential opportunities by anticipating industry trends.Travel to networking events, customer/prospect meetings and site visits.Monitor/assist client presentation and proposals.Develop succession planning and workforce optimizations initiatives.Negotiates fees, closes sales orders and obtains signed contract with pricing approval.Uphold company policies as well as holding management team to company policy standards.Follow company policies and procedures, including those related to safety and quality control.Other tasks assigned.Qualifications:  4 year degree in Supply Chain, Business or Logistics, preferred.Minimum of 7 years in Sales operation leadership experience within Supply Chain and Logistics/3PL.Experience of over 7 years within the Beverage, Food or Alcohol industry required.Bilingual in English and Spanish, preferred.Knowledge of the continuous improvement processes.Strong financial acumen required.Attention to detail and a commitment to accuracy in all tasks.Strong negotiation and project management skills.Advanced computer skills including Excel, Word and Outlook.Excellent organizational and analytical skills.Strong leadership and interpersonal skills.Flexibility to work various shifts, including weekends, as needed.Able and willing to work in a different office location if and when needed.Reliable transportation.Physical Requirements and Environmental Conditions:  Ability to lift and carry heavy objects weighing up to 40 pounds on a regular basis.Physical stamina and endurance to perform repetitive tasks, including bending, lifting, stooping, and standing for extended periods.Ability to work in a fast-paced environment and adapt to changing priorities.Must be able to work in various weather and temperature conditions to include extreme heat, humidity, and cold.Ability to hear and understand audible signals and instructions in a noisy environment.Good vision, including depth perception and peripheral vision navigate through the facility.Exposure to loud noises and vibration.Clear verbal and nonverbal communication abilities to follow instructions, collaborate with team members, and report any safety concerns promptly.Ability to maneuver within confined spaces, climb ladders, work on elevated platforms, and maintain balance while walking on uneven surfaces.Manual Dexterity for safely handling, manipulating, and controlling various sizes of items, packages, and machinery.NOTE  This job description is not a complete list nor implies that these are the only duties to be performed by the employee(s) in this position. Employees will be required to follow any other job-related instructions and to perform any other job-related duties requested by any person authorized to give instructions or assignments. All duties and responsibilities are essential functions and requirements and are subject to possible modification to reasonably accommodate individuals with disabilities. To perform this job successfully, the incumbents will possess the skills, aptitudes, and abilities to perform each duty proficiently. Some requirements may exclude individuals who pose a direct threat or significant risk to the health or safety of themselves or others. The requirements listed in this document are the minimum levels of knowledge, skills, or abilities. This document does not create an employment contract, implied or otherwise, other than an “at will” relationship.", "responsibilities": "Building and maintaining relationships with prospects, vendors, and other internal partners to negotiate favorable terms and ensure growth targets are met.Identify areas of Business sales improvement by analyzing and monitoring key performance indicators (KPI’s).Collaborating with senior executives and managers to align the Business Development department with the overall business strategy and objectives.Managing sales team as well as giving motivation and strong leadership.Maintain and develop new business account relationships by educating yourself on the customers’ business needs.Amplify business opportunities by engaging with external partners, industry leaders and suppliers.Represent the Company in major networking events, conferences, expositions and business meetings.Remain competitive and innovative by improving commercial contracts/financials to maximize company profits.Increase business portfolio by engaging in standard processes, implementation, presentations.Create and maintain SOP for the Business Development team.Identify potential opportunities by anticipating industry trends.Travel to networking events, customer/prospect meetings and site visits.Monitor/assist client presentation and proposals.Develop succession planning and workforce optimizations initiatives.Negotiates fees, closes sales orders and obtains signed contract with pricing approval.Uphold company policies as well as holding management team to company policy standards.Follow company policies and procedures, including those related to safety and quality control.Other tasks assigned.", "qualifications": {"required": "Minimum of 7 years in Sales operation leadership experience within Supply Chain and Logistics/3PL.Experience of over 7 years within the Beverage, Food or Alcohol industry required.Strong financial acumen required.Attention to detail and a commitment to accuracy in all tasks.Strong negotiation and project management skills.Advanced computer skills including Excel, Word and Outlook.Excellent organizational and analytical skills.Strong leadership and interpersonal skills.Flexibility to work various shifts, including weekends, as needed.Able and willing to work in a different office location if and when needed.Reliable transportation.", "preferred": "4 year degree in Supply Chain, Business or Logistics, preferred.Bilingual in English and Spanish, preferred.Knowledge of the continuous improvement processes."}, "skills": ["Supply Chain", "Logistics", "Sales", "Business Development", "Leadership", "Negotiation", "Project Management", "Financial Acumen", "Excel", "Word", "Outlook", "Organizational Skills", "Analytical Skills", "Interpersonal Skills", "Continuous Improvement"], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4004714151"}