{"jobTitle": "Talent Buyer Assistant", "company": {"name": "AEG", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Purchasing and Supply Chain", "industry": "Entertainment Providers", "description": "For more than 20 years, AEG has played a pivotal role in transforming sports and live entertainment. Annually, we host more than 160 million guests, promote more than 10,000 shows and present more than 22,000 events around the world. We are committed to innovation, artistry, and community, and leverage the power of our 300+ venues, leading sports franchises, marquee music brands, integrated entertainment districts, premier ticketing platform and global sponsorship activations, to create memorable moments that give the world reason to cheer.<br/><br/>Our business is interwoven with the human mind and heart, and we strive to build a diverse and inclusive company that reflects the artists, athletes, and fans that we host; reach beyond traditional boundaries to support the communities in which we operate; and minimize our impact on the environment by adopting sustainable practices throughout our business operations.<br/><br/>If you want to be challenged to up your game and make a difference, then join us in giving the world reason to cheer!<br/><br/><strong>Position Summary:<br/><br/></strong>The Talent Buyer Assistant will support the Talent Buyer with the booking of events and shows. This position will draft offers to be submitted to artists and venues. The Talent Buyer Assistant will coordinate availability of both artists and venues to create calendar holds for shows and events. Additionally, they will assist in the maintenance of show files and the settlement of shows.<br/><br/><strong>Essential Functions:<br/><br/></strong><ul><li>Assist Talent Buyer with the booking of events. Draft offers for artists and venues based on projected ticket sales. Reach out to venues to place calendar holds and coordinate with the availability of an artist.</li><li>Submit offers to venues and agents. Follow up to ensure that appropriate documents are in order. Assist with ticket pricing, royalties, marketing, budgeting, and catering.</li><li>Advance shows on the day of an event. Ensure that artist and vendors arrive, parking is available, and show advances on schedule.</li><li>Maintain show files. Update information if changes are made and if new information is made available. </li><li>Compile all relevant invoices for settlement of shows, scan documents into internal drive-ELVIS and issue payments for vendors and its appropriate parties.</li><li>Responsible for various administrative tasks including submission of checks and contracts, ordering of petty cash, and revision of contracts for vendors and artists.</li><li>Works with ticketing on sale announcement. Confirm accuracy of online announcements that they go out in a timely manner. </li><li>May be responsible for various festival related tasks including: booking of hotels, credentials, artist’s needs and updating show sheets, ensuring vendor forms have been completed correctly, and ensuring all vendors have all essential materials.<br/><br/><br/></li></ul><strong>Required Qualifications:<br/><br/></strong><ul><li>Bilingual verbal and written Spanish (fluent)</li><li>A minimum education level of: High School Diploma or its equivalency (BA/BS preferred)</li><li>1 years of related work experience in the music industry</li><li>Computer savvy with knowledge of Microsoft Office (Word, Excel, Outlook)</li><li>Ability to navigate social media platforms</li><li>Strong interpersonal, as well as written and verbal communication skills</li><li>Ability to work independently and as part of a team</li><li>Ability to prioritize tasks and work in a fast paced environment</li><li>Highly organized with the ability to multitask</li><li>Ability and willing to work nights, weekends and holidays as required</li><li>20% travel required</li><li>Experience in Photoshop preferred</li><li>Knowledge of the music industry preferred<br/><br/><br/></li></ul>Pay Scale: $20.15 - $26.43<br/><br/>AEG reserves the right to change or modify the employee’s job description whether orally or in writing, at any time during the employment relationship. AEG may require an employee to perform duties outside thier normal description.", "responsibilities": "The Talent Buyer Assistant will support the Talent Buyer with the booking of events and shows. This position will draft offers to be submitted to artists and venues. The Talent Buyer Assistant will coordinate availability of both artists and venues to create calendar holds for shows and events. Additionally, they will assist in the maintenance of show files and the settlement of shows.", "qualifications": {"required": "Bilingual verbal and written Spanish (fluent), A minimum education level of: High School Diploma or its equivalency (BA/BS preferred), 1 years of related work experience in the music industry, Computer savvy with knowledge of Microsoft Office (Word, Excel, Outlook), Ability to navigate social media platforms, Strong interpersonal, as well as written and verbal communication skills, Ability to work independently and as part of a team, Ability to prioritize tasks and work in a fast paced environment, Highly organized with the ability to multitask, Ability and willing to work nights, weekends and holidays as required, 20% travel required", "preferred": "Experience in Photoshop, Knowledge of the music industry"}, "skills": ["Spanish", "Microsoft Office", "Social Media", "Communication", "Teamwork", "Organization", "Multitasking"], "postedDate": "2 days ago", "salary": {"amount": "20.15 - 26.43", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4004231995"}