{"jobTitle": "Merchandise Coordinator", "company": {"name": "Solomon Page", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Associate", "jobFunction": "Administrative and Distribution", "industry": "Retail Apparel and Fashion and Entertainment Providers", "description": "Our client, a large entertainment company with an office in Glendale, California is looking for Merchandise Coordinator to join their Consumer Products team for a 6 month contract! Please note - this role will work onsite Monday through Thursday with Friday remote.", "responsibilities": "Provide operational support for the department (placement grids, management and execution of the assortment and vendor base)\nMaintain the assigned department's range plan including item setup, updates and stage sets\nPurchase order creation, maintenance and delivery tracking of all orders in the company database system\nManage daily promotional price change entries and departmental promotion activity\nManage licensed vendor setup, PRRs, gather testing reports and handle general vendor communication\nMaintain product flow documents to reflect stage set changes and process launch date changes\nManage incoming samples, archiving and storage\nCreate assortment line sheets\nObtain images and copy points needed for the website\nCoordinate and provide rework direction to Distribution Center for non-compliant or assorted sku orders\nCoordinate with the DC and inventory control to RTV (Return to Vendor) product as needed\nMaintain and update inventory chase log-weekly\nTrack inventory levels on dropship skus to ensure merchandise is in stock with licensee", "qualifications": {"required": "Bachelor's degree in a related field\n3+ years of experience in a Coordinator role\nStrong computer skills (Excel, Power Point, Word, Keynote)\nSelf-starter and motivated but able to ask for assistance when uncertain\nAbility to project manage and capable of meeting deadlines and dealing with time constraints\nPossess strong analytical and organizational skills\nExcellent interpersonal, solid written and verbal communication and presentation skills\nResourceful, innovative and responsive to change", "preferred": ""}, "skills": ["Excel", "PowerPoint", "Word", "Keynote"], "postedDate": "1 day ago", "applicationDeadline": "", "benefits": "Solomon Page offers a comprehensive benefit program for hourly employees. We pride ourselves on offering medical, dental, 401(k), direct deposit and commuter benefits to our employees, including freelancers - which sets us apart in the industries we serve.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004397013"}