{"jobTitle": "Manager, Data Analytics", "company": {"name": "ClickJobs.io", "industry": "Human Resources Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$142,600.00/yr - $191,100.00/yr", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Human Resources Services", "description": "About Direct-To-Consumer\n\nThe DTC Content Analytics team is looking for a Manager to lead the Sports Content vertical supporting the ESPN business unit. Our broader team partners closely with stakeholders across the DTC business and the wider TWDC organization to understand, analyze, and deliver impactful insights on content performance and audience engagement, with the Sports team focused on ESPN+ programming and live sporting events (both on ESPN+ and across platforms). Our team masters exploratory data analysis, advanced reporting, data modeling and visualizations that serve the dual purpose of driving business decision making and delivering fact-based actionable recommendations. This group supports teams within the ESPN business unit as well as key partners from DTC to generate insightful, compelling, and strategic analyses that help make a difference. The right person for this role has exceptional analytical capabilities, thrives in a fast-paced environment, loves problem-solving, is a good communicator, and is passionate about sports.", "responsibilities": "Provide leadership and set strategic vision and direction for the Sports Content Analytics team focused on ESPN+ content performance, cross-platform sports audience insights, and sports DTC programming strategy. Manage relationship with stakeholders across the ESPN and DTC business units. Partner closely with both business stakeholders and engineering partners to develop short and long-term roadmaps for sports content analysis and self-service solutions. Support in day-to-day business operations through quick analytics and ad-hoc insights. Develop and maintain core business logic, and key metrics for measuring streaming sports performance and audience behaviors across platforms. Oversee the development of operational dashboards in Looker and Tableau to understand performance over time, enable efficient exploratory analysis, and equip partners with self-serve tools. Drive team development through coaching, mentoring, training, and leadership growth.", "qualifications": {"required": "At least 8 years of relevant data analytics experience. 3+ years of experience managing teams of analysts. Proven track record of building and leading teams of analysts, data scientists, or data engineers. Extremely skilled at simplifying complex problems, distilling data, and constructing compelling narratives to guide decision making. Excellent relationship building and communication skills with all levels of the organization, from junior analysts to C-suite leaders. Expertise working with extremely large, disparate data sets and using SQL for data wrangling, designing ETLs, and analysis. Experience manipulating large data sets and interpreting data trends using a multitude of disparate data sources and tools. Fluent in data exploration and visualization tools such as Looker and Tableau. Very comfortable translating highly technical analyses into easily understandable insights for non-technical stakeholders. Working knowledge of the current sports consumer landscape and an understanding of viewership metrics.", "preferred": "Experience working with scripting languages such as Python or R. Experience in the streaming media industry and/or supporting a direct-to-consumer subscription-based product. Experience in the technology industry and knowledge of how to build and implement data products. Familiarity with data platforms and applications such as Databricks, Jupyter, Snowflake, Redshift, Airflow."}, "skills": ["Data Analytics", "SQL", "Looker", "Tableau", "Data Visualization", "Data Modeling", "Data Analysis", "Team Management", "Communication", "Problem Solving"], "postedDate": "3 days ago", "applicationDeadline": "Not specified", "benefits": "A bonus and/or long-term incentive units may be provided as part of the compensation package, in addition to the full range of medical, financial, and/or other benefits, dependent on the level and position offered.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4004300704"}