{"jobTitle": "VP Marketing Manager, Banking", "company": {"name": "Planet Green Search, LLC", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Marketing and Sales", "industry": "Staffing and Recruiting", "description": "Top Reasons To Work With Our Client<br/><br/>Scroll down to find the complete details of the job offer, including experience required and associated duties and tasks.<br/><br/>Medical, dental, vision and life insurance eligibly the first day of the month following employment!Several discount programs, Employee Assistant Program (EAP), several voluntary plans, Flexible Spending, Health Savings Account and more!401(k) pre-tax with matching contribution and Roth 401(k)!Free checking and savings accounts!Monthly stipend for cell phone expenses!Flexible work schedule!Beyond holidays, vacation and sick pay. Adoption assistance and leave options for medical, personal or family reasons including jury duty and military leave!Recognition programs, monetary rewards for new team members and more!<br/><br/>What You Will Be Doing<br/><br/>Coordinate and enforce branding guidelines and standards.Execute marketing strategy to meet brand recognition, and promotional goals.Develop, manage and execute all advertising, promotional materials and corporate event activities.Maintain all marketing systems and processes, technology and applications.Develop, organize, monitor and measure business acquisition campaigns.Create and manage strategic marketing plans, budgets, and forecasting.Develop and deploy shareholder communications.Stay updated on all marketing trends.Work closely with executive management.Multi-task and prioritize projects and ensure adherence to deadlines.Understand and comply with regulatory guidelines as they pertain to the job function.<br/><br/>Experience You Will Need<br/><br/>Experience in managing and motivating staff.Bachelor's degree from a four-year college or university.Five years of experience in B2B marketing, preferably in the financial industry.Excellent computer skills in a Microsoft Windows environment, including Word and Excel.Certified Financial Marketing Professional (CFMP) designation is preferred.Experience with Adobe Acrobat Bank Core System.<br/><br/>#J-18808-Ljbffr", "postedDate": "4 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004236045"}