{"jobTitle": "Logistics Specialist", "company": {"name": "ektello", "industry": "Telecommunications and Appliances, Electrical, and Electronics Manufacturing", "size": "Not specified", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Not specified", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "$20.00/hr - $25.00/hr", "currency": "USD"}, "jobFunction": "Supply Chain", "industry": "Telecommunications and Appliances, Electrical, and Electronics Manufacturing", "description": "**W2 Contract**Santa Ana, CA**ONSITE**$20-25/hr**\n\n**Bilingual Korean speaking candidates are a strong preference for this position**\n\n**Top Three Skillsets**\n- Industry knowledge\n- Excel/data analytic skills\n- Detail oriented\n\nThe main function of this position is to ensure smooth collection and validation of data, documents, and invoices via email with logistics colleagues, business partners, internal partners, and customers based on the logistic background or knowledge.", "responsibilities": "- Conduct collection of data and documents to support departments projects/activities.\n- Examine documents, materials and data to assess conformation to standards.\n- Coordinate and execute special project and ancillary services.\n- Work in a continuous improvement spirit across a highly-matrix working environment.\n- Complete all other duties as assigned.", "qualifications": {"required": "Bachelor’s or equivalent degree of experience. 0-2 years related experience required. Typically has general knowledge of logistics operations related to employee’s specific area of work, and limited knowledge of overall logistics operations. Excellent verbal and written communication. A team player. Previous experience with computer applications, such as Microsoft Excel and Word. High level of accuracy and efficiency. Detail Oriented. Works on problems of limited and routine scope where limited analysis of data requires identification of predetermined solutions. The ability to read, interpret, and understand product shipment information from various order and shipping documents to ensure accuracy and thorough preparation of transportation documents. Exercises judgment within defined practices and policies in selection of methods and techniques for obtaining solutions. Works on problems of limited and routine scope where limited analysis of data requires identification of predetermined solutions.", "preferred": "Bilingual Korean speaking candidates are a strong preference for this position."}, "skills": ["Industry knowledge", "Excel/data analytic skills", "Detail oriented"], "postedDate": "5 days ago", "applicationDeadline": "Not specified", "benefits": "Medical insurance, Dental insurance, Vision insurance, 401(k)", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4004880379"}