{"jobTitle": "Sales & Events Specialist - North LA", "company": {"name": "Milk Makeup", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Other and Sales", "industry": "Personal Care Product Manufacturing", "description": "<strong>Welcome to the MILK MAKEUP FAM:</strong><br/>At Milk Makeup, we believe in good ingredients + epic payoff. We’re cruelty-free, paraben-free, and 100% vegan.<br/>We were born at Milk, a creative studio in downtown New York City. Our community and culture have always been our inspiration.<br/>We see personal style and experimentation as the ultimate forms of self-expression. It’s not just about how you create your look; it’s what you do in it that matters.<br/>#LiveYourLook<br/><strong>Your VIBE: </strong><br/>• <strong>Naturally progressive</strong>: You’re curious and always thinking about how to improve your and your community’s future. You value a forward-thinking space that encourages you to move the needle and take risks.<br/>• <strong>Confident but chill: </strong>You’re flexible and ready to get the job done, but you’re humble and make moves thoughtfully. You go after what you want, but always have your team and the greater good of the brand in mind.<br/>• <strong>Rule breaker: </strong>You’re not afraid of the unknown. You’re down to disrupt the status quo and believe that an open mind is always a good place to start.<br/>• <strong>Inclusive + mindful of community:</strong> You embrace differences and help foster a safe working environment for yourself and your peers.<br/>• <strong>Champion of self-expression:</strong> You’re genuinely <em>you</em>. You live your look and want to grow with people who champion self-expression.<br/><strong>The Role: </strong><br/><strong> </strong><br/>The Milk Makeup Sales &amp; Events Specialist is a freelance ambassador for the brand that services our Sephora accounts. We are looking for a passionate brand advocate, beauty industry expert, and creative problem solver. The person should be strong in Education, sales driven to help grow the business in North LA, and hyper-focused on brand initiatives and building brand love and awareness.<br/><em>Please note this is a part-time position.</em><br/><strong>What YOU’ll do:</strong><br/><ul><li>Responsible for meeting Daily Sales Goals</li><li>Ensure brand image and operational standards are met</li><li>Communicate merchandising and stock issues to SD</li><li>Recap Regional Sales &amp; Education Executive after each visit</li><li>Drive brand recognition, awareness and loyalty by developing and maintaining relationships with Sephora leadership and BA’s</li><li>Training Sephora BA’s on new launches</li><li>Seeking out clients in store</li></ul>", "postedDate": "2 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004374286"}