{"jobTitle": "HR Generalist", "company": {"name": "Emtek Products", "location": "Irwindale, CA"}, "location": "Irwindale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$90,000.00/yr - $105,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Consumer Goods", "description": "Fortune Brands Innovations, Inc. is an industry-leading innovation company focused on creating smarter, safer and more beautiful homes and improving lives. Our driving purpose is that we elevate every life by transforming spaces into havens. We believe our work and our brands can have incredibly positive impacts for not just our business and shareholders, but for people and the planet, too.<br/><br/>When you join Fortune Brands, you become part of a high-performing team who are empowered to think big, learn fast and make bold decisions. We support an inclusive and diverse culture where everyone is encouraged and empowered to be their authentic selves, and where our differences and unique perspectives are a key strength.<br/><br/>Explore life at Fortune Brands here.<br/><br/><strong>Job Description<br/><br/></strong>The <strong>HR Generalist</strong> will provide support for the Emtek/Schaub headquarters location and members of the commercial team. This role is responsible for key HR activities including compliance, talent acquisition, change management initiatives, employee relations, performance management, employee engagement, and talent initiatives. This role partners closely with other matrix HR leaders in the organization that support associates at the Irwindale location.<br/><br/>The <strong>ideal candidate</strong> will be an agent for change, have at least 3 years experience as an HR Generalist or similar role in a commercial setting, have extensive knowledge of all HR functions including state, local, and federal laws and regulations, and have excellent interpersonal skills.<br/><br/><strong>Location: </strong>This role is eligible for a hybrid schedule based in our Irwindale, CA office location at least 3 days per week.<strong> (Tuesday, Wednesday, Thursday)<br/><br/></strong><strong>Salary: </strong>$90k - $105k/year<br/><br/><strong>What You Will Be Doing<br/><br/></strong><ul><li>Lead Labor Relations for Hourly and Salary Employees</li><li>Lead PAR Activities at the Manufacturing Plant.</li><li>Facilitating, promoting, and ensuring employee participation of the FBIN employee survey and employee experience activities.</li><li>Partner with management on driving change initiatives and providing insight and support in implementing effective strategies to maximize employee engagement, buy-in, and ensuring alignment with organizational objectives.</li><li>Assist with performance evaluations and goal planning providing input for talent development and performance management planning.</li><li>Facilitating and ensuring the completion of Open Enrollment</li><li>Promptly responding to the needs and concerns of the employees to sustain good employee relations. </li><li>Conducting, documenting, and concluding internal investigations, as needed.</li><li>Ensuring compliance with Company policies and procedures by enforcing guidelines and standards across the organization.</li><li>Ensure pay increases are justified, approved and administered according to pay scales and plan.</li><li>Oversee absence management, including site accountability for proper use of absence codes, tracking and consistently applying progressive discipline where needed. Ensure the utilization of absence management tools to reduce unplanned absenteeism.</li><li>Providing counsel, coaching, guidance and options to Site Leaders on HR policy and disciplinary matters to minimize legal exposure.</li><li>Utilize and implement effective processes to increase direct hiring of all employees while reducing dependence upon staffing agencies to improve turnover rates and talent.</li><li>Assisting and facilitating the recruiting, selection and onboarding activities.</li><li>Prepare HR reports on monthly basis and ad hoc basis, while analyzing data and collaborating on the appropriate countermeasures with the Director, Human Resources and Site Leaders. </li><li>Assist and collaborate with EHS regarding accident investigations, including taking statements, determining work-relatedness, assisting in root cause determination and establishing countermeasures. Communicate with worker’s comp carrier and overseeing claim management.</li><li>Ensure proper voluntary and involuntary termination approval and administration of processes.</li><li>Maintain and update job descriptions.</li><li>Oversee, facilitate and preserve the integrity of the internal job posting process to increase internal promotions.</li><li>Ensure compliance with all legal and regulatory compliance agencies as it relates to labor, wage and hour and employment laws; actively supports corporation's commitment to Affirmative Action.</li><li>Assures compliance with federal, state, local and corporate governance policies, regulations and laws, Emtek programs and policies and the FBIN Code of Conduct. </li><li>Continuously develop your HR expertise with ongoing learning opportunities<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>3+ years of experience as an HR Generalist or in a similar HR role</li><li>Well-versed in local, state, and federal employment laws and regulations</li><li>Proficiency in HR software and Microsoft Office applications</li><li>Ability to maintain confidentiality and handle sensitive information</li><li>Ability to prioritize and manage multiple projects</li><li>Strong attention to detail and reporting and analysis</li><li>Excellent critical thinking and creative problem-solving skills</li><li>Strong interpersonal and communication skills (written and oral)<br/><br/></li></ul><strong>Nice-to-Have<br/><br/></strong><ul><li>Associate degree or Equivalent Experience in Human Resources</li><li>Bilingual (English/Spanish)<br/><br/></li></ul><strong>Additional Information<br/><br/></strong>At Fortune Brands, we support the overall health and wellness of our associates by offering comprehensive, competitive benefits that prioritize all aspects of wellbeing and provide flexibility for our teammates’ unique needs. This includes robust health plans, a market-leading 401(k) program with a company contribution, product discounts, flexible time off benefits (including half-day summer Fridays per policy), inclusive fertility/adoption benefits, and more. We offer numerous Employee Resource Groups to support inclusivity and our associates’ feeling of belonging at work.<br/><br/>Fortune Brands is a brand, innovation and channel leader focused on exciting, supercharged categories in the home products, security and commercial building markets. Our portfolio of brands includes Moen, House of Rohl, Aqualisa, SpringWell, Therma-Tru, Larson, Fiberon, Master Lock, SentrySafe and Yale residential.<br/><br/>Fortune Brands is headquartered in Deerfield, Illinois and trades on the NYSE as FBIN.<br/><br/><strong>Equal Employment Opportunity<br/><br/></strong>FBIN is an equal employment opportunity employer and does not discriminate against any applicant based on race, color, religion, sex, gender identity or expression, national origin, ancestry, age, disability, marital status, protected veteran status, sexual orientation, genetic history or information, or any other legally protected characteristic.", "responsibilities": "The <strong>HR Generalist</strong> will provide support for the Emtek/Schaub headquarters location and members of the commercial team. This role is responsible for key HR activities including compliance, talent acquisition, change management initiatives, employee relations, performance management, employee engagement, and talent initiatives. This role partners closely with other matrix HR leaders in the organization that support associates at the Irwindale location.", "qualifications": {"required": "3+ years of experience as an HR Generalist or in a similar HR role, Well-versed in local, state, and federal employment laws and regulations, Proficiency in HR software and Microsoft Office applications, Ability to maintain confidentiality and handle sensitive information, Ability to prioritize and manage multiple projects, Strong attention to detail and reporting and analysis, Excellent critical thinking and creative problem-solving skills, Strong interpersonal and communication skills (written and oral)", "preferred": "Associate degree or Equivalent Experience in Human Resources, Bilingual (English/Spanish)"}, "skills": ["HR", "HR Generalist", "Labor Relations", "Employee Relations", "Performance Management", "Talent Acquisition", "Change Management", "Employee Engagement", "Talent Initiatives", "Compliance", "HR Software", "Microsoft Office", "Confidentiality", "Prioritization", "Project Management", "Attention to Detail", "Reporting", "Analysis", "Critical Thinking", "Problem Solving", "Interpersonal Skills", "Communication", "Bilingual", "English", "Spanish"], "postedDate": "2 days ago", "benefits": "At Fortune Brands, we support the overall health and wellness of our associates by offering comprehensive, competitive benefits that prioritize all aspects of wellbeing and provide flexibility for our teammates’ unique needs. This includes robust health plans, a market-leading 401(k) program with a company contribution, product discounts, flexible time off benefits (including half-day summer Fridays per policy), inclusive fertility/adoption benefits, and more. We offer numerous Employee Resource Groups to support inclusivity and our associates’ feeling of belonging at work.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004497667"}