{"jobTitle": "Chief Executive Officer", "company": {"name": "Cayton Children's Museum", "industry": "Museums, Historical Sites, and Zoos", "size": "40 employees", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "$175,000.00 - $200,000.00", "currency": "USD"}, "jobFunction": "Executive", "industry": "Museums, Historical Sites, and Zoos", "description": "The Board seeks a relationship builder and visionary to: refine the museum’s brand and strategy; shape content-rich play-based education for children ages 0 to 8 years; grow museum attendance and community engagement; and provide regularly refreshed programs for Santa Monica and Los Angeles-area families.", "responsibilities": "The CEO will lead and financially strengthen the Cayton as it continues its evolution as a unique institution that engages children through play and exploration to discover their own capability to learn, serve, lead and build. Celebrating five years in Santa Monica, this is the beginning of a key chapter at the Cayton. The CEO will be an inspiring leader who is active in the community and engages new supporters through genuine, authentic, strategic and consistent outreach.", "qualifications": {"required": "Strong management and leadership responsibility in a museum, school, children’s entertainment, or experiential learning environment that attracts a similar audience and is known for innovative programming; a deep understanding of ways to engage and build audience; and cultivating strong ties with the community in which their institution is located.", "preferred": "Deep and current experience in relationship building and raising the public profile of learning and play environments for children; an extensive background or passion for the education process would be an advantage."}, "skills": ["Leadership", "Strategic Planning", "Community Engagement", "Fundraising", "Program Development"], "postedDate": "3 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004728219"}