{"jobTitle": "Sales Buying Assistant", "company": {"name": "24 Seven Talent", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Contract-to-Hire", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Production, Sales, and Customer Service", "industry": "Retail Apparel and Fashion and Fashion Accessories Manufacturing", "description": "<strong>Sales Buying Assistant - Fashion Brand</strong><br/><strong>Location:</strong> Commerce, CA 90040<br/><strong>Type:</strong> Contract-to-Hire<br/><strong>Hours:</strong> Monday - Friday<br/><strong>Rate:</strong> up to $22 per hour<br/><br/><strong>About the Role:</strong><br/>Our client, a leading fashion brand known for its trendy and contemporary clothing for young women, is seeking a dynamic Sales Buying Assistant to join their team. The Sales Buying Assistant will play a key role in supporting the sales/buying team and ensuring an exceptional customer experience.<br/><br/><strong>Key Responsibilities:</strong><br/><ul><li>Provide outstanding customer service to both customers and prospects, addressing inquiries and resolving issues promptly.</li><li>Assist the sales team with various customer service tasks to facilitate smooth operations.</li><li>Create and maintain detailed records of line sheets based on buyer selections.</li><li>Take notes during sales meetings to ensure accurate documentation and follow-up.</li><li>Collaborate with design and production teams to support product development and fulfillment.</li><li>Coordinate the sending of fabric swatches and garment sample pictures to factories.</li></ul><br/><strong>Qualifications:</strong><br/><ul><li>College educated - ideally in fashion, merchandising, buying or product development </li><li>FIDM GRADS would be a plus!</li><li> Understanding of garment bodies and fashion trends</li><li> Basic understanding of retail metrics and terms</li><li>Strong written and verbal communication skills.</li><li>Proficiency in Microsoft Office Suite (Word, Excel, Outlook).</li><li>Knowledge of the clothing industry, particularly Kids, Junior Dresses, and Sportswear.</li><li>Retail experience is a plus.</li><li>Ability to multitask and thrive under pressure in a fast-paced environment.</li><li>Capability to work independently as well as collaboratively within a team.</li><li>Successful completion of drug and background checks required prior to starting.</li></ul>", "postedDate": "2 days ago", "skills": ["Customer Service", "Microsoft Office", "Retail", "Fashion", "Merchandising", "Buying", "Product Development", "Communication"], "url": "https://www.linkedin.com/jobs/view/4004625198"}