{"jobTitle": "Export Department Manager-Air and Ocean", "company": {"name": "Energy Jobline", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Compton, CA"}, "location": "Compton, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000-$110,000", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Job Description\n\nBaltimore MD or Los Angeles CA\n\nWho We Are\n\nWe offer you an exciting opportunity to join the fast-paced world of international logistics! Make a difference by joining an international team committed to providing the Ultimate Customer Experience, while remaining on the cutting edge of technology and working to improve our environment. When you join our team, you join a truly diverse, international organization in a dynamic, fast-paced, environmentally minded work environment where you will grow and learn while building your career. You will have the opportunity to help shape the world through humanitarian efforts, cutting edge technology, and environmental incentives.\n\nGlobal scope\n\nPriority Worldwide is fully committed to our corporate environmental responsibility and has taken substantial actions to enhance the working environment for our employees and reduce our impact on this planet. Since 2009, 10%+ of net profits have been donated to environmental organizations!\n\nPriority Worldwide has a unique and dedicated focus to the wider emergency response sector. Whether we are responding to an oil spill domestically or a major natural international disaster, we are a leader in emergency planning, preparation, and global response. With over 20 years-experience of working with governments, IGO's, NGO's, charitable organizations, and commercial responders, this is Priority's World.\n\nWho You Are\n\nDo you enjoy learning new skills and finding creative solutions in a fast-paced environment? The Export Manager needs to have a strong sense of leadership and customer service skills. They will assume an intricate role in our team as a principal representative to customers and managing the entire international shipment process from quote to delivery. As an operations leader, they are responsible for maintaining healthy, mutually beneficial relationships with Priority Worldwide's international freight forwarding vendors and regulatory agencies.\n\nRequired Skills And Competencies\n\n- 7+ years of Freight Forwarding Export Experience\n- Experience with Intermodal Exports-Air and Ocean\n- Experience handling ITAR Shipments and Compliance Regulations\n- Candidate must be able to work on site in either Baltimore MD or Los Angeles CA\n- Experience managing a team on a similar position\n- Experience with CargoWise\n- Excellent customer service skills!\n\nWhat You Will Do\n\nThey will be the driving force of the export team. They are responsible for timely, efficient, and cost-effective movement, routing, and occasional quoting of international freight in our responsibility.\n\nBasic Duties\n\n- Serve as a key contact to all our clients, internal and external, and have a constant focus on excellence to provide the Ultimate Customer Experience.\n- Promote and ensure strong team environment.\n- Direct, active interaction with assigned export team to ensure awareness of all activities and taking lead role in problem resolution.\n- Ensure the assigned export team is working effectively, clients are responded to quickly, and established processes are being followed.\n- Develop measurable statistics and goals that can be presented to team and management.\n- Assist the Directors of Operations and Compliance as needed, for any issues related to export compliance.\n- Manage workload and distribution of tasks, shipments for HQ and remote staff members.\n- Be energetic and motivational to customers and employees.\n- Lead weekly departmental meetings for the assigned export team.\n- Prepare, review and present monthly departmental statistics.\n- Mentor and train team members, assign and review individual/team goals\n- AES filling audits.\n- Review and take action on any service issues, feedback from/to ops/sales including reviewing/initiating CARS\n- Be able to step in and take a hands-on approach when needed to ensure client satisfaction.\n\nBenefits And Compensation\n\nIndividual compensation packages are based on various factors unique to each candidate, including skill set, experience, qualifications, and other job-related reasons.\n\n- Salary $75,000-$110,000 annually, depending on experience\n- Comprehensive Benefits Package (Medical, Dental, Vision)\n- 5 WFH days per month\n- 3 Weeks Paid Time Off\n- 3 Days of Paid Time off for Volunteer Work\n- Quarterly Bonus Program\n- 529E College Savings Program\n- Retirement Plan\n- $20,000 Term Life Insurance Plan\n- Mental Health Plan\n- Identity Theft Protection Plan", "responsibilities": "They will be the driving force of the export team. They are responsible for timely, efficient, and cost-effective movement, routing, and occasional quoting of international freight in our responsibility.", "qualifications": {"required": "7+ years of Freight Forwarding Export Experience, Experience with Intermodal Exports-Air and Ocean, Experience handling ITAR Shipments and Compliance Regulations, Candidate must be able to work on site in either Baltimore MD or Los Angeles CA, Experience managing a team on a similar position, Experience with CargoWise, Excellent customer service skills!", "preferred": ""}, "skills": ["Freight Forwarding", "Intermodal Exports", "ITAR Shipments", "Customer Service", "CargoWise"], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "Comprehensive Benefits Package (Medical, Dental, Vision), 5 WFH days per month, 3 Weeks Paid Time Off, 3 Days of Paid Time off for Volunteer Work, Quarterly Bonus Program, 529E College Savings Program, Retirement Plan, $20,000 Term Life Insurance Plan, Mental Health Plan, Identity Theft Protection Plan", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4004257695"}