{"jobTitle": "Program Manager, Liberty Hill Foundation", "company": {"name": "Charity Search Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-Time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$72,600 - $82,600", "currency": "USD"}, "jobFunction": "Project Management", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "<strong>Position Title:</strong> Program Manager<br/><br/><strong>Reports to:</strong> Senior Director, Programs<br/><br/><strong>Position: </strong>Full-Time<br/><br/><strong>Location:</strong> Hybrid-Onsite; Los Angeles, California<br/><br/><strong>Salary:</strong> $72,600 - $82,600<br/><br/><strong>About Liberty Hill<br/><br/></strong>At Liberty Hill Foundation, we are at the forefront of social change, championing social justice and equity by supporting grassroots movements in communities most affected by systemic oppression. Our mission is to transform lives, communities, and policies, building a more equitable future for all. We are a dynamic team of passionate changemakers, committed to supporting community organizing through our programs: grantmaking, training and capacity building, and alliance building.<br/><br/>Our staff represents a dedicated community of people who are committed to social justice and improving the material conditions in which we live. At Liberty Hill, we're also committed to our organizational values of Justice, Equity, Diversity, and Inclusion (JEDI).<br/><br/>We embrace the differences and characteristics that make us all unique, and we encourage collaboration as an essential element of our mission to reach our North Star goal—to achieve justice and equity by building power in communities most impacted by systemic oppression.<br/><br/><strong>The Role <br/><br/></strong>Reporting to the Senior Director, of Programs, the Program Manager is responsible for supporting and administering Liberty Hill's programmatic efforts. In the first year, the role's primary focus will be to support Environmental Justice programs, including: Thriving Communities Grant Making Program (TCGM), EJ Ready, Environmental Leadership Initiative (ELI), and STAND LA, while being available to support efforts across programmatic focus areas.<br/><br/><strong>Support Across All Programs <br/><br/></strong><ul><li> Actively participate in Program meetings and team initiatives, such as competitive grantmaking and capacity-building programs, outreach, landscape analysis, and strategy development</li><li> Develop training curriculum and lead training</li><li> Coordinate, plan, schedule, organize, and facilitate meetings within LHF and with community partners</li><li> Manage the logistics related to sponsorship of the virtual meetings, including calendaring, compiling stakeholder lists for outreach, agenda development, speaker recruitment, translation, tech support, registration, and meeting facilitation</li><li> Co-manage the development of a curriculum design team/s to propose effective learning modules for the Assemblies on climate themes. </li><li> Assists in the development of foundation reports, and proposals</li><li> Assists in processing financial reimbursements, invoices, and reports</li><li> Informs and coordinates with Liberty Hill staff about EJ activities</li><li> Research and catalog studies and policies related to Climate Equity Roadmaps.  </li><li> Inform communications and advancement teams of current activities and collaborate on related messaging and framework</li><li> Study renewable energy, climate resilience hubs and networks, and just transition, including popular education techniques for diverse audiences. </li><li> Stay abreast of the changing landscape, inform Liberty Hill Program staff, and gather information needed for ongoing fundraising activities.  </li><li> Track policy developments at the LA County Board of Supervisors on oil drilling. </li><li> Provide administrative support<br/><br/></li></ul>Your role will encompass policy research and curriculum development while collaborating with internal and external stakeholders.<br/><br/>In this role, you will primarily coordinate initiatives aimed at addressing environmental inequities and promoting climate justice in marginalized communities in Los Angeles. Working closely with community partners, you will support sustainable and just environmental practices.<br/><br/><strong>Impact Areas <br/><br/></strong><strong>Program Administration <br/><br/></strong><ul><li> Manage logistics for virtual meetings including calendaring, stakeholder outreach, agenda development, speaker recruitment, translation, tech support, registration, and facilitation</li><li> Participate in program meetings and team initiatives, contributing to capacity-building programs, outreach efforts, and strategy development</li><li> Prepare and manage foundation reports, proposals, invoices, and reimbursements</li><li> Coordinate with Liberty Hill staff on EJ activities to maintain alignment and integration across teams<br/><br/></li></ul>Policy Advocacy and Research<br/><br/><ul><li> Conduct research and catalog studies and policies on environmental and climate justice issues and Climate Equity Roadmaps</li><li> Engage policymakers and stakeholders on policy decisions, such as tracking policy developments at the LA County Board of Supervisors on oil drilling</li><li> Stay updated on renewable energy, climate resilience hubs and networks, and just transition, including best practice education techniques for diverse audiences<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><strong>Skills, Knowledge, and Abilities <br/><br/></strong><ul><li> Education: BS/BA Degree preferred or equivalent, strong emphasis on personal lived/professional experience</li><li> 3+ years of progressively responsible experience in nonprofit, government, or labor union programs or campaigns</li><li> 2+ years leading organizing or policy advocacy campaigns</li><li> 2+ years working effectively with diverse and broad-based community constituencies</li><li> Ability to work in a highly collaborative environment that requires continual updating and engagement of multiple internal and external stakeholders</li><li> Exceptional interpersonal and collaboration skills with the ability to work effectively both independently and as part of a team</li><li> Ability to write/speak in Spanish (Preferred).  </li><li> Proficiency with Microsoft Office Products (Word, Excel, and Outlook)</li><li> Ability to navigate and learn various software; specifically, Slack, Asana, and SharePoint</li><li> Attention to detail with strong organizational and time management skills</li><li> Commitment to social and racial justice, equality, diversity, and inclusion<br/><br/><br/></li></ul><strong>Skills in: <br/><br/></strong><ul><li> Facilitating campaign meetings</li><li> Event management</li><li> Ability to work in a highly collaborative environment that requires continual updating and engagement of multiple internal and external stakeholders</li><li> Strategy development and execution</li><li> Problem analysis and resolution</li><li> Excellent writing skills</li><li> Influencing and negotiation</li><li> Time management and delegation<br/><br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Has personal lived experience that directly relates to the role and responsibility of the position</li><li> Is familiar with the concept of systemic oppression in America</li><li> Is familiar with social and racial justice<br/><br/><br/></li></ul><strong>Core Competencies <br/><br/></strong><strong>Problem Solver <br/><br/></strong>Identifies and defines problems and their impact; Evaluates options. Analyzes the advantages and disadvantages of each; Present recommendations after evaluating potential solutions.<br/><br/><strong>Resilient <br/><br/></strong>Shows determination. Sets challenging goals and persists in the face of setbacks; Takes accountability for work and actions. Owns mistakes and deals with issues when necessary; Adapts to changing circumstances and new information with flexibility and resilience.<br/><br/><strong>Collaborative <br/><br/></strong>Builds and maintains relationships across the team and organization; Gets support from others to get work done together; Open to contributions from a diverse range of stakeholders.<br/><br/><strong>Benefits<br/><br/></strong><ul><li> Comprehensive coverage for employee healthcare, vision, and dental at 100%</li><li> Employer contribution and match for 403b retirement savings</li><li> Stipend to support remote work</li><li> 10 Days of PTO paid vacation time the first year and 58 hours of sick time</li><li> Generous benefit of 22 paid holidays</li><li> 2 dedicated Volunteer Days</li><li> Fridays off throughout August</li><li> Summer Break is the first week in July, and Winter Break is the last two weeks of December<br/><br/></li></ul>Liberty Hill operates in a hybrid remote environment with a dedicated coworking space in downtown Los Angeles. While in-person elements vary by function, key elements of this role revolve around face-to-face mentorship, in-person meetings and events, and other components that require physical presence and participation.<br/><br/><strong>Physical Asks <br/><br/></strong><ul><li> Ability to operate a remote workstation and laptop/screen for extended periods</li><li> Manual dexterity in operating a computer keyboard, printer, facsimile machine, photocopier, calculator, and/or ten-key adding machine</li><li> Ability to lift up to 15 pounds</li><li> Ability to engage in a hybrid remote work environment in our shared downtown co-working space or working remotely</li><li> Must live in Los Angeles County and be available for face-to-face collaboration when necessary<br/><br/><br/></li></ul><strong>How To Apply<br/><br/></strong>Liberty Hill has retained the services of Charity Search Group to coordinate the search for this position. To apply, please complete this online application. If you have questions or need accommodations, please contact <strong>Pascale Hughes</strong> at <strong>pascale@charitysearchgroup.com</strong> or visit www.charitysearchgroup.com.<br/><br/>Liberty Hill is an equal opportunity employer and is committed to having a workforce that reflects diversity at all levels of the organization. We recognize the importance of not viewing individuals based on a single identity, and we thrive on being equitable in our recruitment process as well as in our efforts to be inclusive of all employees.", "responsibilities": "The Program Manager is responsible for supporting and administering Liberty Hill's programmatic efforts. In the first year, the role's primary focus will be to support Environmental Justice programs, including: Thriving Communities Grant Making Program (TCGM), EJ Ready, Environmental Leadership Initiative (ELI), and STAND LA, while being available to support efforts across programmatic focus areas.", "qualifications": {"required": "Education: BS/BA Degree preferred or equivalent, strong emphasis on personal lived/professional experience\n3+ years of progressively responsible experience in nonprofit, government, or labor union programs or campaigns\n2+ years leading organizing or policy advocacy campaigns\n2+ years working effectively with diverse and broad-based community constituencies\nAbility to work in a highly collaborative environment that requires continual updating and engagement of multiple internal and external stakeholders\nExceptional interpersonal and collaboration skills with the ability to work effectively both independently and as part of a team\nAbility to write/speak in Spanish (Preferred).  \nProficiency with Microsoft Office Products (Word, Excel, and Outlook)\nAbility to navigate and learn various software; specifically, Slack, Asana, and SharePoint\nAttention to detail with strong organizational and time management skills\nCommitment to social and racial justice, equality, diversity, and inclusion", "preferred": "Has personal lived experience that directly relates to the role and responsibility of the position\nIs familiar with the concept of systemic oppression in America\nIs familiar with social and racial justice"}, "skills": ["Grantmaking", "Capacity Building", "Alliance Building", "Social Justice", "Equity", "Community Organizing", "Environmental Justice", "Climate Justice", "Policy Advocacy", "Research", "Curriculum Development", "Event Management", "Strategy Development", "Problem Analysis", "Writing", "Influencing", "Negotiation", "Time Management", "Delegation", "Microsoft Office", "Slack", "Asana", "SharePoint"], "postedDate": "1 day ago", "benefits": "Comprehensive coverage for employee healthcare, vision, and dental at 100%\nEmployer contribution and match for 403b retirement savings\nStipend to support remote work\n10 Days of PTO paid vacation time the first year and 58 hours of sick time\nGenerous benefit of 22 paid holidays\n2 dedicated Volunteer Days\nFridays off throughout August\nSummer Break is the first week in July, and Winter Break is the last two weeks of December", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4004997586"}