{"jobTitle": "Field Supervisor III", "company": {"name": "SitelogIQ", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "90,000.00/yr - 120,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Facilities Services", "description": "<strong>SitelogIQ Commercial &amp; Industrial (C&amp;I)</strong> delivers turnkey energy efficiency and property improvement programs that transform built environments and breathe life into the sustainability, financial, and ESG goals of real estate teams and corporations across the U.S. Our mission is to make it easy for our clients to accelerate progress and ensure their facilities are healthy, optimized, and exceed the needs of their occupants.<br/><br/>The <strong>Field Supervisor III</strong> (FSIII) role is critical to the Execution, monitoring, and control of Field Operations. The FSIII’s core role is to promote and execute the SafetyIQ Program. The SafetyIQ Program is our policy towards a safe and healthy workplace. This position will oversee our regional In-House labor force for Job Site Activities, and project execution. The FSIII will work with their assigned crews to perform lighting retrofits and electrical vehicle charger installations, including switch gear panels, transformers, EV charging stations, protective bollards, working with local municipalities, local electrical inspectors, utility companies, and full electrical infrastructure. The FSIII will support the Project Development team on project scope and proposed solutions. FSIII will work with Project Management to support schedule and project performance. This position requires a high level of detail and accuracy as well as clear and proactive communication skills, both with internal team members and external team members. This position will require strong people and leadership skills to help support the team’s growth and technical development. The FSIII will provide coaching and mentorship to the team to support career pathing and overall unity amongst team members. All members of our team are expected to work together in a safe, positive, respectful, and professional manner. This position will coordinate their schedule with assigned project managers and report to the Director of Construction. Must adhere to SitelogIQ company safety policy and rules and regulations of SitelogIQ.<br/><br/>Travel will be required, and may include but is not limited to, executing projects, client meetings, site visits, field verifications, building assessments, permit review &amp; close out, and site walks with the customer.<br/><br/><strong>Target Salary: </strong>$90,000 – $120,000 annual salary depending on experience<br/><br/><strong>Field Supervisor III Responsibilities<br/><br/></strong><ul><li>Perform Field Supervision for Project Execution. Provide knowledge and guidance for safety, compliance with governing authority, quality, and company policies.</li><li>Will conduct job site safety visits and notify Senior Management of unsafe conditions and proposed corrective action.</li><li>Perform LED lighting retrofits and EV charger installations, including switch gear panels, transformers, EV chargers, protective bollards, and electrical infrastructure.</li><li>Promote the understanding and influence of governing jurisdictions.</li><li>Manage Permitting, inspections, and compliance in multiple states, including Pre-Construction activities to Final Project Close Out</li><li>Interpreting and applying industry standards (NEC, IEEE, ANSI, UL, BSC)</li><li>Manage Employee / Vendor Safety and Safety Prevention in accordance with OSHA, and help team members support Safety Program by influence, education, and example.<br/><br/></li></ul><strong>To support the Project Management and Project development with project solutions, field schedules, and company resources.<br/><br/></strong><ul><li>Obtain an understanding of project scope of work from Project Manager including any available plans or documents.</li><li>Verify scope, material requirements, and develop installation plan for project and communicate the plan to all Technicians and Installers.</li><li>Field installation of project scope ensuring all work is performed according to the appropriate compliance and completed in a timely manner.</li><li>Provide regular and timely information to the operations team regarding project progress, installation variance, workforce resources, equipment rental, and differences in Contract Project Scope.</li><li>Close out projects, conduct quality assurance and prevention, jurisdiction inspections, and any final verification of scope and quality.<br/><br/></li></ul><strong>Responsible for all aspects of Field Execution including job sites, company resources, project solutions, troubleshooting building systems, and allocation of company resources.<br/><br/></strong><ul><li>Must be able to have a functioning knowledge of the aspects of working systems for buildings and facilities.</li><li>Must be able to read electrical blueprints including, reflected ceiling plans, electrical plans, panel plans, single line diagrams, and structural plans.</li><li>Able to understand assigned task and time constraints associated to Program.</li><li>Effectively communicate task completion, progress, and quality to Project Managers and direct supervisor</li><li>Must be able to perform job tasks with minimal supervision.<br/><br/></li></ul><strong>Field Supervisor III Qualifications<br/><br/></strong><ul><li>High School Diploma or equivalent</li><li>Minimum Seven (7) years electrical experience is required</li><li>Must maintain active driver's license with clean record, and have reliable transportation to report to jobsite and office locations with own vehicle</li><li>Must be able to obtain an EVITP (Electric Vehicle Infrastructure Training Program) certification</li><li>Must possess a minimum of current California C-10 electrical license, and be able, and willing to get additional electrical licenses in other states through direct state testing and reciprocity.</li><li>Possess effective communication and leadership skills</li><li>Proficient in Microsoft Office Suite, including Outlook<br/><br/></li></ul><strong>No Agencies, please<br/><br/></strong><strong>Physical Requirements<br/><br/></strong><ul><li>Able to move or lift 75 lbs. unassisted.</li><li>Able to withstand varying temperatures typical in an outdoor environment.</li><li>Position spends significant amount of time standing, walking, lifting, pulling, and pushing.</li><li>Position may require climbing of ladders and/or working from heights.<br/><br/></li></ul><strong>Travel Requirements<br/><br/></strong><ul><li>Position requires 55-60% travel to regional projects and other states, based on business needs, and will include overnight or out-of-state travel.<br/><br/></li></ul><strong>Benefits<br/><br/></strong><strong>A complete job description can be provided upon request.<br/><br/></strong>We offer a highly competitive salary/wage, and comprehensive benefits, including:<br/><br/><ul><li>Medical, dental, and vision insurance</li><li>Disability and life insurance</li><li>401K</li><li>Flex time off</li><li>12 paid holidays</li><li>Tuition reimbursement</li><li>Opportunities to drive our DE&amp;I efforts by joining our affinity groups, Veterans and Allies Leadership Organization, or Women Inspiring &amp; Strengthening Everyone</li><li>Opportunities to give back to our local communities through organized events or fundraisers<br/><br/></li></ul><strong>More About SitelogIQ<br/><br/></strong>At SitelogIQ, we’re focused on creating a great environment for our team first so that it is more energizing and rewarding to focus on creating a great customer experience. That’s what we call a win-win.<br/><br/>We partner with clients in K-12, higher ed, government, healthcare, multifamily housing, and industry to optimize energy efficiency, improve indoor air quality, address lighting, and improve the customer experience. With offices across the country, it’s rewarding to make a difference in the communities where our teammates live and work.<br/><br/>SitelogIQ is an Equal Opportunity Employer and participates in the E-Verify program.", "responsibilities": "Perform Field Supervision for Project Execution. Provide knowledge and guidance for safety, compliance with governing authority, quality, and company policies.\nWill conduct job site safety visits and notify Senior Management of unsafe conditions and proposed corrective action.\nPerform LED lighting retrofits and EV charger installations, including switch gear panels, transformers, EV chargers, protective bollards, and electrical infrastructure.\nPromote the understanding and influence of governing jurisdictions.\nManage Permitting, inspections, and compliance in multiple states, including Pre-Construction activities to Final Project Close Out\nInterpreting and applying industry standards (NEC, IEEE, ANSI, UL, BSC)\nManage Employee / Vendor Safety and Safety Prevention in accordance with OSHA, and help team members support Safety Program by influence, education, and example.\n\nTo support the Project Management and Project development with project solutions, field schedules, and company resources.\nObtain an understanding of project scope of work from Project Manager including any available plans or documents.\nVerify scope, material requirements, and develop installation plan for project and communicate the plan to all Technicians and Installers.\nField installation of project scope ensuring all work is performed according to the appropriate compliance and completed in a timely manner.\nProvide regular and timely information to the operations team regarding project progress, installation variance, workforce resources, equipment rental, and differences in Contract Project Scope.\nClose out projects, conduct quality assurance and prevention, jurisdiction inspections, and any final verification of scope and quality.\n\nResponsible for all aspects of Field Execution including job sites, company resources, project solutions, troubleshooting building systems, and allocation of company resources.\nMust be able to have a functioning knowledge of the aspects of working systems for buildings and facilities.\nMust be able to read electrical blueprints including, reflected ceiling plans, electrical plans, panel plans, single line diagrams, and structural plans.\nAble to understand assigned task and time constraints associated to Program.\nEffectively communicate task completion, progress, and quality to Project Managers and direct supervisor\nMust be able to perform job tasks with minimal supervision.", "qualifications": {"required": "High School Diploma or equivalent\nMinimum Seven (7) years electrical experience is required\nMust maintain active driver's license with clean record, and have reliable transportation to report to jobsite and office locations with own vehicle\nMust be able to obtain an EVITP (Electric Vehicle Infrastructure Training Program) certification\nMust possess a minimum of current California C-10 electrical license, and be able, and willing to get additional electrical licenses in other states through direct state testing and reciprocity.\nPossess effective communication and leadership skills\nProficient in Microsoft Office Suite, including Outlook", "preferred": ""}, "skills": ["Safety", "Compliance", "Quality", "OSHA", "Project Management", "Electrical", "Blueprints", "Communication", "Leadership", "Microsoft Office"], "postedDate": "5 days ago", "applicationDeadline": "", "benefits": "We offer a highly competitive salary/wage, and comprehensive benefits, including:\nMedical, dental, and vision insurance\nDisability and life insurance\n401K\nFlex time off\n12 paid holidays\nTuition reimbursement\nOpportunities to drive our DE&amp;I efforts by joining our affinity groups, Veterans and Allies Leadership Organization, or Women Inspiring &amp; Strengthening Everyone\nOpportunities to give back to our local communities through organized events or fundraisers", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004469420"}