{"jobTitle": "CEO/Entrepreneur through Acquisition", "company": {"name": "Novastone Capital Advisors", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "General Business, Management, and Finance", "industry": "Financial Services and Investment Management", "description": "NCA is a Swiss-based entity that represents a consortium of Single Family Offices that currently runs an Entrepreneurship Through Acquisition program in Europe and in North America.\n\nNovastone Capital Advisors (NCA) is looking for motivated, talented, aspirational mid-career professionals / entrepreneurs with the ambition to partner with NCA to search, acquire and lead a small or medium-sized enterprise as Chief Executive Officer.\n\n<br/>\n\nAs an NCA Entrepreneur, you will spearhead an up to 24-month professional search in order to acquire one small – mid sized company. Within the scope of our “Entrepreneurship Through Acquisition” program, you will have access to financial and business support from NCA during the search, as well as an attractive incentive package in the form of a base compensation and vested shares in the acquired company that will further enhance and secure your entrepreneurial journey.\n\n<br/>\n\n<ul><li>Please note that we do not invest in start-up or scale up companies.</li><li>Successful candidates will search, acquire and manage a company in the US. </li><li>Applications close on September 5th, 2024.</li><li>We strongly recommend attending one of our Q&A sessions to learn more about the opportunity<em> (registration is mandatory)</em>: https://insights.novastone-ca.com/register-qa-l-jobs/ </li></ul>\n\n<strong> </strong>\n\n<strong>ENTREPRENEUR RESPONSIBILITIES</strong>\n\n· Together with NCA, establish a search process aiming to generate sufficient deal flow with the ultimate goal of finding a business to acquire in accordance with pre-defined criteria\n\n· Manage the acquisition process with the support of our experienced M&A team\n\n· Step into the CEO role of the newly acquired business\n\n· Proactively generate and evaluate strategic growth options and business opportunities, develop long term business strategy and 100-day plans\n\n· Grow the business top line via impactful marketing and sales initiatives\n\n· Review product/service offerings, portfolio strategies, existing brand positioning and identify gaps and implement improvements\n\n· Manage geographical expansions, when required, preparing and successfully implementing market entrance strategies\n\n· Manage efficiency and ensure profitable growth\n\n<br/>\n\n<strong>MUST HAVE REQUIREMENTS</strong>\n\n· 10+ years of professional experience\n\n· Min. 5+ years in leadership roles managing multiple teams across multiple geographies and locations\n\n· Min. 10+ years of proven track record of running and growing businesses or business units in the US\n\n· P&L responsibility\n\n· Having a strategic vision for a sector or an industry\n\n· Strong motivation towards entrepreneurship\n\n<br/>\n\n<strong>NICE-TO-HAVE REQUIREMENTS</strong>\n\n· Academic achievement (Executive MBA or MBA degree preferred)\n\n· M&A experience\n\n· Consulting experience from a top consulting firm\n\n· Experience managing and operating an SME\n\n· Owner, Founder or co-Founder of a Start-up\n\n· Experience in global business development, international expansion\n\n· Recent successful business transformation experience\n\n· Open mind towards learning, people and even failure\n\n<br/>\n\n<strong>SELECTION PROCESS</strong>\n\n· Selected candidates will have several in depth interviews, will complete and present a business case assignment and will have a jury review their investment thesis over several weeks\n\n· We offer webinars for candidates to gather more information about the program and meet the NCA team\n\n· Final Assessment Center with the jury selection happens in December 2024\n\n<br/>\n\n<em>We are an Equal Opportunity program, and all submitted CVs pass through the same application process, regardless of gender, religion, national origin, sexual orientation, race, political affiliation, marital status, disability, age, parental status, or any other non-merit factor.</em>\n\n<br/>\n\n<em>For more information on the program, our application and selection process please refer to our website www.novastone-ca.com.</em>", "postedDate": "2 days ago", "applicationDeadline": "September 5th, 2024", "qualifications": {"required": "10+ years of professional experience\n\n· Min. 5+ years in leadership roles managing multiple teams across multiple geographies and locations\n\n· Min. 10+ years of proven track record of running and growing businesses or business units in the US\n\n· P&L responsibility\n\n· Having a strategic vision for a sector or an industry\n\n· Strong motivation towards entrepreneurship", "preferred": "Academic achievement (Executive MBA or MBA degree preferred)\n\n· M&A experience\n\n· Consulting experience from a top consulting firm\n\n· Experience managing and operating an SME\n\n· Owner, Founder or co-Founder of a Start-up\n\n· Experience in global business development, international expansion\n\n· Recent successful business transformation experience\n\n· Open mind towards learning, people and even failure"}, "skills": [], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004971327"}