{"jobTitle": "Psychiatric Nurse Practitioner / Physician Assistant", "company": {"name": "Get It Recruit - Educational Services", "location": "Lakewood, CA"}, "location": "Lakewood, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Health Care Provider", "industry": "Human Resources Services", "description": "## Join a Compassionate Healthcare Environment\n\nAre you a dedicated healthcare professional seeking to make a meaningful impact in mental health care? This physician-owned and led psychiatric practice offers both remote and in-person services in a supportive and collegial atmosphere. We're proud of our strong team culture, having maintained a zero turnover rate since our inception. We invite skilled professionals, including M.D.s, D.O.s, Psychiatric Nurse Practitioners, and Physician Assistants, to consider joining our growing team.\n\n### Why You Should Consider This Opportunity\n\n<ul><li>Flexible Schedules:** Enjoy the freedom to work as often or as little as you want, accommodating your personal needs.</li><li>Competitive Compensation:** Benefit from industry-leading pay that reflects your expertise.</li><li>Comprehensive Support:** Access supervision and consultation when needed, ensuring you never feel alone in patient care.</li><li>Efficient Workflow:** Experience a streamlined work environment without lengthy meetings or complicated documentation processes.</li><li>Work-Life Balance:** Pursue a fulfilling career while maintaining a healthy personal life.</li><li>Community Impact:** Contribute positively to the lives of patients through high-quality mental health care.</li><li>Prescribing Autonomy:** Work with minimal controlled substance prescriptions and without pressure to prescribe certain medications.</li><li>Positive Work Culture:** Join a professional and supportive environment that fosters growth and collaboration.</li><li>Focus on Care:** Our excellent support staff handles all administrative tasks, allowing you to concentrate on your patients.</li><li>Transparent Compensation:** There are no confusing metrics—your earnings are clear and straightforward.</li><li>Complete Coverage:** We fully cover malpractice insurance, licensing fees, and continuing education costs.</li><li>No After-Hours Requirements:** Dedicate your focus to patient care during your scheduled hours without on-call demands.</li><li>Strong Community Reputation:** Align with a practice recognized for its outstanding service and integrity.<br/><br/></li></ul>### Position Overview\n\nWe are seeking a Psychiatric Nurse Practitioner or Physician Assistant with psychiatric experience for a part-time role, with the potential for full-time growth. In this position, you will evaluate, develop, and treat individuals, families, and teenagers through both in-person and telemedicine services. Responsibilities include comprehensive mental health assessments, diagnoses, and medication management, with collaboration among medical and mental health professionals.\n\n### Key Responsibilities\n\n<strong>Patient Care Management &amp; Documentation<br/><br/></strong><ul><li> Conduct thorough evaluations to establish diagnoses and create effective treatment plans.</li><li> Adhere to ethical medication management practices.</li><li> Maintain patient confidentiality and privacy.</li><li> Document clinical encounters accurately and promptly.</li><li> Employ various treatment methodologies and counseling techniques.<br/><br/></li></ul><strong>Consultation &amp; Referral<br/><br/></strong><ul><li> Seek consultations as necessary to ensure optimal quality of care.</li><li> Facilitate ethical decision-making processes.<br/><br/></li></ul><strong>Patient Education<br/><br/></strong><ul><li> Educate patients and their families using effective teaching-learning strategies to encourage positive health outcomes.<br/><br/></li></ul><strong>Communication &amp; Team Collaboration<br/><br/></strong><ul><li> Identify system-specific issues and collaborate with colleagues to enhance office operations.</li><li> Actively participate in continuous improvement initiatives.<br/><br/></li></ul>### Skills &amp; Qualifications<br/><br/><ul><li> Strong independent clinical decision-making abilities.</li><li> Excellent communication and interpersonal skills.</li><li> Team player with a collaborative mindset.</li><li> Proficiency in electronic medical records (EMR) systems.<br/><br/></li></ul>### Requirements<br/><br/><ul><li> **Experience:** Minimum of two years of post-graduate experience in a behavioral health setting.</li><li> **Education:** Master's degree from an accredited nursing or physician assistant program.</li><li> **Licensure &amp; Certification:** Current NP or PA license in California without disciplinary actions; DEA registration.<br/><br/></li></ul>If you're ready to advance your career in a practice that values both your well-being and professional development, we encourage you to connect with us. We look forward to hearing from you!\n\nEmployment Type: Part-Time", "responsibilities": "Conduct thorough evaluations to establish diagnoses and create effective treatment plans. Adhere to ethical medication management practices. Maintain patient confidentiality and privacy. Document clinical encounters accurately and promptly. Employ various treatment methodologies and counseling techniques. Seek consultations as necessary to ensure optimal quality of care. Facilitate ethical decision-making processes. Educate patients and their families using effective teaching-learning strategies to encourage positive health outcomes. Identify system-specific issues and collaborate with colleagues to enhance office operations. Actively participate in continuous improvement initiatives.", "qualifications": {"required": "Minimum of two years of post-graduate experience in a behavioral health setting. Master's degree from an accredited nursing or physician assistant program. Current NP or PA license in California without disciplinary actions; DEA registration."}, "skills": ["Clinical Decision Making", "Communication", "Interpersonal Skills", "Teamwork", "Electronic Medical Records (EMR)"], "postedDate": "1 day ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4004917319"}