{"jobTitle": "Communications Coordinator", "company": {"name": "DigiTalkTell", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "55,000.00/yr - 68,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Events Services", "description": "<strong>Department: </strong>TMZ Events<br/><br/><strong>Location: </strong>Los Angeles, CA<br/><br/><strong>Compensation: </strong>$55,000 - $68,000 / year<br/><br/><strong>Description<br/><br/></strong><strong>Description:</strong> As a Communications Coordinator at TMZ Events, you will play a key role in shaping and maintaining our brand's voice across multiple platforms. You'll manage our internal and external communications, ensuring consistency, clarity, and engagement in every message we deliver.<br/><br/><strong>Responsibilities<br/><br/></strong><strong>Key Responsibilities<br/><br/></strong><ul><li>Develop and implement communication strategies that align with our company's goals and brand identity.</li><li>Draft, edit, and distribute internal and external communications, including press releases, newsletters, and social media content.</li><li>Collaborate with various departments to ensure messaging consistency across all platforms.</li><li>Manage media relations, including responding to inquiries, coordinating interviews, and maintaining a positive public image.</li><li>Monitor and analyze communication metrics to assess the effectiveness of our strategies and make data-driven improvements.</li><li>Organize and support company events, including press conferences, product launches, and promotional activities.</li><li>Act as a liaison between the company and external stakeholders, ensuring clear and professional communication.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Skills, Knowledge and Expertise<br/><br/></strong><ul><li>Bachelor's degree in Communications, Public Relations, Journalism, or a related field.</li><li>Proven experience (2+ years) in a communications role, preferably within the events or entertainment industry.</li><li>Exceptional writing, editing, and verbal communication skills.</li><li>Strong understanding of media relations and social media platforms.</li><li>Ability to multitask and manage multiple projects simultaneously in a fast-paced environment.</li><li>Proficiency in Microsoft Office and familiarity with content management systems (CMS) and social media management tools.<br/><br/></li></ul><strong>Benefits<br/><br/></strong><strong>Benefits:<br/><br/></strong><ul><li>Competitive salary with potential for growth and performance-based bonuses.</li><li>Weekends off, allowing for a balanced work-life schedule.</li><li>Comprehensive health benefits package, including medical, dental, and vision coverage.</li><li>Opportunities for professional development and career advancement.</li><li>A dynamic and collaborative work environment with a focus on team success.</li></ul>", "responsibilities": "Develop and implement communication strategies that align with our company's goals and brand identity. Draft, edit, and distribute internal and external communications, including press releases, newsletters, and social media content. Collaborate with various departments to ensure messaging consistency across all platforms. Manage media relations, including responding to inquiries, coordinating interviews, and maintaining a positive public image. Monitor and analyze communication metrics to assess the effectiveness of our strategies and make data-driven improvements. Organize and support company events, including press conferences, product launches, and promotional activities. Act as a liaison between the company and external stakeholders, ensuring clear and professional communication.", "qualifications": {"required": "Bachelor's degree in Communications, Public Relations, Journalism, or a related field. Proven experience (2+ years) in a communications role, preferably within the events or entertainment industry. Exceptional writing, editing, and verbal communication skills. Strong understanding of media relations and social media platforms. Ability to multitask and manage multiple projects simultaneously in a fast-paced environment. Proficiency in Microsoft Office and familiarity with content management systems (CMS) and social media management tools."}, "skills": ["Communications", "Public Relations", "Journalism", "Media Relations", "Social Media", "Microsoft Office", "Content Management Systems", "Social Media Management Tools"], "postedDate": "4 days ago", "benefits": "Competitive salary with potential for growth and performance-based bonuses. Weekends off, allowing for a balanced work-life schedule. Comprehensive health benefits package, including medical, dental, and vision coverage. Opportunities for professional development and career advancement. A dynamic and collaborative work environment with a focus on team success.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004827500"}