{"jobTitle": "Cargo Sales Operations & Customer Service Manager", "company": {"name": "Cathay Pacific", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Airlines and Aviation", "description": "Move Beyond! To move people forward in life - We are the people behind Cathay Pacific. We are proud of our Hong Kong heritage but equally proud of the global, diverse workforce that makes us who we are. We are relentlessly driven to create lifetime customer loyalty, value for our shareholders and satisfaction and enrichment for our employees. We are a complex global business, but we are also family. And whether we are in the cockpit or behind a desk, moving cargo, checking our passengers in or ensuring they are safe and comfortable while in the air, we are all one team, focused on delivering one world-class airline operation. Join us and discover just how far you can go!<br/><br/>Role Introduction<br/><br/>We are looking for for a Cargo Sales Operations &amp; Customer Service Manager to manages centralized sales support team which directly interacts and communicates with customers, both internal &amp; external in a courteous, efficient, friendly, and professional manner. They will ensure the centralized sales support team follows all procedures and maintain a healthy and positive working environment. They will lead the team that increases conversions through leading Sales Enablement initiatives and provide support to the regional commercial function. They will create and maintain the sales enablement strategy to identify initiatives for the regional Cathay salesforce in collaboration with Global Sales Strategy and Enablement. They will support the regional commercial function.<br/><br/>Key Responsibilities<br/><br/><ul><li>. Sales Productivity and Process</li><ul><li>Managing and leading the centralized sales support executive team to perform customer services.</li><li>Helps to implement the Cargo Business Plan in alignment with local cargo strategies and specified Key Performance Indicators</li><li>Creating strategies, processes, documentation, and performance measurements to ensure high efficiency and productivity of the team.</li><li>Creates, manages, and maintains the centralized sales support team’s work schedule and hours to optimize performance and to ensure meeting the company requirements to have adequate coverage.</li><li>Oversees and manages daily operations and ensures customer service staff performance is meeting expectations by conducting reviews as needed and on regular basis.</li><li>Responsible for escalated incidents, averts and/or diffuses potential customer problems.</li><li>Monitors that the team is communicating tracing of missing cargo and following up on tracers.</li><li>Stays informed about industry trends, emerging technologies, and best practices in customer experience to ensure Cathay Cargo remains at the forefront of service excellence.</li><li>Establishes and maintains strong relationships with key stakeholders, including customers, partners, and industry organizations, to drive collaboration and leverage industry insights.</li><li>Collaborates with cross-functional teams to identify opportunities for service improvement and drive initiatives to enhance customer satisfaction and loyalty.</li><li>Analyzes data and develops reports to support decision-making across senior management<br/></li></ul></ul><strong>Sales Enablement – General<br/><br/></strong><ul><li>Utilizes resources such as $hopping and In$ight2 to identify opportunities and generate incremental revenue by optimizing space utilization, load factor, and drive premium selling rates and regular business</li><li>Monitors load factors of ex-TAM outbound flights and seek support while managing booking acceptance accordingly to maximize flight revenue.</li><li>Ensures that special solution shipments are handled with utmost care and attention to secure high yield cargo.</li><li>Supports Account Managers in handling project shipments by managing allotments, bookings, shipment tracking, permit approval, and irregularities.</li><li>Assists the Area Cargo Manager(s) and coordinate with the Account Managers to achieve revenue target and generate ancillary revenue by actively seeking support from customers.</li><li>Managing and overseeing the team for the day-to-day relationship with stakeholders from all sales channels for revenue generation purposes while ensuring efficient and compliance.<br/><br/></li></ul><strong>Sales Enablement – Team Effectiveness<br/><br/></strong><ul><li>Implements the development, delivery, and training of effective regional sales playbooks for Cathay Cargo’s sales roles in the region in tight collaboration with sales leadership, Cathay Academy and Brand, Insights &amp; Marketing Communications and Global Sales Strategy and Enablement</li><li>Creates and updates regional playbooks based on seller feedback and shifting market demands together with Global Sales Strategy and Enablement</li><li>Ensures all team members received all required trainings, are certified to perform duties, and are regularly updated with new requirements and policies.</li><li>Creates KPI and monitor it for all team members.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Academic Qualifications</li><ul><li>University degree in a relevant Sales, Marketing or Business-related discipline, or equivalent combination of education, training, and experience is required.<br/></li></ul></ul><strong>Knowledge, Skills, Training And Experience<br/><br/></strong><ul><li>A passionate, customer-centric, and results-driven sales professional. Skilful in collaborating with various stakeholders to drive a positive outcome.</li><li>A minimum of 7 years to Direct Sales Management with proven track record</li><li>Proven experience in creating and implementing successful sales process, methodology, sales playbook initiatives.</li><li>Ability to create and track metrics which demonstrate constant increases in sales productivity.</li><li>Ability to break down complex problems in a simplified way.</li><li>Creative thinking and ability to innovate.</li><li>Ability to work cross-functionally and in a complex matrix for the greater good of the</li><li>Must have the right to live and work in the USA<br/><br/></li></ul><strong>Additional Requirements<br/><br/></strong><ul><li>Must successfully pass all pre-screening clearances, including a background check and pre-employment drug screen upon contingent job offer.</li><li>Strong cognitive reasoning, diagnostic, and mathematical skills are essential</li><li>Must be willing and able to travel within North America and overseas, if required <br/><br/></li></ul><strong>Benefits<br/><br/></strong>Cathay Pacific Airways is proud to offer eligible employees competitive Compensation &amp; Benefits package, as varied by location, regularly scheduled hours worked, length of employment and employment status as highlighted below.<br/><br/><ul><li>Travel Privileges on Cathay Pacific Airways Global Network</li><li>Extensive well-being programs including health, dental, prescription, vision, virtual doctor visits and flexible spending accounts and employee assistance program benefits to help you stay well.</li><li>Generous 401K Matching Program</li><li>Paid Holiday &amp; Vacation</li><li>LTD &amp; Basic Life Insurance</li><li>If this position requires a uniform, a uniform allowance will be provided.<br/><br/></li></ul>Salary Range -<br/><br/>The estimated salary range for this role is $94,000 to $141,312 per year. Employee pay will vary based on factors such as qualifications, experience, skill level, competencies and work location.<br/><br/>To learn more about Cathay Pacific as a Certified Great Place Employer – Please Click Here’<br/><br/>Personal &amp; Application Information<br/><br/><em>Cathay Pacific Airways is an </em><em>Equal Opportunity (EOE) </em><em>and </em><em>Affirmative Action (AA)</em><em> employer. All qualified applicants will receive consideration for employment regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status and other protected status as required by applicable law and will not be discriminated against. Cathay Pacific Airways is an E-Verify participating employer.<br/><br/></em><em>If you require assistance or an accommodation in completing any aspect of the application process, please contact the Cathay Americas Recruiting team at: </em><em>jobs@cathaypacific.com</em><em>.</em>", "responsibilities": "Manages centralized sales support team which directly interacts and communicates with customers, both internal &amp; external in a courteous, efficient, friendly, and professional manner. They will ensure the centralized sales support team follows all procedures and maintain a healthy and positive working environment. They will lead the team that increases conversions through leading Sales Enablement initiatives and provide support to the regional commercial function. They will create and maintain the sales enablement strategy to identify initiatives for the regional Cathay salesforce in collaboration with Global Sales Strategy and Enablement. They will support the regional commercial function.", "qualifications": {"required": "University degree in a relevant Sales, Marketing or Business-related discipline, or equivalent combination of education, training, and experience is required.<br/>A passionate, customer-centric, and results-driven sales professional. Skilful in collaborating with various stakeholders to drive a positive outcome.<br/>A minimum of 7 years to Direct Sales Management with proven track record<br/>Proven experience in creating and implementing successful sales process, methodology, sales playbook initiatives.<br/>Ability to create and track metrics which demonstrate constant increases in sales productivity.<br/>Ability to break down complex problems in a simplified way.<br/>Creative thinking and ability to innovate.<br/>Ability to work cross-functionally and in a complex matrix for the greater good of the<br/>Must have the right to live and work in the USA<br/>Must successfully pass all pre-screening clearances, including a background check and pre-employment drug screen upon contingent job offer.<br/>Strong cognitive reasoning, diagnostic, and mathematical skills are essential<br/>Must be willing and able to travel within North America and overseas, if required", "preferred": ""}, "skills": [], "postedDate": "6 days ago", "benefits": "Cathay Pacific Airways is proud to offer eligible employees competitive Compensation &amp; Benefits package, as varied by location, regularly scheduled hours worked, length of employment and employment status as highlighted below.<br/><br/><ul><li>Travel Privileges on Cathay Pacific Airways Global Network</li><li>Extensive well-being programs including health, dental, prescription, vision, virtual doctor visits and flexible spending accounts and employee assistance program benefits to help you stay well.</li><li>Generous 401K Matching Program</li><li>Paid Holiday &amp; Vacation</li><li>LTD &amp; Basic Life Insurance</li><li>If this position requires a uniform, a uniform allowance will be provided.<br/><br/></li></ul>", "remoteWork": null, "salary": {"amount": "94,000 to 141,312", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4004061636"}