{"jobTitle": "Executive Assistant", "company": {"name": "LOTA USA", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$17.00 - $28.84", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Executive Offices", "description": "**Summary Description**<br/><br/>We are looking for a new Executive Assistant to support our executive team. You will mostly manage business related tasks for the team such as creating reports, organizing travel and accommodations, taking minutes, and other organizational tasks.<br/><br/>**Responsibilities**<br/><br/><ul><li> Preparing financial statements, reports, memos, invoices letters, and other documents.</li><li> Answering phones and routing calls to the correct person or taking messages.</li><li> Handling basic bookkeeping tasks.</li><li> Filing and retrieving corporate records, documents, and reports.</li><li> Researching and conducting data to prepare documents for review and presentation by boards of directors, committees, and executives.</li><li> Helping prepare for meetings.</li><li> Accurately recording minutes from meetings.</li><li> Greeting visitors and deciding if they should be able to meet with executives.</li><li> Using various software, including word processing, spreadsheets, databases, and presentation software.</li><li> Reading and analyzing incoming memos, submissions, and distributing them as needed.</li><li> Making travel arrangements for executives.</li><li> Performing office duties that include ordering supplies and managing a records database.</li><li> Experience as a virtual assistant.</li><li> Opening, sorting and distributing incoming faxes, emails, and other correspondence.</li><li> Provide general administrative support.<br/><br/></li></ul>**Qualifications**<br/><br/><ul><li> Proven experience as an executive assistant or other relevant administrative support experience.</li><li> In-depth understanding of entire MS Office suite.</li><li> High school diploma.</li><li> Ability to organize a daily workload by priorities.</li><li> Must be able to meet deadlines in a fast-paced quickly changing environment.</li><li> A proactive approach to problem-solving with strong decision-making skills.</li><li> Professional level verbal and written communication skills.<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li> Pay: $17.00 - $28.84 per hour</li><li> Expected hours: No more than 40 per week</li><li> 401(k)</li><li> Dental insurance</li><li> Employee discount</li><li> Health insurance</li><li> Life insurance</li><li> Vision insurance</li><li> Work from home</li></ul>", "responsibilities": "Preparing financial statements, reports, memos, invoices letters, and other documents. Answering phones and routing calls to the correct person or taking messages. Handling basic bookkeeping tasks. Filing and retrieving corporate records, documents, and reports. Researching and conducting data to prepare documents for review and presentation by boards of directors, committees, and executives. Helping prepare for meetings. Accurately recording minutes from meetings. Greeting visitors and deciding if they should be able to meet with executives. Using various software, including word processing, spreadsheets, databases, and presentation software. Reading and analyzing incoming memos, submissions, and distributing them as needed. Making travel arrangements for executives. Performing office duties that include ordering supplies and managing a records database. Experience as a virtual assistant. Opening, sorting and distributing incoming faxes, emails, and other correspondence. Provide general administrative support.", "qualifications": {"required": "Proven experience as an executive assistant or other relevant administrative support experience. In-depth understanding of entire MS Office suite. High school diploma. Ability to organize a daily workload by priorities. Must be able to meet deadlines in a fast-paced quickly changing environment. A proactive approach to problem-solving with strong decision-making skills. Professional level verbal and written communication skills."}, "skills": [], "postedDate": "2 days ago", "benefits": "Pay: $17.00 - $28.84 per hour Expected hours: No more than 40 per week 401(k) Dental insurance Employee discount Health insurance Life insurance Vision insurance Work from home", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4004498675"}