{"jobTitle": "DIGITAL MERCHANDISING MANAGER- ONSITE", "company": {"name": "Posh Peanut®️", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Product Management, Distribution, and Design", "industry": "Retail Apparel and Fashion", "description": "<strong>WHO WE ARE</strong>\n<p><strong>Born in 2011, Posh Peanut Inc. began because of a genuine love for children, children’s clothing and an inventive excitement needing to be fulfilled. The founder of Posh Peanut, Fiona Sahakian is a wife, mother of two, daughter and sister. Fiona is the true example of a working mother and wife proving that it is possible for women to do it all. Posh Peanut has been a dream come true for Fiona and she could never imagine life without all of the loyal parents & peanuts that have grown to adore the company as well! Creating is a passion that she will forever embrace in herself and all children.</strong></p><p><br/></p><p><strong>Posh Peanut is committed to providing fashion forward, excellent quality and adorable children’s clothing & accessories as well as serving our customers with above satisfactory customer service. Posh Peanut Inc. strives to foster a working environment where our employees learn, grow and take satisfaction knowing that they contribute to the success of the Company.</strong></p><p><br/></p><p><strong>WHO WE WANT </strong></p><p>Seeking an E-commerce Site Merchandiser to support our fast-growing direct-to-consumer channel. Driving weekly product launches, this role is responsible for all aspects of visual merchandising on our website. In the role of Site Merchandiser, you will assume a pivotal position in curating and enhancing our online product offerings and content presentation to elevate the overall user experience and boost sales. Your responsibilities will include collaborating with cross-functional teams, analyzing customer behavior, and employing your creative and analytical skills to unleash the full potential of our website.</p><p><br/></p><p><strong>ESSENTIAL FUNCTIONS AND BASIC DUTIES</strong></p><ul><li>Implement effective merchandising strategies to showcase products in an attractive and well-organized manner, fostering customer engagement and increasing conversion rates.</li><li>Collaborate with the marketing, design, and content teams to develop visually compelling online collections and landing pages that highlight weekly launches, products, sales, and seasonal themes.</li><li>Utilize analytics, such as customer behavior data and sales data, to best inform and enhance merchandising practices</li><li>Discover new and exciting ways to showcase slow-moving product</li><li>Manage site-wide product linking to drive conversion of featured items</li><li>Manage and optimize product recommendations across the site (cross-sells & upsells)</li><li>Analyze search keyword data to optimize search-ability of product assortment for the consumer</li><li>Implement keyword associations and associated site re-directs</li><li>Perform routine on-site testing to verify proper functionality of content; promptly identify and address any issues proactively</li><li>Closely monitor collections (Product Landing Pages) to ensure correct products are showing up in correct collections</li><li>Conduct A/B testing in partnership with cross-functional teams to prove out hypothesis</li><li>Partner with e-commerce team to brainstorm new ideas and optimizations for the website</li><li>Perform other duties as required/assigned by manager</li></ul><p><br/></p><p><strong>QUALIFICATIONS</strong></p><p><strong>Education/Certification: </strong>Bachelor’s degree in Business, Marketing, or related field</p><p><strong>EXPERIENCE REQUIRED: At least 4 </strong>of ecommerce merchandising or site merchandising experience within fashion/apparel industry.</p><p><br/></p><p><strong>SKILLS/ABILITIES: </strong></p><ul><li>Experience working with Shopify Plus</li><li>Experience working with search and merchandising tools such as SearchSpring</li><li>Expertise in e-commerce merchandising practices</li><li>Expertise in Analytics tools such as Google Analytics & Hot Jar (highly analytical, critical thinker able to translate data into actionable insights)</li><li>Effective communication skills, attention to detail for consistent accuracy, and organizational proficiency</li><li>Detail and process-oriented with the ability to prioritize and manage multiple tasks at once</li><li>Organized with time management skills to coordinate timelines and delivering on multiple deadlines</li><li>Relevant experience in e-commerce, preferably within baby apparel</li><li>Fantastic team player to execute in a fast-paced environment</li><li>Growth-driven mindset</li></ul><p><br/></p><p><strong>Posh Peanut offers great benefits: </strong></p><ul><li><strong>Medical</strong></li><li><strong>Dental</strong></li><li><strong>Vision</strong></li><li><strong>401K</strong></li><li><strong>Life Insurance</strong></li><li><strong>Referral Bonus</strong></li><li><strong>Employee Discount</strong></li><li><strong>Paid Holidays</strong></li><li><strong>Vacation</strong></li><li><strong>Sick</strong></li><li><strong>Bereavement</strong></li></ul><p><br/></p><p><strong>EEO Statement: The company is an equal opportunity employer, committed to intentional anti-racism in all areas of our organization and will consider qualified applicants with criminal histories in accordance with the L.A. Fair Chance Initiative Ordinance. Our diverse backgrounds, perspectives, identities, and talents help us thrive.</strong></p>", "responsibilities": "Implement effective merchandising strategies to showcase products in an attractive and well-organized manner, fostering customer engagement and increasing conversion rates. Collaborate with the marketing, design, and content teams to develop visually compelling online collections and landing pages that highlight weekly launches, products, sales, and seasonal themes. Utilize analytics, such as customer behavior data and sales data, to best inform and enhance merchandising practices Discover new and exciting ways to showcase slow-moving product Manage site-wide product linking to drive conversion of featured items Manage and optimize product recommendations across the site (cross-sells & upsells) Analyze search keyword data to optimize search-ability of product assortment for the consumer Implement keyword associations and associated site re-directs Perform routine on-site testing to verify proper functionality of content; promptly identify and address any issues proactively Closely monitor collections (Product Landing Pages) to ensure correct products are showing up in correct collections Conduct A/B testing in partnership with cross-functional teams to prove out hypothesis Partner with e-commerce team to brainstorm new ideas and optimizations for the website Perform other duties as required/assigned by manager", "qualifications": {"required": "At least 4 of ecommerce merchandising or site merchandising experience within fashion/apparel industry.", "preferred": "Bachelor’s degree in Business, Marketing, or related field"}, "skills": ["Shopify Plus", "SearchSpring", "Google Analytics", "Hot Jar"], "postedDate": "1 day ago", "benefits": "Medical, Dental, Vision, 401K, Life Insurance, Referral Bonus, Employee Discount, Paid Holidays, Vacation, Sick, Bereavement", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004702654"}