{"jobTitle": "Business Development Manager", "company": {"name": "Hellas", "industry": "Construction", "location": "Riverside, CA"}, "location": "Riverside, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Construction", "description": "Hellas, *The #1 Sports Construction company in North America*, is seeking a Business Development Manager to join our team and increase our national presence in and around the Los Angeles, CA market. We will train you how to be successful as part of the best Sports Construction Company in North America. If you have a passion for sports and selling and want to work for an award-winning company, we want to hear from you. Previous experience prospecting and selling in the sports and/or construction industry a plus. This position will be selling million-dollar synthetic turf solutions, running tracks, and more.<br/><br/>Our ideal candidate is entrepreneurial and ambitious, with excellent written and oral communication skills, client relationship-building skills, and a strong sales skill set. Our commission program has no ceiling, so the earning potential for these positions is unlimited. If you are a motivated professional with strong business acumen and thrive in a fast-paced and self-directed work environment, we want to hear from you.<br/><br/>Responsibilities of the Business Development Manager (including but not limited to):<br/><br/><ul><li>Travel approximately 75% to aggressively drive and generate new business (on average, 3-5 days on the road; first 3 weeks of each month, Company vehicle and gas card provided)</li><li>Target, qualify and pursue leads in accordance with company strategy and techniques</li><li>Plan and perform sales calls, appointments, and site visits</li><li>Implement effective business plans and strategies for assigned territory growth</li><li>Learn and master value selling and ROI discussions to close new accounts</li><li>Provides accurate weekly forecasting, including deal value, status, decision makers and steps to close</li><li>Communicate regularly with Sales Management regarding performance, inquiries, competitive activities, complaints, market conditions or other pertinent conditions</li><li>Serve as the liaison between the client, Marketing, Sales Management, and other departments</li><li>Attend company meetings, trainings, tradeshows, events and promotions</li><li>Develop a solid understanding of product lines and competitive selling points</li><li>Study patterns and trends to assess competitive presence in our industry<br/><br/></li></ul>Qualifications and Skills:<br/><br/><ul><li>Bachelor’s degree required</li><li>Previous experience and success in prospecting, qualifying, and closing new accounts in a construction environment is preferred. Previous sales experience is required. Landscaping sales experience a plus</li><li>Exceptional relationship and communication skills</li><li>Proficient in Microsoft Office, CRM experience preferred</li><li>Professional demeanor and strong work ethic</li><li>Highly organized with strong attention to detail and problem-solving capabilities</li><li>Motivated, driven personality with the ability to work autonomously to deliver results<br/><br/></li></ul>Hellas offers an excellent compensation package for our sales staff. Base salary plus aggressive commission schedule. Benefits package including medical, dental, vision, pet insurance, maternity/paternity leave, life coverage, and 401(k) profit sharing plan. Company vehicle to include gas card.<br/><br/>This position does require extensive travel within your designated region. Comprehensive training and onboarding program provided.<br/><br/>This is a base plus commission opportunity. Base salary will be determined upon candidates’ previous sales experience and market experience.<br/><br/>Company Description<br/><br/>Headquartered in Cedar Park, TX, Hellas is the #1 Sports Construction company in North America. While specializing in the general construction of sports facilities and synthetic surfaces, Hellas also champions innovative artificial turf manufacturing, base construction, field, track and tennis planning, installation and maintenance. The only fully integrated sports construction company and controls all business operations to take its products straight to the end-user including marketing, sales, quality control, project management, maintenance and warranty.<br/><br/>To learn more about our quality artificial surfaces for field sports, track, and tennis visit us online at: http://www.hellasconstruction.com<br/><br/>Headquartered in Cedar Park, TX, Hellas is the #1 Sports Construction company in North America. While specializing in the general construction of sports facilities and synthetic surfaces, Hellas also champions innovative artificial turf manufacturing, base construction, field, track and tennis planning, installation and maintenance. The only fully integrated sports construction company and controls all business operations to take its products straight to the end-user including marketing, sales, quality control, project management, maintenance and warranty. To learn more about our quality artificial surfaces for field sports, track, and tennis visit us online at: http://www.hellasconstruction.com", "responsibilities": "Travel approximately 75% to aggressively drive and generate new business (on average, 3-5 days on the road; first 3 weeks of each month, Company vehicle and gas card provided)\nTarget, qualify and pursue leads in accordance with company strategy and techniques\nPlan and perform sales calls, appointments, and site visits\nImplement effective business plans and strategies for assigned territory growth\nLearn and master value selling and ROI discussions to close new accounts\nProvides accurate weekly forecasting, including deal value, status, decision makers and steps to close\nCommunicate regularly with Sales Management regarding performance, inquiries, competitive activities, complaints, market conditions or other pertinent conditions\nServe as the liaison between the client, Marketing, Sales Management, and other departments\nAttend company meetings, trainings, tradeshows, events and promotions\nDevelop a solid understanding of product lines and competitive selling points\nStudy patterns and trends to assess competitive presence in our industry", "qualifications": {"required": "Bachelor’s degree required\nPrevious experience and success in prospecting, qualifying, and closing new accounts in a construction environment is preferred. Previous sales experience is required. Landscaping sales experience a plus\nExceptional relationship and communication skills\nProficient in Microsoft Office, CRM experience preferred\nProfessional demeanor and strong work ethic\nHighly organized with strong attention to detail and problem-solving capabilities\nMotivated, driven personality with the ability to work autonomously to deliver results", "preferred": null}, "skills": ["Sales", "Construction", "Business Development", "CRM", "Microsoft Office"], "postedDate": "3 days ago", "applicationDeadline": null, "benefits": "Base salary plus aggressive commission schedule. Benefits package including medical, dental, vision, pet insurance, maternity/paternity leave, life coverage, and 401(k) profit sharing plan. Company vehicle to include gas card.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004400824"}