{"jobTitle": "Vice President Human Resources", "company": {"name": "Solaris Paper, Inc", "location": "Orange, CA", "industry": "Paper and Forest Product Manufacturing"}, "location": "Orange, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "description": "<strong><u>About Solaris Paper:</u></strong>\n<p>Solaris Paper is one of the largest tissue companies in the US with manufacturing sites in California, Oklahoma and Virginia. Solaris is part of Asia Pulp &amp; Paper Group (APP). APP is one of the world's largest integrated paper companies with over 100,000 employees. APP products are sold in over 150 countries with manufacturing units around the world. Tissues International is the tissue finished goods business of APP (one of the largest in the world) with products sold under 18 brands across 5 categories, coming from 18 converting factories around the world. </p><p><br/></p><p>Ensuring supply chain integrity and commitment to the Sustainable Roadmap Vision 2030 are crucial to APP's operations. Learn more about Asia Pulp &amp; Paper (APP)' path to operational excellence by reading our Sustainability Reports and Forest Conservation Policy at:</p><p>https://app.co.id/sustainability-roadmap-vision-2030</p><p><br/></p><p><strong><u>VP of HR Role Overview</u></strong>:</p><p>In this challenging, yet rewarding role, you will play a key role in helping us rapidly expand our North American operations. We are looking for someone with 15 plus years of experience in formulating, devising, and building successful teams over their career. </p><p><br/></p><p><strong><u>Key Responsibilities</u></strong>:</p><ul><li>Take major initiatives to drive organizational effectiveness</li><li>Provide strategic direction, leadership, and support to senior management on workforce planning.</li><li>Supervise the company’s human resources department and the recruitment, interview, selection, and hiring processes</li><li>Ensure implementation of Universal HR processes and practices</li><li>Adhere to all internal policies and legal standards</li><li>Thorough understanding of, labor, and employment laws for compliance</li><li>Devise competitive compensation, benefits, performance appraisal, and employee incentive programs &amp; policies for employees to retain top talent</li><li>Evaluate areas of improvement and brief HR executives</li><li>Determine organizational success and market competitiveness based on KPIs and other business metrics</li><li>Guide plant HR Managers on employee relations, and grievance resolution</li><li>Keep abreast with the latest trends and changes in HR strategies globally</li><li>Participate and represent the company in HR networking events, workshops, and seminars</li><li>Ensure inclusion and diversity by assisting HR business partners and the entire HR department with workforce retention programs and equal opportunity</li></ul><p><br/></p><p><strong><u>Key Requirements</u>:</strong></p><ul><li>At least 15 years of progressive human resource management experience</li><li>Manufacturing industry experience preferably in fast moving consumer goods, (FMCG) </li><li>Excellent verbal and written communication, leadership skills, and organizational skills</li><li>Remarkable interpersonal and conflict-resolution skills</li><li>Strong analytical, supervisory, and problem-solving skills</li><li>Deep understanding of labor relations, international HR processes, employment legislation, and legal regulations</li><li>Thorough understanding and experience of HR functions, including talent acquisition and management</li><li>Skilled in budget preparation and overall fiscal management</li><li>Experienced in formulating policies for hiring and termination</li><li>Skilled in taking exit interviews and formulating policy on employee retention</li><li>Employee development and performance management skills</li><li>Strategic planning and performance measurement skills</li><li>Hands-on experience in using the most advanced HR management software, such as SAP</li><li>Expert in Microsoft Office Suites such as Word, Excel, PowerPoint, and Project</li><li>Thought leader, with a proven digital media presence on social media, like LinkedIn</li><li>Knowledge of business analysis techniques</li></ul><p><br/></p><p><strong><u>Preferred Education Qualifications:</u></strong></p><ul><li>Master’s degree in business administration or human resources </li><li>HR Certifications, such as Professional in Human Resources (HR) and Senior Professional in Human Resources Certification (SPHR)</li></ul><p><br/></p><p><em>Solaris Paper Inc. is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, sexual orientation, or expression.</em></p>", "jobFunction": "Human Resources", "industry": "Paper and Forest Product Manufacturing", "postedDate": "2 days ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004360917"}