{"jobTitle": "Chief Executive Officer (CEO) - Central Valley Electric Cooperative", "company": {"name": "Energy Jobline", "location": "Artesia, CA"}, "location": "Artesia, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Business Development and Sales", "industry": "Staffing and Recruiting", "description": "Job Description<strong>CEO </strong> <strong>Central Valley Electric Cooperative </strong> The Board of Trustees at Central Valley Electric Cooperative (CVE), headquartered in Artesia, NM, is looking for a visionary, principled, and innovative leader to assume the pivotal role of CEO for the cooperative. The ideal candidate would be ready to start in January 2025. CVE’s new leader will replace Chuck Pinson, who is retiring after 38 years of service to the Central Valley members. CVE has partnered with GreatCo-Ops (www.greatcoops.com) to assist with the search. The cooperative is seeking a CEO who demonstrates outstanding leadership, excellent communication skills, and effective relationship-building capabilities. The ideal candidate should have a strategic mindset and the ability to foster collaboration, creating a unified vision for CVE’s future. As the CEO, they will cultivate an organizational culture that empowers CVE’s 85 employees to excel and consistently deliver exceptional service to members. He/she must have the industry experience and competencies required to continue to provide excellent service to the co-op’s diverse membership. It is of utmost importance that the CEO firmly commits to ethics, safety, and CVE’s values. This commitment should be at the core of their leadership approach. Additionally, the CEO should demonstrate self-awareness and foster a collaborative spirit within the team. As the CEO of CVE, they will drive excellence in organizational culture, safety, service, reliability, operations, and fiscal strength. This role demands strong leadership to foster positive relationships with the board, employees, co-op members, regulatory agencies, legislators, energy providers, and the wider community. <strong>About Central Valley Electric Cooperative</strong> CVE energized its first lines in October 1938. Serving more than 4,300 members and approximately 15,000 meters across Chaves, Eddy, Lea, and Otero counties in New Mexico, CVE owns approximately 4,146 miles of distribution lines. In addition, the co-op owns and manages their own substations and transmission with a total plant investment exceeding $224 million. Their service area extends 35 miles north of Roswell to the south of Artesia, including Brantley Lake and just north of Carlsbad Caverns. CVE’s commitment lies in personalized service for its members and the economic vitality of its region. Their mission revolves around providing reliable power at the lowest possible cost and the best member service. As a member-owned cooperative, CVE’s focus remains on meeting members’ needs and ensuring their community thrives. CVE is a member of Western Farmers Electric Cooperative (WFEC), a and transmission cooperative headquartered in Anadarko, OK, which is a part of the Southwest Power Pool (SPP) Market. As a member of WFEC, CVE sources energy from WFEC’s owned facilities and through power purchase agreements. These resources reflect a mix of technologies and fuel types. The in mix helps reduce exposure to changing market conditions, keeping rates competitive. As part of its commitment to community involvement, CVE offers college scholarships to its members and their dependents. Scholarship recipients can receive financial assistance for up to eight semesters of undergraduate studies. Additionally, CVE operates a Safe Haven Program. Their company vehicles, easily recognized by the co-op logo and Safe Haven bumper sticker, serve as safe havens for those who are lost, stranded, hurt, or feeling threatened. Moreover, CVE sponsors high school juniors and seniors for the Government-in-Action Youth Tour to Washington, D.C., providing an all-expense-paid educational experience where students learn about citizenship, meet members of Congress, tour historic sites, and more. CVE is governed by seven dedicated, experienced, and actively involved trustees. The trustees are eager to collaborate with the next CEO to build on CVE’s legacy. For additional information about Central Valley Electric Cooperative, please visit their website at cvecoop.org. <strong>About the Region </strong> Artesia, New Mexico, is a charming city with a rich history and unique features. It is in Eddy County, situated at the intersection of US routes 82 and 285. As of the 2020 census, the city’s population was 12,875. It is nestled between the cities of Roswell to the north and Carlsbad to the south, with the Texas border less than 100 miles to the east and beautiful mountains to the west. Artesia offers small-town comfort and a great quality of life. Artesia is less than a four-hour drive from both Albuquerque and Santa Fe, and less than two hours from the mountains of Ruidoso, Cloudcroft, and the Lincoln Forest for skiing, fly fishing, hiking, horseback riding, and much more. Retail, agriculture, construction, mining, oil and gas, professional scientific and technical services, and hospitality are key drivers of the region’s bustling economy. New Mexico is celebrated for its rich cultural heritage, diverse landscapes, and unique blend of American, Hispanic, and Anglo influences. The state is home to numerous American pueblos, historical sites, and cultural events, such as the Albuquerque International Balloon Fiesta and the Santa Fe Indian Market. Its stunning landscapes range from deserts and high plans to mountain ranges, with notable natural attractions such as White Sands Park, Carlsbad Caverns Park, Bandelier Monument, the Gila Cliff Dwellings, and the Sangre de Cristo Mountains. Known for its vibrant art scene, particularly in Santa Fe and Taos, and its distinctive cuisine, New Mexico also offers abundant outdoor recreation opportunities. Popular fishing spots include Brantley Lake, Lake Van, Pecos River, and Grindstone Lake. The closest airport to Artesia is the Roswell Air Center (ROW), 32 miles from Artesia. <strong>Qualifications </strong> <strong>Required </strong> <em><strong>Applications from those not meeting the required qualifications will not be considered. <br/><br/></strong></em><ul><li>Knowledge of electric utility operations, safety protocols, power supply, member needs and expectations, finance, strategic planning, and risk management </li><li>An understanding of electric utility industry trends, their likely effects on cooperatives, and ways to leverage those trends to benefit CVE and its members </li><li>Verifiable management experience </li><li>Excellent leadership and communication skills </li><li>Demonstrated success in building high-performance teams and excellent organizational cultures where employees thrive </li><li>A focus on delivering an outstanding member experience </li><li>The ability to build a workplace that aligns with CVE’s vision, values, and policies and adheres to federal and state employment regulations </li><li>A demonstrated ability to work collaboratively with boards of trustees, executive teams, employees, and key external stakeholders </li><li>An understanding of – and an appreciation for – the cooperative business model and Seven Cooperative Principles </li><li>A commitment to professional growth and development for self and the employees </li><li>A willingness to travel for meetings at the local, regional, and levels </li><li>Experience at the Vice President level (or equivalent) or above with an electric utility (We recognize that many utilities refer to those reporting to the CEO/GM as something other than “Vice President.” In such situations, individuals who are direct reports to the CEO/GM are welcome to apply, and they should be clear that they are a direct report to the CEO/GM in the cover letter or resume.) </li><li>A bachelor’s degree from an accredited university </li><li>An understanding of the regulatory, political, and legislative environments facing the electric utility industry </li><li>An advanced degree or certification in an area relevant to leading an electric utility, including but not limited to law, management, finance, accounting, economics, or engineering. </li><li>An understanding of how to work effectively with large industrial members with an emphasis in the oil and gas industry </li><li>A strong commitment to long-term service to the cooperative, its employees, and the membership <br/><br/></li></ul><strong>Compensation and Benefits </strong>  In addition to a highly competitive salary, CVE’s new CEO will enjoy the following benefits: pension and 401(k); medical, dental, and vision insurance; long-term insurance; life insurance; death benefit; business travel accident insurance; paid holidays; sick leave and vacation; a 125 flexible spending plan; and a company vehicle. <strong>Application Process and Deadline </strong> Interested individuals who meet the required qualifications must email a cover letter and resume to Monica Beavers, Director of Client Services at GreatCo-Ops, at mbeavers@greatcoops.com. <strong>In addition to discussing the applicant’s fit for the role, the cover letter must also include the individual’s perspectives on one significant trend in the electric utility industry and how it will likely affect CVE, given the cooperative’s unique characteristics. </strong> Professional references and a personality profile will be requested later for progressing applicants. Finalists will undergo a comprehensive background check. The selected candidate must also undergo a pre-employment drug test and physical. <strong>Applications are by September 19, 2024, at 5:00 pm Mountain Time</strong>. However, applications will be reviewed until the position is filled. CVE is an equal opportunity provider and employer.", "responsibilities": "The Board of Trustees at Central Valley Electric Cooperative (CVE), headquartered in Artesia, NM, is looking for a visionary, principled, and innovative leader to assume the pivotal role of CEO for the cooperative. The ideal candidate would be ready to start in January 2025. CVE’s new leader will replace Chuck Pinson, who is retiring after 38 years of service to the Central Valley members. CVE has partnered with GreatCo-Ops (www.greatcoops.com) to assist with the search. The cooperative is seeking a CEO who demonstrates outstanding leadership, excellent communication skills, and effective relationship-building capabilities. The ideal candidate should have a strategic mindset and the ability to foster collaboration, creating a unified vision for CVE’s future. As the CEO, they will cultivate an organizational culture that empowers CVE’s 85 employees to excel and consistently deliver exceptional service to members. He/she must have the industry experience and competencies required to continue to provide excellent service to the co-op’s diverse membership. It is of utmost importance that the CEO firmly commits to ethics, safety, and CVE’s values. This commitment should be at the core of their leadership approach. Additionally, the CEO should demonstrate self-awareness and foster a collaborative spirit within the team. As the CEO of CVE, they will drive excellence in organizational culture, safety, service, reliability, operations, and fiscal strength. This role demands strong leadership to foster positive relationships with the board, employees, co-op members, regulatory agencies, legislators, energy providers, and the wider community.", "qualifications": {"required": "Knowledge of electric utility operations, safety protocols, power supply, member needs and expectations, finance, strategic planning, and risk management, An understanding of electric utility industry trends, their likely effects on cooperatives, and ways to leverage those trends to benefit CVE and its members, Verifiable management experience, Excellent leadership and communication skills, Demonstrated success in building high-performance teams and excellent organizational cultures where employees thrive, A focus on delivering an outstanding member experience, The ability to build a workplace that aligns with CVE’s vision, values, and policies and adheres to federal and state employment regulations, A demonstrated ability to work collaboratively with boards of trustees, executive teams, employees, and key external stakeholders, An understanding of – and an appreciation for – the cooperative business model and Seven Cooperative Principles, A commitment to professional growth and development for self and the employees, A willingness to travel for meetings at the local, regional, and levels, Experience at the Vice President level (or equivalent) or above with an electric utility (We recognize that many utilities refer to those reporting to the CEO/GM as something other than “Vice President.” In such situations, individuals who are direct reports to the CEO/GM are welcome to apply, and they should be clear that they are a direct report to the CEO/GM in the cover letter or resume.), A bachelor’s degree from an accredited university, An understanding of the regulatory, political, and legislative environments facing the electric utility industry, An advanced degree or certification in an area relevant to leading an electric utility, including but not limited to law, management, finance, accounting, economics, or engineering., An understanding of how to work effectively with large industrial members with an emphasis in the oil and gas industry, A strong commitment to long-term service to the cooperative, its employees, and the membership"}, "skills": [], "postedDate": "4 days ago", "benefits": "pension and 401(k); medical, dental, and vision insurance; long-term insurance; life insurance; death benefit; business travel accident insurance; paid holidays; sick leave and vacation; a 125 flexible spending plan; and a company vehicle.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4004268686"}