{"jobTitle": "Affiliate Marketing Internship", "company": {"name": "Beauty & the Broth", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Internship", "employmentType": "Internship", "experienceLevel": "Internship", "jobFunction": "Marketing and Sales", "industry": "Food and Beverage Services", "description": "Affiliate Marketing Intern at Beauty and the Broth<p><strong>Company:</strong> Beauty and the Broth</p><p><strong>Location:</strong> Remote</p><p><strong>Type:</strong> Unpaid Internship (Part-time)</p><p><strong>Website:</strong> www.thebeautyandthebroth.com</p><p><br/></p>About Us:<p>At Beauty and the Broth, we believe in the power of nourishing beauty from the inside out. We specialize in crafting premium bone broth that supports beauty, health, and wellness. Our products are rich in collagen and nutrients, designed to help our customers achieve radiant skin, stronger hair, and overall well-being. We are passionate about promoting a healthy lifestyle and are looking for a driven and creative Affiliate Marketing Intern to join our team.</p><p><br/></p>Role Overview:<p>We are seeking an enthusiastic Affiliate Marketing Intern to assist in expanding our affiliate program. The ideal candidate is a motivated self-starter with a keen interest in digital marketing, influencer partnerships, and brand building. This internship will provide hands-on experience in affiliate marketing, giving you the opportunity to contribute to our growing brand while developing valuable skills for your future career.</p><p><br/></p>Key Responsibilities:<p><br/></p><ul><li>Assist in identifying and recruiting potential affiliates, influencers, doctors, and partners who align with Beauty and the Broth's brand values.</li><li>Help manage and maintain relationships with existing affiliates, providing them with support, resources, and content to promote our products effectively.</li><li>Monitor affiliate performance, track sales, and analyze data to optimize campaigns and drive growth.</li><li>Collaborate with the marketing team to create engaging content and promotional materials for affiliates.</li><li>Stay updated on industry trends, best practices, and emerging platforms in affiliate and influencer marketing.</li><li><span>Develop brand materials and presentation decks to support outreach efforts to potential affiliates and partners.</span></li><li>Provide regular reports on the success of affiliate marketing initiatives and suggest improvements.</li></ul><p><br/></p>Qualifications:<ul><li>Currently pursuing or recently completed a degree in Marketing, Business, Communications, or a related field.</li><li>Strong interest in digital marketing, e-commerce, and the health and wellness industry.</li><li>Excellent communication skills, both written and verbal.</li><li>Proficiency in social media platforms and a basic understanding of affiliate marketing concepts.</li><li>Ability to work independently and manage time effectively in a remote work environment.</li><li>Detail-oriented with strong analytical and organizational skills.</li><li>Familiarity with affiliate marketing tools and platforms (e.g., ShareASale, Commission Junction) is a plus, but not required.</li></ul><li><br/></li>What We Offer:<ul><li>Flexible working hours to accommodate your schedule.</li><li>A collaborative and supportive work environment with opportunities for professional growth.</li><li>Hands-on experience in a fast-growing, mission-driven company.</li><li>Plenty of bone broth to keep you glowing from the inside out!</li></ul><p><em>Please note: This is an unpaid internship, but the experience and bone broth benefits will be worth it!</em></p>", "postedDate": "4 days ago", "skills": ["Digital Marketing", "Affiliate Marketing", "Influencer Marketing", "Social Media", "Brand Building", "Communication", "Content Creation", "Data Analysis", "Relationship Management", "Time Management", "Remote Work", "E-commerce", "Health and Wellness", "ShareASale", "Commission Junction"], "url": "https://www.linkedin.com/jobs/view/4004366327"}