{"jobTitle": "Facilities Coordinator", "company": {"name": "JLL", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Real Estate", "description": "<strong><strong>What this job involves</strong> – The Facilities Coordinator will provide support to the Site and/or Assistant Facility Managers with operational activities in maintenance and operations, accounting and finance, vendor oversight, equipment and supplies, occupancy services and proactively develop and maintain client relationships ensuring that expected service levels are achieved.<br/><br/></strong><strong><em>You are a Subject Matter Expert in... </em>Building positive client and vendor relationships while ensuring overall operations are maintained at a high level. <br/><br/></strong><strong><em>Service Delivery<br/><br/></em></strong><ul><li> Actively support an environment of teamwork, cooperation, performance excellence, and personal success. </li><li>Conduct daily walkthroughs to ensure a clean and organized office. </li><li>Respond to all work orders in a timely manner, ensuring KPI compliance and excellent customer service. </li><li>Identify opportunities for improved operation and service excellence, making recommendations for conduct site inspections and assessments to ensure all building procedures and performance measures are maintained at all times and the provision of a safe workplace. </li><li>Schedule and manage repairs and maintenance, minor works and other work requests, tracking to completion. </li><li>Provide information and direction to vendors, facilities staff and other service providers as required to ensure excellent coordination and execution of work, with minimal disruption. </li><li>Assist in the procurement of vendors and services as required. </li><li>Coordinate the delivery of site amenities which may include: fitness, food services, massage, transportation, support moves as required and act as the site key point of contact. </li><li>Provide coordination and support events, meeting and conference facilities as required. </li><li>Other duties that may include but are not limited to: reception and guest support, mail and courier services, office supplies and equipment maintenance, landlord relations and management of building access passes, safety and security support. </li><li>Update and maintain accurate records and official documentation for the site/s including web pages where any other activities to support JLL and/or operations, including, but not limited to: moves/reconfigurations, events, reception, and building operations. </li><li>Maintain and propose emergency response plans including evacuation, implementation of after-hours emergency response, and environmental health and safety. <br/><br/></li></ul><strong><em>Client Relationship Management<br/><br/></em></strong><ul><li>Comply with all requirements of the client contract and meet or exceed Key Performance Indicators. </li><li>Deliver an exceptional quality of service, as reflected by client feedback. </li><li>Coordinate site operations in accordance with all agreed policies, procedures and contract scope. <br/><br/></li></ul><strong><strong>Sound like you? To apply you need to be:</strong> <br/><br/></strong><ul><li>Prior experience in facilities, property management, hospitality or related fields preferred. </li><li>Knowledge of local occupational health and safety requirements, critical facilities and vendor management for specialized services is advantageous. </li><li>Understanding of basic technical aspects of property (computer room air-conditioning, chiller system, fire protection system, mechanical &amp; electrical system) is advantageous. </li><li>Proficiency in a range of information technology tools and platforms. </li><li>Excellent communication, organization and problem solving skills. </li><li>Ability to work independently with little supervision and effectively deal with stressful situations. </li><li>Ability to occasionally lift, push, move as needed for job duties. </li><li>Self-motivated; confident, energetic and flexible.</li></ul>", "postedDate": "2 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004722622"}