{"jobTitle": "SIR Project Scientist", "company": {"name": "EBI Consulting", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "70,000.00 - 85,000.00", "currency": "USD"}, "jobFunction": "Consulting", "industry": "Environmental Services", "description": "At EBI we’re committed to providing deep technical, industry and commercial real estate expertise to help our clients navigate complexity and realize maximum value for their assets. For 35 years we’ve been helping investors, lenders, owners, developers, contractors, and property managers mitigate risk and optimize their built facilities for maximum economic, safety, and environmental value. We’re unique in our ability to deliver high quality, responsive services across the entire asset lifecycle, from rapid assessments, to advisory, to implementation and verification services, nationwide. Unlike other environmental consulting firms, we provide the full suite of commercial real estate and asset management services through to improvement and verification. Our experts leverage our proprietary assessment methodologies, benchmarking, regulation, and analytics tools across six core domains.\n\n \n\nEBI is your environmental, sustainability, engineering and health and safety partner, nationwide. \n\n \n\nAssess. Advise. Improve. Verify.\n\n \n\n**Position Summary**\n\nEBI Consulting is seeking a full-time Project Scientist in the Site Investigation and Remediation (SIR) Services Group to conduct Phase II Subsurface Investigation and remediation projects for commercial real estate, lending, telecommunications, industrial, institutional, and public sector clientele.  This position requires a strong understanding of and experience with site characterization, environmental sampling techniques and methodologies (soil, groundwater, surface water, sediment, soil vapor, indoor air, etc.), data analysis, remediation technologies, state and Federal environmental regulatory framework, and managing drilling subcontractors and laboratories.  Additional experience is required in transactional due diligence associated with private sector and financial institutions, including Phase I Environmental Site Assessments (ESAs).  Experience conducting response actions and preparing regulatory submittal reports under California or other state technical requirements is a plus.  \n\n \n\nThis position reports to the Senior Project Manager and is a fully remote, work from home position. This position will travel to client sites primarily in the Southern California market approximately 50% of the week, so candidates need to already be established in this area and comfortable with both travel and working in a remote setting.\n\n \n\n** **\n\n**Essential Duties and Responsibilities**\n\n<ul>\n<li>Conduct subsurface investigation and remediation field activities, including environmental sampling (soil, groundwater, surface water, sediment, soil vapor, indoor air, etc.) and manage drilling subcontractors and laboratories</li>\n<li>Prepare technical report deliverables with supporting documentation (site figures, tables, appendices, etc.)</li>\n<li>Travel on short notice (one week or less) will be required at times</li>\n</ul>\n\n \n\n \n\n**Qualifications and Capabilities**\n\n<ul>\n<li>Bachelor's degree or higher from accredited college or university in Environmental Engineering, Geology, Environmental Science, or related field</li>\n<li>A minimum of 3-5 years of professional experience in environmental consulting, including Phase II Subsurface Investigation and remediation projects</li>\n<li>Specific experience conducting response actions and preparing regulatory submittal reports under California or other state technical requirements is a plus</li>\n<li>OSHA 29 CFR 1910.120 40 Hour Hazardous Waste Operations &amp; Rescue (HAZWOPER) Training Certification is required</li>\n<li>Specific registration credentials are not required. However, Professional Geologist (P.G.), Professional Engineer (P.E.), or similar professional environmental certification/licensure is a plus</li>\n<li>Asbestos Inspector Certification is a plus</li>\n</ul>\n\n \n\n \n\n**Application Disclaimer**\n\nAt EBI, we cultivate a welcoming and collaborative culture. We are proud to be an Equal Employment Opportunity employer and encourage diverse candidates to apply. We do not discriminate against qualified individuals based on their status as a protected veteran or individuals with disabilities, nor do we discriminate based on sex, race, color, religion, national origin, age, marital status, gender identity, gender expression, or sexual orientation. All vendors are expected to maintain a working environment free from discrimination or harassment.\n\n \n\n*The reasonable estimate of the salary range for this position is $70,000 - $85,000. The salary range describes the minimum to maximum base salary range for this position across applicable US locations. This position may also be eligible for a bonus whereby total compensation may exceed base salary depending on individual performance. The actual compensation offered will be based on a range of factors that are considered in making compensation decisions including, but not limited to; geographic location, work experience, education, licensure requirements, knowledge, skills/level, qualifications and budget.*\n\n Angeles ", "responsibilities": "<ul>\n<li>Conduct subsurface investigation and remediation field activities, including environmental sampling (soil, groundwater, surface water, sediment, soil vapor, indoor air, etc.) and manage drilling subcontractors and laboratories</li>\n<li>Prepare technical report deliverables with supporting documentation (site figures, tables, appendices, etc.)</li>\n<li>Travel on short notice (one week or less) will be required at times</li>\n</ul>", "qualifications": {"required": "Bachelor's degree or higher from accredited college or university in Environmental Engineering, Geology, Environmental Science, or related field\nA minimum of 3-5 years of professional experience in environmental consulting, including Phase II Subsurface Investigation and remediation projects\nOSHA 29 CFR 1910.120 40 Hour Hazardous Waste Operations &amp; Rescue (HAZWOPER) Training Certification is required", "preferred": "Specific experience conducting response actions and preparing regulatory submittal reports under California or other state technical requirements is a plus\nProfessional Geologist (P.G.), Professional Engineer (P.E.), or similar professional environmental certification/licensure is a plus\nAsbestos Inspector Certification is a plus"}, "skills": ["Environmental Consulting", "Phase II Subsurface Investigation", "Remediation", "Site Characterization", "Environmental Sampling", "Data Analysis", "Remediation Technologies", "Environmental Regulations", "Drilling Subcontractor Management", "Laboratory Management", "Transactional Due Diligence", "Phase I Environmental Site Assessments", "Response Actions", "Regulatory Submittal Reports", "California Environmental Regulations", "OSHA HAZWOPER", "Professional Geologist", "Professional Engineer", "Asbestos Inspector"], "postedDate": "2 days ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4004981479"}