{"jobTitle": "Senior Director Human Resources", "company": {"name": "Summit Staffing Partners", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Human Resources and Management", "industry": "Retail, Retail Apparel and Fashion, and Retail Luxury Goods and Jewelry", "description": "<strong>Overview</strong>\n<p>Our client is a leading luxury beauty brand dedicated to delivering exceptional products and experiences with a commitment to innovation, quality, and sustainability has positioned us as a trusted name in the beauty industry. Their team is seeking a dynamic and experienced Senior Director of Human Resources to join our team and help us continue to foster a vibrant, inclusive, and high-performing workplace.</p>\n<p>This role is based out of their Culver City, CA office and has a “hybrid” model, of work both in office, as well as from home / remotely.</p>\n<p><br/></p>\n<p><strong>Job Description</strong></p>\n<p>As the Senior Director of Human Resources, you will play a critical role in shaping our company culture, driving HR initiatives, and ensuring that our workforce remains engaged, motivated, and aligned with our strategic goals. Reporting and partnering directly to the VP of Human Resources, you will lead a team of HR professionals and work closely with senior leadership to develop and implement HR strategies that support our business objectives.</p>\n<p><br/></p>\n<p><strong>Key Responsibilities</strong></p>\n<ul><li><strong>Strategic HR Leadership:</strong> Develop and execute HR strategies that align with the company’s business goals and objectives. Provide strategic guidance on organizational development, talent management, and workforce planning.</li><li><strong>Talent Acquisition and Management:</strong> Oversee the recruitment and onboarding process to attract top talent. Implement talent management programs to develop, retain, and engage employees at all levels.</li><li><strong>Employee Relations:</strong> Foster a positive and inclusive workplace culture. Address employee concerns and conflicts with a focus on resolution and maintaining a productive work environment.</li><li><strong>Performance Management:</strong> Lead the design and implementation of performance management systems. Provide coaching and support to managers on performance reviews, goal setting, and employee development.</li><li><strong>Compensation and Benefits:</strong> Develop and administer competitive compensation and benefits programs. Ensure compliance with legal requirements and industry best practices.</li><li><strong>Training and Development:</strong> Identify training needs and implement programs to enhance employee skills and career development. Promote continuous learning and professional growth.</li><li><strong>Compliance and Risk Management:</strong> Ensure compliance with all federal, state, and local employment laws and regulations. Mitigate HR-related risks through proactive policies and practices.</li><li><strong>HR Metrics and Reporting:</strong> Utilize HR data and analytics to measure the effectiveness of HR initiatives and drive continuous improvement. Prepare and present reports to senior leadership.</li></ul>\n<p><br/></p>\n<p><strong>Qualifications</strong></p>\n<ul><li>Bachelor’s degree in Human Resources, Business Administration, or a related field (Master’s degree preferred).</li><li>10+ years of progressive HR experience, with at least 5 years in a leadership role within the luxury beauty or consumer products industry.</li><li>Proven track record in developing and implementing HR strategies that drive business results.</li><li>Strong knowledge of employment laws, regulations, and HR best practices.</li><li>Excellent interpersonal and communication skills, with the ability to build relationships at all levels of the organization.</li><li>Demonstrated experience in talent acquisition, employee relations, performance management, and compensation and benefits.</li><li>Ability to lead and inspire a team of HR professionals.</li><li>High level of integrity, professionalism, and confidentiality.</li><li>Our client offers a strong compensation package, comprehensive benefits, and opportunities for professional growth and development. Join us and be part of a company that is redefining luxury beauty.</li></ul><p></p>", "responsibilities": "As the Senior Director of Human Resources, you will play a critical role in shaping our company culture, driving HR initiatives, and ensuring that our workforce remains engaged, motivated, and aligned with our strategic goals. Reporting and partnering directly to the VP of Human Resources, you will lead a team of HR professionals and work closely with senior leadership to develop and implement HR strategies that support our business objectives.", "qualifications": {"required": "Bachelor’s degree in Human Resources, Business Administration, or a related field (Master’s degree preferred). 10+ years of progressive HR experience, with at least 5 years in a leadership role within the luxury beauty or consumer products industry. Proven track record in developing and implementing HR strategies that drive business results. Strong knowledge of employment laws, regulations, and HR best practices. Excellent interpersonal and communication skills, with the ability to build relationships at all levels of the organization. Demonstrated experience in talent acquisition, employee relations, performance management, and compensation and benefits. Ability to lead and inspire a team of HR professionals. High level of integrity, professionalism, and confidentiality.", "preferred": ""}, "skills": [], "postedDate": "1 day ago", "benefits": "Our client offers a strong compensation package, comprehensive benefits, and opportunities for professional growth and development.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4004393753"}