{"jobTitle": "Junior Account Manager", "company": {"name": "Valyrian Consultants", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Our Junior Account Managers have the opportunity to work with one of the most renowned household names for the latest in technology, top-of-the-line communications, and the best entertainment on the market. With growth comes opportunity, and we are looking for the ideal Junior Account Manager to think BIG and grow with us. Our senior-level Sales Managers do an excellent job at mentoring and shaping our Junior Account Managers to be the best version of themselves. If you’re looking for a fun, encouraging, and insightful new career opportunity where your creativity is put to the test, then look no further.<br/><br/>Our Junior Account Managers:<br/><br/><ul><li>Build customized packages for new clients and perform demonstrations and onsite meetings</li><li>Utilize consultative selling techniques to identify key market trends, unclose customer demands, and leverage industry knowledge to detect and close sales opportunities</li><li>Create meaningful relationships through an outstanding presentation, strategic thinking, and personalized interaction with every client</li><li>Understand the communication and technology needs of consumers by attending client meetings and maintaining knowledge of our client’s product and sales offerings</li><li>Propose customized solutions to meet the unique business needs of consumers</li><li>Communicate expertise in AT&amp;T services by hands-on sales demos</li><li>Ensure a flawless delivery of the customer experience from sale to installment to foster relationships and grow a larger client network</li><li>Collaborate with the Junior Account Manager to improve the client experience and set sales targets<br/><br/></li></ul>Junior Account Manager Qualifications:<br/><br/><ul><li>0-3 years of experience as a Junior Account Manager, Sales Associate, or equivalent</li><li>Bachelor's degree in Business, Communications, or related field</li><li>Honest, trustworthy, and operate with integrity</li><li>Keen eye for detail and clear communication abilities</li><li>Ability to perform a variety of tasks simultaneously and under pressure</li><li>Ability to work both independently and cooperatively as part of a team with enthusiasm, initiative, and creativity</li><li>Adaptable, open to new ideas, and willing to take on new responsibilities</li><li>Natural overachiever with a drive for superiority <br/><br/></li></ul>Powered by JazzHR<br/><br/>wUkdgQV5x5", "postedDate": "3 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004576113"}