{"jobTitle": "Global Associate Merchandiser", "company": {"name": "Silver Jeans Co.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Merchandising", "industry": "Apparel & Fashion", "description": "<strong><u>JOIN OUR FAMILY!</u></strong><br/><br/>At Silver Jeans, we believe that all good jeans have a story to tell–and our story starts in Winnipeg in 1921 at Western Glove Works, a family run business founded by the Silver family. Western Glove Works is now the oldest privately held denim producer in North America. <br/>That’s over 100 years of craft at your service.<br/><br/><strong><u>Job Summary</u></strong><br/><br/><span> As the Global Associate Merchandiser, you will lead, create, and drive assortment strategies based on current inventory and the need of specific markets. By partnering with the Vice President of Merchandising, you will be the expert on customer needs and marketplace capacity. The Associate Merchandiser will drive cross-functional alignment with Design, Product Development, Sales, Production &amp; Planning to ensure the right product is delivered on- time and meets all customer requirements.</span><br/><br/><strong><u>RESPONSIBILITIES</u></strong><ul><li><span>Create Seasonal Line Planning and assortment strategies for Men’s &amp; Women’s product with an understanding of fabric and materials, as well as lead times</span></li><li><span>Merchandise and present seasonal product assortments that meet sales and margin targets</span></li><li><span>Maintain seasonal sku counts and effectively manage all product lifecycles as it relates to Replenishment, Repeat and Fashion styles</span></li><li><span>Drive growth by partnering with cross functional teams to help develop assortment strategies with respect to category, SKU count, breadth vs. depth, and new vs. carryover</span></li><li><span>Track business performance; Identify risks and opportunities for reacting to current business</span></li><li><span>Participate in key business meeting throughout the product creation process</span></li><li><span> Attend all pertinent meetings for the division and provide recommendations as needed based on knowledge of trend and selling data</span></li><li><span>Help present seasonal product assortment to upper management, wholesale and global team</span></li><li><span>Keen understanding of competitive and trend landscape</span></li></ul><br/><br/><strong><u>QUALIFICATIONS</u></strong><ul><li><span>Minimum of 3 years Buying/Merchandising experience</span></li><li><span>Proven business and strategic acumen and possess merchandising planning skills</span></li><li><span>Knowledge of OTB management and financial modeling</span></li></ul><br/><br/><strong><u>SUCCESS FACTORS</u></strong><ul><li><span> Entrepreneur spirit and thrives in a fast-paced environment</span></li><li><span>Natural leader and problem solver with a growth mindset</span></li><li><span>Self-starter who can work proactively &amp; independently as well as collaboratively</span></li><li><span>Excellent communication and organizational skills</span></li><li><span> Excellent Excel skills</span></li></ul><br/>", "responsibilities": "Create Seasonal Line Planning and assortment strategies for Men’s & Women’s product with an understanding of fabric and materials, as well as lead times, Merchandise and present seasonal product assortments that meet sales and margin targets, Maintain seasonal sku counts and effectively manage all product lifecycles as it relates to Replenishment, Repeat and Fashion styles, Drive growth by partnering with cross functional teams to help develop assortment strategies with respect to category, SKU count, breadth vs. depth, and new vs. carryover, Track business performance; Identify risks and opportunities for reacting to current business, Participate in key business meeting throughout the product creation process, Attend all pertinent meetings for the division and provide recommendations as needed based on knowledge of trend and selling data, Help present seasonal product assortment to upper management, wholesale and global team, Keen understanding of competitive and trend landscape", "qualifications": {"required": "Minimum of 3 years Buying/Merchandising experience, Proven business and strategic acumen and possess merchandising planning skills, Knowledge of OTB management and financial modeling"}, "skills": ["Merchandising", "Line Planning", "Assortment Planning", "Sales", "Product Development", "Financial Modeling", "OTB Management", "Trend Analysis", "Competitive Analysis", "Cross-Functional Collaboration"], "postedDate": "1 day ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004356041"}