{"jobTitle": "Sr. Human Resources Generalist  24-00633", "company": {"name": "Alura Workforce Solutions", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$45.00 - $48.00", "currency": "USD"}, "jobFunction": "Other", "industry": "IT Services and IT Consulting", "description": "<strong>POSITION <br/><br/></strong><strong>Sr. Human Resources Generalist<br/><br/></strong><strong>(Hospital, Employee Relations And Union Experience Required)<br/><br/></strong>Position Type: LOA 3-6 months. Extension is possible<br/><br/>Pay: $45.00 - $48.00<br/><br/>Onsite in Long Beach<br/><br/><strong>Description<br/><br/></strong>The Sr. Human Resources Generalist performs professional duties in proactively enhancing an effective human resources program. This position will serve as a key HR professional delivering Human Resources services and support. Areas of responsibility include employee relations, compliance, leaves of absences, employee file maintenance, performance evaluations, contract staff, HRIS, Onboarding of New hires, and employee events. This position works in collaboration with the Sr. Human Business Partners in supporting the organizations strategic needs.<br/><br/><strong>Essential Functions And Responsibilities Of The Job<br/><br/></strong><ul><li>Triages calls received through the Employee Relations Hotline to ensure timeline support and necessary escalation of issues or concerns. </li><li>Provide interpretation and explanation of current company policies, procedures, and Collective Bargaining Agreements to leaders and employees, escalating complex and potentially risky issues appropriately. </li><li>Ensures compliance with policies related to performance evaluations, leaves of absence, compensation, benefits, licensure, orientation, Employee Action Forms (EAF) and other related transactions. </li><li>Ensures compliance with state/federal laws, regulations and ordinances as well as compliance with regulatory agencies, such as The Joint Commission and the California Department of Public Health (CDPH). </li><li>Supports programs including training, recruitment, HRIS, performance management, employee relations, organizational development, employment law compliance, benefits administration, compensation, employee events, and new hire orientation. </li><li>Leads in the planning and coordinating employee functions and activities. Participates in Hospital Committees, task forces and events. </li><li>Maintains current knowledge and facilitates resolution of questions and issues that arise from concerns or interest in any organizational and/or facility policy, procedure, program or benefit. </li><li>Ensures employee and contract files are complaint with The Joint Commission standards. Conducts human resources related analyses and researches and prepares related reports. </li><li>Performs the day-to-day maintenance of various HR related tasks such as, but not limited to tuition reimbursement, employment verification, benefits enrollment, leaves, subpoenas, data entry of employee information, running reports, tracking information, assisting staff with specific requests and assisting employees with general information requests. </li><li>Works in collaboration with other Human Resources Staff to ensure information flow and secure positive operational results within department. </li><li>Performs other duties as assigned. <br/><br/></li></ul><strong> REQUIREMENTS <br/><br/></strong><ul><li>Must have an Employee Relations Background within a Hospital setting AND Union experience. </li><li>5+ years of HR Generalist experience </li><li>Knowledge and hands-on experience with several HR areas including recruitment, compensation, performance management, employee engagement, benefits management including leaves, ADA &amp; workers compensation, and employee and labor relations. </li><li>Excellent computer skills in a Microsoft Windows environment that includes Office 365 </li><li>Demonstrated skill in database management and record keeping. </li><li>Strong working knowledge of all relevant or applicable employment laws including federal and state wage and hour requirements. </li><li>Bachelor's degree preferred. </li><li>Professional in Human Resources (PHR or SPHR) is a plus. <br/><br/></li></ul>INDH", "responsibilities": "The Sr. Human Resources Generalist performs professional duties in proactively enhancing an effective human resources program. This position will serve as a key HR professional delivering Human Resources services and support. Areas of responsibility include employee relations, compliance, leaves of absences, employee file maintenance, performance evaluations, contract staff, HRIS, Onboarding of New hires, and employee events. This position works in collaboration with the Sr. Human Business Partners in supporting the organizations strategic needs.", "qualifications": {"required": "Must have an Employee Relations Background within a Hospital setting AND Union experience. 5+ years of HR Generalist experience Knowledge and hands-on experience with several HR areas including recruitment, compensation, performance management, employee engagement, benefits management including leaves, ADA &amp; workers compensation, and employee and labor relations. Excellent computer skills in a Microsoft Windows environment that includes Office 365 Demonstrated skill in database management and record keeping. Strong working knowledge of all relevant or applicable employment laws including federal and state wage and hour requirements.", "preferred": "Bachelor's degree preferred. Professional in Human Resources (PHR or SPHR) is a plus."}, "skills": ["Employee Relations", "HR Generalist", "Recruitment", "Compensation", "Performance Management", "Employee Engagement", "Benefits Management", "Leaves", "ADA", "Workers Compensation", "Employee and Labor Relations", "Microsoft Windows", "Office 365", "Database Management", "Record Keeping", "Employment Laws", "Federal and State Wage and Hour Requirements", "Bachelor's Degree", "PHR", "SPHR"], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004993940"}