{"jobTitle": "District Manager", "company": {"name": "Pick Up Stix", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management", "industry": "Restaurants", "description": "<strong>Multi-Unit Manager - District Manager - Area Supervisor</strong><br/><br/><strong>Who we are:</strong><br/><br/>Pick Up Stix, is one of four concepts owned and operated by West Coast Capital, the second largest Operator of fast casual/quick-service Chinese restaurants in the U.S.<br/><br/>Pick Up Stix’s story began in 1989 in Laguna Niguel, California. The concept was developed around the idea of taking the best traditional Chinese food and adapting it to American tastes. Unlike our competitors who serve food from steam tables, our focus continues to be on fresh, high-quality food wok’d fresh to order and served in a friendly, comfortable environment. Our exhibition kitchens treat our Guests to a show of the art of Chinese cooking as they watch their dish being prepared to order. We strive to be our Guest’s neighborhood choice for Asian food.<br/><br/><strong>What we are looking for:</strong><br/><br/>We are looking for smart, responsible, driven and talented leaders who have a passion for service, quality, teamwork and cleanliness to lead 6 to 8 restaurants. We want great leaders that have a deep understanding of our guests and communities. You will develop strong leaders, encourage teamwork, create amazing guest experiences, maintain high standards and drive financial performance in your region.<br/><br/><strong>What we offer:</strong><br/><br/><ul><li>Competitive salary based on experience</li><li>Bonus opportunity</li><li>Paid vacation</li><li>Medical, dental, vision, short term and long-term disability, and 401(k) plans</li><li>Paid mileage expense</li><li>Cell phone reimbursement</li><li>Various paid holidays</li></ul><br/><br/><strong>What you will do:</strong><br/><br/><ul><li>Take a hands-on management approach with all team members and 6 to 8 restaurants to drive the vision, brand and direction of our Company</li><li>Be accountable for all functional areas within your region including full P&amp;L, FOH/BOH Operations, Sales, Accounting and Human Resources</li><li>Hire great talent for your locations</li><li>Coach, train and support restaurant managers and team members on the service model, menu execution, systems and program implementation</li><li>Set and uphold standards, goals and strategies</li><li>Focus on problem solving and process improvement by leveraging restaurant management in each location</li><li>Motivate and recognize restaurant managers and their teams for their accomplishments</li><li>Role model appropriate skills and behaviors in their restaurants</li></ul><br/><br/><strong>Requirements:</strong><br/><br/><ul><li>2 years of previous multi-unit management experience in a restaurant, retail, hospitality or similar environment</li><li>Excellent verbal and written communication skills</li><li>Excellent planning, organizing and follow-up skills</li><li>Strong decision making and conflict resolution skills</li><li>Manage time effectively and reach objectives within specified time frames</li><li>Communicate detailed knowledge of restaurant standards, in a top-of-mind manner, to both employees and managers</li><li>Experience working in a hands-on, fast paced environment</li><li>High School diploma or GED required, bachelor’s degree a plus</li></ul><br/><strong>Working Conditions:</strong><ul><li>Must be able to travel</li><li>Must be able to stand and walk for periods of eight to twelve hours in length each shift</li><li>Must be able to reach, bend, balance and transport various objects weighing up to 30lbs repeatedly during a shift</li></ul><p></p>", "responsibilities": "<ul><li>Take a hands-on management approach with all team members and 6 to 8 restaurants to drive the vision, brand and direction of our Company</li><li>Be accountable for all functional areas within your region including full P&amp;L, FOH/BOH Operations, Sales, Accounting and Human Resources</li><li>Hire great talent for your locations</li><li>Coach, train and support restaurant managers and team members on the service model, menu execution, systems and program implementation</li><li>Set and uphold standards, goals and strategies</li><li>Focus on problem solving and process improvement by leveraging restaurant management in each location</li><li>Motivate and recognize restaurant managers and their teams for their accomplishments</li><li>Role model appropriate skills and behaviors in their restaurants</li></ul>", "qualifications": {"required": "2 years of previous multi-unit management experience in a restaurant, retail, hospitality or similar environment, Excellent verbal and written communication skills, Excellent planning, organizing and follow-up skills, Strong decision making and conflict resolution skills, Manage time effectively and reach objectives within specified time frames, Communicate detailed knowledge of restaurant standards, in a top-of-mind manner, to both employees and managers, Experience working in a hands-on, fast paced environment, High School diploma or GED required, bachelor’s degree a plus", "preferred": ""}, "skills": [], "postedDate": "2 days ago", "benefits": "<ul><li>Competitive salary based on experience</li><li>Bonus opportunity</li><li>Paid vacation</li><li>Medical, dental, vision, short term and long-term disability, and 401(k) plans</li><li>Paid mileage expense</li><li>Cell phone reimbursement</li><li>Various paid holidays</li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004354105"}