{"jobTitle": "Customer Service Rep / Dealer Services", "company": {"name": "RemoteWorker CA", "location": "Buena Park, CA"}, "location": "Buena Park, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/>Join one of the top 20 auto finance companies in the industry and grow with us! We offer in-house promotions, great benefits, work-life balance, and job stability. If you're looking to work for a rewarding company that encourages their employees to learn and develop, then partner with Lobel.<br/><br/><strong><strong>Position Summary<br/><br/></strong></strong>The Dealer Services Representative provides excellent customer service to dealers through our caller support center, phone, internet and email. The ideal candidate will represent the company in a professional manner, is time efficient, organized, detail oriented, able to prioritize duties, and adhere to company policies and procedures.<br/><br/><strong><strong>Basic Responsibilities<br/><br/></strong></strong><ul><li>Provide exceptional customer service to dealers while supporting the company's objectives</li><li>Learn and become proficient with the company guidelines</li><li>Work in a fast paced environment with a supportive team</li><li>Call and collect buy backs, obtain title updates and complete dealer packages<br/><br/></li></ul><strong><strong>Skills &amp; Qualifications <br/><br/></strong></strong><ul><li>Strong interpersonal and written communication skills</li><li>Organizational and problem solving skills</li><li>Experience with Microsoft Office is a plus</li><li>Ability to multi-task</li><li>Basic computer skills using common internet browsers and email</li><li>Knowledge of motor vehicle finance industry or some experience in an automobile dealership is preferred</li><li>Experience providing customer support via telephone and through remote desktop support software</li><li>Bilingual English / Spanish a plus but not necessary</li><li>High School graduate<br/><br/></li></ul><strong><strong>Company Benefits<br/><br/></strong></strong><ul><li>401K with company match</li><li>Medical, dental and vision</li><li>Optional life insurance</li><li>Paid holidays</li><li>Paid vacation and sick days<br/><br/></li></ul>Lobel Financial is an equal opportunity employer.<br/><br/><strong>Company Description<br/><br/></strong>Lobel Financial is a full-spectrum auto financing solution that specializes in the acquisition and servicing of prime to sub-prime motor vehicle retail installment contracts. We are head quartered in Southern California and have branch offices coast-to-coast.<br/><br/>Employees choose Lobel Financial because of the work-life balance, positive company culture, reward system, benefits and flexibility. If you are an employee and you want to work with a company that is consistently growing, offers competitive salaries and benefits, promotes their employees, and provides a stable work environment, then you've found it with Lobel Financial.<br/><br/><strong>Company Description<br/><br/></strong>Lobel Financial is a full-spectrum auto financing solution that specializes in the acquisition and servicing of prime to sub-prime motor vehicle retail installment contracts. We are head quartered in Southern California and have branch offices coast-to-coast. Employees choose Lobel Financial because of the work-life balance, positive company culture, reward system, benefits and flexibility. If you are an employee and you want to work with a company that is consistently growing, offers competitive salaries and benefits, promotes their employees, and provides a stable work environment, then you've found it with Lobel Financial.", "responsibilities": "The Dealer Services Representative provides excellent customer service to dealers through our caller support center, phone, internet and email. The ideal candidate will represent the company in a professional manner, is time efficient, organized, detail oriented, able to prioritize duties, and adhere to company policies and procedures.", "qualifications": {"required": "Strong interpersonal and written communication skills, Organizational and problem solving skills, Experience with Microsoft Office is a plus, Ability to multi-task, Basic computer skills using common internet browsers and email, Knowledge of motor vehicle finance industry or some experience in an automobile dealership is preferred, Experience providing customer support via telephone and through remote desktop support software, Bilingual English / Spanish a plus but not necessary, High School graduate"}, "skills": ["Customer Service", "Microsoft Office", "Communication", "Problem Solving", "Computer Skills", "Motor Vehicle Finance", "Telephone Support", "Remote Desktop Support", "Bilingual"], "postedDate": "2 days ago", "benefits": "401K with company match, Medical, dental and vision, Optional life insurance, Paid holidays, Paid vacation and sick days", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004358731"}