{"jobTitle": "Shift Supervisor", "company": {"name": "Yogurtland", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Food and Beverage Services", "description": "The Shift Supervisor ensures company standards are met in the event the Store Manager is unavailable and to ensure Associates comply with policies and procedures. Assist the Store Manager in the development and compliance with policies and procedures. Upholds and executes the vision and mission of Yogurtland and assists others in doing the same.<br/><br/><strong>JOB RESPONSIBILITIES: <br/><br/></strong><ul><li>Cash Handling (drawer balancing, safe deposits, etc.) is accountable for funds.</li><li>Assisting with shift scheduling.</li><li>Coordinate and communicate individual Associates duties throughout shift.</li><li>Assist in training, coaching and development of newly hired Associates.</li><li>Follows and ensures Associates adhere to meal and break periods.</li><li>Taste product to ensure quality standards are met.</li><li>Is the “role-model” for outstanding customer service and overall Associate standards.</li><li>Ensures cleanliness, health and safety standards are maintained at all times.</li><li>Other job-related activities as requested by Store Leader.<br/><br/><br/></li></ul><strong>QUALIFICATIONS:<br/><br/></strong><ul><li>Ability to maintain confidential information in the strictest of confidence.</li><li>1-year previous supervisory experience preferred but not required.</li><li>Ability to maintain a fast pace.</li><li>Ability to problem solve quickly and effectively.</li><li>Effective customer service skills delivered with a friendly disposition.</li><li>Basic management skills.</li><li>Ability to handle responsibility.</li><li>Ability to communicate clearly and concisely.</li><li>Ability to lead others in always upholding company standards.</li><li>ServSafe or equivalent food handler’s certification.<br/><br/><br/></li></ul>Duties, Responsibilities, and/or Activities may change at any time, with or without notice.<br/><br/>CG Yogurt/Socal Frozen Treats will consider qualified applicants with criminal histories for employment pursuant to the California Fair Chance Act (AB 1008)", "postedDate": "2 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004938991"}