{"jobTitle": "QA Manager", "company": {"name": "Jobot", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "135,000.00/yr - 150,000.00/yr", "currency": "USD"}, "jobFunction": "Quality Assurance", "industry": "Manufacturing, Machinery Manufacturing, and Computers and Electronics Manufacturing", "description": "Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!<br/><br/>Job details<br/><br/><strong>QA Manager needed for well-established food manufacturing company based in Vernon, CA<br/><br/></strong>This Jobot Job is hosted by Marcus Curiel<br/><br/>Are you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.<br/><br/>Salary $135,000 - $150,000 per year<br/><br/><strong>A Bit About Us<br/><br/></strong>We are currently one of the most successful seafood companies in southern California providing over 5,000 fresh and frozen seafood products. We manage fishing vessels, harvest sites and processing plants throughout the world. We are growing and looking for a QA Manager to join our team!<br/><br/><strong><br/><br/><strong>Why join us?<br/><br/><br/></strong></strong><ul><li> Medical insurance</li><li> Dental insurance</li><li> Vision insurance</li><li> Life insurance</li><li> Disability insurance</li><li> Paid vacation leave</li><li> 401k with employer match<br/><br/></li></ul><strong>Job Details<br/><br/></strong><strong>Responsibilities<br/><br/></strong><ul><li> Develop and manage quality assurance metrics for performance improvement of all teams.</li><li> Conduct regular audits and reviews to ensure compliance with established quality assurance processes and standards.</li><li> Manage audits and certifications (e.g., SQF, BRC) to maintain high food safety standards.</li><li> Identify and implement training needs for teams in relation to quality assurance.</li><li> Ensure compliance with all relevant food safety regulations (e.g., FDA, HACCP, GMP).</li><li> Collaborate with other department managers to develop business strategies and improve processes.</li><li> Manage and oversee all aspects of quality assurance including establishing metrics, applying industry best practices, and developing new tools and processes to ensure quality goals are met.</li><li> Lead the development and implementation of a quality strategy that supports the company's continuous improvement culture.</li><li> Ensure compliance with industry regulations and ISO requirements.</li><li> Implement ongoing quality improvement processes across all areas of the business.</li><li> Develop and maintain a system for capturing, analyzing and reporting on quality metrics.</li><li> Oversee the investigation of customer complaints and non-conformance issues.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Bachelor’s degree in Business Administration, Food, Chemistry Biology (Master's Degree is a plus) </li><li> 3+ years of experience in Quality Assurance in the food or seafood industry.</li><li> Strong knowledge of QA methodologies, tools, and processes.</li><li> Experience in writing clear, concise and comprehensive test plans and cases.</li><li> Knowledge of relevant regulatory requirements.</li><li> Experience with process improvement techniques and methodologies.</li><li> Ability to effectively influence and lead multiple levels of an organization through functional boundaries.</li><li> Certified Quality Manager (CQM) certification preferred.<br/><br/></li></ul>Interested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.<br/><br/><strong>Want to learn more about this role and Jobot?<br/><br/></strong>Click our Jobot logo and follow our LinkedIn page!<br/><br/>", "responsibilities": "Develop and manage quality assurance metrics for performance improvement of all teams. Conduct regular audits and reviews to ensure compliance with established quality assurance processes and standards. Manage audits and certifications (e.g., SQF, BRC) to maintain high food safety standards. Identify and implement training needs for teams in relation to quality assurance. Ensure compliance with all relevant food safety regulations (e.g., FDA, HACCP, GMP). Collaborate with other department managers to develop business strategies and improve processes. Manage and oversee all aspects of quality assurance including establishing metrics, applying industry best practices, and developing new tools and processes to ensure quality goals are met. Lead the development and implementation of a quality strategy that supports the company's continuous improvement culture. Ensure compliance with industry regulations and ISO requirements. Implement ongoing quality improvement processes across all areas of the business. Develop and maintain a system for capturing, analyzing and reporting on quality metrics. Oversee the investigation of customer complaints and non-conformance issues.", "qualifications": {"required": "Bachelor’s degree in Business Administration, Food, Chemistry Biology (Master's Degree is a plus) 3+ years of experience in Quality Assurance in the food or seafood industry. Strong knowledge of QA methodologies, tools, and processes. Experience in writing clear, concise and comprehensive test plans and cases. Knowledge of relevant regulatory requirements. Experience with process improvement techniques and methodologies. Ability to effectively influence and lead multiple levels of an organization through functional boundaries.", "preferred": "Certified Quality Manager (CQM) certification"}, "skills": ["Quality Assurance", "Food Safety", "Auditing", "Compliance", "Training", "Process Improvement", "ISO", "HACCP", "GMP", "FDA"], "postedDate": "3 days ago", "benefits": "Medical insurance, Dental insurance, Vision insurance, Life insurance, Disability insurance, Paid vacation leave, 401k with employer match", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004427843"}