{"jobTitle": "Sr Coordinator Terms and Conditions - Full Time, Days (Bellflower)", "company": {"name": "Prospect Medical Holdings, Inc.", "location": "Bellflower, CA"}, "location": "Bellflower, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Finance and Accounting/Auditing", "industry": "Hospitals and Health Care, Medical Practices, and Mental Health Care", "description": "<strong>Job Description<br/><br/></strong>The Sr. Terms and Conditions (T &amp; C) Coordinator is responsible for researching, identifying, and solving systemic issues preventing the accurate net down of all accounts. Includes holding the vendor resources accountable for building, testing, and implementation of new and updated contracts. Collaborates with Payers and Managed Care to resolve ambiguous calculation of expected reimbursement.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Analyzes underpayment and overpayment data for systemic pricing inaccuracies. Prioritizes opportunities for improvement. Researches underlying causes, gains consensus from stakeholders about proposed corrections, details contract model change requests for submission to vendor, and ensures change in production solved the original issue.</li><li> Maintains vendor open item log and holds resources accountable for completion.</li><li> Collaborates with Finance and DSS teams to review reimbursement valuation monthly. Researches any unusual changes in reimbursement and communicates to stakeholders.</li><li> Partners with Managed Care when each contract is in active negotiation to provide information regarding payer behavior that impacts the value of the relationship. Provides recommendations to strengthen language related to expected reimbursement to remove ambiguities.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Required Qualifications: <br/><br/></strong><ul><li>Five (5) years experience focusing on hospital expected reimbursement </li><li>High School Diploma or GED</li><li>Thorough understanding of Payer Contracts and contract language</li><li>Excellent written and verbal communication skills in English</li><li>Ability to multitask and maintain a work pace appropriate to workload</li><li>Computer literacy and proficiency</li><li>Must demonstrate customer service skills appropriate to the job<br/><br/></li></ul><strong>Preferred Qualifications: <br/><br/></strong><ul><li>Bachelors Degree<br/><br/></li></ul><strong>Pay Range: Min: 29.70 / Max: 40.80<br/><br/></strong><strong>About Us<br/><br/></strong>Prospect Medical Holdings' ability to deliver quality, compassionate care during the unprecedented pandemic affirms the original vision of its founders. This is the fulfillment of the hopes Prospect’s founders had for the company, and proof that a clear vision, an insightful operating model, and a commitment to communities and our employees, born in the past, remains the way of the future.<br/><br/>Every day, our more than 11,000 affiliated physicians and 18,000 employees at 17 hospitals, 165 outpatient centers and 28 medical groups provide nationally recognized care in six states. Our comprehensive network of quality healthcare services is designed to offer our patients and 600,000 members highly coordinated, personalized care tailored to the unique needs of each community we serve—many of which provide essential medical services to underserved communities as safety-net hospitals.", "responsibilities": "The Sr. Terms and Conditions (T &amp; C) Coordinator is responsible for researching, identifying, and solving systemic issues preventing the accurate net down of all accounts. Includes holding the vendor resources accountable for building, testing, and implementation of new and updated contracts. Collaborates with Payers and Managed Care to resolve ambiguous calculation of expected reimbursement.", "qualifications": {"required": "Five (5) years experience focusing on hospital expected reimbursement , High School Diploma or GED, Thorough understanding of Payer Contracts and contract language, Excellent written and verbal communication skills in English, Ability to multitask and maintain a work pace appropriate to workload, Computer literacy and proficiency, Must demonstrate customer service skills appropriate to the job", "preferred": "Bachelors Degree"}, "skills": [], "postedDate": "1 day ago", "salary": {"amount": "29.70 / Max: 40.80", "currency": ""}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004720603"}