{"jobTitle": "Director of R&D (Food Manufacturing)", "company": {"name": "Jobot", "location": "Ontario, CA"}, "location": "Ontario, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$140,000.00 - $180,000.00", "currency": "USD"}, "jobFunction": "Research, Analyst, and Information Technology", "industry": "Manufacturing, Machinery Manufacturing, and Computers and Electronics Manufacturing", "description": "Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!<br/><br/>Job details<br/><br/><strong>Career Growth Opportunity with a Rapidly Growing Food Manufacturer!<br/><br/></strong>This Jobot Job is hosted by David Pacheco<br/><br/>Are you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.<br/><br/>Salary $140,000 - $180,000 per year<br/><br/><strong>A Bit About Us<br/><br/></strong>We are a renowned global partner for the food industry, food service, butchery, and nutrition sectors. Our specialty lies in creating tailor-made ingredient solutions that excel in delivering exceptional taste, improved nutrition, and optimized functionality. Our commitment is to craft food products that embody goodness in every aspect, benefiting both individuals and the planet.<br/><br/><strong><br/><br/><strong>Why join us?<br/><br/><br/></strong></strong><ul><li> Excellent Compensation &amp; Benefits package!</li><li> State of the art facility!</li><li> 401K!</li><li> Bonus</li><li> Paid Holidays!</li><li> PTO!<br/><br/></li></ul><strong>Job Details<br/><br/></strong><strong>Responsibilities<br/><br/></strong><ul><li> Lead and oversee the Research and Development (R&amp;D) department in a dynamic and fast-paced food manufacturing environment.</li><li> Develop and implement innovative strategies for new product launches, ensuring that they meet company objectives and market demands.</li><li> Collaborate with cross-functional teams to create and execute product development plans, from concept to commercialization.</li><li> Manage the product development process, including formulation, testing, and scaling up production.</li><li> Stay up-to-date with industry trends and consumer preferences to identify opportunities for new product development.</li><li> Conduct market research and competitive analysis to inform product positioning and pricing strategies.</li><li> Ensure compliance with regulatory labeling requirements and manage the product labeling process.</li><li> Lead the development and implementation of process improvement initiatives to optimize efficiency and quality in manufacturing operations.</li><li> Collaborate with Quality Assurance and Operations teams to ensure product safety, quality, and consistency.</li><li> Manage and mentor a team of R&amp;D professionals, fostering a culture of innovation, collaboration, and continuous improvement.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Bachelor's degree in Food Science, Food Engineering, or a related field. Advanced degree is preferred.</li><li> Minimum of 5-10 years of experience in a manufacturing or food-based environment, with a focus on Research and Development.</li><li> Strong knowledge of food product labeling requirements and regulatory compliance.</li><li> Proven track record in developing and launching new products in the food industry.</li><li> Experience in process improvement methodologies, such as Lean Six Sigma, with a demonstrated ability to drive operational efficiencies.</li><li> Proficient in the use of food development software and tools.</li><li> Excellent project management skills, with the ability to prioritize and manage multiple projects simultaneously.</li><li> Strong analytical and problem-solving abilities, with a keen attention to detail.</li><li> Exceptional communication and interpersonal skills, with the ability to effectively collaborate with cross-functional teams and senior leadership.</li><li> Demonstrated leadership skills, with the ability to inspire and motivate a team to achieve goals and deliver results.<br/><br/></li></ul>Note This job description is not intended to be all-inclusive. The employee may perform other related duties as negotiated to meet the ongoing needs of the organization.<br/><br/>Interested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.<br/><br/><strong>Want to learn more about this role and Jobot?<br/><br/></strong>Click our Jobot logo and follow our LinkedIn page!<br/><br/>", "responsibilities": "Lead and oversee the Research and Development (R&D) department in a dynamic and fast-paced food manufacturing environment. Develop and implement innovative strategies for new product launches, ensuring that they meet company objectives and market demands. Collaborate with cross-functional teams to create and execute product development plans, from concept to commercialization. Manage the product development process, including formulation, testing, and scaling up production. Stay up-to-date with industry trends and consumer preferences to identify opportunities for new product development. Conduct market research and competitive analysis to inform product positioning and pricing strategies. Ensure compliance with regulatory labeling requirements and manage the product labeling process. Lead the development and implementation of process improvement initiatives to optimize efficiency and quality in manufacturing operations. Collaborate with Quality Assurance and Operations teams to ensure product safety, quality, and consistency. Manage and mentor a team of R&D professionals, fostering a culture of innovation, collaboration, and continuous improvement.", "qualifications": {"required": "Bachelor's degree in Food Science, Food Engineering, or a related field. Advanced degree is preferred. Minimum of 5-10 years of experience in a manufacturing or food-based environment, with a focus on Research and Development. Strong knowledge of food product labeling requirements and regulatory compliance. Proven track record in developing and launching new products in the food industry. Experience in process improvement methodologies, such as Lean Six Sigma, with a demonstrated ability to drive operational efficiencies. Proficient in the use of food development software and tools. Excellent project management skills, with the ability to prioritize and manage multiple projects simultaneously. Strong analytical and problem-solving abilities, with a keen attention to detail. Exceptional communication and interpersonal skills, with the ability to effectively collaborate with cross-functional teams and senior leadership. Demonstrated leadership skills, with the ability to inspire and motivate a team to achieve goals and deliver results.", "preferred": ""}, "skills": [], "postedDate": "3 days ago", "applicationDeadline": "", "benefits": "Excellent Compensation & Benefits package! State of the art facility! 401K! Bonus Paid Holidays! PTO!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004606470"}