{"jobTitle": "Traveling Retail Merchandiser", "company": {"name": "The Retail Odyssey Company", "industry": "Manufacturing", "size": "Not specified", "location": "San Juan Capistrano, CA"}, "location": "San Juan Capistrano, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$16.25 per hour", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Manufacturing", "description": "Join our team of Travel Retail Merchandisers! In this role, we handle product movement at retail. We display it, we move it, we track it; making sure stores and their product suppliers have the best opportunities for optimal sales. When you join the SAS Retail Services' team as a Traveling Reset Merchandiser, you'll be making a difference by ensuring the latest products match the newest plan. We've got a lot to offer with specialized training and growth opportunities. This is a traveling position that requires regular travel as a primary requirement of the role. Travel roles may require various degrees of travel up to 50% or more of the time.", "responsibilities": "Handle product movement at retail, display products, track product sales, ensure optimal sales opportunities for stores and suppliers.", "qualifications": {"required": "You're 18 years or older, interested in traveling within and outside of your home state, have reliable transportation and valid driver's license, can perform physical work of moving, bending, standing and can lift up to 50 lbs, ready to jumpstart your professional career and/or fit your lifestyle needs.", "preferred": "Not specified."}, "skills": [], "postedDate": "3 days ago", "applicationDeadline": "Not specified", "benefits": "Competitive Wage; Paid travel with overnight stays; Competitive wages with annual increase eligibility; Get paid quicker with early access to earned wages; Paid training; Growth opportunities; Benefits that can be customized to meet your family's needs, including medical, dental, vision, life insurance, supplemental voluntary plans, wellness programs, and online discounts.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4004388593"}