{"jobTitle": "Warehouse Operations Supervisor", "company": {"name": "lululemon", "location": "Ontario, CA"}, "location": "Ontario, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "lululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth-focused environment for our people.<br/><br/>Our Global Distribution teams are part of our greater lululemon Supply Chain organization. This team supports lululemon’s overall purpose by ensuring we are fulfilling our products to our guests through our various channels including our retail stores and ecommerce. Reporting to the Warehouse Operations Manager, the Warehouse Operations Supervisor is responsible for overseeing all DC operations for a particular shift/process within a facility. They lead their DC operations teams, ensuring efficient DC operations and SLA attainment. They act as a coach to the Warehouse Operations Floor Leads and associates on their development to build their talent pipeline. They do this by actively developing their people through vision and goals, coaching and feedback.<br/><br/>Our Global Distribution teams are part of our greater lululemon Supply Chain organization. This team supports lululemon’s overall purpose by ensuring we are fulfilling our products to our guests through our various channels including our retail stores and ecommerce. Reporting to the Warehouse Operations Manager, the Warehouse Operations Supervisor is responsible for overseeing all DC operations for a particular shift/process within a facility. They lead their DC operations teams, ensuring efficient DC operations and SLA attainment. They act as a coach to the Warehouse Operations Floor Leads and associates on their development to build their talent pipeline. They do this by actively developing their people through vision and goals, coaching and feedback.<br/><br/>Directs and oversee all aspects of an assigned shift or process within a DC department. Supports their manager in creating and implementing departmental operating and strategic plans to drive continuous improvements. Responsible for coaching and developing up to 25 hourly lululemon team members and greater during peak season including Floor Leads, Warehouse Associates, Forklift Drivers, and Data Administrators. Ensuring all areas of the hourly employee life cycle are happening- Hiring, Training, performance management, rewards, and recognition, offboarding, etc. (teams include agency, lululemon and fixed-term). Responsible for overseeing the execution of department work tasks to ensure target metrics and SLAs are met (pick, pack, ship, receive, transfer, etc.). Responsible for daily labor planning including sending workers home for the day or to other departments where labor is needed. Supports Manager with weekly workforce planning including requesting labor from agency partners and Talent Acquisition. Responsible for partnering with DC Workforce Administrators on verifying and approving timekeeping for hourly direct reports including attendance tracking. Responsible for communicating with agency vendors: employee performance, staffing, feedback, etc. Responsible for partnering with Health and Safety and P and C on employee concerns. Responsible for communication flow to their hourly workforce. Ensures compliance within department including Labor Laws and Health and Safety compliance. Champions and leads through lululemon’s IDEA (Inclusion, Diversity, Equity and Action) initiatives and values.<br/><br/>Bachelors/Associates degree in engineering, supply chain, logistics, operations or relevant on the job experience. 3-5 years of experience in a warehouse or similar environment. 2+ years directly or indirectly leading a team of hourly employees. Proficient in Microsoft Office Suite. Experience with automation or MHE (material handling equipment) and labor management system. Ability to obtain a powered industrial truck (PIT) operator certification depending on business needs. Ability to effectively communicate with the team and business partners. Capable of adapting to third party technologies (RF scanners, voice picking and new systems). Ability to lift up to 50lbs frequently. Ability to maintain a safe work environment. Flexible and adaptable with schedule which could include nights, working required holidays, some weekends with occasional after-hours requirements. <br/><br/>Acknowledge the presence of choice in every moment and take personal responsibility for your life. Possess an entrepreneurial spirit and continuously innovate to achieve great results. Communicate with honesty and kindness and create the space for others to do the same. Lead with courage, knowing the possibility of greatness is bigger than the fear of failure. Foster connection by putting people first and building trusting relationships. Integrate fun and joy as a way of being and working, aka doesn’t take yourself too seriously.<br/><br/>Authorization to work in the United States is required for this role.<br/><br/>lululemon’s compensation offerings are grounded in a pay-for-performance philosophy that recognizes exceptional individual and team performance. The typical hiring range for this position is from $81,100-106,500 annually; the base pay offered is based on market location and may vary depending on job-related knowledge, skills, experience, and internal equity. As part of our total rewards offering, permanent employees in this position may be eligible for our competitive annual bonus program, subject to program eligibility requirements.  <br/><br/>At Lululemon, Investing In Our People Is a Top Priority. We Believe That When Life Works, Work Works. We Strive To Be The Place Where Inclusive Leaders Come To Develop And Enable All To Be Well. Recognizing Our Teams For Their Performance And Dedication, Other Components Of Our Total Rewards Offerings Include Support Of Career Development, Wellbeing, And Personal Growth<br/><br/>Extended health and dental benefits, and mental health plans Paid time off Savings and retirement plan matching Generous employee discount Fitness &amp; yoga classes Parenthood top-up Extensive catalog of development course offerings People networks, mentorship programs, and leadership series (to name a few) <br/><br/>Note: The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.<br/><br/>This role is classified as In-Person under our SSC Workplace Policy:<br/><br/>In-Person<br/><br/>In-person collaboration and/or office-based work is necessary or important for the role. Work is mainly performed onsite, 4-5 days per week depending on role requirements.<br/><br/>", "responsibilities": "Directs and oversee all aspects of an assigned shift or process within a DC department. Supports their manager in creating and implementing departmental operating and strategic plans to drive continuous improvements. Responsible for coaching and developing up to 25 hourly lululemon team members and greater during peak season including Floor Leads, Warehouse Associates, Forklift Drivers, and Data Administrators. Ensuring all areas of the hourly employee life cycle are happening- Hiring, Training, performance management, rewards, and recognition, offboarding, etc. (teams include agency, lululemon and fixed-term). Responsible for overseeing the execution of department work tasks to ensure target metrics and SLAs are met (pick, pack, ship, receive, transfer, etc.). Responsible for daily labor planning including sending workers home for the day or to other departments where labor is needed. Supports Manager with weekly workforce planning including requesting labor from agency partners and Talent Acquisition. Responsible for partnering with DC Workforce Administrators on verifying and approving timekeeping for hourly direct reports including attendance tracking. Responsible for communicating with agency vendors: employee performance, staffing, feedback, etc. Responsible for partnering with Health and Safety and P and C on employee concerns. Responsible for communication flow to their hourly workforce. Ensures compliance within department including Labor Laws and Health and Safety compliance. Champions and leads through lululemon’s IDEA (Inclusion, Diversity, Equity and Action) initiatives and values.", "qualifications": {"required": "Bachelors/Associates degree in engineering, supply chain, logistics, operations or relevant on the job experience. 3-5 years of experience in a warehouse or similar environment. 2+ years directly or indirectly leading a team of hourly employees. Proficient in Microsoft Office Suite. Experience with automation or MHE (material handling equipment) and labor management system. Ability to obtain a powered industrial truck (PIT) operator certification depending on business needs. Ability to effectively communicate with the team and business partners. Capable of adapting to third party technologies (RF scanners, voice picking and new systems). Ability to lift up to 50lbs frequently. Ability to maintain a safe work environment. Flexible and adaptable with schedule which could include nights, working required holidays, some weekends with occasional after-hours requirements. ", "preferred": "Acknowledge the presence of choice in every moment and take personal responsibility for your life. Possess an entrepreneurial spirit and continuously innovate to achieve great results. Communicate with honesty and kindness and create the space for others to do the same. Lead with courage, knowing the possibility of greatness is bigger than the fear of failure. Foster connection by putting people first and building trusting relationships. Integrate fun and joy as a way of being and working, aka doesn’t take yourself too seriously."}, "skills": ["Supply Chain", "Logistics", "Operations", "Warehouse Management", "Team Leadership", "Microsoft Office Suite", "Automation", "Material Handling Equipment", "Labor Management", "Powered Industrial Truck", "Communication", "Safety", "Compliance"], "postedDate": "1 day ago", "benefits": "Extended health and dental benefits, and mental health plans Paid time off Savings and retirement plan matching Generous employee discount Fitness &amp; yoga classes Parenthood top-up Extensive catalog of development course offerings People networks, mentorship programs, and leadership series (to name a few) ", "remoteWork": "No", "salary": {"amount": "81,100-106,500", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4004622688"}