{"jobTitle": "Package Handler (Warehouse like)", "company": {"name": "Federal Express Corporation", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$19.00 per hour", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Freight and Package Transportation", "description": "<strong>IMMEDIATE OPENINGS!<br/><br/></strong>Come for a job and stay for a career! Federal Express Corporation (FEC) is part of the rapidly growing warehouse and transportation sector that helps keep America, and our economy, moving. Be part of a winning team and workplace community that cares about who you are as an individual, and your safety in the workplace.<br/><br/><strong>Perks And Benefits At Federal Express Corporation (FEC)<br/><br/></strong><ul><li>Competitive wages beginning at ﻿$19.00 per hour﻿ paid weekly for both full and part time opportunities</li><li>$5,250 tuition reimbursement every year with no lifetime cap! All employees are eligible for this awesome benefit on their first day of employment!</li><li>Generous paid time off program – work your way up to 5 weeks of PTO a year!</li><li>Medical, dental and vision benefits after a short waiting period.</li><li>Flexible scheduling that helps balance your work and personal life.</li><li>Valuable employee discounts on things like cell phone plans, electronics, cars and restaurants.</li><li>Free Purple Pathways career development program for all Federal Express Corporation (FEC) employees.</li><li>Paid parental leave for both moms and dads!</li><li>Employee networks, and diversity, equity and inclusion programs available for all employees.<br/><br/></li></ul><strong>What You Can Expect At Federal Express Corporation (FEC)<br/><br/></strong><ul><li>Fast paced and physical warehouse work – why pay for a gym membership when you can get paid while working out?</li><li>Warehouse duties include loading, unloading, and sorting of packages of various sizes.</li><li>Part time Federal Express Corporation (FEC) employees work one shift a day; full time Federal Express Corporation (FEC) employees work two shifts.</li><li>Shift lengths vary based on package volume – generally part time employees work between 3 and 6 hours a day. Full time employees can expect to work between 6 and 10 hours.</li><li>Overtime paid after 40 hours a week.<br/><br/></li></ul><strong>Pay Transparency<br/><br/></strong>This compensation range is provided as a reasonable estimate of the current starting salary range for this role across all potential locations. If this opportunity includes multiple job levels, the salary information represents the job level minimum and the job level maximum. Actual starting pay would be determined by experience relative to the job, market level, pay at the location for this job and other job-related factors permitted by law. An employee may be eligible for additional pay, premiums, or bonus potential. The Company offers eligible employees health, vision and dental insurance, retirement, and tuition reimbursement.<br/><br/><strong>Pay Range:</strong> ﻿﻿<br/><br/><strong>Additional Posting Information: </strong>﻿﻿<br/><br/><strong>EEO Statement<br/><br/></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. Reasonable accommodations are available for qualified individuals with disabilities throughout the application process. Applicants who require reasonable accommodations in the application or hiring process should contact recruitmentsupport@fedex.com.<br/><br/><strong>Applicants Have Rights Under Federal Employment Laws<br/><br/></strong><ul><li>Equal Employment Opportunity is the Law</li><li>EEO is the Law Supplement</li><li>Pay Transparency Policy</li><li>Family and Medical Leave Act (FMLA)</li><li>Employee Polygraph Protection Act<br/><br/></li></ul>E-Verify Program Participant: Federal Express Corporation participates in the Department of Homeland Security U.S. Citizenship and Immigration Services' E-Verify program (For U.S. applicants and employees only). Please click below to learn more about the E-Verify program:<br/><br/><ul><li>E-Verify Notice (bilingual)</li><li>Right to Work Notice (English) / (Spanish)</li></ul>", "responsibilities": "Warehouse duties include loading, unloading, and sorting of packages of various sizes.", "postedDate": "11 hours ago", "benefits": "Competitive wages beginning at ﻿$19.00 per hour﻿ paid weekly for both full and part time opportunities, $5,250 tuition reimbursement every year with no lifetime cap! All employees are eligible for this awesome benefit on their first day of employment!, Generous paid time off program – work your way up to 5 weeks of PTO a year!, Medical, dental and vision benefits after a short waiting period., Flexible scheduling that helps balance your work and personal life., Valuable employee discounts on things like cell phone plans, electronics, cars and restaurants., Free Purple Pathways career development program for all Federal Express Corporation (FEC) employees., Paid parental leave for both moms and dads!, Employee networks, and diversity, equity and inclusion programs available for all employees.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004701277"}