{"jobTitle": "Airport Driver - Class B", "company": {"name": "Energy Jobline", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Since its inception, The Parking Spot has made superior airport parking experiences easy and affordable by focusing on hospitality. Now with more than 25 years in business, The Parking Spot has cemented itself as the leading near-airport Parking Company with 40+ locations at 28 airports, over 2,000 employees nationwide and 2 incredibly strong brands – The Parking Spot and Park ‘N Fly by The Parking Spot.<br/><br/>Our Shuttle Drivers play an important role in our operation in providing safe and courteous transportation of customers between the parking facility and airport. If you share our values for team, people, and service, we encourage you to apply with us!<br/><br/>Pay Rate: $17.28 /hour (plus tips - cash and mobile) with regular bonus opportunities  <br/><br/>Weekly Schedule:  <br/><br/><ul><li>Part Time<br/><br/></li></ul>What We Offer<br/><br/><ul><li>Immediate job offer after successful interview and background check </li><li>Great tips featuring both cash and mobile tipping, and regular bonus opportunities for those who are eligible </li><li>Consistent schedules </li><li>For those who are eligible to enroll: Medical, Vision, Dental, Life Insurance, EAP and 401(k) plan benefits </li><li>Paid Time Off, Vacation Pay, and Paid Holidays </li><li>Training and professional development opportunities <br/><br/></li></ul>Key Responsibilities Of Shuttle Drivers<br/><br/><ul><li>Greets each customer with a smile, offering to assist with their luggage </li><li>Provides pleasant customer service </li><li>Demonstrates knowledge of the facility and airport terminals </li><li>Cooperates with all team members to provide the best possible service </li><li>Complies with all applicable regulations and requirements governing operation of commercial vehicles </li><li>Performs additional duties as reasonably requested by Management <br/><br/></li></ul>Knowledge, Skills, &amp; Experience Of Shuttle Drivers<br/><br/><ul><li>Must be at least 21 years of </li><li>High school education or equivalent </li><li>Previous driver and/or customer service experience </li><li>Clean driving record </li><li>Currently holds, or is able to obtain, applicable licenses or badges as required by governing authorities to operate a commercial vehicle </li><li>Must be willing to pass a physical as part of the selection process as required by airport, federal DOT and/or state regulations </li><li>Able to read and speak the English sufficiently (DOT Requirement) </li><li>Ability to lift up to 50 pounds to assist with luggage <br/><br/></li></ul>_<br/><br/>At The Parking Spot, we don’t just accept difference - we celebrate and seek it. We believe a diverse, inclusive, and equitable company is one where all employees, partners, and customers are welcome, supported, and valued. As a company in the travel industry, we witness the power of bringing individuals from different backgrounds and communities together. We treat all others with dignity and respect and stand firmly against racism and discrimination in any form. We intentionally develop diverse teams and relationships to ensure all voices are heard and to foster equal opportunity for all. We are committed to listening, learning, and growing because we know that our work is never done. <br/><br/>Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities<br/><br/>The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)", "responsibilities": "<ul><li>Greets each customer with a smile, offering to assist with their luggage </li><li>Provides pleasant customer service </li><li>Demonstrates knowledge of the facility and airport terminals </li><li>Cooperates with all team members to provide the best possible service </li><li>Complies with all applicable regulations and requirements governing operation of commercial vehicles </li><li>Performs additional duties as reasonably requested by Management <br/><br/></li></ul>", "qualifications": {"required": "Must be at least 21 years of \nHigh school education or equivalent \nPrevious driver and/or customer service experience \nClean driving record \nCurrently holds, or is able to obtain, applicable licenses or badges as required by governing authorities to operate a commercial vehicle \nMust be willing to pass a physical as part of the selection process as required by airport, federal DOT and/or state regulations \nAble to read and speak the English sufficiently (DOT Requirement) \nAbility to lift up to 50 pounds to assist with luggage <br/><br/>"}, "skills": [], "postedDate": "4 days ago", "benefits": "<ul><li>Immediate job offer after successful interview and background check </li><li>Great tips featuring both cash and mobile tipping, and regular bonus opportunities for those who are eligible </li><li>Consistent schedules </li><li>For those who are eligible to enroll: Medical, Vision, Dental, Life Insurance, EAP and 401(k) plan benefits </li><li>Paid Time Off, Vacation Pay, and Paid Holidays </li><li>Training and professional development opportunities <br/><br/></li></ul>", "remoteWork": "No", "salary": {"amount": "17.28", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4004261631"}