{"jobTitle": "Maintenance Supervisor", "company": {"name": "University of California, Riverside", "location": "Riverside County, CA"}, "location": "Riverside County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$81,500.00/yr - $150,100.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Higher Education", "description": "<strong>Position Information<br/><br/></strong>Reporting to the UCR Facilities Services Assistant Director of Maintenance, The Maintenance Supervisor oversees the paint, carpentry, and sheet metal/welding shops and staff. This role is responsible for administration, daily operations, service delivery and quality, preventative maintenance, break/fix efforts, management and development of staff, and implementation and use of technology relevant to trades within the scope of the role. UC Riverside's Facilities Services is recruiting for a Maintenance Supervisor. The full salary range for the Maintenance Supervisor is $81,500 - $150,100 annually. We base salary offers on a variety of considerations, such as education, licensure and certifications, experience, and other business and organizational needs. Applicants must have current work authorization when accepting a UCR staff position. Currently, we are unable to sponsor or take over sponsorship of an employment Visa for staff. As a University employee, you will be required to comply with all applicable University policies and/or collective bargaining agreements, as may be amended from time to time. Federal, state, or local government directives may impose additional requirements.<br/><br/><strong><strong>Requirements<br/><br/></strong></strong><strong>Educational Requirements<br/><br/></strong><strong>Degree<br/><br/></strong>Bachelor's degree in related area and/or equivalent experience/training.<br/><br/><strong>Requirement<br/><br/></strong><strong>Required<br/><br/></strong><strong>Experience Requirements<br/><br/></strong><strong><strong>Experience<br/><br/></strong></strong>6 - 10 years of related experience.<br/><br/><strong>Requirement<br/><br/></strong><strong><strong>Experience<br/><br/></strong></strong>Previous supervisory/managerial experience.<br/><br/><strong>Requirement<br/><br/></strong><strong>Preferred<br/><br/></strong><strong>Experience<br/><br/></strong>Experience with personnel management, including staffing, hiring, training, disciplinary action, termination, and performance management.<br/><br/><strong>Requirement<br/><br/></strong><strong><strong>Experience<br/><br/></strong></strong>Experience using online and/or web-based work order systems.<br/><br/><strong>Requirement<br/><br/></strong><strong><strong>Experience<br/><br/></strong></strong>Experience with collective bargaining units.<br/><br/><strong>Requirement<br/><br/></strong><strong><strong>Minimum Requirements<br/><br/></strong></strong><ul><li>Solid knowledge and skills in the specialty craft supervised.</li><li>Solid supervisory skills to include organization, scheduling, assigning work and ensuring quality standards are met.</li><li>Skills to actively promote and maintain safety standards.</li><li>Solid skills to effectively select and evaluate staff, and to appropriately handle disciplinary issues.</li><li>Solid knowledgeable of plumbing, mechanical and utility systems. Knowledge of application of the Uniform Plumbing Code. Skill in the general repair, maintenance and troubleshooting of reverse osmosis purification equipment.</li><li>Ability to motivate and inspire staff to provide the highest level of quality and service to campus constituents.</li><li>Knowledge and understanding of applicable laws, rules, codes, regulations, and internal policies.</li><li>Ability to generate and provide reports on project status, staffing, equipment, schedules, metrics, etc.</li><li>Proficient computer/technical skills. Knowledge of Microsoft Office applications such as Outlook, Word, and Excel.</li><li>Strong analytical and problem solving skills.</li><li>Ability to be flexible to shifting priorities, demands and timelines. Strong organizational skills to successfully complete multiple assignments with competing deadlines. Skill in working effectively, following through on assignments with minimal direction and a fluctuating workload.</li><li>Skill in communicating effectively with campus clients, contractors, and support staff both verbally and in writing. Ability to read, write, speak and understand the English language.</li><li>Ability establish and maintain interpersonal relations with diverse personnel, vendors and campus clients.</li><li>Ability to ensure that quality and customer service standards are communicated, implemented and continually monitored.<br/><br/></li></ul><strong><strong>Preferred Qualifications<br/><br/></strong></strong><ul><li>Solid financial skills to accurately project costs of potential jobs and to consistently complete work within established budgetary and time constraints.</li><li>Experience and/or knowledge of UC systems, polices, procedures and regulations.<br/><br/></li></ul><strong><strong>Additional Information<br/><br/></strong></strong>In the Heart of Inland Southern California, UC Riverside is located on nearly 1,200 acres near Box Springs Mountain in Southern California; the park-like campus provides convenient access to the vibrant and growing Inland region. The campus is a living laboratory for the exploration of issues critical to growing communities' air, water, energy, transportation, politics, the arts, history, and culture. UCR gives every student, faculty and staff member the resources to explore, engage, imagine and excel. UC Riverside is recognized as one of the most ethnically diverse research universities in the country boasting several key rankings of which we are extremely proud.<br/><br/><ul><li>UC Riverside is proud to be ranked No. 12 among all U.S. universities, according to Money Magazine's 2020 rankings, and among the top 1 percent of universities worldwide, according to the 2019-20 Center for World University rankings. </li><li>UC Riverside is the top university in the United States for social mobility. - U.S. News 2020 </li><li>UCR is a member of the University Innovation Alliance, the leading national coalition of public research universities committed to improving student success for low-income, first-generation, and students of color. </li><li>Among top-tier universities, UC Riverside ranks No. 2 in financial aid. - Business Insider 2019 </li><li>Ranked No. 2 in the world for research, UCR's Department of Entomology maintains one of the largest collections of insect specimens the nation. - Center for World University Rankings </li><li>UCR's distinguished faculty boasts 2 Nobel Laureates, and 13 members of the National Academies of Science and Medicine. <br/><br/></li></ul>The University of California is an Equal Opportunity/Affirmative Action Employer with a strong institutional commitment to the achievement of excellence and diversity among its faculty and staff. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or any other characteristic protected by law. For information about our generous employee benefits package, visit: Employee Benefits Overview<br/><br/><strong><strong>Job Description Details<br/><br/></strong></strong><strong>Generic Scope<br/><br/></strong>Provides direct supervision typically to professionals or skilled technical employees. Functions as advisor to unit and administration. Analyzes and resolves problems, interprets policies (e.g., fiscal management, HR, contracts and grants, resource management in defined areas) and demonstrates solid subject matter knowledge. Exercises judgment within defined procedures and policies to determine appropriate action. Supervises staff to assure accountability and stewardship of department resources (operational, financial, and human) in compliance with departmental goals and objectives.<br/><br/><strong>Custom Scope<br/><br/></strong>Receives assignments in the form of objectives with goals and the process by which to meet goals. Provides direction and supervision to skilled crafts and trades workers, according to established policies and management guidance. Examples of specialties include carpentry, plumbing, boiler operators, HVAC, abatement and insulation, electrical, and painting. Administers policies that directly affect subordinate staff. Recommends changes to department policies and practices. Identifies risks and responds accordingly. Provide priority setting and work flow analysis.<br/><br/><strong>Department Custom Scope<br/><br/></strong>Reporting to the Assistant Director of Maintenance Services, UCR Facilities Services, the Maintenance Services Supervisor oversees the paint, carpentry, sheet metal/welding shops. This role is responsible for administration, daily operations, service delivery and quality, preventative maintenance, break/fix efforts, staff management and development, and implementation and use of technology relevant to trades within the scope of the role.", "responsibilities": "Reporting to the UCR Facilities Services Assistant Director of Maintenance, The Maintenance Supervisor oversees the paint, carpentry, and sheet metal/welding shops and staff. This role is responsible for administration, daily operations, service delivery and quality, preventative maintenance, break/fix efforts, management and development of staff, and implementation and use of technology relevant to trades within the scope of the role.", "qualifications": {"required": "Solid knowledge and skills in the specialty craft supervised. Solid supervisory skills to include organization, scheduling, assigning work and ensuring quality standards are met. Skills to actively promote and maintain safety standards. Solid skills to effectively select and evaluate staff, and to appropriately handle disciplinary issues. Solid knowledgeable of plumbing, mechanical and utility systems. Knowledge of application of the Uniform Plumbing Code. Skill in the general repair, maintenance and troubleshooting of reverse osmosis purification equipment. Ability to motivate and inspire staff to provide the highest level of quality and service to campus constituents. Knowledge and understanding of applicable laws, rules, codes, regulations, and internal policies. Ability to generate and provide reports on project status, staffing, equipment, schedules, metrics, etc. Proficient computer/technical skills. Knowledge of Microsoft Office applications such as Outlook, Word, and Excel. Strong analytical and problem solving skills. Ability to be flexible to shifting priorities, demands and timelines. Strong organizational skills to successfully complete multiple assignments with competing deadlines. Skill in working effectively, following through on assignments with minimal direction and a fluctuating workload. Skill in communicating effectively with campus clients, contractors, and support staff both verbally and in writing. Ability to read, write, speak and understand the English language. Ability establish and maintain interpersonal relations with diverse personnel, vendors and campus clients. Ability to ensure that quality and customer service standards are communicated, implemented and continually monitored.", "preferred": "Solid financial skills to accurately project costs of potential jobs and to consistently complete work within established budgetary and time constraints. Experience and/or knowledge of UC systems, polices, procedures and regulations."}, "skills": ["Microsoft Office", "Outlook", "Word", "Excel", "Supervisory Skills", "Safety Standards", "Problem Solving", "Communication", "Interpersonal Relations", "Financial Skills", "UC Systems"], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "The University of California is an Equal Opportunity/Affirmative Action Employer with a strong institutional commitment to the achievement of excellence and diversity among its faculty and staff. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or any other characteristic protected by law. For information about our generous employee benefits package, visit: Employee Benefits Overview", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004743274"}