{"jobTitle": "Legal & Compliance Analyst", "company": {"name": "SpaceX", "industry": "Aviation and Aerospace Component Manufacturing", "size": "1001-5000 employees", "location": "Hawthorne, CA"}, "location": "Hawthorne, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$75,000.00 - $95,000.00", "currency": "USD"}, "jobFunction": "Legal", "industry": "Aviation and Aerospace Component Manufacturing", "description": "SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Today SpaceX is actively developing the technologies to make this possible, with the ultimate goal of enabling human life on Mars. As a Legal and Compliance Analyst, you will primarily be responsible for supporting SpaceX’s Global Trade Compliance team on matters relating to SpaceX’s Starlink program. In this role, you will work closely with attorneys, other legal and compliance professionals, and engineers to ensure that SpaceX complies with applicable export control and sanctions regulations in all areas of the Starlink business—from satellite design and production to the expansion of Starlink to all corners of Planet Earth and beyond.", "responsibilities": "Support trade compliance attorneys in managing compliance procedures related to U.S. export and sanctions laws applicable to SpaceX commercial satellite programs. Perform research on U.S. federal statutes, regulations, directives, and guidance related to U.S. export and sanctions laws. Work cross-functionally with company business teams to ensure compliance, including through export classification reviews and internal investigations. Draft, submit, and track licenses submitted to government agencies that administer export and sanctions laws. Help develop, maintain, improve, and manage tools to facilitate compliance. Support restricted party screening and know-your-customer diligence reviews. Disposition screening matches through customer outreach and open-source research. Maintain and update records and internal databases.", "qualifications": {"required": "Bachelor’s degree, 2+ years of experience as a legal analyst, paralegal, or 2+ years of experience at a law firm or working in compliance", "preferred": "Familiarity with or strong interest to learn U.S. trade and national security laws, Exceptional problem-solving skills and attention to detail, Experience drafting licenses and correspondence to U.S. government agencies, Experience in open-source research and using restricted party screening software, Strong data analysis skills, Ability to work efficiently and independently."}, "skills": ["Legal Analysis", "Compliance", "Export Control", "Sanctions Regulations", "Research", "Data Analysis"], "postedDate": "5 days ago", "applicationDeadline": "", "benefits": "Comprehensive medical, vision, and dental coverage, access to a 401(k) retirement plan, short and long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation and will be eligible for 10 or more paid holidays per year. Exempt employees are eligible for 5 days of sick leave per year.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4004123309"}