{"jobTitle": "Senior Designer", "company": {"name": "Craft", "location": "New York, United States"}, "location": "New York, United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00 - $100,000.00", "currency": "USD"}, "jobFunction": "Art/Creative and Design", "industry": "Design Services and Graphic Design", "description": "<strong>The Company </strong>\nCreative and collaborative, this agency is passionate about what they do - creating stronger connections, they are all about building brands that people love.\n\n<br/>\n\nBlending the best of a boutique studio and an international agency, their global reach is all thanks to their perfect mix of flexibility and agility. Their team of experts have bucketloads of experience, talent and innovative thinking - and they’re now looking for a Senior Designer to add to their ranks!\n\n<br/>\n\n<strong>What’s on Offer?</strong>\n$90,000 - $100,000\nHybrid working\nCollaborative and creative working environment\nPlenty of learning and development opportunities\nFriendly and supportive team\nComprehensive benefits package\nMedical, dental, vision and life insurance schemes\n401k savings program\n\n<br/>\n\n<strong>The Position</strong>\nA master when it comes to Adobe Suite, you’ll work on a variety of exciting projects, getting right to the heart of all the action from briefing straight through to delivery.\n\n<br/>\n\nYou’ll be an ace communicator and presenter, more than comfortable collaborating with your fellow designers, and a real design enthusiast - keeping up with all the latest styles and trends to take your work to the next level.\n\n<br/>\n\nThis role is perfect for someone looking to take the next step in their career and spread their wings, collaborating with great clients and building an enviable portfolio.\n\n<br/>\n\n<strong>What We’re Looking For</strong>\nTalented, ambitious and possessing plenty of passion, you’re a Senior Designer with an eye for great design and a portfolio full of luxury beauty and packaging projects.\n\n<br/>\n\nYou'll have experience across branding, packaging and visual identity for large-scale FMCG brands such as P&G and Unilever and be ready to hit the ground running; the type of person who can multitask, problem solve and utilise your collaborative and flexible attitude to match the team’s positive energy.\n\n<br/>\n\nMotivated and driven, you'll lead from the front when presenting to clients and act as a figurehead for internal teams. We're after someone who knows their stuff and who's in it for the long haul!", "postedDate": "1 day ago", "skills": ["Adobe Suite", "Branding", "Packaging", "Visual Identity", "Communication", "Presentation", "Collaboration", "Design Enthusiasm", "FMCG", "P&G", "Unilever", "Multitasking", "Problem Solving", "Collaborative", "Flexible", "Client Presentation", "Leadership"], "url": "https://www.linkedin.com/jobs/view/4004951770"}