{"jobTitle": "Program Coordinator, First to Go - Req. 4324", "company": {"name": "UCLA", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Contract", "employmentType": "Contract", "jobFunction": "Education", "industry": "Higher Education", "description": "Under the supervision of the First To Go Associate Director, the Program Specialist assists with communications, program development, administrative needs, and onboarding and training of student staff for the First To Go program and the community of approximately 10,000 undergraduate and graduate first-gen students it serves. The Program Specialist will be responsible for various levels of communication which include social media, newsletter, website maintenance, and correspondence with stakeholders. They will implement student-focused programmatic activities that impact approximately 10,000 UCLA undergraduate and graduate first-gen students. The Program Specialist will provide support for First-Gen initiatives and areas of focus designated by leadership. They will also provide support for Welcome Events; First-Gen Awareness Week; First-Gen Graduation Celebration and the year-round programs of the First To Go program. In addition, the incumbent will track and analyze social media metrics for trends, assess student needs, and community-building opportunities. The Program Specialist must be able to work independently and with others to manage multiple constituents and priorities. This requires effective skills in planning, organization, coordination, delegation, and adaptability. The incumbent will have developed skills to analyze information, identify alternatives, and exercise innovation with ingenuity and resourcefulness in selecting appropriate solutions or directions, particularly around communication.", "responsibilities": "The Program Specialist assists with communications, program development, administrative needs, and onboarding and training of student staff for the First To Go program and the community of approximately 10,000 undergraduate and graduate first-gen students it serves. The Program Specialist will be responsible for various levels of communication which include social media, newsletter, website maintenance, and correspondence with stakeholders. They will implement student-focused programmatic activities that impact approximately 10,000 UCLA undergraduate and graduate first-gen students. The Program Specialist will provide support for First-Gen initiatives and areas of focus designated by leadership. They will also provide support for Welcome Events; First-Gen Awareness Week; First-Gen Graduation Celebration and the year-round programs of the First To Go program. In addition, the incumbent will track and analyze social media metrics for trends, assess student needs, and community-building opportunities. The Program Specialist must be able to work independently and with others to manage multiple constituents and priorities. This requires effective skills in planning, organization, coordination, delegation, and adaptability. The incumbent will have developed skills to analyze information, identify alternatives, and exercise innovation with ingenuity and resourcefulness in selecting appropriate solutions or directions, particularly around communication.", "qualifications": {"required": "Excellent written and verbal communication and interpersonal skills to facilitate meetings, prepare, and deliver professional presentations; explain complex ideas to diverse audiences, build consensus, and influence decision-making.\nSkill in interacting with individuals from various social, cultural, economic, educational backgrounds, and professional rank in a high-volume, continuous contact setting to establish and maintain cooperative working relationships.\nAdvanced technical literacy in a Microsoft environment including Microsoft Office Suite (Outlook, Word, Excel, and PowerPoint) and proficiency using publishing programs.\nWorking knowledge of University protocols, procedures, and policies regarding programming, event-management, and liability.\nAbility to market and publicize events and activities in a creative and innovative way including, but not limited to print materials and social media marketing.\nOrganizational skills to work effectively within a complex, rapidly changing environment to simultaneously manage a wide range of active projects and responsibilities with frequently changing priorities and deadlines.\nAbility to work independently to organize and complete assignments, set priorities, and allocate resources with minimal direction in a constantly changing environment. (Required)\nExperience advising individuals or groups.\nStrong organizational and project management skills.\nDemonstrated experience and ability to constructively engage others in complex diversity issues in on campus housing.", "preferred": "Strong knowledge around social media management and analyzing metrics."}, "skills": ["Communication", "Microsoft Office", "Event Management", "Social Media", "Marketing", "Project Management"], "postedDate": "1 day ago", "salary": {"amount": "26.10/hr - 28.00/hr", "currency": "USD"}, "benefits": "Medical insurance, Pension plan, Commuter benefits, Vision insurance, Dental insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004722605"}