{"jobTitle": "Vice President of Population Health Strategy", "company": {"name": "Get It Recruit - Executive", "location": "Walnut, CA"}, "location": "Walnut, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Business Development and Sales", "industry": "Staffing and Recruiting", "description": "### Why Consider This Opportunity?<br/><br/>#### Collaborative Leadership<br/><br/><ul><li> Work alongside an experienced Chief Executive Officer with a clinical background and a thorough understanding of the Federally Qualified Health Center (FQHC) model.<br/><br/></li></ul>#### Team Building and Growth<br/><br/><ul><li> Join a cohesive leadership team focused on continuous growth through consultant-driven programs and advanced leadership training.<br/><br/></li></ul>#### Population Health Management<br/><br/><ul><li> Engage in the Population Health Management Initiative, collaborating with major health organizations to enhance care quality and address health disparities.<br/><br/></li></ul>#### Expansion and Innovation<br/><br/><ul><li> Contribute to an entrepreneurial environment aimed at expanding health center services and increasing access to care.<br/><br/></li></ul>#### Balanced Workload<br/><br/><ul><li> Benefit from a workload divided into 60% administrative and 40% clinical, enabling you to focus on high-level responsibilities while maintaining clinical skills.<br/><br/></li></ul>#### Professional Networking<br/><br/><ul><li> Expand your professional network through participation in regional consortiums and advisory committees, with the support of the CEO.<br/><br/></li></ul>#### Mission-Driven Team<br/><br/><ul><li> Join a dedicated team focused on improving access to high-quality healthcare services in underserved communities.<br/><br/></li></ul>#### Educational Opportunities<br/><br/><ul><li> Involve yourself in clinical activities with a residency program and pursue faculty appointments through established relationships with medical schools.<br/><br/></li></ul>### The Role You'll Play<br/><br/><ul><li> As the primary leader, you will oversee medical services across multiple health center locations, emphasizing population health and the integration of healthcare services. Your mission will be to deliver high-quality care, ensure patient access, and provide exceptional customer service to underserved communities.<br/><br/></li></ul>### Background Profile<br/><br/>#### Education<br/><br/><ul><li> Board Certified MD/DO in Family Practice or Internal Medicine.<br/><br/></li></ul>#### Experience<br/><br/><ul><li> Demonstrated clinical leadership experience in a Federally Qualified Health Center, such as Site Medical Director, Associate Medical Director, Deputy CMO, or CMO.<br/><br/></li></ul>#### Skills<br/><br/><ul><li> Strong project management capabilities, adept at leading strategic implementation and employing a systems-change-oriented approach.<br/><br/></li></ul>#### Leadership<br/><br/><ul><li> Proven ability to inspire and lead provider groups, advocate for the organization, and effectively manage competing priorities.<br/><br/></li></ul>#### Communication<br/><br/><ul><li> Excellent active listening skills, with a talent for articulating the rationale behind changes and adjusting processes to meet goals.<br/><br/></li></ul>Employment Type: Full-Time", "postedDate": "2 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004979794"}