{"jobTitle": "Data Entry Clerk", "company": {"name": "Scion Staffing", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "24.00/hr - 25.00/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Non-profit Organizations, IT Services and IT Consulting, and Staffing and Recruiting", "description": "Scion Staffing has been engaged to conduct an immediate search for a DATA ENTRY CLERK for our client, an incredible consulting firm in Los Angeles, California! This is a full-time, on-site, 6-week contract position.<br/><br/>RESPONSIBILITIES:<br/><br/>\n<ul><li>Reviews data from a variety of sources, including paper charts, forms, and electronic database</li><li>Enters / transfers data from various sources into electronic databases.</li><li>Performs periodic quality assurance of data entry under the guidance of program staff.</li><li>Respond to data correction / data cleaning on a regular basis.</li><li>May perform additional administrative tasks as instructed, including faxing, filing, preparation/maintenance of data reports.</li><li>If needed, will provide training to other volunteers or staff on data entry tasks.<br/><br/></li></ul>QUALIFICATIONS:<br/><br/>\n<ul><li>1 year of Data Entry experience</li><li>Impeccable attention to detail<br/><br/></li></ul>COMPENSATION AND BENEFITS:<br/><br/>\nThis opportunity provides a starting hourly pay of $24-$25.00.<br/><br/>HOW TO APPLY:<br/><br/>\nFor immediate consideration, please submit your resume and cover letter to jordanv@scionstaffing.com. We look forward to contacting potential-match applicants.<br/><br/>ABOUT OUR SEARCH FIRM:<br/><br/>\nScion Staffing is a national award-winning staffing firm! Since 2006, we have had the pleasure of successfully placing thousands of talented professionals with amazing career opportunities. Through our innovative team building and recruiting solutions, we bridge the gap in executive leadership searches, direct hire recruiting, interim leadership placement and temporary professional staffing. Our track record and recruitment process has made us one of the top recruitment firms in the nation.<br/><br/>We are proud to be part of the Forbes lists of the Best Recruitment Firms and the Best Executive Search Firms in America. Additionally, Scion has been recognized as a Clearly Rated Best of Staffing firm as well as a top recruitment firm by The Business Times. Additional information about us can also be found at www.scionstaffing.com. Scion Staffing, Inc. is an equal opportunity employer and service provider and does not discriminate on the basis of race, religion, gender, gender identity, national origin, citizenship status, sexual orientation, disability, political affiliation or belief, or any other protected class. We are committed to the principles of Equal Opportunity Employment and are dedicated to making employment decisions based on merit and value, for ourselves, our client companies, and for the candidates we represent. For opportunities located in a region that have enacted fair chance, arrest or conviction-based employment ordinances, Scion Staffing proactively follows the enacted guidance and considers for employment all qualified applications with arrest and conviction records. We believe in following best practices and considering all qualified applicants that apply with us.", "responsibilities": "Reviews data from a variety of sources, including paper charts, forms, and electronic database\nEnters / transfers data from various sources into electronic databases.\nPerforms periodic quality assurance of data entry under the guidance of program staff.\nRespond to data correction / data cleaning on a regular basis.\nMay perform additional administrative tasks as instructed, including faxing, filing, preparation/maintenance of data reports.\nIf needed, will provide training to other volunteers or staff on data entry tasks.", "qualifications": {"required": "1 year of Data Entry experience\nImpeccable attention to detail"}, "skills": ["Data Entry"], "postedDate": "22 hours ago", "url": "https://www.linkedin.com/jobs/view/4004741384"}