{"jobTitle": "Client Relations Specialist", "company": {"name": "Pixi Inc.", "location": "Los Angeles Metropolitan Area", "industry": "Personal Care Product Manufacturing"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Sales", "industry": "Personal Care Product Manufacturing", "description": "<strong>About Pixi Beauty</strong><p><br/></p><p>Pixi Beauty, a luminary in the beauty industry, combines innovation, quality, and charm to create unforgettable customer experiences. Our rapid growth and international reputation highlight our commitment to excellence. In our journey forward, we seek an experienced Associate Vice President for Global Merchandising to join our Los Angeles team and support our retail presence and growth under the guidance of the Chief Revenue Officer.</p><p><br/></p><p><strong>Responsibilities</strong></p><p><br/></p><ul><li>Partnering &amp; establishing annual sales objectives &amp; goals for nominated customers in conjunction with the D.R.P.</li><li>Partnering on new listing objectives and planning accordingly to ensure customer forecasts are communicated internally and with respective client’s internal teams. This includes customer respective templates and POG planning.</li><li>Providing monthly / quarterly progress reports against goals set (sales in / out / etc).</li><li>Attending review / planning meetings with nominated clients to ensure that planned sales and commercial activity are executed and achieving predetermined goals.</li><li>Partnering with D.R.P. &amp; Trade Sector Marketing Manager to plan customer specific promotional, merchandising &amp; communication activity to drive sales and awareness.</li><li>Providing forecast data to planning and production teams to ensure that stocks are available, OTIF and appropriate forward needs are visible.</li><li>Assisting with customer care support.</li><li>Tracking and advising on any stock issues (shortages / late / etc.) so that customers can be apprised as needed and internal planning and corrective actions are instigated.</li><li>Partnering closely with the Operations and Supply Chain team to ensure routing / shipment timing is executed within customer timeframes.</li><li>Working closely with customers to manage in DC dates.</li><li>Managing all new item set-ups within customer portals.</li><li>Completing promotional and space planning customer templates.</li><li>All other tasks and responsibilities will be assigned by management.</li></ul>", "postedDate": "2 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004726707"}