{"jobTitle": "Data Entry Clerk Work From Home - Part-Time Survey Participants", "company": {"name": "WorkatHome-JobBoard", "location": "Riverside, CA"}, "location": "Riverside, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Advertising Services", "description": "<strong>Position:</strong> Data Entry Clerk Work From Home - Part-Time Focus Group Participants (Side Gig)<br/><br/>We are seeking individuals to participate in National &amp; Local Paid Focus Groups, Clinical Trials, Phone Interviews or Paid Surveys.<br/><br/>With most of our paid surveys, you have the option to participate remotely online or in-person. This is a great way to earn additional income from the comfort of your home.<br/><br/><strong>Job Requirements<br/><br/></strong><ul><li>Participate by completing written and/or oral instructions.</li><li>Complete written survey provided for each panel.</li><li>MUST actually use products and/or services, if provided. Then be ready to discuss PRIOR to meeting date.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Must have either a smart phone with working camera or webcam on desktop/laptop.</li><li>Must have access to high speed internet</li><li>Desire to fully participate in one or several of the given topics</li><li>Ability to read, understand, and follow oral and written instructions.</li><li>Data entry clerk experience is not necessary<br/><br/></li></ul><strong>Job Benefits<br/><br/></strong><ul><li>Flexibility to take part in discussions online or in-person.</li><li>No commute needed if you choose to work from home remotely.</li><li>No minimum hours. You can do this part-time or full-time</li><li>Enjoy free samples from our sponsors and partners in exchange for your honest feedback of their products.</li><li>You get to review and use new products or services before they are launched to the public.<br/><br/></li></ul>This position is perfect for anyone looking for temporary, part-time or full-time work. The hours are flexible and no previous experience is needed. If you are a data entry clerk or someone just looking for a flexible part time remote work at home job, this is a great way to supplement your income.<br/><br/><ul><li>Please note that this is an opportunity to earn extra money from home and should not be considered as a full time job.</li></ul>", "postedDate": "5 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004073705"}