{"jobTitle": "Assistant Project Manager", "company": {"name": "Ferrante Koberling", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "75,000.00 - 85,000.00", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Construction", "description": "<strong>ASSISTANT PROJECT MANAGER:</strong><p><span>Ferrante Koberling Construction, Inc. is a boutique custom construction firm focused on high design luxury-based projects. We are immediately seeking an Assistant Project Manager with 2 years minimum retail, restaurant and / or office build – out experience. The right candidate will have assistant project management experience with a keen understanding of the time sensitive nature of construction, subcontractor relationships, and basic construction accounting. </span></p><p><br/></p><p><strong>GENERAL RESPONSIBILITIES:</strong></p><ul><li>Aptitude for reading full project drawings - This position requires regular review of drawings and details with the PM and Supervisor, to support efforts to ensure only the most current plans/specifications are being followed .</li><li>Assist with permit process including but not limited to visits to applicable City offices to pick up permits.</li><li>Assist PM with schedule modifications through scheduling software.</li><li>Will issue contracts, purchase orders, and change orders through Procore.  Includes timely distribution of all applicable information to affected parties.</li><li>Must proactively push subcontractors for submittals, catalogue and upload submittals, timely distribute submittal and RFI responses, and generally monitor all communications to ensure applicable parties are kept informed.</li><li>Must attend and document PM/Supervisor meetings to review schedule, track progress, and assist with addressing issues before they become problems or cause delay impacts.</li><li>Must download and review all installation guides and operations manuals with Supervisor to ensure materials and equipment are installed properly, and warranties are protected.</li><li>Assist with initial project set-up in Procore, including upload of all drawings, specifications, and sketches throughout the project duration.</li><li>Assist Supervisor in developing plan for project staging and site service purchases.  Will lay out job office, dumpsters, portable toilets and sinks, signage, trash, and ash receptacles, staging area, storage area, fence, and gates.  Will track site services monthly to ensure proper invoicing.</li><li>Assist with safety program updates and ensure Supervisors are kept informed of changes.</li><li>Attend all OAC meetings; Accountable for taking meeting minutes and distributing all within 24-hours of PM review.</li><li>Accountable for all document control, through Procore software, to ensure records are current/accurate, with dual file on Sharepoint.</li><li>Keep accurate record of all material and equipment purchases for each project; Accountable for monthly review of budget with PM and Accounts Manager.</li><li>Occasionally may visit jobsites to deliver permits and/or materials (submittals/mock-ups), understands liability, and will wear PPE as required.</li><li>Accountable for collecting comprehensive close-out package and ensuring distribution to applicable clients within 21 days of substantial completion.</li></ul><p><br/></p><p><strong>SKILLS, EXPERIENCE AND EDUCATION</strong></p><ul><li>No less than 2 years’ experience working in the construction industry, with a minimum of one-years’ experience with Procore software.</li><li>Professional appearance; Excellent communication skills; knowledge of construction practices, means and methods.</li><li>Must have valid driver’s license; and own a vehicle in good working condition.</li><li>Must be a legal citizen of the United States and fluent in English. Spanish is a plus. </li><li>Must have basic knowledge of OSHA standards.</li><li>Computer literate; Advanced knowledge of office software (Word; Excel; Outlook; SharePoint; Dropbox).</li><li>Highly motivated and capable of working independently and in teams.</li></ul><p><br/></p><p><strong>BENEFITS:</strong></p><ul><li>Full-time position with excellent growth potential.</li><li>Salary Range is $75,000.00 - $85,000.00 per year (Based on experience)</li><li><span>Medical and Dental offered after first 90-days </span><span>(Company pays 50% of monthly premium, pre-tax, through payroll deductions); 401k program.</span></li><li>Paid vacation and sick leave.</li><li>Excellent growth potential.</li></ul><p><br/></p><p><strong>LOCATION:</strong></p><ul><li>We are a Los Angeles based company with projects throughout southern California. This position will report to the home office Monday-Friday and will require minimal travel within the greater Los Angeles area.</li></ul><p><br/></p><p></p>", "responsibilities": "GENERAL RESPONSIBILITIES:<ul><li>Aptitude for reading full project drawings - This position requires regular review of drawings and details with the PM and Supervisor, to support efforts to ensure only the most current plans/specifications are being followed .</li><li>Assist with permit process including but not limited to visits to applicable City offices to pick up permits.</li><li>Assist PM with schedule modifications through scheduling software.</li><li>Will issue contracts, purchase orders, and change orders through Procore.  Includes timely distribution of all applicable information to affected parties.</li><li>Must proactively push subcontractors for submittals, catalogue and upload submittals, timely distribute submittal and RFI responses, and generally monitor all communications to ensure applicable parties are kept informed.</li><li>Must attend and document PM/Supervisor meetings to review schedule, track progress, and assist with addressing issues before they become problems or cause delay impacts.</li><li>Must download and review all installation guides and operations manuals with Supervisor to ensure materials and equipment are installed properly, and warranties are protected.</li><li>Assist with initial project set-up in Procore, including upload of all drawings, specifications, and sketches throughout the project duration.</li><li>Assist Supervisor in developing plan for project staging and site service purchases.  Will lay out job office, dumpsters, portable toilets and sinks, signage, trash, and ash receptacles, staging area, storage area, fence, and gates.  Will track site services monthly to ensure proper invoicing.</li><li>Assist with safety program updates and ensure Supervisors are kept informed of changes.</li><li>Attend all OAC meetings; Accountable for taking meeting minutes and distributing all within 24-hours of PM review.</li><li>Accountable for all document control, through Procore software, to ensure records are current/accurate, with dual file on Sharepoint.</li><li>Keep accurate record of all material and equipment purchases for each project; Accountable for monthly review of budget with PM and Accounts Manager.</li><li>Occasionally may visit jobsites to deliver permits and/or materials (submittals/mock-ups), understands liability, and will wear PPE as required.</li><li>Accountable for collecting comprehensive close-out package and ensuring distribution to applicable clients within 21 days of substantial completion.</li></ul>", "qualifications": {"required": "No less than 2 years’ experience working in the construction industry, with a minimum of one-years’ experience with Procore software. Professional appearance; Excellent communication skills; knowledge of construction practices, means and methods. Must have valid driver’s license; and own a vehicle in good working condition. Must be a legal citizen of the United States and fluent in English. Spanish is a plus.  Must have basic knowledge of OSHA standards. Computer literate; Advanced knowledge of office software (Word; Excel; Outlook; SharePoint; Dropbox). Highly motivated and capable of working independently and in teams.", "preferred": ""}, "skills": ["Procore", "Construction", "OSHA", "Word", "Excel", "Outlook", "SharePoint", "Dropbox"], "postedDate": "5 days ago", "benefits": "Full-time position with excellent growth potential. Salary Range is $75,000.00 - $85,000.00 per year (Based on experience) Medical and Dental offered after first 90-days (Company pays 50% of monthly premium, pre-tax, through payroll deductions); 401k program. Paid vacation and sick leave. Excellent growth potential.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4004478856"}