{"jobTitle": "Receptionist - LA Administration", "company": {"name": "SAG-AFTRA", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Entertainment Providers", "description": "<strong>Overview<br/><br/></strong><strong> Who We Are <br/><br/></strong>SAG-AFTRA is the iconic American labor union that represents approximately 160,000 media professionals. SAG-AFTRA employees support our members and thrive on securing the strongest protections by negotiating the best wages, working conditions, health and pension benefits. We preserve and expand members’ work opportunities, vigorously enforce our contracts and protect our members against unauthorized use of their work.<br/><br/><strong>Responsibilities<br/><br/></strong><strong> What You’ll Do <br/><br/></strong><strong> Performs duties related to the front desk, and, as directed by the National Director - Administration, performs duties supporting office operations (purchasing, staff and building requests, mailroom services etc.) to ensure various inter-departmental needs are met in service of our membership. <br/><br/></strong><strong> (This section provides a general summary of the most significant job duties performed. It does not explain in detail every single duty performed.) <br/><br/></strong><strong>Essential Duties &amp; Responsibilities<br/><br/></strong><ul><li> Greets and directs visitors, members, staff, and board members. </li><li> Communicates with various department representatives to address visitor and member questions and requests </li><li> Receives, logs, and transfers mail or other document drop-offs from couriers, members, or staff </li><li> Assists, as a liaison in coordination with the Administrative Coordinator, with responding to staff and building requests. May include answering or coordinating some purchasing, logistics, maintenance, and service questions and requests. </li><li> Assists with greeting and guiding technicians or vendors to appropriate locations for scheduled repairs and/or deliveries. </li><li> Drafts, prints, and posts signage related to office closures, compliance, and/or office name plates. </li><li> Assist security with distributing ID badges, access cards, and keys; logs and provides visitor badges </li><li> Provides and assists with filling in claim and other request forms from various departments </li><li> Assist P&amp;C with greeting and processing incoming job applicants and new hires </li><li> Assists various departments with document and check pickups </li><li> Coordinates meeting room requests, including booking rooms, directing visitors, and communicating service requests </li><li> Maintains departmental records and databases, including logs of received/distributed documents, service requests, visitors and other records as required. </li><li> Fills in for and assists Administrative Coordinator </li><li> May be responsible for lifting and moving heavy items. </li><li> Performs other duties as assigned or as the situation dictates. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong> What You’ll Need <br/><br/></strong><strong> We want to make sure you’re successful. To be considered, you must have: <br/><br/></strong><strong> ( </strong><strong> The individual must possess the following knowledge, skills and abilities and be able to explain and demonstrate that he or she can perform the essential functions of this job with or without reasonable accommodation, using some other combination of skills and abilities.) <br/><br/></strong><ul><li> Excellent customer service skills. </li><li> Able to communicate effectively orally and in written form; must be tactful and diplomatic </li><li> Able to listen to visitors, members and staff while remaining congenial, courteous and assertive. </li><li> Able to work with minimal supervision. </li><li> Expert interpersonal skills: high degree of patience and tact, and must be able to cultivate relationships with people from diverse backgrounds, both internally and externally. </li><li> Expert organizational and clerical skills: high degree of attention to detail and time management to plan and prioritize daily tasks, identify delays and errors, and maintain records. </li><li> Able to create, compose, and edit written materials. </li><li> Strong communication skills in English, both oral and written. </li><li> Able to use sound judgment, discretion, and maintain confidentiality. </li><li> Able to organize, prioritize and coordinate multiple assignments and projects; able to thrive in a highly dynamic work environment; able to develop creative solutions. Able to learn and apply knowledge of office management principles and procedures to administrative and procedural decisions. </li><li> Able to learn and apply knowledge of mail processing and general office equipment to complete tasks. </li><li> Knowledge of supplies, equipment, and/or services ordering and inventory control. </li><li> Information research and records management skills. </li><li> Able to lift up to 50lbs. </li><li> Proficient in PC applications and Internet-based systems. </li><li> Must be able to accurately type 35 WPM </li><li> Capable of taking direction from more than one supervisor </li><li> Have an understanding and awareness of worker rights impacting SAG-AFTRA members </li><li> Able to maintain regular and acceptable attendance at such a level as is determined at SAG-AFTRA’s sole discretion. </li><li> Available and willing to work extended hours (and/or overtime for applicable non- exempt positions) per day or per week, including weekends and holidays, as SAG-AFTRA determines is necessary to meet its business needs </li><li> Available and willing to travel to such locations and with such frequency as SAG-AFTRA determines is necessary or desirable to meet its business needs. <br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><strong> Education and/or Experience: <br/><br/></strong><ul><li> High School diploma or equivalent <br/><br/></li></ul><strong>Testing Requirements<br/><br/></strong><ul><li> Basic skills- math, spelling, grammar and filing – passing score: 76% </li><li> Typing 35 wpm. </li><li> Word and Excel tests (basic) – passing score: 76% <br/><br/></li></ul><strong>What You’ll Get<br/><br/></strong><strong> We are a great place to work because we offer: <br/><br/></strong><ul><li> The hourly rate for this position is $22.00 per hour along with excellent employee benefits and perks such as a 35-hour work week. </li><li> Colleagues that are passionate about what we do and how they contribute to our mission </li><li> Balance between work and home life responsibilities </li><li> Affordable and comprehensive medical and dental plans </li><li> Generous pension plan </li><li> Employee discounts and perks</li></ul>", "responsibilities": "Performs duties related to the front desk, and, as directed by the National Director - Administration, performs duties supporting office operations (purchasing, staff and building requests, mailroom services etc.) to ensure various inter-departmental needs are met in service of our membership.  (This section provides a general summary of the most significant job duties performed. It does not explain in detail every single duty performed.)  Essential Duties & Responsibilities<br/><br/>\n<ul><li> Greets and directs visitors, members, staff, and board members. </li><li> Communicates with various department representatives to address visitor and member questions and requests </li><li> Receives, logs, and transfers mail or other document drop-offs from couriers, members, or staff </li><li> Assists, as a liaison in coordination with the Administrative Coordinator, with responding to staff and building requests. May include answering or coordinating some purchasing, logistics, maintenance, and service questions and requests. </li><li> Assists with greeting and guiding technicians or vendors to appropriate locations for scheduled repairs and/or deliveries. </li><li> Drafts, prints, and posts signage related to office closures, compliance, and/or office name plates. </li><li> Assist security with distributing ID badges, access cards, and keys; logs and provides visitor badges </li><li> Provides and assists with filling in claim and other request forms from various departments </li><li> Assist P&C with greeting and processing incoming job applicants and new hires </li><li> Assists various departments with document and check pickups </li><li> Coordinates meeting room requests, including booking rooms, directing visitors, and communicating service requests </li><li> Maintains departmental records and databases, including logs of received/distributed documents, service requests, visitors and other records as required. </li><li> Fills in for and assists Administrative Coordinator </li><li> May be responsible for lifting and moving heavy items. </li><li> Performs other duties as assigned or as the situation dictates. <br/><br/></li></ul>", "qualifications": {"required": "Excellent customer service skills.  Able to communicate effectively orally and in written form; must be tactful and diplomatic  Able to listen to visitors, members and staff while remaining congenial, courteous and assertive.  Able to work with minimal supervision.  Expert interpersonal skills: high degree of patience and tact, and must be able to cultivate relationships with people from diverse backgrounds, both internally and externally.  Expert organizational and clerical skills: high degree of attention to detail and time management to plan and prioritize daily tasks, identify delays and errors, and maintain records.  Able to create, compose, and edit written materials.  Strong communication skills in English, both oral and written.  Able to use sound judgment, discretion, and maintain confidentiality.  Able to organize, prioritize and coordinate multiple assignments and projects; able to thrive in a highly dynamic work environment; able to develop creative solutions. Able to learn and apply knowledge of office management principles and procedures to administrative and procedural decisions.  Able to learn and apply knowledge of mail processing and general office equipment to complete tasks.  Knowledge of supplies, equipment, and/or services ordering and inventory control.  Information research and records management skills.  Able to lift up to 50lbs.  Proficient in PC applications and Internet-based systems.  Must be able to accurately type 35 WPM  Capable of taking direction from more than one supervisor  Have an understanding and awareness of worker rights impacting SAG-AFTRA members  Able to maintain regular and acceptable attendance at such a level as is determined at SAG-AFTRA’s sole discretion.  Available and willing to work extended hours (and/or overtime for applicable non- exempt positions) per day or per week, including weekends and holidays, as SAG-AFTRA determines is necessary to meet its business needs  Available and willing to travel to such locations and with such frequency as SAG-AFTRA determines is necessary or desirable to meet its business needs. <br/><br/>", "preferred": "High School diploma or equivalent <br/><br/>"}, "skills": ["Customer Service", "Communication", "Organization", "Time Management", "Microsoft Office", "Typing", "Inventory Control", "Information Research", "Records Management"], "postedDate": "1 day ago", "benefits": "The hourly rate for this position is $22.00 per hour along with excellent employee benefits and perks such as a 35-hour work week.  Colleagues that are passionate about what we do and how they contribute to our mission  Balance between work and home life responsibilities  Affordable and comprehensive medical and dental plans  Generous pension plan  Employee discounts and perks", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004331992"}