{"jobTitle": "Quality Assurance Manager", "company": {"name": "TekPrism Inc", "location": "La Puente, CA"}, "location": "La Puente, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Quality Assurance", "industry": "Information Technology & Services", "description": "<strong>Role: Quality Assurance Manager</strong>\n<p><strong>Location: Proctor Avenue, Industry, CA 91746</strong></p><p><strong>Type: Full-time, On-site</strong></p><p><br/></p><p><br/></p><p><strong>Position Overview:</strong></p><p>The Quality Assurance Manager will be responsible for overseeing the quality assurance and quality control functions to ensure that all products meet customer specifications and industry standards. This role involves developing and implementing quality standards, monitoring adherence to those standards, and identifying areas for improvement. You will collaborate closely with manufacturing and engineering teams to address quality issues, propose corrective actions, and lead the organization's efforts to foster a culture of quality and continuous improvement.</p><p><br/></p><p><strong>Key Responsibilities:</strong></p><ul><li>Regulatory Compliance: Coordinate and manage regulatory inspections, follow-up reporting, and corrective action plans across departments.</li><li>Quality Program Development: Develop and implement quality programs in alignment with ISO guidelines.</li><li>Documentation Review: Evaluate control documents and analyze trends to ensure components, in-process, and finished products meet specifications.</li><li>Continuous Improvement: Participate in and support continuous improvement initiatives, reviewing and evaluating outcomes.</li><li>Internal Audits: Conduct internal audits, oversee corrective action plans, and monitor results.</li><li>Documentation Management: Develop, control, and maintain all quality-related documents.</li><li>Corrective Actions: Lead corrective and preventive action teams, tracking their effectiveness.</li><li>Product Inspection: Coordinate in-process inspections, batch record reviews, and product releases.</li><li>Team Leadership: Facilitate training and lead the quality assurance team.</li><li>Customer Interaction: Represent the company professionally with customers, suppliers, and colleagues.</li><li>Statistical Analysis: Coordinate statistical capability studies to ensure compliance with customer specifications and ISO standards.</li></ul><p><br/></p><p><strong>Qualifications:</strong></p><ul><li>Education: Bachelor's degree in engineering is preferred.</li><li>Certification: Certified Quality Engineer (CQE) is required.</li><li>Experience: Minimum of 5 years in management or supervisory roles, with at least 10 years in quality assurance within the metal fabrication industry.</li><li>Preferred Experience: Familiarity with ISO standards and IQMS.</li><li>Leadership: Proven ability to manage and direct a team of 3 to 6 employees within the Quality Control Department.</li><li>Technical Skills: Proficiency in Quality Improvement Tools and Techniques (Lean, Six Sigma, Statistical Process Control, FMEA).</li><li>Industry Knowledge: Strong understanding of manufacturing and quality practices, specifically in sheet metal processes and equipment calibration.</li><li>Software Proficiency: Strong skills in MS Office; knowledge of CAPA is essential.</li></ul><p><br/></p><p><strong>Skills and Abilities:</strong></p><ul><li>Exceptional interpersonal and communication skills, both written and oral.</li><li>Strong problem-solving, analysis, and project management abilities.</li><li>Ability to work independently as well as in a cross-functional team environment.</li><li>Excellent organizational skills with keen attention to detail.</li><li>Demonstrated ability to lead and manage projects, with a proactive approach to challenges.</li></ul><p><br/></p><p><strong>Physical Requirements:</strong></p><ul><li>Ability to sit, stand, and walk for extended periods.</li><li>Frequent lifting of up to 20 pounds, with occasional lifting of up to 40 pounds.</li><li>Capability to maneuver safely around moving equipment and within congested manufacturing areas.</li></ul><p><br/></p><p><br/></p><p><br/></p><p><strong>Thanks&amp; Regards,</strong></p><p><strong> Sumi B</strong></p><p>Talent Acquisition Executive</p><p> D:18327624435</p><p> Email : Sumi.b@tekprisminc.com</p><p><br/></p><p><br/></p>", "responsibilities": "The Quality Assurance Manager will be responsible for overseeing the quality assurance and quality control functions to ensure that all products meet customer specifications and industry standards. This role involves developing and implementing quality standards, monitoring adherence to those standards, and identifying areas for improvement. You will collaborate closely with manufacturing and engineering teams to address quality issues, propose corrective actions, and lead the organization's efforts to foster a culture of quality and continuous improvement.", "qualifications": {"required": "Education: Bachelor's degree in engineering is preferred.\nCertification: Certified Quality Engineer (CQE) is required.\nExperience: Minimum of 5 years in management or supervisory roles, with at least 10 years in quality assurance within the metal fabrication industry.", "preferred": "Familiarity with ISO standards and IQMS.\nLeadership: Proven ability to manage and direct a team of 3 to 6 employees within the Quality Control Department.\nTechnical Skills: Proficiency in Quality Improvement Tools and Techniques (Lean, Six Sigma, Statistical Process Control, FMEA).\nIndustry Knowledge: Strong understanding of manufacturing and quality practices, specifically in sheet metal processes and equipment calibration.\nSoftware Proficiency: Strong skills in MS Office; knowledge of CAPA is essential."}, "skills": ["ISO", "IQMS", "Lean", "Six Sigma", "Statistical Process Control", "FMEA", "MS Office", "CAPA"], "postedDate": "2 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004333299"}