{"jobTitle": "Group Creative Strategy Lead, Brand Studio", "company": {"name": "Google", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "214,000.00/yr - 305,000.00/yr", "currency": "USD"}, "jobFunction": "Sales, Advertising, and Marketing", "industry": "Information Services and Technology, Information and Internet", "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: **San Francisco, CA, USA; New York, NY, USA; Portland, OR, USA**. **Minimum qualifications:**<br/><br/> <ul><li>Bachelor's degree or equivalent practical experience.</li><li>13 years of experience at an advertising agency or in-house creative team, or consumer product marketing and brand management experience within brand organization.</li><li>A portfolio of creative work.<br/><br/></li></ul> **Preferred qualifications:**<br/><br/> <ul><li>Experience leading an integrated marketing team on a global scale for a tech/communications brand.</li><li>Experience in history of delivering brand marketing strategies for large, multifaceted companies and bringing brand experiences to life in new and remarkable ways.<br/><br/></li></ul> **About The Job**<br/><br/> Brand Studio is focused on building the Google brand. By combining user insights, strategic thinking, beautiful design and storytelling, our team creates a wide range of work that drives Google’s reputation for being helpful to people, businesses, and communities. Our work also aims to build advocacy and trust in the brand. To achieve that, we’re a multidisciplinary team of marketers, strategists, insights specialists, creatives, producers, and engineers who work together to create exceptional marketing.<br/><br/> In this role, you will utilize your insights and drive, approach and create a strong background to shape how Google shows up in the world in this new era of Artificial Intelligence (AI). You will have prior experience navigating global challenges and building relationships with decision makers across senior stakeholder teams. You will have a record of challenging the people around them to grow in high pressure environments, and pushing creative boundaries, but also be a practical leader, quick to author thinking, shape presentations, and lead discussions in service of getting to great work, faster.<br/><br/> As a core lead on a small team, you will be critical in taking our creative thinking to a global stage, working closely with our Europe, Middle East, and Africa (EMEA) partners and helping align everyone around a single brand expression.<br/><br/> The US base salary range for this full-time position is $214,000-$305,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/> Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/> **Responsibilities**<br/><br/> <ul><li>Lead our biggest core global marketing projects, including providing insights driven input and support in planning, creative development, execution, measurement and optimization of projects.</li><li>Partner closely with Brand Studio Insights Lab, Brand Foundations, Brand Engagement, and Product Area (PA) partner teams to help challenge and transform the way we approach creative thinking. </li><li>Co-ordinate with global brands and brand ideas that will make lasting impacts in users lives and for the Google Brand.</li><li>Communicate globally, working with the respective regional brand and product marketing leadership. </li><li>Build and maintain relationships across Google that can help to facilitate a strong cross functional team dynamic and ultimately lead to better creative work.<br/><br/><br/></li></ul> Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Lead our biggest core global marketing projects, including providing insights driven input and support in planning, creative development, execution, measurement and optimization of projects.</li><li>Partner closely with Brand Studio Insights Lab, Brand Foundations, Brand Engagement, and Product Area (PA) partner teams to help challenge and transform the way we approach creative thinking. </li><li>Co-ordinate with global brands and brand ideas that will make lasting impacts in users lives and for the Google Brand.</li><li>Communicate globally, working with the respective regional brand and product marketing leadership. </li><li>Build and maintain relationships across Google that can help to facilitate a strong cross functional team dynamic and ultimately lead to better creative work.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience. 13 years of experience at an advertising agency or in-house creative team, or consumer product marketing and brand management experience within brand organization. A portfolio of creative work.", "preferred": "Experience leading an integrated marketing team on a global scale for a tech/communications brand. Experience in history of delivering brand marketing strategies for large, multifaceted companies and bringing brand experiences to life in new and remarkable ways."}, "skills": [], "postedDate": "1 day ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004316572"}