{"jobTitle": "Program Assistant", "company": {"name": "West Coast University", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "22.90/hr - 30.91/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Education Administration Programs", "description": "Come care with us at West Coast University! As a Program Assistant for a certified Great Place to Work, you will provide administrative support for healthcare programs. Through your daily activities and interactions, you will help students to do more than change their own lives – you will help change the lives of every patient they treat throughout their careers in healthcare. At West Coast University you will have the opportunity to share your knowledge and experience as a key member of our student-centered, innovative community!<br/><br/><strong>You will make an impact by: <br/><br/></strong><ul><li>Assisting the program leadership team with all administrative assignments.</li><li>Dealing discreetly with large volumes of sensitive, confidential information concerning student, staff, faculty and campus affairs, information contained in minutes, letters, and other documents.</li><li>Initiating, collecting, and tracking data within a database system to ensure appropriate related records are maintained. </li><li>Scheduling and organizing committee meetings; assisting with the preparation, typing, filing, and distribution of minutes.</li><li>Providing world class customer service to students, associates, faculty, and other stakeholders.</li><li>Monitoring and communicating regularly with students and/or associates for adherence to license, certifications, development activities, and any other applicable information/documentation and sends to proper department for filing.</li><li>Serving as backup to other departments (student services, bursar, registrar, reception, etc.) as needed.</li><li>Maintaining record keeping and filing systems.</li><li>Maintaining files, ensuring accurate and up-to-date information for accreditation. Maintains accreditation files and prepares accreditation reports as directed. </li><li>Performing other duties as assigned.<br/><br/></li></ul><strong>Your Experience Includes: <br/><br/></strong><ul><li>Working knowledge of Microsoft Office Suite Products, especially Outlook, Word, PowerPoint and other MS office products as needed.</li><li>Two to three years of experience performing office and administrative/secretarial duties, preferably including some administrative support work for one or more managers in an academic or business office environment.</li><li>Proficient reception and telephone communication skills and techniques.</li><li>Knowledge of record keeping, account maintenance, and purchasing practices and procedures.</li><li>Proficient command of grammar, punctuation, spelling, and correct usage of the English language.<br/><br/></li></ul><strong>Education:<br/><br/></strong><ul><li>Associate’s degree or equivalent work experience required.</li></ul>", "responsibilities": "Assisting the program leadership team with all administrative assignments.Dealing discreetly with large volumes of sensitive, confidential information concerning student, staff, faculty and campus affairs, information contained in minutes, letters, and other documents.Initiating, collecting, and tracking data within a database system to ensure appropriate related records are maintained. Scheduling and organizing committee meetings; assisting with the preparation, typing, filing, and distribution of minutes.Providing world class customer service to students, associates, faculty, and other stakeholders.Monitoring and communicating regularly with students and/or associates for adherence to license, certifications, development activities, and any other applicable information/documentation and sends to proper department for filing.Serving as backup to other departments (student services, bursar, registrar, reception, etc.) as needed.Maintaining record keeping and filing systems.Maintaining files, ensuring accurate and up-to-date information for accreditation. Maintains accreditation files and prepares accreditation reports as directed. Performing other duties as assigned.", "qualifications": {"required": "Working knowledge of Microsoft Office Suite Products, especially Outlook, Word, PowerPoint and other MS office products as needed.Two to three years of experience performing office and administrative/secretarial duties, preferably including some administrative support work for one or more managers in an academic or business office environment.Proficient reception and telephone communication skills and techniques.Knowledge of record keeping, account maintenance, and purchasing practices and procedures.Proficient command of grammar, punctuation, spelling, and correct usage of the English language.", "preferred": "Associate’s degree or equivalent work experience required."}, "skills": ["Microsoft Office", "Outlook", "Word", "PowerPoint", "Customer Service", "Communication", "Record Keeping", "Administrative Support"], "postedDate": "2 days ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4004381148"}