{"jobTitle": "Account Executive, Personal Lines", "company": {"name": "HUB International", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Insurance", "description": "<strong>IGNITE YOUR PASSION * IMPACT WHAT MATTERS <br/><br/></strong><strong>Who We Are.<br/><br/></strong>Breaking Boundaries for 25 years - and counting.<br/><br/>The world is rapidly changing, and HUB is here to advise businesses and individuals on how to prepare for the unexpected. With more than 530 HUB offices across North America and ranked 5th among the world’s largest insurance brokers, our focus is dedicated to providing our customers with the peace of mind that what matters most will be protected through unrelenting advocacy and tailored insurance solutions. Our growing team of professionals across North America represents a broad, deep, and one-of-a kind aggregation of entrepreneurs and leaders recognized for their excellence throughout the insurance community.<br/><br/><strong>WE LOVE OUR PEOPLE &amp; OUR PEOPLE LOVE US. <br/><br/></strong>We have the competitive, exciting, and friendly work environment you are seeking. We strategically position our employees for longevity and success by investing in their future and providing continuous opportunities for growth and development<em>.</em> Join us in taking the first step toward creating a future that combines a diverse, challenging work environment with financial security and career satisfaction. We welcome ALL candidates and are proud of our wonderfully diverse employee population.<br/><br/><em><strong>We are proud to be designated “Top Workplaces 2023” for the 4th consecutive year!!<br/><br/></strong></em>“HUB LAOC is a place where I have every opportunity to share my voice and be part of the diverse culture in our organization. I feel very confident as my authentic self and know I have a place at HUB where my ideas and contributions are welcomed, valued, and respected.” <em>Glenn - VP, Constituent Experience<br/><br/></em>“In my short time here at HUB, I have already had the privilege of working with some of the most outstanding coworkers! At HUB, no matter what your job title is every single person from the top down makes you feel like you have a voice and wants you to know that you are playing a crucial role in this company’s future. I love that HUB places so much value on building relationships with those you work with and recognizes the importance of communication and camaraderie in the workplace. I look forward to having many more years of being a part of the HUB family!” <em>Clara – Client Service Associate<br/><br/></em><strong>WE’LL TAKE CARE OF YOU. <br/><br/></strong>We care about our people, and we mean it. We reward our talented professionals with a competitive salary, bonus potential, and a variety of benefits to help you reach your health, retirement, and professional goals. Our suite of benefits includes PPOs, HMO, HSA, FSA, vision coverage, dental coverage, pet insurance, paid time off, a generous 401k plan and more!<br/><br/><strong>The Opportunity<br/><br/></strong>Our service professionals play a vital role in supporting our clients with day-to-day account management, claims management, and underwriting services that ensure they have what they need to protect what matters most. Through a robust network of resources, you will be amongst some of the industry’s top talent to help guide and support our customer’s needs and provide them with innovative insurance solutions.<br/><br/>The Personal Lines Account Executive manages an assigned book of business, develops client relationship, and strives to grow and retain clients. May work alongside the Producer, the Account Executive is responsible for overseeing the management of assigned accounts including interacting with appropriate decision makers, proactive consultation, insurance program design, carrier interface/marketing, coordination of risk control resources, relevant collaboration with colleagues throughout HUB, and negotiation of coverage terms and conditions. The Account Executive may work with other members of the client service team, utilizing available resources and personnel as appropriate, in service-related activities in support of clients.<br/><br/><ul><li> May work alongside and cooperatively with Producers, if assigned on accounts, serve as the HUB’s primary consultant to the client. The Producer has primary responsibility for client relationship management and initiating new sales. The AE has primary responsibility for retaining the account, acting as the de facto technical expert and broker-consultant. (In some instances, when no Producer is assigned, the AE is primarily responsible for client relationship management.)</li><li>Ensure Producers, when assigned, are fully informed about, and prepared for all client meetings and interfaces to be able to manage the client relationship competently and proactively. </li><li>Establish and maintain strong and productive professional relationships with “C-Level” and other decision makers for assigned HUB clients.</li><li>Obtains a detailed knowledge of the client’s business and industry, articulates applicable exposures to loss, insurance coverages, and appropriate/available risk management/control solutions.</li><li>Establish and maintain strong and productive professional relationships with insurance carrier marketing, underwriting, and risk control staff, including a detailed familiarity with each carrier’s products and services in support of assigned clients.</li><li>Directly oversee and coordinate the delivery of all HUB services to assigned clients throughout the policy cycle, including stewardship reports, delivery of risk control services, carrier meetings, claims reviews, preparation of coverage outlines, and marketing of emergent and renewal coverage requests.</li><li>Work cooperatively and professionally with AM colleagues to deliver HUB services as described above, using the interface as an opportunity to teach, train, and mentor AM team members. Provide input and feedback to the Head of P&amp;C as to the performance of AM staff on assigned accounts. (When applicable)</li><li>Ensure that all client service needs are promptly and professionally delivered, either directly by the AE or via HUB colleagues (e.g., AMs, Small Business Unit, Risk Control, etc.). The AE is accountable for the competence, timeliness, and quality of all deliverables to the client.</li><li>Conduct annual review w/clients making coverage and loss control recommendations focused on reducing the client’s total cost of risk.</li><li>Identify opportunities for cross-sell and up-sell of other HUB products and services when appropriate for the client’s needs, initiating same. At all times, be knowledgeable about and document what other insurance products and services the clients are purchasing through other providers and who those providers are.</li><li>Work with the Producer, if assigned, or be primarily responsible for maintaining current receivable status for assigned clients. Proactive efforts to collect receivables more than 30 days past-due should be undertaken, with each unresolved circumstance documented and reported to accounting.</li><li>Designs and delivers effective group presentations using various media, including but not limited to conducting internal training to a sales or renewal presentation at a client’s office.</li><li>Performs other duties and projects as assigned.<br/><br/></li></ul><strong>What You Bring To The Table.<br/><br/></strong><ul><li>You are a change advocate; you go above and beyond, and you are fun to be around!</li><li>High School Diploma / GED; College degree strongly preferred.</li><li>Minimum of 5-7 years of related Personal Lines insurance experience (brokage experience preferred) or equivalent combination of education &amp; experience.</li><li>Currently licensed in good standing in required lines and states.</li><li>You have demonstrated oral and written communication skills with the ability to effectively interact with all levels within the organization.</li><li>You are computer proficient with Microsoft Office Suite, Outlook, and various AMSs (Epic preferred).</li><li>Willing to complete continuing education requirements, as needed.</li><li>Willing to work outside of normal business, as needed.</li><li>The expected salary range for this position is $80,000 to $105,000 and will be impacted by factors such as the successful candidate’s skills, experience and working location, as well as the specific position’s business line, scope and level. HUB International is proud to offer comprehensive benefit and total compensation packages which could include health/dental/vision/life/disability insurance, FSA, HSA and 401(k) accounts, paid-time-off benefits, and eligible bonuses, equity and commissions for some positions.<br/><br/></li></ul><strong>TAKE THE FIRST STEP TOWARD AN AMAZING FUTURE.<br/><br/></strong>We want to meet you! Apply today and start your journey to a better tomorrow.<br/><br/>Department Account Management &amp; Service<br/><br/>Required Experience: 5-7 years of relevant experience<br/><br/>Required Travel: Negligible<br/><br/>Required Education: High school or equivalent<br/><br/>HUB International Limited is an equal opportunity and affirmative action employer that does not discriminate on the basis of race/ethnicity, national origin, religion, age, color, sex, sexual orientation, gender identity, disability or veteran's status, or any other characteristic protected by local, state or federal laws, rules or regulations. The EEO is the Law poster and its supplement is available here at http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm .<br/><br/>EEOAA Policy<br/><br/>E-Verify Program<br/><br/>We endeavor to make this website accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact the US Recruiting Team toll-free at (844) 300-9193 or USRecruiting@hubinternational.com. This contact information is for accommodation requests only; do not use this contact information to inquire about the status of applications.", "responsibilities": "The Personal Lines Account Executive manages an assigned book of business, develops client relationship, and strives to grow and retain clients. May work alongside the Producer, the Account Executive is responsible for overseeing the management of assigned accounts including interacting with appropriate decision makers, proactive consultation, insurance program design, carrier interface/marketing, coordination of risk control resources, relevant collaboration with colleagues throughout HUB, and negotiation of coverage terms and conditions. The Account Executive may work with other members of the client service team, utilizing available resources and personnel as appropriate, in service-related activities in support of clients.<br/><br/><ul><li> May work alongside and cooperatively with Producers, if assigned on accounts, serve as the HUB’s primary consultant to the client. The Producer has primary responsibility for client relationship management and initiating new sales. The AE has primary responsibility for retaining the account, acting as the de facto technical expert and broker-consultant. (In some instances, when no Producer is assigned, the AE is primarily responsible for client relationship management.)</li><li>Ensure Producers, when assigned, are fully informed about, and prepared for all client meetings and interfaces to be able to manage the client relationship competently and proactively. </li><li>Establish and maintain strong and productive professional relationships with “C-Level” and other decision makers for assigned HUB clients.</li><li>Obtains a detailed knowledge of the client’s business and industry, articulates applicable exposures to loss, insurance coverages, and appropriate/available risk management/control solutions.</li><li>Establish and maintain strong and productive professional relationships with insurance carrier marketing, underwriting, and risk control staff, including a detailed familiarity with each carrier’s products and services in support of assigned clients.</li><li>Directly oversee and coordinate the delivery of all HUB services to assigned clients throughout the policy cycle, including stewardship reports, delivery of risk control services, carrier meetings, claims reviews, preparation of coverage outlines, and marketing of emergent and renewal coverage requests.</li><li>Work cooperatively and professionally with AM colleagues to deliver HUB services as described above, using the interface as an opportunity to teach, train, and mentor AM team members. Provide input and feedback to the Head of P&amp;C as to the performance of AM staff on assigned accounts. (When applicable)</li><li>Ensure that all client service needs are promptly and professionally delivered, either directly by the AE or via HUB colleagues (e.g., AMs, Small Business Unit, Risk Control, etc.). The AE is accountable for the competence, timeliness, and quality of all deliverables to the client.</li><li>Conduct annual review w/clients making coverage and loss control recommendations focused on reducing the client’s total cost of risk.</li><li>Identify opportunities for cross-sell and up-sell of other HUB products and services when appropriate for the client’s needs, initiating same. At all times, be knowledgeable about and document what other insurance products and services the clients are purchasing through other providers and who those providers are.</li><li>Work with the Producer, if assigned, or be primarily responsible for maintaining current receivable status for assigned clients. Proactive efforts to collect receivables more than 30 days past-due should be undertaken, with each unresolved circumstance documented and reported to accounting.</li><li>Designs and delivers effective group presentations using various media, including but not limited to conducting internal training to a sales or renewal presentation at a client’s office.</li><li>Performs other duties and projects as assigned.<br/><br/></li></ul>", "qualifications": {"required": "High School Diploma / GED; College degree strongly preferred.<br/>Minimum of 5-7 years of related Personal Lines insurance experience (brokage experience preferred) or equivalent combination of education &amp; experience.<br/>Currently licensed in good standing in required lines and states.<br/>You have demonstrated oral and written communication skills with the ability to effectively interact with all levels within the organization.<br/>You are computer proficient with Microsoft Office Suite, Outlook, and various AMSs (Epic preferred).<br/>Willing to complete continuing education requirements, as needed.<br/>Willing to work outside of normal business, as needed.", "preferred": ""}, "skills": ["Insurance", "Sales", "Client Relationship Management", "Business Development", "Risk Management", "Underwriting", "Claims Management", "Microsoft Office", "Outlook", "AMS", "Epic"], "postedDate": "2 days ago", "benefits": "We reward our talented professionals with a competitive salary, bonus potential, and a variety of benefits to help you reach your health, retirement, and professional goals. Our suite of benefits includes PPOs, HMO, HSA, FSA, vision coverage, dental coverage, pet insurance, paid time off, a generous 401k plan and more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004626616"}