{"jobTitle": "Quality Assurance Manager 503B Outsourcing Facility", "company": {"name": "Xseer Pharmaceuticals", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Quality Assurance", "industry": "Pharmaceutical Manufacturing", "description": "<strong>Job Description<br/><br/></strong><strong>Quality Assurance Manager 503B Outsourcing Facility<br/><br/></strong>The Manager of Quality Assurance plays a vital role in ensuring the highest quality and safety standards of our pharmaceutical products. Your responsibilities will include managing all Quality Assurance aspects of compliance within the Outsourcing Facility.<br/><br/>Your attention to detail and adherence to precise procedures will guarantee that our medications meet the highest standards of safety, efficacy, and quality, providing patients with the best possible care and outcomes.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Manage Quality Assurance activities to ensure that procedures are followed and to oversee various aspects of production so that a quality drug product is produced. </li><li>Responsible for periodic review of records to evaluate the quality standards for each drug product to determine the need for changes in specifications or control procedures. </li><li>Manage final review and approval of all cGMP documentation (SOPs, Instructions, Protocols, Specifications, Forms, Master Batch Records, etc.)</li><li>Responsible for maintaining electronic and paper master batch record process steps and approval. </li><li>Manage disposition of batch documentation for manufacture products. </li><li>Maintains quality records (equipment calibration and maintenance, training, deviation and complaint investigations) </li><li>Ensure communication and manage product release with Operations to ensure availability of product in a timely manner. </li><li>Ensure employee Qualification Programs for 503B activities are maintained and general training is current. </li><li>Manage review and approval of unexpected results or failures, environmental &amp; personnel monitoring results that exceed alert or action limits, and direct resulting improvement activities. </li><li>Provide Review, Impact Assessment, and Approval of Changes according to Xseer Change Management. </li><li>Participate in, and assist with, regulatory inspections as applicable to the 503B Operation and Quality Systems. </li><li>Responsible for maintaining QA records associated with internal and external testing. <br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Minimum four(4) year college degree in Life Science. </li><li>Requires a minimum of 4 years of experience in pharmaceutical Quality Assurance with focus on cGMP compliance. </li><li>Prefer experience and understanding as they apply to Section 503B of the FD&amp;C Act. </li><li>Prefer knowledge of cGMP, FDA, USP and pharmacy state board regulatory guidelines. </li><li>Strong interpersonal/group skills with ability to motivate and direct the Strong communication skills, verbal and written Proficiency with basic computer skills</li></ul>", "postedDate": "3 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004415027"}