{"jobTitle": "Merchandiser Specialist", "company": {"name": "Acosta Group", "location": "Compton, CA"}, "location": "Compton, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "17.27/hr - 17.27/hr", "currency": "USD"}, "jobFunction": "Purchasing", "industry": "Retail", "description": "General Information<br/><br/>Company: PRE-US<br/><br/>Location: COMPTON, California, 90220<br/><br/>Ref #: 25491<br/><br/>Pay Rate: $ 17.27<br/><br/>Experience/skills and/or location may influence position wage rate<br/><br/>Range Minimum: $ 17.27<br/><br/>Range Maximum: $ 17.27<br/><br/>Function: Merchandising<br/><br/>Employment Duration: Part-time<br/><br/>Description And Requirements<br/><br/>As a Premium Merchandiser Specialist, you'll represent hundreds of brands across several retail locations. You will work with a diverse set of products including Magazines, Grocery items, Sunglasses, Candy, Cosmetics, Health &amp; Beauty, and many more! By joining the team, you'll become an integral part of an established and fast-growing company built on family values. Growing sales for Premium clients is the name of the game, and you'll do it by executing a variety of retail merchandising activities.<br/><br/>What's in it for you?<br/><br/><ul><li>You'll merchandise brands you know and love in a variety of categories. </li><li>Flexibility - you make your own schedule. Yes, you read that right. </li><li>Variety in your job tasks. You won't get stuck doing the same thing every day. </li><li>Independence in your day-to-day work with the support of field management and a community of merchandisers nationwide. </li><li>Full training and certification provided by true retail experts. </li><li>Merchandising can be the first step of an exciting career path with Premium or a great way to earn extra cash. </li><li>Health plan options including no-copay telemedicine, regardless of hours worked. <br/><br/></li></ul>What will you do?<br/><br/><ul><li>Locate merchandise in the backroom (stockroom / warehouse) of stores in order to place product on the floor. </li><li>Stock and pack out products to help ensure shoppers find what they need. </li><li>Front face products to make sure product shelves look the best they can. </li><li>Receive marketing and promotional materials at your home and bring them to the store. </li><li>Install and place promotional materials as outlined in instructions to ensure our clients' products stand out. </li><li>Display set up and maintenance for a variety of products throughout the store. </li><li>Resetting displays or product areas based on the needs of the client. This could include the full remodel of a section and / or placing new product and shifting current product to a new home on the shelf. </li><li>Answer simple, step-by step questions within Premium's field technology on your mobile device as you complete your work. </li><li>Take photos of completed work to demonstrate your success. </li><li>Represent Premium and Premium clients in retail stores within your assigned area. <br/><br/></li></ul>How will you succeed?<br/><br/><ul><li>Enjoy working independently in stores most of the time while still building and maintaining relationships with store associates and managers. </li><li>Owning your stores. You will be the face of Premium as you visit stores on behalf of our clients. Over time, you'll be the go-to Premium resource because of the relationships you build. </li><li>Effectively communicating with store associates, store managers and Premium team members. </li><li>Leveraging the support of and sharing best practices with our merchandising team nationwide through closed social media groups and a variety of communication channels. </li><li>Contacting Premium's Operations Support Center for help with challenges in store - they're here to help! </li><li>Completing work within the provided timeframe. </li><li>Closely following detailed instructions to ensure we get it right the first time. </li><li>Reporting your work the same day you complete it. <br/><br/></li></ul>What tools do you need for the job?<br/><br/><ul><li>Access to reliable transportation to get you from multiple retail locations in your area. </li><li>A smartphone with access to data and internet in order to report and upload photos. <br/><br/></li></ul>This job posting covers the general job duties for our merchandising position and does not imply that these are the only tasks required. Premium's Talent Acquisition Team will go over any questions you have regarding the above during the interview process.<br/><br/>So, are you Premium's next Merchandiser Specialist?<br/><br/>#WeArePremium<br/><br/>Equal Opportunity Employer (Disabled, Veteran) | Under applicable requirements, such as the San Francisco FCO and the Los Angeles FCHIO, we consider for employment qualified applicants with arrest and conviction records or criminal histories | E-Verify Employer<br/><br/><ul><li>Premium, in good faith, believes that any posted range of compensation is the accurate range for this role at the time of this posting. Premium may ultimately pay more or less than the posted range depending on candidate qualifications and locations. This range may be modified in the future.<br/><br/></li></ul>PipelineDetail: 8959", "responsibilities": "<ul><li>Locate merchandise in the backroom (stockroom / warehouse) of stores in order to place product on the floor. </li><li>Stock and pack out products to help ensure shoppers find what they need. </li><li>Front face products to make sure product shelves look the best they can. </li><li>Receive marketing and promotional materials at your home and bring them to the store. </li><li>Install and place promotional materials as outlined in instructions to ensure our clients' products stand out. </li><li>Display set up and maintenance for a variety of products throughout the store. </li><li>Resetting displays or product areas based on the needs of the client. This could include the full remodel of a section and / or placing new product and shifting current product to a new home on the shelf. </li><li>Answer simple, step-by step questions within Premium's field technology on your mobile device as you complete your work. </li><li>Take photos of completed work to demonstrate your success. </li><li>Represent Premium and Premium clients in retail stores within your assigned area. <br/><br/></li></ul>", "postedDate": "2 days ago", "skills": ["Merchandising", "Retail", "Sales", "Customer Service", "Communication", "Teamwork", "Independence", "Training", "Certification", "Technology", "Mobile Devices", "Photos", "Transportation", "Smartphone", "Data", "Internet", "Detailed Instructions", "Reporting"], "url": "https://www.linkedin.com/jobs/view/4004998867"}