{"jobTitle": "General Manager", "company": {"name": "Veronica Beard", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00 - $110,000.00", "currency": "USD"}, "jobFunction": "Management, Customer Service, and Sales", "industry": "Retail Apparel and Fashion", "description": "The General Manager is responsible for maximizing sales, providing an exceptional shopping experience for the customer, and managing the store’s visual and operational standards, including the store’s shrink %, wage cost and Clienteling. The General Manager is responsible for staffing, training and developing high performance teams.\n\nResponsibilities:\n\nSALES LEADERSHIP:\n\n* Creates an outstanding sales and Customer Service environment\n* Strives for sales excellence and results\n* Sets and evaluates weekly, monthly and seasonal goals for staff\n* Works with customers and models excellent customer service and Clienteling skills\n* Maximizes sales through strong floor supervision skills\n* Assesses store morale, monitors and praises positive associate performance, and resolves and documents performance issues promptly\n* Develops Sales Associates to be experts in the selling steps and client building through utilizing the Sales Training Programs and the Client Books\n\nSTAFFING AND ASSOCIATE DEVELOPMENT:\n\n* Networks in industry to recruit and hire high quality management and sales-oriented associates\n* Fills all levels of open positions within the store in an urgent and timely manner\n* Ensures adequate staff is available to meet business needs – schedules accordingly\n* Follows company criteria properly hiring, reviewing, coaching and promoting Sales Associates and Assistant Managers\n* Administers company personnel programs including appropriate performance reviews, compensation and employment records\n* Ensure personnel are trained on product knowledge, selling skills and customer service to support the brand experience\n* Documents employee performance in a timely manner\n* Creates enthusiasm and excitement within store to motivate high performance teams\n\nOPERATIONAL EXCELLENCE:\n\n* Protects store payroll by managing wage costs, salaries, and allowable hours\n* Controls company’s assets, i.e. key control, loss prevention measures, inventory paperwork and company standards of conduct\n* Strives for 100% accuracy and compliance in cash, inventory, fixtures and property\n\nSTORE STANDARDS:\n\n* Execute floor-set and promotional directives; implements visual merchandising\n* Supervises the overall cleanliness and organization of the sales floor and backroom\n* Ensures store appearance and atmosphere supports and reinforces the brand image\n* Understands, supports and complies with all company policies and procedures\n\nMERCHANDISING/VISUAL:\n\n* Ensure execution of effective merchandising strategies and directives\n* Ensure the selling floor is neat, clean, organized and reflects the correct visual image at all times\n* Ensure presentation of all displays, fixtures and all visual areas are reflective of current visual direction\n* Identify and communicate product concerns in a timely manner\n* Communicate inventory needs to support the business goals\n\nFASHION/STYLING:\n\n* Represents the fashion and style of Veronica Beard\n* Knowledge of current fashion trends and styles\n* Appreciation and demonstration of an overall finished fashion look\n* Ensure staff is following Veronica Beard fashion guidelines.\n* Comfortable with being on camera for social media purposes (both stills and video)\n* Able to fluidly discuss product and fashion on camera\n\nRequirements:\n\n* Ideal candidate must possess 3-5 years in the luxury business, strong team leadership, excellent customer service, interpersonal and communication skills required, energetic, outgoing, driven individual with an eye for women’s fashion and passion to succeed. Strong visual background, sound organization and operational skills\n* Minimum of 2 years retail Store Management position/experience in women’s apparel (or related field)\n* Ability to work flexible schedule including nights and weekends\n* Strong verbal and communication skills\n* Strong observation skills – identifying and assessing customer and employee behavior, reactions, and floor awareness\n* Ability to retain and utilize data, i.e. names, merchandise, information, policies and procedures\n* Ability to create a quality working environment that will encourage others to develop and excel\n* Foster a work climate that inspires mutual trust, respect, professionalism and teamwork to achieve goals\n\nThe base salary range for this role is between $100,000 and $110,000. The relevant base salary will vary depending on wide range of factors that are considered in making compensation decisions, including but not limited to, skill sets, experience, training, degrees, and certifications. The base salary is just one component of our total compensation offerings, which consist of a comprehensive benefits package as well as a short-term incentive program, clothing allowance, and merchandise discounts.\n\nAt Veronica Beard, we are committed to creating and maintaining a workplace where every single employee can thrive and feel valued. As a company, we firmly believe that there is strength in diversity. We seek to recruit talent from a variety of perspectives and backgrounds and are actively seeking candidates with a dedication to advancing equity, inclusion, and racial and social justice in their work.\n\nVeronica Beard is committed to an environment of mutual respect and is an EEO/Affirmative Action Employer. No employee or applicant is discriminated against because of race, color, sex (including pregnancy), age, national origin, religion, sexual orientation, gender identity, gender expression, parental status, status as a veteran, and basis of disability or any other federal, state or local protected class.", "responsibilities": "The General Manager is responsible for maximizing sales, providing an exceptional shopping experience for the customer, and managing the store’s visual and operational standards, including the store’s shrink %, wage cost and Clienteling. The General Manager is responsible for staffing, training and developing high performance teams.", "qualifications": {"required": "Ideal candidate must possess 3-5 years in the luxury business, strong team leadership, excellent customer service, interpersonal and communication skills required, energetic, outgoing, driven individual with an eye for women’s fashion and passion to succeed. Strong visual background, sound organization and operational skills\n* Minimum of 2 years retail Store Management position/experience in women’s apparel (or related field)\n* Ability to work flexible schedule including nights and weekends\n* Strong verbal and communication skills\n* Strong observation skills – identifying and assessing customer and employee behavior, reactions, and floor awareness\n* Ability to retain and utilize data, i.e. names, merchandise, information, policies and procedures\n* Ability to create a quality working environment that will encourage others to develop and excel\n* Foster a work climate that inspires mutual trust, respect, professionalism and teamwork to achieve goals"}, "skills": [], "postedDate": "2 days ago", "benefits": "The base salary is just one component of our total compensation offerings, which consist of a comprehensive benefits package as well as a short-term incentive program, clothing allowance, and merchandise discounts.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004632268"}