{"jobTitle": "Concert & Artist Administrative Assistant", "company": {"name": "Steinway & Sons", "industry": "Musicians", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Administrative", "industry": "Musicians", "description": "Position Summary: The Concert & Artist (C&A) Western Region Administrative Assistant is a member of the Los Angeles-based Steinway team, reports directly to the C&A Sr. Manager, and plays an important role in the day-to-day operations of the C&A markets in LA, San Diego, San Francisco, Portland, Seattle, Scottsdale, Miami, Denver, and Chicago. This list may expand over time to include additional American cities. Main Responsibilities: - Coordinate and confirm event logistics with production staff, and to confirm bookings with movers and tuners on new and recurring C&A orders, with direction from the Sr. Manager C&A. - Process C&A customer payments (receiving/depositing checks, credit card payments, wire transactions) and post approved rental sales invoices in the company ERP system. - Follow-up on all delinquent customer accounts to help maintain a clean A/R report. - Organize and submit approved vendor invoices to accounting and to communicate with vendors regarding payment status updates. - Compile up-to-date maintenance records on each of the 45+ pianos in the western region C&A inventory pool, including logging work performed as well as technician’s recommendations for required maintenance and preparing requisitions of replacement supplies, parts, materials, etc. - Maintain an up-to-date photo gallery of all C&A pianos from our Western markets—with special focus on our pianos that are featured in major performance halls, on live TV, film, or in music videos—to be shared on Steinway’s local and global social media channels. - Be “on-call” through a rotating schedule to respond to “piano emergencies” when Sr. Manager, Chief Concert Technician, Department Coordinator, and other team members are unavailable. - Assist the overall needs of the Steinway west coast operations which may include working on a limited basis to help staff special retail and institutional events. - Keep up to date and informed of performances by Steinway Artists & important non-Steinway artists in each market, and to keep an up-to-date calendar that can be shared with retail managers and sales reps. - Ability to split working environments between in-office and remote locations. (Must reside within reasonable commuting distance to the Steinway Concert & Artist Office in the Arts District of Downtown Los Angeles)", "responsibilities": "Coordinate and confirm event logistics, process customer payments, follow-up on delinquent accounts, organize vendor invoices, maintain piano maintenance records, manage photo gallery of pianos, respond to emergencies, assist with operations, keep performance calendar updated.", "qualifications": {"required": "Bachelor’s degree required, prior experience in a professional business setting, organized and detail-oriented, strong communication skills, ability to meet deadlines, background in music preferred.", "preferred": "Not specified"}, "skills": [], "postedDate": "5 days ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4004836640"}