{"jobTitle": "Business Analyst", "company": {"name": "Unibail-Rodamco-Westfield", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Finance", "industry": "Real Estate", "description": "<strong>What we offer</strong><p> </p><p>The Airport’s Business Analyst assists the Asset Leads with value creation at their designated assets. The Business Analyst supports the value creation process and works with the asset team (consisting of members from other divisions/departments) to complete the 5-Year Business Plan (5YBP) and fulfill the current year plan for the assets. The Business Analyst will act as an apprentice to the Airport Asset and Business Development leads. The Business Analyst is business oriented with strong focus on numbers and problem solving in a complex environment.</p><p> </p><p> <strong>In this role, your main responsibilities are: </strong></p><p> </p><p><strong><em>Asset value growth</em></strong></p><ul><li>Support establishment and delivery of 5-year business plan and growth plan by leading and aligning contributions of all internal departments</li><li>Suggest and model priorities from an NRI/cash flow perspective</li><li>Support, follow up and challenge all operating expenses and capital expenditures, offering up cost saving measures while allowing for a high-quality customer experience</li></ul><p><br/></p><p> <strong><em>Project delivery</em></strong></p><ul><li>Assist the Asset Lead by leading assigned projects/analysis in support of leasing, management, marketing, development, and finance in order to deliver the 5YBP, while influencing asset team members to succeed in achieving the portfolio’s target</li><li>Prepares project documents for internal approval</li><li>Produces business models to analyze project’s vitality</li><li>Manages deadlines, reporting and review processes for the asset team members</li><li>Is a reference for the portfolio internally</li></ul><p><br/></p><p> <strong><em>Other</em></strong></p><ul><li>Carry out and deliver the 5YBP project, together with the Asset Lead</li><li>Participate in negotiations with tenants and offers advice when the deal has a substantial investment or other complicated elements</li><li>Understanding of designated airport agreements with specific focus on the contractual commercial terms</li><li>Prepare assumptions and cash flow for semi-annual valuations</li><li>Closely monitor and focus on vital KPIs such as like-for-like NRI, IRR, Sales per Enplanement, Sales per SF, effective rental yields, etc.</li><li>Prepare internal &amp; external presentations as necessary</li><li>Participate in improving processes/tools/”ways of working”, driving efficiency across the business</li><li>Propose innovative ideas for value creation in the Asset</li></ul><p><br/></p><p> <strong>What we are looking for</strong></p><p><strong> </strong></p><p><strong> You...</strong></p><ul><li>Hold a BA/BS Business Finance, Economics, Real Estate or other related field.</li><li>Project management</li><li>Ability to plan project tasks and activities</li><li>Ability to coordinate all activities, organize necessary contributions and leverage other departments to complete tasks</li><li>Ability to anticipate and prioritize problems</li><li>Ability to solve complex problems, involving large numbers of actors (internal/external)</li><li>Ability to communicate well with others</li></ul><p><br/></p><p> <strong><em>Business/financial</em></strong></p><ul><li>2+ years preferred, with experience in financial analysis required</li><li>Advanced financial skills (business model preparation, calculation of return on investment, return on capital employed)</li><li>Business modeling skills for developments, acquisitions, new investments</li><li>Ability to define, model, compute, and document assumptions: operations and leasing, acquisition costs, capex/asset redevelopment, tax.</li><li>Ability to prepare and present a synthetic Business Model/Investment proposal</li><li>Ability to assess associated risks and apply investment criteria with judgment and prepare a recommendation</li><li>Understanding of impact of any operational decision on asset profit and loss account</li><li>Basic accounting knowledge. Full knowledge of Group glossary and accounting</li></ul><p><br/></p><p> <strong><em>Advanced analytical skills</em></strong></p><ul><li>Ability to analyze, model, and compute complex problems/projects</li><li>Ability to create new project models ad hoc to fit the situation</li><li>Willingness to enter in the details and ability to synthesize analysis and facilitate decision making</li><li>Advanced Excel (e.g. use of financial functions, database and search functions, pivot tables)</li><li>Presentation skills using Powerpoint</li></ul><p><br/></p><p> <strong><em>Commercial understanding</em></strong></p><ul><li>Knowledge and strong interest in retail industry (knowledge of key retailers, interest in brands/products)</li><li>Understanding of the airport commercial model</li></ul><p><br/></p><p> <strong><em>Basic knowledge in real estate investment</em></strong></p><ul><li>Asset valuation (cap rates, discounted cash flows, comparables, replacement costs)</li><li>Legal knowledge in leasing/commercial/real estate law</li></ul><p><br/></p><p><strong><em>Compensation</em></strong></p><ul><li>Exempt</li><li>$70,000 – $82,000 + Discretionary Annual Bonus</li></ul><p><br/></p><p><strong>What is important to us </strong></p><p>Unibail-Rodamco-Westfield (URW) is driven by an entrepreneurial foundation of talented and ambitious employees who embrace change, strive for innovation, and know when to venture into uncharted terrain. Teams within URW are collaborative and thrive by working together to seize opportunity and solve challenges. Employees receive mentorship and guidance while being empowered to drive their initiatives, embracing their individuality and unique backgrounds. URW‘s flagship destinations are interwoven into the community fabric, and we give employees the power to be impactful in their work and lead meaningful change in our communities through volunteering, DE&amp;I programming and leading ESG efforts. URW is an innovator and trend setter in experiential entertainment and is making bold moves to be a brand that creates inspiring consumer experiences in-person and digitally. Breaking beyond conventional beliefs, URW is surprising and delighting customers by reinventing being together and creating memorable moments.</p><p><br/></p><p>Our company purpose – to Reinvent Being Together – is about reimagining how individuals and communities come together, socialize, and enjoy dynamic experiences alongside one another in entirely new ways. We are at our best when we are TOGETHER safely and joyfully.</p><p>Unibail-Rodamco-Westfield is an equal opportunity employer that embraces diversity of backgrounds, perspectives, experience, and skills. </p><p><br/></p><p>We believe that diversity plays an important part in the success of our business, and we are committed to creating an environment which respects, values, celebrates and makes the most of people’s differences.</p><p><br/></p><p>We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, and other legally protected characteristics.</p><p>Join us in Creating Sustainable Places That Reinvent Being Together.</p>", "responsibilities": "The Airport’s Business Analyst assists the Asset Leads with value creation at their designated assets. The Business Analyst supports the value creation process and works with the asset team (consisting of members from other divisions/departments) to complete the 5-Year Business Plan (5YBP) and fulfill the current year plan for the assets. The Business Analyst will act as an apprentice to the Airport Asset and Business Development leads. The Business Analyst is business oriented with strong focus on numbers and problem solving in a complex environment.", "qualifications": {"required": "Hold a BA/BS Business Finance, Economics, Real Estate or other related field.", "preferred": "2+ years preferred, with experience in financial analysis required"}, "skills": ["Project management", "Financial analysis", "Business modeling", "Advanced Excel", "Powerpoint", "Retail industry", "Airport commercial model", "Real estate investment", "Asset valuation", "Leasing/commercial/real estate law"], "postedDate": "1 day ago", "salary": {"amount": "$70,000 – $82,000", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004368112"}