{"jobTitle": "Material Handler - Part Time (Warehouse like)", "company": {"name": "Federal Express Corporation", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "20.05 - 27.74", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Freight and Package Transportation", "description": "Provides safe and efficient operation of equipment used for the movement of packages/documents/heavyweight, dangerous goods and ULDs. Assists in the buildup/breakdown of pallets containing heavyweight freight. Serves as liaison between company and ULD repair vendor, as required. Performs other duties as assigned.<br/><br/><strong>Minimum Education<br/><br/></strong>None<br/><br/><strong>Minimum Experience<br/><br/></strong>None<br/><br/><strong>Knowledge, Skills And Abilities<br/><br/></strong>Able to lift 50 lbs. without assistance from the ground to chest level and to maneuver packages of any weight above 50 lbs. using appropriate equipment and/or assistance from another person. Able to walk and stand for designated work hours. Able to bend and squat for designated work hours. Able to maneuver packages above shoulder level. Ability to maneuver packages in enclosed spaces and stack packages above one’s head if required at location. Able to work in all weather conditions if required at work location. Able to climb stairs and ladders if required at work location. Able to successfully complete all basic and re-currency training. The ability to communicate both timely and effectively, in a noisy operations environment, is required.<br/><br/><strong>Job Conditions<br/><br/></strong>Non-covered safety sensitive position. Medical exam required. Ability to work in a constant state of alertness and in a safe manner. Since operating motorized conveyances is required in this job, employee must possess a valid driver's license.<br/><br/><strong>Pay Transparency<br/><br/></strong>This compensation range is provided as a reasonable estimate of the current starting salary range for this role across all potential locations. If this opportunity includes multiple job levels, the salary information represents the job level minimum and the job level maximum. Actual starting pay would be determined by experience relative to the job, market level, pay at the location for this job and other job-related factors permitted by law. An employee may be eligible for additional pay, premiums, or bonus potential. The Company offers eligible employees health, vision and dental insurance, retirement, and tuition reimbursement.<br/><br/><strong>Pay Range:</strong> ﻿This is for our Weekend Shift Only Split Shift - Pay Range: $20.05 - 27.74 LAX Part Time Weekend Shift Material handler position Saturday 4:30pm - 10:00pm &amp; Sunday 2:30am to 7:30am &amp; Sunday 4:00pm to 11:00pm Driver License Required﻿<br/><br/><strong>Additional Posting Information: </strong>﻿This is for our Weekend Shift Only Split Shift LAX Part Time Weekend Shift Material handler position Saturday 4:30pm - 10:00pm &amp; Sunday 2:30am to 7:30am &amp; Sunday 4:00pm to 11:00pm $20.05 - $27.74 Driver License Required.﻿<br/><br/><strong>EEO Statement<br/><br/></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. Reasonable accommodations are available for qualified individuals with disabilities throughout the application process. Applicants who require reasonable accommodations in the application or hiring process should contact recruitmentsupport@fedex.com.<br/><br/><strong>Applicants Have Rights Under Federal Employment Laws<br/><br/></strong><ul><li>Equal Employment Opportunity is the Law</li><li>EEO is the Law Supplement</li><li>Pay Transparency Policy</li><li>Family and Medical Leave Act (FMLA)</li><li>Employee Polygraph Protection Act<br/><br/></li></ul>E-Verify Program Participant: Federal Express Corporation participates in the Department of Homeland Security U.S. Citizenship and Immigration Services' E-Verify program (For U.S. applicants and employees only). Please click below to learn more about the E-Verify program:<br/><br/><ul><li>E-Verify Notice (bilingual)</li><li>Right to Work Notice (English) / (Spanish)</li></ul>", "postedDate": "1 day ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004395988"}