{"jobTitle": "Marketing Project Manager", "company": {"name": "Berkadia", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "70,000—$90,000", "currency": "USD"}, "jobFunction": "Art/Creative and Design", "industry": "Leasing Non-residential Real Estate and Financial Services", "description": "Are you looking for an opportunity to work on a highly collaborative team where partnership drives performance?<br/><br/>Berkadia’s investment sales platform offers the highest-quality deal marketing resources, technology that marries local expertise with capital markets knowledge, and seamless integration with our mortgage banking and servicing platforms to ensure your success. Advance your career in a culture committed to personal and professional growth.<strong> Be Backed by the Best. Be Berkadia.<br/><br/></strong>Berkadia’s Irvine office has an immediate need for a full-time Marketing Project Manager. Our Marketing Project Managers for our Market and Research Center (MaRC) are instrumental in providing excellent support for our advisors as they conduct their daily business activities. The Marketing Project Manager coordinates activities for our Investment Advisors including proposals, listings and the marketing of those listings, escrow closings and all related processes. This position offers candidates a great opportunity to work in and learn about all facets of the multifamily brokerage business. The ideal candidate should have excellent written and verbal communication skills and be able to craft compelling arguments in support of real estate investment opportunities.<br/><br/>The ideal candidate represents a unique cross-section of the marketplace in that they are focused on the<strong> real estate </strong>industry AND are looking for a role in a <strong>marketing </strong>function. Successful candidates will have a strong interest in understanding real estate fundamentals and analytics, the ability to craft an investment thesis for a real estate opportunity, write and present compelling arguments, and creatively leverage media to illustrate and communicate the value of real estate.<br/><br/><strong>We Innovate to shape the future of CRE, so in this role you will:<br/><br/></strong><ul><li>Conceive, develop and produce persuasive copy for offering memorandums, pitch presentations, and other marketing materials for multifamily real estate opportunities</li><li>Assist with the preparation of marketing materials using various graphic design software programs (i.e. Adobe InDesign)</li><li>Research and analyze data on real estate market fundamentals to develop a compelling investment narrative and provide insights that support the investment thesis</li><li>Conduct rental market surveys</li><li>Coordinate the launch of all listings for assigned advisors and provide support as needed through close of escrow</li><li>Coordinate and streamline the flow of projects, information and documents, creating a collaborative environment with the advisor and accountability between all parties involved</li><li>Coordinate gathering of information from advisors and other support staff for creation of marketing materials, presentation packages, and other document</li><li>Other duties as assigned.<br/><br/></li></ul><strong>We Stand for Excellence, so to achieve success in this role you should have:<br/><br/></strong><ul><li>Outstanding time management skills, ability to organize, and attention to detail</li><li>Ability to organize and prioritize multiple simultaneous projects with changing priorities</li><li>Excellent writing skills</li><li>Experience in commercial real estate preferred</li><li>Experience with Microsoft products (including Excel, Word and PowerPoint)</li><li>Experience with Adobe products (including InDesign and Photoshop) preferred</li><li>Strong analytical and critical thinking skills</li><li>Ability to work both independently and collaboratively in a team environment</li><li>Bachelor's degree or equivalent</li><li>One to three years prior experience in a similar position<br/><br/></li></ul><strong>We believe People Matter, so we offer benefits that go beyond:<br/><br/></strong><ul><li>Monthly paid volunteer hours and donation matching to benefit our communities </li><li>Employee Resource Groups that help you grow with us</li><li>Fertility and family planning services </li><li>Up to 12-weeks of fully paid parental leave </li><li>Mental health care, including free counseling sessions: </li><li>We'll help you fund your learning journey with generous tuition reimbursement </li><li>Pet insurance discounts </li><li>And more! <br/><br/></li></ul><strong>Be the Next Big Thing. Be Berkadia.<br/><br/></strong>The provided base salary information for this position is part of an overall national range. The actual salary within our range for this position will be determined by several factors, including but not limited to the scope, complexity and location of the role, the skills, education, training, credentials, and experience of the candidate. The total compensation package for this role may also include additional incentive opportunities.<br/><br/><strong>Compensation<br/><br/></strong>$70,000—$90,000 USD<br/><br/>Berkadia, as an equal opportunity employer, celebrates our employees’ unique differences, which we believe drives personal and company-wide innovation and creates a people-first culture where your career can take the long view. To achieve these goals, we are committed to the full inclusion of all qualified individuals, without regard to race, religion, age, color, national origin, gender, sexual orientation, gender identity or expression, marital status, domestic partner status, military and veteran status, disability, pregnancy, parental status, genetic information, political affiliation, or any other status protected by federal, state and local laws.<br/><br/>In keeping with our commitment, Berkadia takes the necessary steps to provide a workplace free from harassment and discrimination, as well as access and reasonable accommodations for individuals with disabilities. If you require reasonable accommodation to take part in the interview process, please contact talentacquisition@berkadia.com.<br/><br/>You have rights under Federal and State employment laws. No question in this Application is intended to elicit information in violation of any such law, nor will any information obtained in response to any question be used in violation of any such law. If you apply for this role, you are acknowledging Berkadia's Application Policy and Berkadia's Privacy Policy. Please click the following links for more information about: EEOC, Employee Rights under the FMLA, EPPA.<br/><br/>", "responsibilities": "Conceive, develop and produce persuasive copy for offering memorandums, pitch presentations, and other marketing materials for multifamily real estate opportunities\nAssist with the preparation of marketing materials using various graphic design software programs (i.e. Adobe InDesign)\nResearch and analyze data on real estate market fundamentals to develop a compelling investment narrative and provide insights that support the investment thesis\nConduct rental market surveys\nCoordinate the launch of all listings for assigned advisors and provide support as needed through close of escrow\nCoordinate and streamline the flow of projects, information and documents, creating a collaborative environment with the advisor and accountability between all parties involved\nCoordinate gathering of information from advisors and other support staff for creation of marketing materials, presentation packages, and other document\nOther duties as assigned.", "qualifications": {"required": "Outstanding time management skills, ability to organize, and attention to detail\nAbility to organize and prioritize multiple simultaneous projects with changing priorities\nExcellent writing skills\nExperience in commercial real estate preferred\nExperience with Microsoft products (including Excel, Word and PowerPoint)\nExperience with Adobe products (including InDesign and Photoshop) preferred\nStrong analytical and critical thinking skills\nAbility to work both independently and collaboratively in a team environment\nBachelor's degree or equivalent\nOne to three years prior experience in a similar position", "preferred": ""}, "skills": ["Adobe InDesign", "Microsoft Excel", "Microsoft Word", "Microsoft PowerPoint", "Adobe Photoshop"], "postedDate": "2 days ago", "benefits": "Monthly paid volunteer hours and donation matching to benefit our communities \nEmployee Resource Groups that help you grow with us\nFertility and family planning services \nUp to 12-weeks of fully paid parental leave \nMental health care, including free counseling sessions: \nWe'll help you fund your learning journey with generous tuition reimbursement \nPet insurance discounts \nAnd more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004995672"}