{"jobTitle": "Employee Benefits Account Manager", "company": {"name": "RemoteWorker CA", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "75,000 - 80,000", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/>We have an opening for an Employee Benefits Account Manager with an established insurance brokerage based in Los Angeles. The Benefits Account Manager will join a team of professionals servicing large group accounts. You will be key in supporting and managing an expanding client base, collaborating closely with the senior client managers and producers to ensure top-tier service delivery.<br/><br/><strong>Location:</strong> Remote (Must be based in California)<br/><br/><strong>Salary:</strong> $75,000 - $80,000<br/><br/><strong>Benefits: </strong>Excellent benefits package<br/><br/><strong>Why Join Us?<br/><br/></strong><ul><li>Client and Desk Focus: Focus primarily on account management tasks with minimal direct client interaction.</li><li>Professional Growth: Enhance your skills in a structured environment with significant exposure to senior leadership.</li><li>Advancement Potential: With our ongoing growth, numerous opportunities exist to broaden your professional skills and advance your career.<br/><br/></li></ul><strong><strong>Key Responsibilities:<br/><br/></strong></strong><ul><li>Account Management: Oversee daily operations, ensuring all client needs are addressed with excellence.</li><li>Presentations and Reporting: Develop and deliver comprehensive presentations and reports for both internal and client stakeholders.</li><li>Client and Employee Relations: Ensure smooth interactions and resolve inquiries and issues promptly.</li><li>Benefits Administration: Utilize Employee Navigator effectively for all aspects of benefits administration.</li><li>Policy and Claims Oversight: Manage policy renewals and claims with a focus on maintaining client satisfaction and retention.<br/><br/></li></ul><strong><strong>What We Offer:<br/><br/></strong></strong><ul><li>Competitive Salary: $75,000, reflecting experience and industry standards.</li><li>Comprehensive Benefits: Includes extensive PTO, multiple health plan options, dental and vision coverage, and a robust 401(k) plan.</li><li>Remote Work Flexibility: Enjoy the full convenience of working from anywhere in California.</li><li>Supportive Culture: We value mental health, fitness, and personal growth, fostering a supportive work environment.<br/><br/></li></ul><strong><strong>Qualifications:<br/><br/></strong></strong><ul><li>Experience: Minimum of 2 years in account management within the insurance sector.</li><li>Licenses: A current life and health license is required.</li><li>Technical Skills: Proficiency in Employee Navigator, strong Microsoft Office skills, and excellent communication abilities.<br/><br/></li></ul><strong>Company Description<br/><br/></strong>About Us<br/><br/>Insurance Search Specialists is dedicated to helping talented insurance professionals find the right opportunities with national, regional, and local insurance brokerages.<br/><br/>With over 25 years of experience in the industry, we are committed to connecting insurance professionals with the right brokerages. We focus on presenting smart career opportunities to our candidates, and we only introduce the best talent to our clients.<br/><br/>We specialize in Commercial Lines Insurance, Personal Lines/Private Client, and Employee Benefits, and our mission is to ensure that our clients and candidates find the perfect match for their needs.<br/><br/>Contact us today to learn how we can help you take the next step in your career.<br/><br/><strong>Company Description<br/><br/></strong>About Us Insurance Search Specialists is dedicated to helping talented insurance professionals find the right opportunities with national, regional, and local insurance brokerages. With over 25 years of experience in the industry, we are committed to connecting insurance professionals with the right brokerages. We focus on presenting smart career opportunities to our candidates, and we only introduce the best talent to our clients. We specialize in Commercial Lines Insurance, Personal Lines/Private Client, and Employee Benefits, and our mission is to ensure that our clients and candidates find the perfect match for their needs. Contact us today to learn how we can help you take the next step in your career.", "responsibilities": "Account Management: Oversee daily operations, ensuring all client needs are addressed with excellence.\nPresentations and Reporting: Develop and deliver comprehensive presentations and reports for both internal and client stakeholders.\nClient and Employee Relations: Ensure smooth interactions and resolve inquiries and issues promptly.\nBenefits Administration: Utilize Employee Navigator effectively for all aspects of benefits administration.\nPolicy and Claims Oversight: Manage policy renewals and claims with a focus on maintaining client satisfaction and retention.", "qualifications": {"required": "Experience: Minimum of 2 years in account management within the insurance sector.\nLicenses: A current life and health license is required.\nTechnical Skills: Proficiency in Employee Navigator, strong Microsoft Office skills, and excellent communication abilities.", "preferred": ""}, "skills": ["Employee Navigator", "Microsoft Office", "Communication"], "postedDate": "2 days ago", "benefits": "Excellent benefits package", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4004356874"}