{"jobTitle": "Stock Associate, Full Time, Camarillo Outlets- Pottery Barn Outlet", "company": {"name": "Pottery Barn", "industry": "Retail", "size": "Large", "location": "Camarillo, CA"}, "location": "Camarillo, CA", "jobType": "Full Time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$16.00/hr - $17.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "About the Role\nReceive shipments & accurately maintain inventory records. Maintain stockroom & off-site locations. Assist sales team in replenishing sales floor after shipment or during recovery periods.\n\nYou’re Excited About This Opportunity Because You Will...\nExemplify the highest level of customer service standards to internal and external customers\nScan shipment as delivered\nTicket and stock merchandise in the stock room or prepare for immediate distribution to the sales floor\nProvide feedback to supervisor regarding inventory levels and damages\nOrganize stockroom by department and categories and stock merchandise on appropriate shelves or in offsite locations\nAdjust stocking procedures to ensure aisles and exits are clear\nEnsure that merchandise is safely stored, properly ticketed packaged and logged, and easily located for replenishment\nPack and log merchandise as required for customer deliveries\nTransport merchandise to and from remote stockroom locations and maintain accurate inventory records\nEnsure that the stockroom is clean, swept, with garbage removed and supplies organized\nMay assist on sales floor during peak times and as assigned\nComplete tasks listed on daily agenda or as assigned (i.e., maintenance of store, lighting, cleaning)\nComply with all company policies and procedures\nEnsure all appropriate stockroom procedures are followed to minimize loss to the company\n\nWhy you will love working at Williams-Sonoma, Inc.\nWe’re a successful, fast-growing company with an entrepreneurial vibe\nA technologically and data-driven business\nCompetitive salaries and comprehensive health benefits\nWe’re at the forefront of tech and retail, redefining technology for the next generation\nWe’re passionate about our internal and external clients and live/breathe the client experience\nWe get to be creative daily\nA smart, experienced leadership team that wants to do it right and is open to new ideas\nWe believe in autonomy and reward taking initiative\nWe have fun!", "responsibilities": "Receive shipments & accurately maintain inventory records. Maintain stockroom & off-site locations. Assist sales team in replenishing sales floor after shipment or during recovery periods.", "qualifications": {"required": "High school diploma or equivalent preferred. 1-2 years customer service experience preferred and stockroom (or related work.) experience.", "preferred": "Effective time management skill to execute multiple tasks simultaneously. Ability to be mobile in the stockroom or on sales floor for extended periods of time. Proven ability to operate and read scanning equipment for extended periods. Ability to lift and carry medium-to-large items, weighing up to 100 lbs., utilizing appropriate equipment and safety techniques."}, "skills": ["Customer Service", "Inventory Management", "Stock Management", "Teamwork", "Attention to Detail"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "This role offers a competitive compensation package including pay and benefits. Pay is based on several factors including but not limited to education, work experience, certifications, geographic location etc. The anticipated pay range for this role will be: $16.00-$17.00 per hour. Depending on your position and your location, here are a few highlights of what you might be eligible for: A generous discount on all Williams-Sonoma, Inc. brands, A 401(k) plan and other investment opportunities, A wellness program that supports your physical, financial and emotional health, Paid vacations and holidays (full-time), Health benefits, dental and vision insurance, including same-sex domestic partner benefits (full-time).", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004171715"}