{"jobTitle": "Seasonal Production Assistant", "company": {"name": "National Football League (NFL)", "location": "Inglewood, CA"}, "location": "Inglewood, CA", "jobType": "Temporary", "employmentType": "Temporary", "experienceLevel": "Entry level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Spectator Sports", "description": "<strong>Summary<br/><br/></strong>JOB DESCRIPTION<br/><br/>The Production Assistant supports all aspects of the Creative Content Group, from development through delivery. The position is closely connected to day-to-day assignments within the department, taking direction from Sr. Managers to organize and complete tasks for a variety of segments, shows and platforms around NFL Network/NFL Media Group. This is a demanding and fast-paced role that requires the candidate to be self-motivated, highly organized, flexible and proactive. <br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Works closely with internal production teams and producers on a daily basis. </li><li>Pulls, sources and locates footage within the NFL library. </li><li>Develops pitches and research packets for NFL Media features. </li><li>Regularly uses various internal NFL tools and software to facilitate post-production of content. </li><li>Assists in gear pick-ups and returns. </li><li>Assists with content clearance, acquisition and licensing. </li><li>Takes direction and adheres to established production schedules to meet tight deadlines. </li><li>Works on special projects as needed and assists in all aspects of general Original Content work throughout department. <br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong><ul><li>Prior experience or education within video and content production. </li><li>Working knowledge of video equipment, media-management software and post-production environments. </li><li>General knowledge of football and professional sports industry. </li><li>Exceptional communication skills, proven track record of maintaining consistent communication with team members. </li><li>Thrives in a team environment. <br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Bachelor’s degree in Film, Journalism, Media preferred </li><li>Experience with Adobe Premiere <br/><br/></li></ul><strong>Other Key Attributes / Characteristics<br/><br/></strong><ul><li>Passion for storytelling and closely follows content trends inside and outside of sports. </li><li>Demonstrated ability to manage multiple projects and to work effectively under deadlines. </li><li>Attention to detail, strong organizational and problem-solving skills. </li><li>Consistently maintain a positive, solution-oriented attitude. <br/><br/></li></ul><strong>Travel<br/><br/></strong><ul><li>No travel outside of the Los Angeles, CA area <br/><br/></li></ul><strong>Terms / Expected Hours of Work<br/><br/></strong><ul><li>Seasonal – ability to work 40+ hours per week for 7 months. </li><li>Position requires a flexible schedule, with potential weekend, after hours and holiday support. <br/><br/></li></ul><strong>Salary / Pay Range<br/><br/></strong>This job posting contains a pay range, which represents the range of salaries or hourly rates that the NFL believes, in good faith, at the time of this posting that it might be willing to pay for the posted job in the location(s) specified. The NFL expects to hire for this position near the middle of the range. Only in truly rare and exceptional circumstances, where an external candidate has experience, credentials or expertise that far exceed those required or expected for the position, would the NFL consider paying a salary or rate near the higher end of the range.<br/><br/>Salary<br/><br/>$24.97—$24.97 USD<br/><br/><em>The NFL maintains a Flexible Workplace Policy that provides members of our workforce with opportunities to periodically work from a location of their choice while maintaining a priority on in-person work at an NFL office, which enables us to more effectively collaborate, connect, and build a workplace culture that will drive our continued success. <br/><br/></em><em>The NFL is committed to building a diverse, equitable, and inclusive work environment that reflects our incredibly diverse fan base. We provide an environment of mutual respect where equal employment opportunities are available to all employees and applicants without regard to status as protected by applicable federal, state, or local law.</em>", "responsibilities": "Works closely with internal production teams and producers on a daily basis. \nPulls, sources and locates footage within the NFL library. \nDevelops pitches and research packets for NFL Media features. \nRegularly uses various internal NFL tools and software to facilitate post-production of content. \nAssists in gear pick-ups and returns. \nAssists with content clearance, acquisition and licensing. \nTakes direction and adheres to established production schedules to meet tight deadlines. \nWorks on special projects as needed and assists in all aspects of general Original Content work throughout department.", "qualifications": {"required": "Prior experience or education within video and content production. \nWorking knowledge of video equipment, media-management software and post-production environments. \nGeneral knowledge of football and professional sports industry. \nExceptional communication skills, proven track record of maintaining consistent communication with team members. \nThrives in a team environment.", "preferred": "Bachelor’s degree in Film, Journalism, Media preferred \nExperience with Adobe Premiere"}, "skills": ["Video Production", "Content Production", "Media Management", "Post Production", "Football", "Sports", "Communication", "Teamwork"], "postedDate": "1 day ago", "salary": {"amount": "24.97—24.97", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004986868"}