{"jobTitle": "Retail Merchandiser (Hiring Immediately)", "company": {"name": "The Retail Odyssey Company", "location": "Orange, CA"}, "location": "Orange, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Manufacturing", "description": "Are you looking for an opportunity to work in the dynamic world of retail merchandising? Retail Odyssey is currently seeking Retail Reset Merchandisers to join our team. As a Retail Odyssey Merchandiser, you will play a crucial role in enhancing the shopping experience for customers within the nationwide Kroger family of brands. You will utilize your basic merchandising skills to reset shelves, tag products, build eye-catching displays, ensure product facing, and rotate stock efficiently. Your keen eye for detail will be essential in maintaining the visual appeal of the grocery stores, ensuring products are well-presented, and displays are aesthetically pleasing.<br/><br/><strong>What You Get<br/><br/></strong><ul><li>Competitive wage; $16.00 per hour </li><li>Early morning weekday hours, allowing you to maintain a healthy work-life balance with no weekend commitments</li><li>Additional hours may be available upon request</li><li>Paid training, equipping you with the necessary skills and knowledge to excel in your role</li><li>Paid mileage and travel reimbursement when applicable </li><li>We offer benefits that can be customized to meet your family's needs, including medical, dental, vision, life insurance, supplemental voluntary plans, wellness programs, and online discounts <br/><br/></li></ul><strong>Now, About You<br/><br/></strong><ul><li>You're 18 years or older</li><li>Have reliable transportation and a valid driver's license </li><li>You enjoy physical work of moving, bending, standing, squatting and can lift up to 50 lbs. </li><li>Are open to visiting multiple stores in a week</li><li>Have excellent communication skills to effectively interact with team members, store staff, and customers<br/><br/></li></ul>Click video link here to see our team in action.<br/><br/>If you are passionate about retail, have a great eye for detail, and enjoy creating visually appealing displays, we invite you to apply to this opportunity. Join us at Retail Odyssey and be a part of a dedicated team committed to delivering exceptional merchandising services to our clients' customers.<br/><br/>Click Apply Now to start your rewarding journey with Retail Odyssey!", "postedDate": "2 days ago", "benefits": "Competitive wage; $16.00 per hour, Early morning weekday hours, allowing you to maintain a healthy work-life balance with no weekend commitments, Additional hours may be available upon request, Paid training, equipping you with the necessary skills and knowledge to excel in your role, Paid mileage and travel reimbursement when applicable, We offer benefits that can be customized to meet your family's needs, including medical, dental, vision, life insurance, supplemental voluntary plans, wellness programs, and online discounts", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004391372"}