{"jobTitle": "Merchandise Coordinator", "company": {"name": "Aquent", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "28.00-31.00/hr", "currency": "USD"}, "jobFunction": "Project Management", "industry": ["Entertainment Providers", "Staffing and Recruiting"], "description": "<strong>Job Title: </strong> Jr-Mid Level Merchandise Coordinator\n\n<strong>Client Location: </strong> Glendale CA *Hybrid 4 days onsite, Friday remote!*\n\n<strong>Starting: </strong> 08/26/2024\n\n<br/>\n\n<strong>Salary/Pay Rate: </strong> $28.00-$31.00/hr MAX\n\n<strong>Firm, non-negotiable: </strong> Yes\n\n<strong>Hours: </strong> Full-time\n\n<strong>Duration: </strong> 6 months (potential to extend)\n\n<br/>\n\n<strong>Job Description</strong>\n\nOur global entertainment client is seeking a<strong> Jr-Mid Level Merchandise Coordinator</strong> for a 6 month assignment - <strong>*hybrid in Glendale - Mon thru Thurs onsite*, Friday remote.</strong>\n\n<br/>\n\nAs the Merchandise Coordinator, you will be responsible for providing operational support for our clients Consumer Products and Interactive Media department, item set-up, purchase order creation and maintenance and delivery tracking of all orders. Manage incoming samples, including archiving and storage. Create assortment line sheets for both licensed and vertical product.\n\n<br/>\n\nThe dept this role supports brings stories and characters to life through innovative and engaging physical products and digital experiences across more than 100 categories, from toys and t-shirts, to apps, books and console games. This segment is home to world class teams of app and game developers, licensing and retail experts, a leading retail business, artists and storytellers, and technologists who inspire imaginations around the world.\n\n<br/>\n\n<strong>Day-to-day Responsibilities:</strong>\n\n• Provide operational support for the department (placement grids, management and execution of the assortment and vendor base).\n\n• Responsible for maintaining the assigned department's range plan including item setup, updates and stage sets.\n\n• Purchase order creation, maintenance and delivery tracking of all orders in the company database system.\n\n• Responsible for daily promotional price change entries and departmental promotion activity.\n\n• Licensed vendor setup, PRRs, gather testing reports & general vendor communication.\n\n• Maintain product flow documents to reflect stage set changes and process launch date changes.\n\n• Manage incoming samples, archiving and storage.\n\n• Create assortment line sheets.\n\n• Obtain images and copy points needed for website.\n\n• Coordinate and provide rework direction to Distribution Center for non-compliant or assorted sku orders (NCI).\n\n• Coordinate with the DC and inventory control to RTV (Return to Vendor) product as needed.\n\n• Troubleshoot to ensure assortment is buyable and published (guest services, production, site merch, copy, photo).\n\n• Maintain and update inventory chase log-weekly.\n\n• Track inventory levels on dropship skus to ensure merchandise is in stock with licensee\n\n<br/>\n\n<strong>Qualifications:</strong>\n\n• Client is ideally seeking 3 years years exp in a similar Coordinator role\n\n• Strong computer skills (Excel, Power Point, Word, Keynote)\n\n• Self-starter, motivated, proactive, dependable, flexible, detail oriented\n\n• Confident, but able to ask for assistance when uncertain\n\n• Display ability to multi-task, managing a variety of initiatives / issues simultaneously\n\n• Ability to project manage and capable of meeting deadlines and dealing with time constraints\n\n• Excellent organizational skills and analytical skills\n\n• Excellent interpersonal, solid written and verbal communication and presentation skills\n\n• Ability to build relationships, be flexible/adaptable, able to collaborate, influence and persuade\n\n• Resourceful, innovative and responsive to change\n\nThe target hiring compensation range for this role is $28.00-$31.00 an hour. Compensation is based on several factors including, but not limited to education, relevant work experience, relevant certifications, and location.\n\n<br/>\n\n<strong>Client Description</strong>\n\nThis legendary company has entertained, informed and inspired people around the globe for over 90 years. Named one of Forbes top companies to work for year over year, this is where dreams really do come true.\n\n<br/>\n\nWhether you’re looking to create, support business growth and development, work behind-the-scenes on your favorite TV shows or upcoming movies, or anything in-between, this is your opportunity to start the next chapter of your career story and help create the exhilarating experiences this company is known for worldwide.\n\n<br/>\n\nWhy work with AQUENT? Check out our awesome benefits: https://aquent.com/talent/talent-benefits\n\n<br/>\n\nAquent is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics.\n\n<strong>About Aquent:</strong>\n\nYou will want to read this fine print. Part of our mission is to take care of you, so we offer the best benefits. Unlike other staffing companies, we provide talent with the same benefits that our CEO gets. This includes:\n\n<ul>\n<li>A choice of three major medical plans (including vision coverage) plus dental insurance</li>\n<li>Paid sick leave for all hourly talent in the U.S. and Canada</li>\n<li>401(k) with a match and immediate vesting</li>\n<li>Exclusive employee discounts through Promo Code: Aquent</li>\n<li>Access to hundreds of professional development courses through Aquent Gymnasium</li>\n<li>And much more</li>\n</ul>\n\nAquent is an equal opportunity employer and is committed to equal opportunity for all employees and applicants. The Company recruits, hires, trains, promotes, compensates, and administers all personnel actions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other protected status of an individual or that individual’s associates or relatives.", "responsibilities": "• Provide operational support for the department (placement grids, management and execution of the assortment and vendor base).\n\n• Responsible for maintaining the assigned department's range plan including item setup, updates and stage sets.\n\n• Purchase order creation, maintenance and delivery tracking of all orders in the company database system.\n\n• Responsible for daily promotional price change entries and departmental promotion activity.\n\n• Licensed vendor setup, PRRs, gather testing reports & general vendor communication.\n\n• Maintain product flow documents to reflect stage set changes and process launch date changes.\n\n• Manage incoming samples, archiving and storage.\n\n• Create assortment line sheets.\n\n• Obtain images and copy points needed for website.\n\n• Coordinate and provide rework direction to Distribution Center for non-compliant or assorted sku orders (NCI).\n\n• Coordinate with the DC and inventory control to RTV (Return to Vendor) product as needed.\n\n• Troubleshoot to ensure assortment is buyable and published (guest services, production, site merch, copy, photo).\n\n• Maintain and update inventory chase log-weekly.\n\n• Track inventory levels on dropship skus to ensure merchandise is in stock with licensee", "qualifications": {"required": "• Client is ideally seeking 3 years years exp in a similar Coordinator role\n\n• Strong computer skills (Excel, Power Point, Word, Keynote)\n\n• Self-starter, motivated, proactive, dependable, flexible, detail oriented\n\n• Confident, but able to ask for assistance when uncertain\n\n• Display ability to multi-task, managing a variety of initiatives / issues simultaneously\n\n• Ability to project manage and capable of meeting deadlines and dealing with time constraints\n\n• Excellent organizational skills and analytical skills\n\n• Excellent interpersonal, solid written and verbal communication and presentation skills\n\n• Ability to build relationships, be flexible/adaptable, able to collaborate, influence and persuade\n\n• Resourceful, innovative and responsive to change"}, "skills": ["Excel", "PowerPoint", "Word", "Keynote"], "postedDate": "22 hours ago", "benefits": "A choice of three major medical plans (including vision coverage) plus dental insurance\n\nPaid sick leave for all hourly talent in the U.S. and Canada\n\n401(k) with a match and immediate vesting\n\nExclusive employee discounts through Promo Code: Aquent\n\nAccess to hundreds of professional development courses through Aquent Gymnasium\n\nAnd much more", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4004384974"}