{"jobTitle": "Security Shift Supervisor - Unarmed", "company": {"name": "Allied Universal", "industry": "Professional Services", "size": "Large", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$21.00 per hour", "currency": "USD"}, "jobFunction": "Other, Information Technology, and Management", "industry": "Professional Services", "description": "Allied Universal®, North America’s leading security and facility services company, provides rewarding careers that give you a sense of purpose. While working in a dynamic, diverse and inclusive workplace, you will be part of a team that fuels a culture that will reflect in our communities and customers we serve. We offer medical, dental and vision coverage, life insurance, retirement plan, employee assistance programs, company discounts, perks and more for most full-time positions!", "responsibilities": "The Shift Security Supervisor will supervise and coordinate the delivery of quality services on a specific shift at an assigned customer. The Security Shift Supervisor will act as a liaison between site supervisor, Account Manager/Field Operations Manager and professional security officers. Supervise staff on assigned shift, providing coaching, recognition and discipline within approved empowerment range.", "qualifications": {"required": "At least 18 years of age, Possess a high school diploma or equivalent, or 5 years verifiable experience, Must possess effective written and oral communication and interpersonal skills, Must be able to frequently prepare written reports and logs in neat, legible handwriting, Must be able to read and understand all operating procedures and instructions, Licensing requirements are subject to state and/or local laws and regulations and may be required prior to employment, Driving Positions: must possess a valid Driver’s License with at least one year of driving experience, a clean driving record, and the ability to safely operate a vehicle required.", "preferred": "Intermediate computer skills to utilize innovative, wireless technology at client specific sites, Ability to handle both common and crisis situations at the client site, calmly and efficiently, Display exceptional customer service and communication skills."}, "skills": ["Effective communication", "Interpersonal skills", "Report writing", "Crisis management", "Customer service"], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "Medical, dental and vision coverage, life insurance, retirement plan, employee assistance programs, company discounts, perks and more for most full-time positions!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004472685"}