{"jobTitle": "Onboarding Intern", "company": {"name": "SimplePractice", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Internship", "employmentType": "Internship", "experienceLevel": "Internship", "jobFunction": "Education and Training", "industry": "Software Development", "description": "About Us\n\nAt SimplePractice, our team is dedicated to improving the health and wellness industry by building a suite of innovative solutions for practitioners and their clients. Our product supports practitioners on their clinical journey to becoming licensed, helps them manage their business and practice once they’re up and running, and enables new clients to discover and interact with practitioners. Taking a practitioner-first approach in everything we do makes it possible for health and wellness practitioners to devote more time to their clients while they use SimplePractice to start, grow, and maintain a successful private practice.\n\nThe Role\n\nWe’re seeking an Onboarding Intern for a 6-month internship to join our People Strategy & Programs team within the People & Culture department. This internship offers the opportunity to play a key role in ensuring a seamless onboarding experience for both full-time employees and contractors. The intern will assist with managing the pre-onboarding process, support communication across departments, and help ensure that all new hires have the resources they need to succeed from day one.\n\nThis is a paid internship that requires a commitment of 20-30 hours per week. General work schedule: Monday - Friday, 8-2pm PT, with flexibility around peak onboarding periods.\n\nResponsibilities \n\nOnboarding Administration:\n\n* Assist in managing and updating our company-wide onboarding checklists and scavenger hunts.\n* Support the creation and distribution of new hire welcome emails and follow-ups, including the onboarding itinerary and schedules.\n* Ensure the timely completion and tracking of new hire forms and documents.\n* Track and coordinate onboarding activities for extended teams, including independent contractors and external agencies.\n* Send out onboarding and experience surveys, analyze feedback, and report on outcomes to relevant teams.\n* Maintain and update internal spreadsheets related to finance and HR data.\n\nCommunication & Support:\n\n* Schedule and facilitate onboarding-related meetings and sessions for new hires.\n* Participate in the bi-weekly new hire experience syncs with internal stakeholders.\n* Act as the primary point of contact for new hires during the onboarding process.\n\nTraining & Compliance:\n\n* Assist in managing the assignment of required compliance trainings for new hires.\n* Follow up on incomplete training assignments and ensure timely completion.\n* Miscellaneous:\n* Track and process offboarding activities for departing employees and contractors.\n\nDesired Skills & Experience\n\n* Strong organizational and communication skills.\n* Ability to multitask and manage time effectively.\n* Proficiency with office software and communication tools (e.g., Google Workspace, Slack, Asana).\n* A keen interest in HR, onboarding, employee experience, or people operations.\n\nHourly Compensation Range\n\n$20 - $30 hourly\n\nThe above represents the expected hourly compensation range for this job requisition. Ultimately, in determining your pay, we’ll consider many factors including, but not limited to, skills, experience, qualifications, geographic location, and other job-related factors.\n\nCalifornia Job Applicant Privacy Notice\n\nThank you for your interest in opportunities at SimplePractice LLC (“SimplePractice” or “us” or “we” or “our”). Please note that when you submit your resume or application materials to us for employment purposes, you are subject to the SimplePractice California Job Applicant Privacy Notice.\n\nFor more information about our privacy practices, please contact us at privacy@simplepractice.com.", "responsibilities": "Onboarding Administration:\n\n* Assist in managing and updating our company-wide onboarding checklists and scavenger hunts.\n* Support the creation and distribution of new hire welcome emails and follow-ups, including the onboarding itinerary and schedules.\n* Ensure the timely completion and tracking of new hire forms and documents.\n* Track and coordinate onboarding activities for extended teams, including independent contractors and external agencies.\n* Send out onboarding and experience surveys, analyze feedback, and report on outcomes to relevant teams.\n* Maintain and update internal spreadsheets related to finance and HR data.\n\nCommunication & Support:\n\n* Schedule and facilitate onboarding-related meetings and sessions for new hires.\n* Participate in the bi-weekly new hire experience syncs with internal stakeholders.\n* Act as the primary point of contact for new hires during the onboarding process.\n\nTraining & Compliance:\n\n* Assist in managing the assignment of required compliance trainings for new hires.\n* Follow up on incomplete training assignments and ensure timely completion.\n* Miscellaneous:\n* Track and process offboarding activities for departing employees and contractors.", "qualifications": {"required": "Strong organizational and communication skills.\nAbility to multitask and manage time effectively.\nProficiency with office software and communication tools (e.g., Google Workspace, Slack, Asana).\nA keen interest in HR, onboarding, employee experience, or people operations.", "preferred": ""}, "skills": ["Google Workspace", "Slack", "Asana"], "postedDate": "23 hours ago", "salary": {"amount": "20 - 30", "currency": "USD"}, "benefits": "This is a paid internship that requires a commitment of 20-30 hours per week. General work schedule: Monday - Friday, 8-2pm PT, with flexibility around peak onboarding periods.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004725772"}