{"jobTitle": "ALEXANDER MCQUEEN Store Manager, Saks Beverly Hills", "company": {"name": "Alexander McQueen", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$110,000.00 - $120,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail Luxury Goods and Jewelry", "description": "Alexander McQueen is a British luxury fashion house founded by Lee Alexander McQueen in 1992. In 2001, the house joined the Kering Group and, since December 2023, is under the creative direction of Seán McGirr. <br/><br/>Alexander McQueen is distinctive for an expression of individuality, subversive strength and raw power. With a design studio and atelier based in London, the house is known for uncompromising quality and creative vision.<br/><br/><strong>Job Description<br/><br/></strong>At Alexander McQueen, we live and breathe a culture defined by our <strong>key Behaviors:<br/><br/></strong><ul><li><strong>Empowerment – </strong>We empower our team and peers, providing unwavering support to ensure everyone can thrive; this means giving support to your team and those you are working with to succeed. </li><li><strong>Teamwork – </strong>We put an emphasis on Teamwork; this means working together as a collective to achieve shared goals.</li><li><strong>Respect – </strong>We value respect, treating everyone with dignity and showing genuine appreciation for their efforts: this means treating everyone equally. </li><li><strong>Kindness – </strong>We believe kindness is integral to everything we do; this means demonstrating compassion and empathy towards others.  <br/><br/></li></ul><strong>How will you contribute?<br/><br/></strong>The Alexander McQueen Store Manager will lead and support all activities to achieve store business objectives, ensuring an unparalleled client experience. This role is responsible for setting up and implementing the strategy and vision for the store, providing recommendations and improvement plans based on store results.<br/><br/>The ideal candidate must perform with a high level of integrity and take full ownership of the store operations, loss prevention compliance, human resources management, as well as visual merchandising presentation. The Store Manager leads by example and guarantees excellence in Client experience through local market knowledge and promoting the values and ambitions of the brand within the marketplace. They will drive excellence in all Client touchpoints through empowering and developing the store team.<br/><br/>Leading the business <br/><br/><ul><li>Drive team to exceed Financial targets and maximize sales performances, contributing to the success of the entire store</li><li>Propose and develop action plans, through careful analysis of store performance.</li><li>Communicate with the team the company set KPI’s and identify strategies to ensure performance standards are met.</li><li>Represent the Company within the local market, identify opportunities to increase foot flow, attract new Clients, and build loyal relationships with the brand.</li><li>Be present on the sales floor, ensuring highest standard of approach and service to Clients.</li><li>Foster the omni channel awareness among the team, as well as encourage and support the team in using digital tools to improve the relationship with clients. </li><li>Meet store operating budgets by monitoring store expenses</li><li>Provide effective product feedback based on store needs, and participate in the buying session when requested</li><li>Proactively follow current competitors and fashion trends, industry news and new innovations in technology.</li><li>Train and communicate current collection knowledge to all associates to ensure the team is fully educated on brand pillars and season strategy; partner with the appropriate internal departments for support<br/><br/></li></ul>Client Development<br/><br/><ul><li>Place the client above all. Lead by example to create a welcoming environment and to ensure the Team strives to meet the Client’s every need and request</li><li>Foster a client centric mindset developing and maintaining solid Client relationships and enforce meaningful after sales experiences to increase customer loyalty</li><li>Manage the achievement of business objectives, by utilizing a top client strategy to retain and develop high potential clients</li><li>Promote brand awareness, establish market/store presence, and capture competitive market share through community outreach and company sponsored events</li><li>Capture meaningful customer data for the purpose of building relationships to personalize future client development opportunities. Monitor monthly CRM database reporting. </li><li>Foster a strong private appointment culture among the team</li><li>Collaborate with the Retail Head Office for the organization of local events defining a challenging and realistic target per Client<br/><br/></li></ul>Performance and Team development <br/><br/><ul><li>Oversee annual review process for all store employees and set annual employee goals  </li><li>Cascade relevant information from the business in an efficient way to ensure team alignment</li><li>Conduct monthly coaching sessions with team members to review performance and provide constructive, timely feedback </li><li>Attract, recruit, and retain a high performing team and build a talent pipeline through networking and competitive shopping. </li></ul><ul><li>Ensure a consistent and branded onboarding experience for all new hires</li></ul><ul><li>Manage the allocation of staff resources and scheduling to effectively drive sales and ensure customer service</li><li>Partner with Retail Manager and Human Resource Manager for all employee relations issues to ensure effective resolution. </li><li>Act as a strong staff motivator, promoting team spirit through effective communication, and cultivating a positive and energetic environment. </li><li>Be a role model of House Code of Behaviors and ensure team abides by them</li><li>Master fully all company tools and applications including IT and digital, and ensure team is constantly informed of relevant updates</li><li>Understand the needs and priorities, train and inspire the Store team on product knowledge, sales techniques, Client Services, and Company policies and procedures  </li><li>Identify talents within your team to propose for internal development opportunities, sharing the proposal with the Retail Manager and Human Resource Manager to define the correct development processes</li><li>Ensure strong cooperation between front and back of house to guarantee efficient operations<br/><br/></li></ul>  <br/><br/>Store Operations <br/><br/><ul><li>Adhere to and enforce all company policies and procedures</li><li>Monitor store expenses and maintain store operating budget while aiming to reduce overall cost. Ensure timely submission of accounts payable invoices and cash disbursement polices</li><li>Comply with all Loss Prevention quarterly self-audits, monthly cycle counts, incident reporting and monthly inventory reconciliations to ensure annual inventory shrinkage is below company target </li></ul><ul><li>Oversee the processing of daily incoming and outbound merchandise requests and shipments</li><li>Provide accurate monthly schedules by analyzing peak hours to ensure adequate floor coverage and timely submission of payroll records for all employees</li><li>Support and maintain visual merchandising standards set by headquarters</li><li>Maintain full organization of company assets per the back of house and front of house guidelines provided by headquarters</li><li>Maintain the borrow log and consignment program ensuring that it is current and adheres with company policy and procedures. <br/><br/></li></ul><strong>Required Skills:<br/><br/></strong><ul><li>You will be able to demonstrate the desired Alexander McQueen behaviors </li><li>Significant sales management experience in retail, luxury retail, or service-related industry</li><li>Proven ability to drive store performance</li><li>Commercial<br/> awareness and strong business acumen, including key retail performance indicators</li><li>Coaching and development skills</li><li>Strong analytical skills</li><li>Entrepreneurial spirit </li><li>Strong budget management experience </li><li>Strong verbal and written communication skills and excellent organizational skills. </li><li>Being confident in public speaking and engaging with external stakeholder </li><li>Ability to manage competing priorities in a fast-paced environment. Open to change and new way of working</li><li>Able to manage pressure and maintain a positive working environment </li><li>Proficiency with Microsoft Office software including Word, Excel, PowerPoint, Outlook</li><li>Flexibility to work a retail schedule which will include evenings, weekends and holidays. </li><li>Ability to effectively create, manage and adhere to deadlines</li><li>Ability to be mobile for extended periods of time </li><li>Passion for the Fashion Industry</li><li>Ability to climb a ladder and lift packages weighing 10 lbs. on a regular basis<br/><br/></li></ul><strong>Salary Range:</strong> $110,000 - $120,000<br/><br/><em>Kering is committed to building a diverse workforce. We believe diversity in all its forms – gender, age, nationality, culture, religious beliefs and sexual orientation – enriches the workplace. It opens up opportunities for people to express their talent, both individually and collectively and it helps foster our ability to adapt to a changing world. As an Equal Opportunity Employer, we welcome and consider applications from all qualified candidates, regardless of their background.<br/><br/></em><strong>Job Type<br/><br/></strong>Regular<br/><br/><strong>Start Date<br/><br/></strong>2024-09-16<br/><br/><strong>Schedule<br/><br/></strong>Full time<br/><br/><strong>Organization<br/><br/></strong>Alexander McQ Trading", "postedDate": "3 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004851139"}