{"jobTitle": "AR Construction Manager", "company": {"name": "H. J. Russell & Company", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Accounting/Auditing and Finance", "industry": "Construction", "description": "At H. J. Russell & Company, we believe that exceptional outcomes start with the right people. We also believe that work should be challenging, and the challenge should be fun. Exceptional outcomes are more likely to occur with a respectful, satisfying, and empowering company. We value and respect our employees - their experience, expertise, energy, passion, and diversity - and their innovative approach to work and life.<br/><br/>Summary<br/><br/>The Construction Manager  reports to the Asset Renewal Sr. Project Manager and acts as the primary liaison and airport/owner representative responsible for the Asset Renewal project for pre- construction and construction activities. The Asset Renewal Program replaces end-of-life airport assets, primarily MEP, vertical transportation systems, building enclosure and passenger boarding bridges. The characteristic of the candidate is someone who has extensive knowledge in MEP system construction and commissioning (i.e. has worked for a MEP subcontractor). The individual shall be experienced in working in an operating environment and be able to coordinate critical outages with minimal impact on the operation of the airport. Transparent communication with many stakeholders is a key ingredient to an effective construction manager.<br/><br/>WHY THIS JOB IS IMPORTANT?<br/><br/>The Asset Renewal Construction Manager  shall provide direction and management for the assigned project and ensure on-schedule completion within or below budget in accordance with contractual obligations. The Asset Renewal Construction Manager  will be focused on planning and defining program goals and devising methods to accomplish them, developing in-depth knowledge of owner objectives, contract terms, and airport policies. The Asset Renewal Construction Manager  is responsible for planning, directing, supervising and controlling the execution of all technical, fiscal, and administrative aspects of the project.<br/><br/>ESSENTIAL DUTIES AND RESPONSIBILITIES  include the following. Other duties may be assigned.<br/><br/><ul><li>Working with team members and airport management to develop budgets, schedules, and plans for the various elements of a project.</li><li>Provide review and initial approval of the tenant acquisition submittal packages prior to official submittal to determine accuracy and completeness and compliance to LAWA CDD requirements. Monitor the development of the acquisition process to ensure adequate review time in accordance with the component acquisition submittal schedule as approved by BOAC action.</li><li>Provide an initial draft of NTP letters and support documents including supplemental conditions as may be necessary for clarification of project conditions and all other supporting documentation as requested by Program Executive.</li><li>Facilitate coordinating the execution of design related Request for Building Modifications.</li><li>Lead the review and approval of exemption requests as may be required to amend design documents. Accept, reject, or mitigate these requests as may be appropriate.</li><li>Facilitate execution of vertical transportation design modification requests as required for agency approvals.</li><li>Facilitate the draft of acceptance letter as required by the lease, on behalf of the Program Executive.</li><li>Hold preconstruction meeting to facilitate the proper start of the project.</li><li>Coordinate with Airport departments to facilitate goals and objectives for administrative, technical, engineering through closeout functions.</li><li>Managing project scope to meet or exceed project goals and objectives.</li><li>Maintaining documentation on the approved scope of work for the project to include all related agreements, authorizations, reports, drawings and specifications. This documentation shall include narratives for all scopes of work as well as a coordinated CAD representation including all projects for key disciplines.</li><li>Coordination with the Design Manager who will be managing the design process during design and construction including resolution of technical design issues, issuing design non-compliances, issuing field non-conformances, timely processing of RFI’s, coordinating shop drawing reviews, participation in and approval of factory and site acceptance tests, coordinating material approvals, coordinating mock up approvals, providing reports, drawings and specification interpretation, participation in testing and commissioning activities, managing the punch list process and other activities as required to ensure the design process supports the project goals.</li><li>Coordination with the Design Manager who will be managing the Design Review Team (DRT) design review process for assigned project(s) through all phases of design including significant design changes during construction.</li><li>Monitoring of permitting information and the permitting process required of the design team and contractor.</li><li>Becoming thoroughly familiar with required contractual obligations and technical aspects of all facilities to be erected.</li><li>Enforce program requirements explicit to the Design and Construction Handbook in effect at the time of the tenant lease and contract. Track pending revisions and liaise with stakeholders to enact Exemption Requests serving potential benefit, accordingly. Enforce supplemental Design Guidelines as may come into effect or are in effect from time to time.</li><li>Liaise with stakeholders while enforcing IT Design Guidelines as this document and subsequent IT requirements may change from the date of the program inception and the date of the Design Construction Handbook. This challenge is further increased by the fact that some information technologies and special systems technology procurement packages tend to be performance based or design build systems with a dynamic set of performance criteria as well as security criteria that are not defined. It is incumbent upon the project manager to strike a balance with the tenant and airport stakeholders to successfully facilitate closure to design, execution and commissioning of these systems.</li><li>Thoroughly understand the agreements and amendments between the design professionals and/or contractors and LAWA in terms of legal and performance requirements including acquisition delivery schedules, component delivery dates, pending notices including NTP or any BOAC action requiring the support of the project manager.</li><li>Anticipate and identify and resolve any program conflicts related to design, construction, operations, commissioning, safety and security. Actively liaise with Airport Operations, Facilities Maintenance &amp; Utilities, CDD, Planning, IMT, Shutdown Control Center (SCC), Airport Police Division (APD), and Inspection.</li><li>Facilitate ASR and USR meetings with Airport Operations to review short- and long-term detailed execution plans with contractors ahead of SCC application.</li><li>Create submittal register to establish the document to be reviewed by the LAWA Subject Matter Experts as a part of the submittal review process.</li><li>Create the RFI review process to establish processing flow and documentation.</li><li>Manage process flow of the submittal and RFI process.</li><li>Maintain and monitor project and program schedule files. Distribute updated schedule files and provide notifications as may be required for integrated elements including initiating of mitigating actions as may be required.</li><li>Ensuring all work is being performed with and inspected to the latest versions of plans and specifications including approved changes, submittals, and RFI’s.</li><li>Working with designer, contractor and stakeholders to develop the overall planning of construction activities and identifying critical milestones and priorities.</li><li>Keeping alert to possible problem areas and taking preventative action to ensure critical milestones are met for each phase of the project.</li><li>Ensuring the use of safe and sound construction practices.</li><li>Preparing reports summarizing progress of construction activities for senior management.</li><li>Reviewing change proposals for contractual compliance and alignment with fair market value.</li><li>Preparing a monthly risk report.</li><li>Monitoring adherence to the quality assurance/quality control plan, and other documents as required and promoting excellence on the project through the application of quality assurance processes.</li><li>Enforcing the program requirements for all areas of the project and monitoring the draft and final deliverables for adherence to these criteria.</li><li>Reviewing pay applications to ensure proper verification of completed work and compliance with contract requirements.</li><li>Working with the key project individual to devise and execute action plans to rectify potential cost overruns or delays, or to accommodate significant changes to the scope of work.</li><li>Assuring that current and timely change orders are documented and administered properly.</li><li>Participating in all necessary coordination meetings with the designer, contractor, and stakeholders.</li><li>Managing the closeout process to ensure all documentation is completed as quickly as possible to efficiently close the project without incurring unnecessary costs.</li><li>Hold preconstruction meeting to facilitate the proper start of the project.</li><li>Performs work in a safe manner and actively encourages others to do the same.<br/><br/></li></ul>Qualifications<br/><br/>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/>EDUCATION and/or EXPERIENCE: Minimum Qualifications:<br/><br/><ul><li>Bachelor’s degree in Architecture, Aviation, Business, Engineering, Construction Management, Planning or other related technical field required .</li><li>Master's degree preferred.</li><li>Relevant professional licensure and/or certification are strongly preferred. Certifications may include AAAE, LEED, PE, PMP, AICP, etc.<br/><br/></li></ul>Required Qualifications<br/><br/>\n<ul><li>15 years or more experience, preferably on airport</li><li>Experience with projects more than $50 million in</li><li>Experience with various delivery methods, including Design-Bid-Build, Design+CMAR and Design/Build.</li><li>Proven ability to perform in a project management</li><li>Excellent written and oral communication skills and a thorough knowledge of industry practices and</li><li>Must have a self-starter attitude with proactive, results-oriented focus; and willing and capable to assume additional responsibilities.</li><li>Must be able to interface with a variety of people with different technical levels and educational</li><li>Must be detail oriented and highly<br/><br/></li></ul>HARDWARE/SOFTWARE KNOWLEDGE <br/><br/>\n<ul><li>Proficient in Microsoft Office Suite and</li><li>Familiarity with Project Management Information</li><li>Ability to work in CAD or REVIT a<br/><br/></li></ul>Additional Qualifications<br/><br/>\n<ul><li>May assume other duties as required/needed.</li><li>Maybe required to work past regular work</li><li>Maybe required to work various shifts as<br/><br/></li></ul>PHYSICAL DEMANDS &amp; WORK ENVIRONMENT<br/><br/>The physical demands and work environment described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><ul><li>While performing the duties of this job, the employee is regularly required to use hands to finger, handle, or feel objects, tools, or controls and talk or hear. The employee frequently is required to stand, walk, sit, and reach with hands and arms. The employee is occasionally required to climb or balance; and stoop, kneel, crouch, or crawl. The employee must occasionally lift and/or move up to 25 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus.</li><li>While performing the duties of this job, the employee frequently works near moving mechanical parts and in outside weather conditions and is frequently exposed to extreme cold. The employee occasionally works in high, precarious places and is occasionally exposed to wet and/or humid conditions, fumes or airborne particles, extreme heat, and the risk of electrical shock. The noise level in the work environment is usually moderate or loud. <br/><br/></li></ul>WHY WORK FOR US?<br/><br/>Simply stated, we put people first. As part of our Mission Statement, we strive to earn the loyalty of our employees through a demonstrated commitment to their development and through rewarding exemplary performance. We take the time to get to know our employees personally, and together develop individualized plans for career advancement and fulfillment with H.J. Russell. Our goal is to provide career growth and development which allows employees to envision and desire a long-term career with our company.<br/><br/>Our culture is rooted in the Russell Fundamentals, a series of 25 characteristics that guide the behavior of our employees and include key tenants like Do the right thing, always; Embrace diversity; Show meaningful appreciation; Deliver results; and Keep things fun. Our intentional focus on creating an outstanding workplace experience has earned our firm numerous recognitions, including being named one of USA Today’s Top Workplaces in 2024 and earning awards for Cultural Excellence in the areas of Leadership, Innovation, Compensation and Benefits, and Purpose and Values. In a recent survey, 90% of our employees said that H.J. Russell motivates them to give their very best at work and 85% report feeling respected and supported in their roles.<br/><br/>In addition to our exceptional culture, we offer the following suite of benefits:<br/><br/><ul><li>Medical, Prescription, Dental, and Vision Insurance</li><li>Company-Sponsored Life &amp; AD&amp;D</li><li>Flexible Spending &amp; Health Savings Accounts</li><li>401(k) with Employer Matching Contribution</li><li>Disability Insurance</li><li>Supplemental Insurance &amp; Other Voluntary Coverage</li><li>Employee Assistance Program</li></ul>", "responsibilities": "The Construction Manager  reports to the Asset Renewal Sr. Project Manager and acts as the primary liaison and airport/owner representative responsible for the Asset Renewal project for pre- construction and construction activities. The Asset Renewal Program replaces end-of-life airport assets, primarily MEP, vertical transportation systems, building enclosure and passenger boarding bridges. The characteristic of the candidate is someone who has extensive knowledge in MEP system construction and commissioning (i.e. has worked for a MEP subcontractor). The individual shall be experienced in working in an operating environment and be able to coordinate critical outages with minimal impact on the operation of the airport. Transparent communication with many stakeholders is a key ingredient to an effective construction manager.<br/><br/>WHY THIS JOB IS IMPORTANT?<br/><br/>The Asset Renewal Construction Manager  shall provide direction and management for the assigned project and ensure on-schedule completion within or below budget in accordance with contractual obligations. The Asset Renewal Construction Manager  will be focused on planning and defining program goals and devising methods to accomplish them, developing in-depth knowledge of owner objectives, contract terms, and airport policies. The Asset Renewal Construction Manager  is responsible for planning, directing, supervising and controlling the execution of all technical, fiscal, and administrative aspects of the project.<br/><br/>ESSENTIAL DUTIES AND RESPONSIBILITIES  include the following. Other duties may be assigned.<br/><br/><ul><li>Working with team members and airport management to develop budgets, schedules, and plans for the various elements of a project.</li><li>Provide review and initial approval of the tenant acquisition submittal packages prior to official submittal to determine accuracy and completeness and compliance to LAWA CDD requirements. Monitor the development of the acquisition process to ensure adequate review time in accordance with the component acquisition submittal schedule as approved by BOAC action.</li><li>Provide an initial draft of NTP letters and support documents including supplemental conditions as may be necessary for clarification of project conditions and all other supporting documentation as requested by Program Executive.</li><li>Facilitate coordinating the execution of design related Request for Building Modifications.</li><li>Lead the review and approval of exemption requests as may be required to amend design documents. Accept, reject, or mitigate these requests as may be appropriate.</li><li>Facilitate execution of vertical transportation design modification requests as required for agency approvals.</li><li>Facilitate the draft of acceptance letter as required by the lease, on behalf of the Program Executive.</li><li>Hold preconstruction meeting to facilitate the proper start of the project.</li><li>Coordinate with Airport departments to facilitate goals and objectives for administrative, technical, engineering through closeout functions.</li><li>Managing project scope to meet or exceed project goals and objectives.</li><li>Maintaining documentation on the approved scope of work for the project to include all related agreements, authorizations, reports, drawings and specifications. This documentation shall include narratives for all scopes of work as well as a coordinated CAD representation including all projects for key disciplines.</li><li>Coordination with the Design Manager who will be managing the design process during design and construction including resolution of technical design issues, issuing design non-compliances, issuing field non-conformances, timely processing of RFI’s, coordinating shop drawing reviews, participation in and approval of factory and site acceptance tests, coordinating material approvals, coordinating mock up approvals, providing reports, drawings and specification interpretation, participation in testing and commissioning activities, managing the punch list process and other activities as required to ensure the design process supports the project goals.</li><li>Coordination with the Design Manager who will be managing the Design Review Team (DRT) design review process for assigned project(s) through all phases of design including significant design changes during construction.</li><li>Monitoring of permitting information and the permitting process required of the design team and contractor.</li><li>Becoming thoroughly familiar with required contractual obligations and technical aspects of all facilities to be erected.</li><li>Enforce program requirements explicit to the Design and Construction Handbook in effect at the time of the tenant lease and contract. Track pending revisions and liaise with stakeholders to enact Exemption Requests serving potential benefit, accordingly. Enforce supplemental Design Guidelines as may come into effect or are in effect from time to time.</li><li>Liaise with stakeholders while enforcing IT Design Guidelines as this document and subsequent IT requirements may change from the date of the program inception and the date of the Design Construction Handbook. This challenge is further increased by the fact that some information technologies and special systems technology procurement packages tend to be performance based or design build systems with a dynamic set of performance criteria as well as security criteria that are not defined. It is incumbent upon the project manager to strike a balance with the tenant and airport stakeholders to successfully facilitate closure to design, execution and commissioning of these systems.</li><li>Thoroughly understand the agreements and amendments between the design professionals and/or contractors and LAWA in terms of legal and performance requirements including acquisition delivery schedules, component delivery dates, pending notices including NTP or any BOAC action requiring the support of the project manager.</li><li>Anticipate and identify and resolve any program conflicts related to design, construction, operations, commissioning, safety and security. Actively liaise with Airport Operations, Facilities Maintenance &amp; Utilities, CDD, Planning, IMT, Shutdown Control Center (SCC), Airport Police Division (APD), and Inspection.</li><li>Facilitate ASR and USR meetings with Airport Operations to review short- and long-term detailed execution plans with contractors ahead of SCC application.</li><li>Create submittal register to establish the document to be reviewed by the LAWA Subject Matter Experts as a part of the submittal review process.</li><li>Create the RFI review process to establish processing flow and documentation.</li><li>Manage process flow of the submittal and RFI process.</li><li>Maintain and monitor project and program schedule files. Distribute updated schedule files and provide notifications as may be required for integrated elements including initiating of mitigating actions as may be required.</li><li>Ensuring all work is being performed with and inspected to the latest versions of plans and specifications including approved changes, submittals, and RFI’s.</li><li>Working with designer, contractor and stakeholders to develop the overall planning of construction activities and identifying critical milestones and priorities.</li><li>Keeping alert to possible problem areas and taking preventative action to ensure critical milestones are met for each phase of the project.</li><li>Ensuring the use of safe and sound construction practices.</li><li>Preparing reports summarizing progress of construction activities for senior management.</li><li>Reviewing change proposals for contractual compliance and alignment with fair market value.</li><li>Preparing a monthly risk report.</li><li>Monitoring adherence to the quality assurance/quality control plan, and other documents as required and promoting excellence on the project through the application of quality assurance processes.</li><li>Enforcing the program requirements for all areas of the project and monitoring the draft and final deliverables for adherence to these criteria.</li><li>Reviewing pay applications to ensure proper verification of completed work and compliance with contract requirements.</li><li>Working with the key project individual to devise and execute action plans to rectify potential cost overruns or delays, or to accommodate significant changes to the scope of work.</li><li>Assuring that current and timely change orders are documented and administered properly.</li><li>Participating in all necessary coordination meetings with the designer, contractor, and stakeholders.</li><li>Managing the closeout process to ensure all documentation is completed as quickly as possible to efficiently close the project without incurring unnecessary costs.</li><li>Hold preconstruction meeting to facilitate the proper start of the project.</li><li>Performs work in a safe manner and actively encourages others to do the same.<br/><br/></li></ul>", "qualifications": {"required": "15 years or more experience, preferably on airport\nExperience with projects more than $50 million in\nExperience with various delivery methods, including Design-Bid-Build, Design+CMAR and Design/Build.\nProven ability to perform in a project management\nExcellent written and oral communication skills and a thorough knowledge of industry practices and\nMust have a self-starter attitude with proactive, results-oriented focus; and willing and capable to assume additional responsibilities.\nMust be able to interface with a variety of people with different technical levels and educational\nMust be detail oriented and highly", "preferred": "Bachelor’s degree in Architecture, Aviation, Business, Engineering, Construction Management, Planning or other related technical field required .\nMaster's degree preferred.\nRelevant professional licensure and/or certification are strongly preferred. Certifications may include AAAE, LEED, PE, PMP, AICP, etc."}, "skills": ["Microsoft Office Suite", "Project Management Information", "CAD", "REVIT"], "postedDate": "12 hours ago", "benefits": "Medical, Prescription, Dental, and Vision Insurance\nCompany-Sponsored Life &amp; AD&amp;D\nFlexible Spending &amp; Health Savings Accounts\n401(k) with Employer Matching Contribution\nDisability Insurance\nSupplemental Insurance &amp; Other Voluntary Coverage\nEmployee Assistance Program", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004389874"}