{"jobTitle": "Manager, Client Relationship Support- Torrance, CA", "company": {"name": "Charles Schwab", "industry": "Financial Services", "size": "Not specified", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Other", "industry": "Financial Services", "description": "Your opportunity\n\nAt Schwab, you’re empowered to make an impact on your career. Here, innovative thought meets creative problem solving, helping us “challenge the status quo” and transform the finance industry together. As a Client Relationship Manager, (CRM), you play an essential and impactful leadership role that informs the daily operational success of the local branch. You are the first point of contact at the branch and will work cross-functionally with other branch team members and partners across the firm to deliver exceptional experiences for our clients. You will assist the Branch Manager and sales/support staff with meeting our clients’ needs, resolving customer escalations, helping to deepen both internal and external client relationships, and acting as the Branch Manager in their absence. Your responsibilities also will include coordinating and maintaining the branch paperwork and operations flow, as well as implementing, training, and supporting new processes adopted by the firm. This is a role where you can bring your passion for mentorship and developing client service professionals to a firm that will value your contributions and champion your growth.\n\nWhat you have\n\nRequired Qualifications\n\nWhat You Have\n\n- Bachelor's degree or equivalent work-related experience\n- Active and valid FINRA Series 7, 9/10 and 63 licenses\n- 3+ years’ experience with customer service\n- 3-5 years in a security/financial services capacity\n\nPreferred Qualifications\n\n- Notary\n- 2+ years’ experience in a management/supervisory capacity\n- Outstanding written and oral communication skills Previous experience in a direct client-facing role\n- Strong financial acumen, especially regarding brokerage regulations and rules that govern client accounts\n- Demonstrated experience handling client concerns and issues with tact and diplomacy\n- Ability to work independently and effectively as part of a team, while prioritizing multiple tasks and responsibilities simultaneously\n- Ability to build and maintain good cross-enterprise working relationships\n\nWhat’s in it for you\n\nAt Schwab, we’re committed to empowering our employees’ personal and professional success. Our purpose-driven, supportive culture, and focus on your development means you’ll get the tools you need to make a positive difference in the finance industry.\n\nWe offer a competitive benefits package that takes care of the whole you – both today and in the future:\n\n- 401(k) with company match and Employee stock purchase plan\n- Paid time for vacation, volunteering, and 28-day sabbatical after every 5 years of service for eligible positions\n- Paid parental leave and family building benefits\n- Tuition reimbursement\n- Health, dental, and vision insurance", "responsibilities": "Not specified", "qualifications": {"required": "Bachelor's degree or equivalent work-related experience, Active and valid FINRA Series 7, 9/10 and 63 licenses, 3+ years’ experience with customer service, 3-5 years in a security/financial services capacity", "preferred": "Notary, 2+ years’ experience in a management/supervisory capacity, Outstanding written and oral communication skills, Previous experience in a direct client-facing role, Strong financial acumen, especially regarding brokerage regulations and rules that govern client accounts, Demonstrated experience handling client concerns and issues with tact and diplomacy, Ability to work independently and effectively as part of a team, while prioritizing multiple tasks and responsibilities simultaneously, Ability to build and maintain good cross-enterprise working relationships"}, "skills": [], "postedDate": "3 days ago", "applicationDeadline": "Not specified", "benefits": "401(k) with company match and Employee stock purchase plan, Paid time for vacation, volunteering, and 28-day sabbatical after every 5 years of service for eligible positions, Paid parental leave and family building benefits, Tuition reimbursement, Health, dental, and vision insurance", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4004979173"}