{"jobTitle": "Logistics Security Officer Shipping Yard", "company": {"name": "Allied Universal", "location": "Carson, CA"}, "location": "Carson, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other, Information Technology, and Management", "industry": "Professional Services", "description": "Allied Universal®, North America’s leading security and facility services company, provides rewarding careers that give you a sense of purpose. While working in a dynamic, diverse and inclusive workplace, you will be part of a team that fuels a culture that will reflect in our communities and customers we serve. We offer medical, dental and vision coverage, life insurance, retirement plan, employee assistance programs, company discounts, perks and more for most full-time positions!<br/><br/><strong>Job Description<br/><br/></strong><strong>Site:</strong> Shipper's Transport Express<br/><br/><strong>Postion</strong> : Security Officer<br/><br/><strong>Pay Rate:</strong> $18 per hour<br/><br/><strong>Qualifications<br/><br/></strong><ul><li> Valid CA Guard Card</li><li> must have flexible/open availibility including weekend days</li><li> must have reliable transportation to travel site to site</li><li> must be able to walk/stand for long periods of time</li><li> must be adequate with the use of technology while on-duty<br/><br/></li></ul><strong>Job Duties<br/><br/></strong><ul><li> gate access control</li><li> checking trucks &amp; shipping containers in/out</li><li> verifying authorized personnel are onsite at all times</li><li> patrolling interior/exterior of property on foot<br/><br/></li></ul>As a Security Officer, you will serve and safeguard clients in a range of industries such as Commercial Real Estate, Healthcare, Education, Government and more.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Provide customer service to our clients by carrying out safety and security procedures, site-specific policies and when appropriate, emergency response activities </li><li> Respond to incidents and critical situations in a calm, problem solving manner </li><li> Conduct regular and random patrols around the business and perimeter. Working environments and conditions may vary by client site. <br/><br/></li></ul><strong>Minimum Requirements<br/><br/></strong><ul><li> Be at least 18 years of age for unarmed roles; 21+ years of age for armed roles </li><li> Possess a high school diploma or equivalent, or 5 years of verifiable experience </li><li> As a condition of employment, applicants will be subject to a background investigation in accordance with all federal, state, and local laws. Allied Universal will consider qualified applications with criminal histories in a manner consistent with applicable laws. </li><li> As a condition of employment, applicants will be subject to a drug screen to the extent permitted by law. </li><li> Licensing requirements are subject to state and/or local laws and regulations and may be required prior to employment.</li><li>A valid driver’s license will be required for driving positions only <br/><br/></li></ul><strong>Perks And Benefits<br/><br/></strong><ul><li> Health insurance and 401k plans for full-time positions </li><li> Schedules that fit with your personal life goals </li><li> Ongoing paid training programs and career growth opportunities </li><li> Employee discounts through our perks program to your favorite restaurants, entertainment venues and much more… <br/><br/></li></ul><strong> Closing <br/><br/></strong><strong>Allied Universal® is an Equal Opportunity Employer.</strong> All qualified applicants will receive consideration for employment without regard to race/ethnicity, age, color, religion, sex, sexual orientation, gender identity, national origin, genetic information, disability, protected veteran status or relationship/association with a protected veteran, or any other basis or characteristic protected by law. For more information: www.aus.com<br/><br/>If you have any questions regarding Equal Employment Opportunity, Affirmative Action, Diversity and Inclusion, have difficulty using the online system and require an alternate method to apply, or require an accommodation at any time during the recruitment and/or employment process, please contact our local Human Resources department. To find an office near you, please visit: www.aus.com/offices .<br/><br/><strong> Requisition ID <br/><br/></strong>2024-1261606", "responsibilities": "Provide customer service to our clients by carrying out safety and security procedures, site-specific policies and when appropriate, emergency response activities Respond to incidents and critical situations in a calm, problem solving manner Conduct regular and random patrols around the business and perimeter. Working environments and conditions may vary by client site.", "qualifications": {"required": "Be at least 18 years of age for unarmed roles; 21+ years of age for armed roles Possess a high school diploma or equivalent, or 5 years of verifiable experience As a condition of employment, applicants will be subject to a background investigation in accordance with all federal, state, and local laws. Allied Universal will consider qualified applications with criminal histories in a manner consistent with applicable laws. As a condition of employment, applicants will be subject to a drug screen to the extent permitted by law. Licensing requirements are subject to state and/or local laws and regulations and may be required prior to employment.A valid driver’s license will be required for driving positions only ", "preferred": null}, "skills": ["Guard Card", "Customer Service", "Security", "Patrol", "Emergency Response"], "postedDate": "1 day ago", "benefits": "Health insurance and 401k plans for full-time positions Schedules that fit with your personal life goals Ongoing paid training programs and career growth opportunities Employee discounts through our perks program to your favorite restaurants, entertainment venues and much more… ", "remoteWork": null, "salary": {"amount": "18", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4004360186"}