{"jobTitle": "Guest Coordinator", "company": {"name": "Ulta Beauty", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "<strong>GENERAL SUMMARY & SCOPE</strong>\nThe Guest Coordinator is responsible for engaging with guests and promoting the Ulta Beauty services business through one-on-one guest interactions, both over the phone and in-person. They represent the image, products, and culture of Ulta Beauty and support the Experience Manager (EM) and Assistant Services Manager (ASM) through a focus on performance (service/retail sales and in-store events), people (guest service and associate culture), and process (operating procedures and compliance standards). This position requires a passion for the beauty industry, exceptional guest service, and the aptitude to learn and communicate salon services and product knowledge.\n \n<strong>PRINCIPAL DUTIES & RESPONSIBILITIES</strong> (*Essential Functions)\nThe Guest Coordinator is a champion of Ulta Beauty’s mission, vision, and values, and should demonstrate them skillfully and consistently by performing the following duties and responsibilities of the position (as well as all other projects/duties as assigned):\n \n<strong>Performance</strong>\n<ul><li>Contribute to meeting or exceeding the store’s goals related to retail and service sales, guest loyalty (including credit), retail shrink, and omni-channel sales as set by Ulta Beauty.</li><li>Provide exceptional guest service by acknowledging all Ulta Beauty guests in the Salon, Haircare, and Skincare areas of the store and offering friendly, prompt, and courteous service.</li><li>Courteously handle sales, refunds and exchanges.</li><li>Support the services team by answering salon phone calls, addressing and resolving guest concerns, managing the services booking system, guest records and salon traffic flow, and suggesting add-on services when booking appointments and interacting with guests in the store and salon.</li><li>Build the services business by informing guests of current promotions and events and confidently inviting them to try services (inclusive of boutiques and salon) while providing knowledgeable, professional product and service recommendations to guests.</li><li>Influence and support service providers in the execution of their daily appointment pages, rebooking, and new guest acquisition behaviors.</li><li>Book appointments for and support the execution of services and in-store events that deliver an unrivaled guest experience while delivering on sales goals.</li><li>Take the initiative to stay informed regarding new and existing industry trends, products, and services during work time, and be knowledgeable about the ingredients and benefits of these trends, products, and services to better serve guests.</li><li>Maintain prompt, regular attendance.</li></ul>\n \n<strong>People</strong>\n<ul><li>Contribute to an inclusive environment that supports teammates, peers, and the internal and external guests served.</li><li>Create awareness around stylists’ personal goals through communication and collaboration with the entire team to drive success.</li><li>Develop guest relationships through in-person and over-the-phone interactions and provide appropriate retail and service recommendations.</li><li>Identify guests’ needs by observing consultations and ensuring each service guest receives a 360&deg; experience.</li><li>Collaborate with managers, associates, stylists, and skin therapists throughout the store to help grow the business and support a well-rounded guest experience.</li><li>Establish professional peer and brand partner relationships that foster a shared interest in collaboratively delivering exceptional guest service.</li><li>Share the benefits of the guest loyalty program, including credit and the Ulta Beauty app, with guests in the salon and salesfloor.</li><li>Attend mandatory trainings and meetings to enable continuous professional development.<br/> </li></ul>\n<strong>Process</strong>\n<ul><li>Be knowledgeable of and ensure compliance with Ulta Beauty’s policies, procedures, and standards.</li><li>Adhere to Ulta Beauty’s dress code.</li><li>Support the services team with ensuring all safety, sanitation, and infection control procedures are being followed before, during, and after services; always ensure compliance with state board guidelines.</li><li>In partnership with the EM, utilize the Ulta Beauty scheduling tools (e.g., services booking system, payroll management tools, Scheduling Opportunities Worksheet, and peak 25 hours) to recommend schedule adjustments that will maximize results.</li><li>Communicate any supply needs to the EM, ensuring guest-readiness at all times.</li><li>Contribute to maintaining outstanding store operational standards, including cleanliness of the salon, salesfloor, restrooms, backroom, break area, and any additional assigned area.</li><li>Protect company assets by following loss prevention best practices and providing exceptional guest service.</li><li>Execute other operational tasks as directed.</li></ul>\n \n<strong>JOB QUALIFICATIONS</strong>\n \n<strong>Education</strong>\n<ul><li>High school diploma is preferred <br/> </li></ul>\n<strong>Experience</strong>\n<ul><li>1 year of relevant work experience or equivalent combination of education and relevant work experience<br/> </li></ul>\n<strong>Skills</strong>\n<ul><li>Proficient with basic technology (e.g., Point of Sale system, Apple devices, Services Booking System)</li><li>Demonstrate significant competency in sales, products, and service</li><li>Ability to build and maintain strong customer relationships</li><li>Strong communication skills</li><li>Ability to troubleshoot</li><li>Ability to work independently and as part of a team<br/> </li></ul>\n<strong>SPECIAL POSITION REQUIREMENTS</strong>\n<ul><li>Work a flexible schedule to include days, evenings, weekends, and holidays</li></ul>\n \n<strong>WORKING CONDITIONS</strong>\n<ul><li>Continuous mobility throughout the store during shift</li><li>Frequent standing, bending, pulling, pushing, crouching, reaching, stooping, and twisting during shift</li><li>Continuous lifting and/or moving up to 10 lbs. during shift</li><li>Continuous coordination and manipulation of objects during shift</li><li>Frequent use of a computer, telephonic devices, and related office supplies</li></ul>\n<span>If an associate has a disability that prevents them from performing an essential function of the job, the Company will engage in the interactive process with the associate to determine whether there is a reasonable accommodation that will enable the associate to perform the essential functions of the job.</span>", "jobFunction": "Other", "industry": "Retail", "postedDate": "3 days ago", "skills": ["Technology", "Sales", "Customer Service", "Communication", "Troubleshooting", "Teamwork"], "url": "https://www.linkedin.com/jobs/view/4004491151"}