{"jobTitle": "Manager, Data Analytics Consultant", "company": {"name": "KPMG US", "location": "Los Angeles, CA", "industry": "Business Consulting and Services"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "General Business", "industry": "Business Consulting and Services", "description": "<strong>Requisition Number:</strong> 116917 - 8<br/><br/><strong>Description:<br/><br/></strong>We are The Lighthouse within KPMG's Consulting practice. We tap into the power of emerging technologies and scientific breakthroughs to create solutions and products that address the largest and most complex issues faced by global companies. By blending technology with our industry expertise, we're able to harness the potential of Cloud, AI, ML, IoT, 5G, and quantum computing to design and implement real-world solutions for a variety of business problems. Work with confidence knowing your ideas are heard and backed by one of the world's top professional services firms. Spark your curiosity and ignite your career at The Lighthouse.<br/><br/>KPMG is currently seeking a Manager in Technology Enablement for our Consulting practice.<br/><br/>Responsibilities:<br/><br/><ul><li>Bring strong sector- and/or business-process-specific knowledge to bear for D&amp;A strategy, transformation, or solution design engagements; focused on helping clients understand the broader D&amp;A journey and implications, and helping engagement teams understand domain context required for delivering meaningful and effective insights from D&amp;A solutions; Gather client and market information through interviews, surveys, workshops, and market research; realize requirements, styles and preferences for visualizations within sectors of expertise; managers in this role may have some opportunity to assist in the overseeing the design, management, execution, and implementation of complex analytics models. </li><li>Assess, capture and translate complex business needs and existing organization D&amp;A maturity levels into a structured strategy for D&amp;A capability development, including role and process design, analytics use case ideation and technology road mapping with the ability to explain data &amp; analytics concepts to non-technical team members </li><li>Proactively broaden and deepen client relationships by working with varying levels of client team members and utilize a hypothesis-driven, problem-solving approach to design and review with clients all aspects of an organization-specific D&amp;A target operating model</li><li>Research and communicate sector or process-specific data and D&amp;A solution design requirements, including building such design requirements into targeted visualizations</li><li>Apply data &amp; analytics concepts to business problems with an understanding of how applying these concepts can provide business value; design, host and debrief a variety of information gathering exercises as part of D&amp;A strategy and transformation readiness evaluations; for example, collaborative workshops and ideation sessions, 1:1 leadership interviews, survey design and execution and external market research </li><li>Support project leaders in tracking and communicating project risks, budget, rates and launch/closeout activities; including the administration of work papers and collaboration sites (shared with D&amp;A Modelers and D&amp;A Engineers); manage/mentor KPMG resources to drive engagements to successful closure<br/><br/></li></ul>Qualifications:<br/><br/><ul><li>A minimum of five years of data analytics experience with a professional services firm, an internal strategy/analytics group, or similar environment with previous experience in strategy and/or analytics consulting highly regarded</li><li>Bachelors degree in a technical or quantitative field from an accredited college or university (masters or MBA degree preferred) with knowledge of topics such as statistics, econometrics, machine learning, operations research, decision science, and cloud computing</li><li>Demonstrated analytics solution design and build expertise, project management skills, strong business consulting acumen in applying advanced analytics to solve business issues, and knowledge of business operational, process, delivery, and revenue models</li><li>Demonstrated ability to manage engagements and interface with senior level management internally as well as with clients and significant project management, client handling, and executive communication capabilities (e.g., interviews, workshop management, business writing)</li><li>Sector- and/or process-specific experience in D&amp;A strategy and transformation, as well as exposure to design and implementation needs with a good understanding of general landscape for data science and big data opportunities; deeper understanding of sector- and/or process-specific landscape for opportunities</li><li>Organization design, transformation design/execution expertise, workstream management skills, and strong business consulting acumen with significant project management, client handling, and executive communication capabilities (e.g., interviews, workshop management, business writing)</li><li>Ability to travel as needed</li><li>Applicants must be currently authorized to work in the United States without the need for visa sponsorship now or in the future<br/><br/></li></ul>KPMG complies with all local/state regulations regarding displaying salary ranges. If required, the ranges displayed below or via the URL below are specifically for those potential hires who will work in the location(s) listed. Any offered salary is determined based on relevant factors such as applicant's skills, job responsibilities, prior relevant experience, certain degrees and certifications and market considerations. In addition, the firm is proud to offer a comprehensive, competitive benefits package, with options designed to help you make the best decisions for yourself, your family, and your lifestyle. Available benefits are based on eligibility. Our Total Rewards package includes a variety of medical and dental plans, vision coverage, disability and life insurance, 401(k) plans, and a robust suite of personal well-being benefits to support your mental health. Depending on job classification, standard work hours, and years of service, KPMG provides Personal Time Off per fiscal year. Additionally, each year the firm publishes a calendar of holidays to be observed during the year and provides two firmwide breaks each year where employees will not be required to use Personal Time Off; one is at year end and the other is around the July 4th holiday. Additional details about our benefits can be found towards the bottom of our KPMG US Careers site at ' Benefits &amp; How We Work '.<br/><br/>Follow this link to obtain salary ranges by city outside of CA: https://kpmg.com/us/en/how-we-work/pay-transparency.html/?id=M150LS_3_24KPMG LLP (the U.S. member firm of KPMG International) offers a comprehensive compensation and benefits package. KPMG is an affirmative action-equal opportunity employer. KPMG complies with all applicable federal, state and local laws regarding recruitment and hiring. All qualified applicants are considered for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, citizenship status, disability, protected veteran status, or any other category protected by applicable federal, state or local laws. The attached link ' <strong>https://assets.kpmg.com/content/dam/kpmg/us/pdf/2018/09/eeo.pdf</strong>? 'contains further information regarding the firm's compliance with federal, state and local recruitment and hiring laws. No phone calls or agencies please.<br/><br/>KPMG does not currently require partners or employees to be fully vaccinated or test negative for COVID-19 in order to go to KPMG offices, client sites or KPMG events, except when mandated by federal, state or local law. In some circumstances, clients also may require proof of vaccination or testing (e.g., to go to the client site).<br/><br/>KPMG recruits on a rolling basis. Candidates are considered as they apply, until the opportunity is filled. Candidates are encouraged to apply expeditiously to any role(s) for which they are qualified that is also of interest to them.", "responsibilities": "<ul><li>Bring strong sector- and/or business-process-specific knowledge to bear for D&amp;A strategy, transformation, or solution design engagements; focused on helping clients understand the broader D&amp;A journey and implications, and helping engagement teams understand domain context required for delivering meaningful and effective insights from D&amp;A solutions; Gather client and market information through interviews, surveys, workshops, and market research; realize requirements, styles and preferences for visualizations within sectors of expertise; managers in this role may have some opportunity to assist in the overseeing the design, management, execution, and implementation of complex analytics models. </li><li>Assess, capture and translate complex business needs and existing organization D&amp;A maturity levels into a structured strategy for D&amp;A capability development, including role and process design, analytics use case ideation and technology road mapping with the ability to explain data &amp; analytics concepts to non-technical team members </li><li>Proactively broaden and deepen client relationships by working with varying levels of client team members and utilize a hypothesis-driven, problem-solving approach to design and review with clients all aspects of an organization-specific D&amp;A target operating model</li><li>Research and communicate sector or process-specific data and D&amp;A solution design requirements, including building such design requirements into targeted visualizations</li><li>Apply data &amp; analytics concepts to business problems with an understanding of how applying these concepts can provide business value; design, host and debrief a variety of information gathering exercises as part of D&amp;A strategy and transformation readiness evaluations; for example, collaborative workshops and ideation sessions, 1:1 leadership interviews, survey design and execution and external market research </li><li>Support project leaders in tracking and communicating project risks, budget, rates and launch/closeout activities; including the administration of work papers and collaboration sites (shared with D&amp;A Modelers and D&amp;A Engineers); manage/mentor KPMG resources to drive engagements to successful closure<br/><br/></li></ul>", "qualifications": {"required": "A minimum of five years of data analytics experience with a professional services firm, an internal strategy/analytics group, or similar environment with previous experience in strategy and/or analytics consulting highly regarded", "preferred": "Bachelors degree in a technical or quantitative field from an accredited college or university (masters or MBA degree preferred) with knowledge of topics such as statistics, econometrics, machine learning, operations research, decision science, and cloud computing"}, "skills": ["Data Analytics", "Strategy", "Analytics Consulting", "Statistics", "Econometrics", "Machine Learning", "Operations Research", "Decision Science", "Cloud Computing", "Analytics Solution Design", "Project Management", "Business Consulting", "Advanced Analytics", "Business Operational", "Process", "Delivery", "Revenue Models", "Engagement Management", "Client Handling", "Executive Communication", "Interviews", "Workshop Management", "Business Writing", "Data Science", "Big Data", "Organization Design", "Transformation Design", "Workstream Management"], "postedDate": "4 days ago", "benefits": "KPMG complies with all local/state regulations regarding displaying salary ranges. If required, the ranges displayed below or via the URL below are specifically for those potential hires who will work in the location(s) listed. Any offered salary is determined based on relevant factors such as applicant's skills, job responsibilities, prior relevant experience, certain degrees and certifications and market considerations. In addition, the firm is proud to offer a comprehensive, competitive benefits package, with options designed to help you make the best decisions for yourself, your family, and your lifestyle. Available benefits are based on eligibility. Our Total Rewards package includes a variety of medical and dental plans, vision coverage, disability and life insurance, 401(k) plans, and a robust suite of personal well-being benefits to support your mental health. Depending on job classification, standard work hours, and years of service, KPMG provides Personal Time Off per fiscal year. Additionally, each year the firm publishes a calendar of holidays to be observed during the year and provides two firmwide breaks each year where employees will not be required to use Personal Time Off; one is at year end and the other is around the July 4th holiday. Additional details about our benefits can be found towards the bottom of our KPMG US Careers site at ' Benefits &amp; How We Work '.<br/><br/>Follow this link to obtain salary ranges by city outside of CA: https://kpmg.com/us/en/how-we-work/pay-transparency.html/?id=M150LS_3_24KPMG LLP (the U.S. member firm of KPMG International) offers a comprehensive compensation and benefits package.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004291489"}