{"jobTitle": "Creator Partnerships Manager", "company": {"name": "Studio71, LP", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "45,000 to $55,000 annually + benefits + Commission.", "currency": "USD"}, "jobFunction": "Management, General Business, and Advertising", "industry": "Broadcast Media Production and Distribution, Strategic Management Services, and Entertainment", "description": "About Studio71:\nStudio71 is a premium global media company and content studio that develops, produces and distributes original programming across multiple platforms. Studio71 has headquarters in Los Angeles with offices in Berlin, New York, and Toronto.\n\nWe are the leaders in digital entertainment, shaping the future of entertainment. Studio71 offers great career advancement and networking opportunities, while also providing work-life balance for our employees. When you join us, you are joining a company that will challenge you and invest in your professional development.\n\nStudio71 is seeking a dynamic and detail-oriented Manager for the Creator Partnerships team with an entrepreneurial spirit to oversee the online presence of Studio71’s talent partners. The successful candidate will work cross-departmentally to ensure the success of creators, managing contracts, deliverables, milestones, optimization, analysis, reporting and more.\n\nThe ideal candidate will have a track record of success among clients and peers, and a willingness to learn and ask questions. They should demonstrate knowledge of the entertainment industry, have a strong work ethic, and meet or exceed KPIs.\n\nKey Responsibilities:\n<ul><li>Channel branding, optimization, programming strategy, and brand executions for a curated roster of clients at any given time</li><li>Pitch, and negotiate with prospective creators that align with personal and departmental goals and assess growth and trends within the YouTube landscape</li><li>Clients' pipeline of internally sourced marketing campaigns through external execution and communication</li><li>Creative executions and provide feedback to improve future outcomes</li></ul>\n\nKey Requirements:\n<ul><li>Years of experience in YouTube, social platforms, influencers, or the digital industry to meet and exceed signing and roster growth targets</li><li>Ability to build and manage industry and client relationships</li><li>Writing skills</li><li>Critical thinking and reasoning abilities</li><li>Spirit and ability to think outside job responsibilities</li><li>Vocabulary in the digital space</li></ul>\n\nOverall, Studio71 is seeking an adaptable and forward-thinking individual who can excel in a fast-paced environment, build relationships, and drive success for creators.\n\n\n\nSalary Expectations\nSalary Range: $45,000 to $55,000 annually + benefits + Commission.\nThis represents the expected salary range for this job requisition. Ultimately, in determining your pay, we'll consider your location, experience, and other job-related factors.\n\nIn addition to base salary, the successful candidate will also be eligible to receive bonus incentive compensation based on the achievement of applicable sales goals.\n\nStudio71 is an Equal Opportunity Employer that’s committed to Diversity, Equity, and Inclusion. We understand the importance of, and foster a culture where you can truly belong, collaborate, and grow. We welcome and encourage people of all characteristics and identities to apply.", "responsibilities": "Channel branding, optimization, programming strategy, and brand executions for a curated roster of clients at any given time\nPitch, and negotiate with prospective creators that align with personal and departmental goals and assess growth and trends within the YouTube landscape\nClients' pipeline of internally sourced marketing campaigns through external execution and communication\nCreative executions and provide feedback to improve future outcomes", "qualifications": {"required": "Years of experience in YouTube, social platforms, influencers, or the digital industry to meet and exceed signing and roster growth targets\nAbility to build and manage industry and client relationships\nWriting skills\nCritical thinking and reasoning abilities\nSpirit and ability to think outside job responsibilities\nVocabulary in the digital space"}, "skills": ["YouTube", "Social Media", "Influencer Marketing", "Digital Marketing", "Negotiation", "Client Management", "Branding", "Content Strategy", "Campaign Management", "Creative Execution", "Analysis", "Reporting"], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "Salary Range: $45,000 to $55,000 annually + benefits + Commission.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004362896"}