{"jobTitle": "Traveling Retail Merchandiser", "company": {"name": "The Retail Odyssey Company", "location": "Calabasas, CA"}, "location": "Calabasas, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Manufacturing", "description": "Join our team of Produce - Travel Retail Merchandisers! In this role, we handle product movement at retail. We display it, we move it, we track it; making sure stores and their product suppliers have the best opportunities for optimal sales. When you join the SAS Retail Services' team as a Produce - Traveling Reset Merchandiser, you'll be making a difference by ensuring the latest products match the newest plan. We've got a lot to offer with specialized training and growth opportunities. This is a traveling position that requires regular travel as a primary requirement of the role. Travel roles may require various degrees of travel up to 50% or more of the time<br/><br/><ul><li>Competitive Wage; $17.50 per hour </li><li>Paid travel with overnight stays </li><li>Competitive wages with annual increase eligibility</li><li>Get paid quicker with early access to earned wages </li><li>Paid training</li><li>Growth opportunities- we pride ourselves on promoting from within (FT opportunities)</li><li>We offer benefits that can be customized to meet your family's needs, including medical, dental, vision, life insurance, supplemental voluntary plans, wellness programs, and online discounts.<br/><br/></li></ul><strong>Now, About You<br/><br/></strong><ul><li>You're 18 years or older</li><li>Interested in traveling within and outside of your home state, with overnight hotel stays </li><li>Have reliable transportation and valid driver's license </li><li>You can perform physical work of moving, bending, standing and can lift up to 50 lbs.</li><li>Previous grocery produce merchandiser experience (preferred)</li><li>1-2 years of experience working in retail or merchandising (preferred)</li><li>Must be able to take direction from others</li><li>Works with in-store leader to merchandiser department in accordance with company standards</li><li>Work with store management on plano-o-gram execution ensuring retail category compliance </li><li>Ability to work in a wet and cold environment</li><li>Ready to jumpstart your professional career and/or fit your lifestyle needs<br/><br/></li></ul>Click here to learn more from our team<br/><br/>Join us and see what's possible for you! Click below to get started.", "postedDate": "1 day ago", "benefits": "Competitive Wage; $17.50 per hour, Paid travel with overnight stays, Competitive wages with annual increase eligibility, Get paid quicker with early access to earned wages, Paid training, Growth opportunities- we pride ourselves on promoting from within (FT opportunities), We offer benefits that can be customized to meet your family's needs, including medical, dental, vision, life insurance, supplemental voluntary plans, wellness programs, and online discounts.", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004391340"}