{"jobTitle": "Head of Vendor Management, Engineering Services, Google Cloud", "company": {"name": "Google", "industry": "Information Services and Technology", "location": "Georgia, United States"}, "location": "Georgia, United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "211,000-300,000", "currency": "USD"}, "jobFunction": "Project Management, Consulting, and Engineering", "industry": "Information and Internet", "description": "The application window will be open until at least August 27th, 2024. This opportunity will remain online based on business needs which may be before or after the specified date.<br/><br/>Note: Google’s hybrid workplace includes remote and in-office roles. By applying to this position you will have an opportunity to share your preferred working location from the following:<br/><br/><strong>In-office locations: Thornton, CO, USA; Boulder, CO, USA; Remote, OR, USA.<br/><br/></strong><strong>Remote location(s): Colorado, USA; Georgia, USA; Texas, USA.</strong><strong>Minimum qualifications:<br/><br/></strong><ul><li> Bachelor's degree or equivalent practical experience.</li><li>15 years of experience in leading extended workforce of IT/engineering services.</li><li>5 years of experience in a senior leadership role in IT services extended workforce either in a tech or product company</li><li>4 years of experience managing people and teams.<br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>Experience in delivering IT/Engineering services globally with exposure to service delivery across North America (NA), LATAM (Latin America) Europe, Middle East, and Africa (EMEA), and Asia–Pacific (APAC).</li><li>Experience delivering a project/program management experience in IT/software development running large long term and need based short term projects.</li><li>Experience engaging with senior leadership in conducting business reviews and resolving business challenges.</li><li>Experience with demand forecasting, capacity planning, and budgeting.</li><li>Experience managing budget and expertise in cost optimization.</li><li>Knowledge in driving consistent performance across multiple global sites and product areas.<br/><br/></li></ul><strong>About The Job<br/><br/></strong>In this role, you will manage service areas spanning across product areas and internal tools and application service areas. Service areas include system integration, artificial intelligence (AI), application development and maintenance, business intelligence (BI), quality assurance and testing, project, and program management.<br/><br/>The US base salary range for this full-time position is $211,000-$300,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Manage vendors for a defined area of scope. </li><li>Drive team performance, build analytics strategies and capabilities to monitor pipeline health, and identify indicators of action and changes needed to achieve a healthy pipeline, attach, value, and productivity measures</li><li>Oversee the effective completion of agreement qualification, service package, delivery strategy and approach, agreement sign-off, and agreement completion.</li><li>Engage with internal business leaders to align priorities, co-manage execution, resolve conflicts and enable functional teams to succeed. Advise business on scoping and defining new work requirements, market benchmarks and practices, budgeting and demand planning.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "Manage vendors for a defined area of scope. \nDrive team performance, build analytics strategies and capabilities to monitor pipeline health, and identify indicators of action and changes needed to achieve a healthy pipeline, attach, value, and productivity measures\nOversee the effective completion of agreement qualification, service package, delivery strategy and approach, agreement sign-off, and agreement completion.\nEngage with internal business leaders to align priorities, co-manage execution, resolve conflicts and enable functional teams to succeed. Advise business on scoping and defining new work requirements, market benchmarks and practices, budgeting and demand planning.", "qualifications": {"required": "Bachelor's degree or equivalent practical experience.\n15 years of experience in leading extended workforce of IT/engineering services.\n5 years of experience in a senior leadership role in IT services extended workforce either in a tech or product company\n4 years of experience managing people and teams.", "preferred": "Experience in delivering IT/Engineering services globally with exposure to service delivery across North America (NA), LATAM (Latin America) Europe, Middle East, and Africa (EMEA), and Asia–Pacific (APAC).\nExperience delivering a project/program management experience in IT/software development running large long term and need based short term projects.\nExperience engaging with senior leadership in conducting business reviews and resolving business challenges.\nExperience with demand forecasting, capacity planning, and budgeting.\nExperience managing budget and expertise in cost optimization.\nKnowledge in driving consistent performance across multiple global sites and product areas."}, "skills": [], "postedDate": "1 day ago", "applicationDeadline": "August 27th, 2024", "benefits": "bonus + equity + benefits", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4004313784"}