{"jobTitle": "Administrative Assistant", "company": {"name": "RemoteWorker CA", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Temporary", "employmentType": "Temporary", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/>Immediate need - REMOTE but must work to PST hours. 3 Month Assignment. Pay up to $24 per hour w2.<br/><br/>Administrative Assistant<br/><br/>Entertainment client seeking highly skilled Administrative Assistant on a temporary basis to support SVP. Assignment will be 3 months to start with the possibility to extend. Remote based, but able to accommodate working PST business hours required.<br/><br/><strong><strong>What You'll Do:<br/><br/></strong></strong><ul><li>Provide proactive administrative and technical support including but not limited to; calendar management, scheduling meetings and room reservations and creating reports and spreadsheets to track departmental and company data.</li><li>Must be able to navigate multiple time zones.</li><li>Manage and maintain daily personal and professional schedule for SVP, including compiling daily calendar reports and weekly schedule. Ensure SVP makes their daily meetings as they have full days.</li><li>Manage event planning and travel arrangements for SVP including but not limited to booking travel, managing reservations, check-in for flights as well as being on standby whilst Executive is in transit.</li><li>Manage invoice reconciliation and payments, department spend, annual budget tracking and forecasting for the department. Liaise with vendors to ensure invoices are received correctly and processed in a timely manner. Work with finance to setup new vendors and process payments as needed.</li><li>Must be able to manage all expenses in a timely fashion in Concur.</li><li>T&amp;E Reports.<br/><br/></li></ul><strong><strong>Who You Are:<br/><br/></strong></strong><ul><li>2-5 years of substantial experience in an administrative capacity.</li><li>Proactive, flexible, and responsive to the needs of the team.</li><li>Excellent oral and written communication skills, detail orientation and demonstrated organizational, project management, and time management skills.</li><li>Working knowledge of office software (Google Apps, Microsoft Office, Excel, Google Suite, Zoom, Adobe Suite, Concur, Teams additional organizational software).</li><li>Ability to work with a diverse and dynamic group of teammates.</li><li>Have a proactive approach to problem-solving with strong decision-making skills.</li><li>Ability to keep information highly confidential and to use discretion.</li><li>Strong work ethic and positive attitude.</li><li>Ability to interact comfortably and effectively with employees of the company at all levels including Executive Management.</li><li>Demonstrated experience and understanding of the current landscape and digital platforms.</li><li>Awareness and interest in music and the creative industries.</li><li>Strong attention to detail.</li><li>Experience in music and/or film industry production is a plus.</li><li>Must be able to work in a fast-paced environment and multi-task/switch gears quickly.</li><li>Detail orientated, enthusiastic, and highly organized.</li><li>High sense of urgency to complete tasks and prioritize.<br/><br/></li></ul>Note: Any pay ranges displayed are estimations. Actual pay is determined by an applicant's experience, technical expertise, and other qualifications as listed in the job description. All qualified applicants are welcome to apply.<br/><br/>Yoh, a Day &amp; Zimmermann company, is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.<br/><br/>Visit <strong>https://www.yoh.com/applicants-with-disabilities </strong>to contact us if you are an individual with a disability and require accommodation in the application process.<br/><br/><strong>Company Description<br/><br/></strong>Founded in 1940, Yoh operates from 75 locations throughout North America and is headquartered in Philadelphia, PA. Yoh was the nation’s first technology staffing firm. As a business unit of Day &amp; Zimmermann, Yoh has a flourishing global footprint, as our parent company operates from more than 150 worldwide locations.<br/><br/>Company Website: https://www.yoh.com/<br/><br/><strong>Company Description<br/><br/></strong>Founded in 1940, Yoh operates from 75 locations throughout North America and is headquartered in Philadelphia, PA. Yoh was the nation’s first technology staffing firm. As a business unit of Day &amp; Zimmermann, Yoh has a flourishing global footprint, as our parent company operates from more than 150 worldwide locations. Company Website: https://www.yoh.com/", "responsibilities": "What You'll Do:<br/><br/><ul><li>Provide proactive administrative and technical support including but not limited to; calendar management, scheduling meetings and room reservations and creating reports and spreadsheets to track departmental and company data.</li><li>Must be able to navigate multiple time zones.</li><li>Manage and maintain daily personal and professional schedule for SVP, including compiling daily calendar reports and weekly schedule. Ensure SVP makes their daily meetings as they have full days.</li><li>Manage event planning and travel arrangements for SVP including but not limited to booking travel, managing reservations, check-in for flights as well as being on standby whilst Executive is in transit.</li><li>Manage invoice reconciliation and payments, department spend, annual budget tracking and forecasting for the department. Liaise with vendors to ensure invoices are received correctly and processed in a timely manner. Work with finance to setup new vendors and process payments as needed.</li><li>Must be able to manage all expenses in a timely fashion in Concur.</li><li>T&amp;E Reports.<br/><br/></li></ul>", "qualifications": {"required": "2-5 years of substantial experience in an administrative capacity, Proactive, flexible, and responsive to the needs of the team, Excellent oral and written communication skills, detail orientation and demonstrated organizational, project management, and time management skills, Working knowledge of office software (Google Apps, Microsoft Office, Excel, Google Suite, Zoom, Adobe Suite, Concur, Teams additional organizational software), Ability to work with a diverse and dynamic group of teammates, Have a proactive approach to problem-solving with strong decision-making skills, Ability to keep information highly confidential and to use discretion, Strong work ethic and positive attitude, Ability to interact comfortably and effectively with employees of the company at all levels including Executive Management, Demonstrated experience and understanding of the current landscape and digital platforms, Awareness and interest in music and the creative industries, Strong attention to detail, Must be able to work in a fast-paced environment and multi-task/switch gears quickly, Detail orientated, enthusiastic, and highly organized, High sense of urgency to complete tasks and prioritize", "preferred": "Experience in music and/or film industry production"}, "skills": ["Calendar Management", "Meeting Scheduling", "Report Writing", "Spreadsheet Creation", "Time Zone Management", "Event Planning", "Travel Arrangements", "Invoice Reconciliation", "Budget Tracking", "Vendor Management", "Concur", "Expense Management", "Microsoft Office", "Google Suite", "Zoom", "Adobe Suite", "Teams", "Communication", "Problem Solving", "Decision Making", "Confidentiality", "Work Ethic", "Customer Service", "Digital Platforms", "Music Industry", "Film Industry", "Production", "Multitasking", "Organization", "Prioritization", "Excel"], "postedDate": "1 day ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4004353739"}