{"jobTitle": "Advanced Corporate Planning Analyst", "company": {"name": "DENSO", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Motor Vehicle Manufacturing", "description": "<strong>Job Summary<br/><br/></strong><strong> JOB DESCRIPTION <br/><br/></strong>Highly competent financial planning and analysis professional able to carry out a full range of professional duties. Under limited supervision, maintains and analyzes manufacturing cost data to properly reflect into planning and actual transactions and to help senior management making educated business decisions. Cooperates with manufacturing team with regards to operations decisions to assess financial implications. With minimal amount of direction, works independently on transactions and financial data, analyses, evaluates, and communicates variances to internal manufacturing teams (PC, ENG, F&amp;A) and to extended teams (CP, PMG, BU) to help mobilize and achieve financial plan and enhance performance. Requires in depth knowledge and experience in professional discipline.<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong><ul><li>Leads annual profit planning process and actual data preparation and analysis; Comprehends overall business schemes and manufacturing operations end-to-end to guide departments on budgeting, uncover issues for improvement, organize and implement improvement plan, and evaluate results for further Kaizen with teams. </li><li>Gathers and maintains direct material costs (finished goods, parts, components, and cores) and direct processing costs (depreciation, labor, and overhead) as well as indirect and SGA expenditures for budget planning and operations transactions analysis. </li><li>Utilizes ERP datasets to ensure correct costing setup into planning and actual transactions; Coordinates with F&amp;A, PC, Ops, ENG, PMG about P/N setup, core price change, standard cost, cost variance calculation etc. </li><li>Performs financial analysis of business performance and manufacturing operations; This utilizes horizontal analysis of budget, actual, and previous years as well as vertical analysis in terms of percentage ratio, dollar per unit, dollar per headcount, dollar per hour as well as costs, rate, expenses to measure efficiency and effectiveness. </li><li>Contributes to manufacturing operations from financial perspectives by monitoring and connecting operations KPI, PSI, parts procurement, inventory management to financials; Assists PC in making optimal operations decisions by assessing and sharing financial implications. </li><li>Arranges and presents plan and actual financial data and statements, not limited to profit &amp; loss statement, segment information, balance sheet items, to business and manufacturing management team in conjunction with operations plan and actual; Demonstrate cost behavior knowledge and discusses recurring/one-time/timing issues in variance analysis to mitigate risks and expand opportunities. </li><li>Coordinates and communicates with CP about budget planning, not limited to schedule, assumptions, allocations, depreciation, submission, transfer price. </li><li>Coordinates and communicate with F&amp;A about month end activities for actuals, not limited to transactions data and backup, journal entries, standard and variance, accrue and reversal, true up. </li><li>Performs other duties as assigned. <br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong><ul><li>5-8 years of relevant experience required</li><li>Requires a Bachelor’s degree in accounting, finance or related field</li><li>FP&amp;A and/or Cost Accounting experience in Manufacturing desired<br/><br/></li></ul><strong>Skills And Abilities<br/><br/></strong><ul><li>Expert in the use of ERP, financial reporting or business intelligence tools</li><li>Extensive level of proficiency in Microsoft Office products such as Word, Excel and PowerPoint</li><li>Detailed analytical skills</li><li>Excellent written and verbal communication skills and presentation skills. Ability to communicate with internal and external customers on issues of moderate to considerable importance</li><li>Excellent customer service skills. Ability to promote and support a service-oriented environment</li><li>Strong negotiation skills. Ability to defend position strongly while keenly aware of the need to maximize benefits for all sides</li><li>Able to drive and visit Murrieta Operations in-person for meetings</li></ul>", "postedDate": "3 days ago", "skills": ["ERP", "Financial Reporting", "Business Intelligence", "Microsoft Office", "Word", "Excel", "PowerPoint", "Analytical Skills", "Communication Skills", "Presentation Skills", "Customer Service", "Negotiation Skills"], "url": "https://www.linkedin.com/jobs/view/4004925904"}