{"jobTitle": "Supply Chain Manager", "company": {"name": "EnVision LED Lighting", "location": "Bell, CA"}, "location": "Bell, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00/yr - $120,000.00/yr", "currency": "USD"}, "jobFunction": "Supply Chain", "industry": "Electric Lighting Equipment Manufacturing", "description": "<strong>The Company</strong>\n<p>Established in 2010, EnVision LED Lighting, Inc. is a Los Angeles based LED lighting leader that provides the market with an array of LED lighting products. Our series of high efficiency, low energy consuming LED products have been skillfully developed by our engineers to suit a range of clients both in the residential and commercial application.</p>\n<p><br/></p>\n<p><strong><em>Customer Service</em></strong> - Customers are number one priority. Everything they do begins and ends with their dedication to providing the best possible customer experience. The company’s continuous improvement initiatives include an extensive Customer Service training program that integrates Lean CX, best practices, customer feedback and behavioral elements to stand out from the competition. </p>\n<p><br/></p>\n<p><strong><em>Shipping Time</em></strong> – They understand how critical on-time shipping is to customer satisfaction. They target to ship the same day all parcel orders from their Los Angeles warehouse that are received by 2 p.m. (PST) on business days. </p>\n<p><br/></p>\n<p><strong><em>Quality and Value</em> </strong>- They are committed to providing extremely high-quality LED products that offer superior lumens/wattage ratios at the competitive pricing. Feel confident that the customers are always receiving the best possible value for specific LED’s they are purchasing. </p>\n<p><br/></p>\n<p><strong><em>Reliability and Sustainability</em></strong> – They proudly stand behind the reliability and usable hours of their products and proudly offer long warranties against defects. New developments in LED design and manufacturing are leading to more efficient LED products that help reduce the overall global carbon footprint for future Generations, something that we can all be proud of!</p>\n<p><br/></p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Execute procurement, demand planning, scheduling, inventory management processes.</li>\n<li>Design and drive strategies and plans to meet or exceed the company’s short-term and long-term supply chain management key performance indicators.</li>\n<li>Drive Supply Chain continuous improvement initiatives in the key areas of customer service level, quality, purchasing efficiencies, inventory accuracy and cost reduction to ensure the supply chain is optimized.</li>\n<li>Responsible for stocking strategies and inventory accuracy across Corporate, 3PL’s, Amazon FBA and other storage / distribution facilities, yet open to new techniques and methodologies to optimize results.</li>\n<li>Report out regularly on Cycle Count financial and operational results, including root cause analysis trends and corrective actions.</li>\n<li>Negotiation involvement with key contracts with both Domestic and International Suppliers.</li>\n<li>Utilize the latest technologies and developments to overcome obstacles and challenges to optimize customer service levels and not settle for average performance.</li>\n<li>Report out regularly on service level, vendor scorecards, purchase order cycle times, cost trends and other KPI’s to drive supply chain corrective actions and achieve targeted results.</li>\n<li>Coordinate Import/Export supply chain activities.</li>\n<li>Create standard operating procedures using ISO9001:2015 methodologies.</li>\n<li>Perform other duties as assigned by the VP of Operations.</li>\n</ul>\n<p><br/></p>\n<p><strong>The Candidate</strong></p>\n<p><strong>Experience and Professional Qualifications</strong></p>\n<p>Experience and professional qualifications required for the role.</p>\n<ul>\n<li>7+ years of relevant planning or supply chain experience, in a distribution or manufacturing company.</li>\n<li>Experience working effectively with cross-functional teams in a fast-paced, dynamic environment.</li>\n<li>Experience in the effective use of ERP, WMS and other systems to automate the demand planning process thus driving down manual adjustments.</li>\n</ul>\n<p><br/></p>\n<p><strong>Skills and Competencies</strong></p>\n<ul>\n<li>In depth knowledge of material requirements planning.</li>\n<li>Experience conducting statistical analysis of sales, inventory and other data; modeling the data to predict future demand; and collaboration with suppliers, manufacturers, commercial functions and other stakeholders to gather information on events that could affect demand, such as promotions and production delays.</li>\n<li>Detailed understanding of cycle count programs including root cause analysis to optimize the inventory cycle count program and procedures.</li>\n<li>Additional specific qualifications in demand and logistics/ or planning management including ASCM’s training and certifications, such as CPIM, CSCP, a plus.</li>\n<li>Self-motivated and willing to accept responsibilities outside of the initial job description as needed by the VP of Operations or executives.</li>\n<li>Excellent interpersonal, verbal and written communication skills are essential.</li>\n<li>Comfortable in a fast-paced small company environment and able to adjust and support changing priorities and requests.</li>\n<li>Excellent organizational skills and an ability to prioritize effectively to deliver results within established timelines.</li>\n<li>Candidates must be authorized to work in the U.S. and up to 20% Travel.</li>\n</ul>\n<p><br/></p>\n<p><strong>Education</strong></p>\n<ul>\n<li>Bachelor’s Degree in business, supply chain, engineering, economics, data analysis. or other relevant field</li>\n</ul>\n<p><br/></p>\n<p><strong>SE# 510645534</strong></p>", "responsibilities": "Execute procurement, demand planning, scheduling, inventory management processes. Design and drive strategies and plans to meet or exceed the company’s short-term and long-term supply chain management key performance indicators. Drive Supply Chain continuous improvement initiatives in the key areas of customer service level, quality, purchasing efficiencies, inventory accuracy and cost reduction to ensure the supply chain is optimized. Responsible for stocking strategies and inventory accuracy across Corporate, 3PL’s, Amazon FBA and other storage / distribution facilities, yet open to new techniques and methodologies to optimize results. Report out regularly on Cycle Count financial and operational results, including root cause analysis trends and corrective actions. Negotiation involvement with key contracts with both Domestic and International Suppliers. Utilize the latest technologies and developments to overcome obstacles and challenges to optimize customer service levels and not settle for average performance. Report out regularly on service level, vendor scorecards, purchase order cycle times, cost trends and other KPI’s to drive supply chain corrective actions and achieve targeted results. Coordinate Import/Export supply chain activities. Create standard operating procedures using ISO9001:2015 methodologies. Perform other duties as assigned by the VP of Operations.", "qualifications": {"required": "7+ years of relevant planning or supply chain experience, in a distribution or manufacturing company. Experience working effectively with cross-functional teams in a fast-paced, dynamic environment. Experience in the effective use of ERP, WMS and other systems to automate the demand planning process thus driving down manual adjustments.", "preferred": "In depth knowledge of material requirements planning. Experience conducting statistical analysis of sales, inventory and other data; modeling the data to predict future demand; and collaboration with suppliers, manufacturers, commercial functions and other stakeholders to gather information on events that could affect demand, such as promotions and production delays. Detailed understanding of cycle count programs including root cause analysis to optimize the inventory cycle count program and procedures. Additional specific qualifications in demand and logistics/ or planning management including ASCM’s training and certifications, such as CPIM, CSCP, a plus. Self-motivated and willing to accept responsibilities outside of the initial job description as needed by the VP of Operations or executives. Excellent interpersonal, verbal and written communication skills are essential. Comfortable in a fast-paced small company environment and able to adjust and support changing priorities and requests. Excellent organizational skills and an ability to prioritize effectively to deliver results within established timelines. Candidates must be authorized to work in the U.S. and up to 20% Travel. Bachelor’s Degree in business, supply chain, engineering, economics, data analysis. or other relevant field"}, "skills": ["Supply Chain Management", "Demand Planning", "Inventory Management", "Procurement", "ERP", "WMS", "Continuous Improvement", "Customer Service", "Negotiation", "ISO9001", "Statistical Analysis", "Data Analysis", "Cycle Counting", "ASCM", "CPIM", "CSCP", "Cross-Functional Teamwork", "Communication", "Organization", "Time Management", "Travel"], "postedDate": "21 hours ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4004722989"}