{"jobTitle": "Production Planner - Fabrication", "company": {"name": "Siemens", "industry": "Automation Machinery Manufacturing", "size": "100+ employees", "location": "Pomona, CA"}, "location": "Pomona, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$70K-$90K", "currency": "USD"}, "jobFunction": "Other", "industry": "Automation Machinery Manufacturing", "description": "Here at Siemens, we take pride in enabling sustainable progress through technology. We do this through empowering customers by combining the real and digital worlds. Improving how we live, work, and move today and for the next generation! We know that the only way a business thrive is if our people are thriving. That’s why we always put our people first. Our global, diverse team would be happy to support you and challenge you to grow in new ways. Who knows where our shared journey will take you? We are looking for a Production Planner for our Fabrication Department in our Pomona, CA location. Our growing facility has more than one hundred employees that produce high-quality, make-to-order power distribution equipment for the western United States market. Our processes include material handling, metal fabrication, final assembly and test. The position is responsible to balance supply and demand and coordinate the different functions within the manufacturing plant to ensure the completion of the customer orders on time in the most efficient/productive way to meet our financial targets as well.", "responsibilities": "Establish and maintain process map of fabrication and planning process; Establish fabrication planning and scheduling with focus on process improvement and optimization; Validate fabrication work center capacity and establish productivity metrics; Daily review of switchboard and lighting panel production schedules to ensure master fabrication schedule covers demand; Identify and resolve production bottlenecks and delays and adjust fab execution; Manages demand MRP via SAP and DMM systems, and reconcile daily; Responsible to support resolution for SAP and DMM communication issues; Reviews SAP master data including, but not limited to, minimum order quantities, safety stocks, lead times and adjust as needed; Monitor raw material stocking levels and coordinate purchases; Monitor Cost of Goods Issue errors and ensure proper consumption of raw material; Create production orders as needed; Modify bills of materials as needed; Evaluate and support in implementation of new technologies to improve efficiency and accuracy to optimize production planning and scheduling; Create and prepare other measurable analytics for reporting an improvement.", "qualifications": {"required": "Bachelor’s Degree in Mechanical/Electrical Engineering required; 3-5 years of experience in production planning or production control in manufacturing environment; Ability to read and understand Blueprints; Advanced knowledge of SAP and Microsoft Office (Excel); Well organized and excellent problem solving skills; Ability to maturely handle confidential issues with discretion and diplomacy; Ability to work independently as all as in a team environment; Excellent verbal, written, and interpersonal skills.", "preferred": "APICS Certification is a plus; Lean Manufacturing experience is a plus; Expertise on MES systems such as OpCenter, PPG, Optimization and DMM; KNIME workflow and Tableu is a plus; Microsoft Access is a plus; Excel Macros is a plus; Bachelor’s Degree in related field desired."}, "skills": ["Production Planning", "SAP", "Microsoft Office", "Problem Solving", "Blueprint Reading"], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "Siemens offers a variety of health and wellness benefits to our employees. Details regarding our benefits can be found here: https://www.benefitsquickstart.com/siemens/index.html", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4005367132"}