{"jobTitle": "Air Export Agent", "company": {"name": "iStaffing®", "location": "Compton, CA"}, "location": "Compton, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Job Overview:<br/><br/>Join our team as an Agent where you will play a crucial role in our operations. As an Agent, you will be responsible for various tasks within our distribution center to ensure efficient order processing and shipment.<br/><br/>Essential Functions:<br/><br/><ul><li>Prepare and coordinate documentation for efficient, cost-effective, and legal air export activities. </li><li>Coordinate and monitor cargo pick-up and transfer. </li><li>Communicate with export authorities, customers, and suppliers across relevant regions to ensure smooth operations. </li><li>Manage and update carrier/vendor rates; obtain spot rates as needed. </li><li>Communicate promptly with overseas agents and clients, including pre-alerts, rate requests, and shipment status updates. </li><li>Track shipments and provide status updates to customers and agents. </li><li>Create and maintain customer files. </li><li>Handle customer invoicing and approve payables. </li><li>Audit files for accuracy and completion. </li><li>Interact professionally and courteously with coworkers. </li><li>Enter data and manage documentation in JWS. </li><li>Assist other departments as needed or requested by management. <br/><br/></li></ul>Qualifications:<br/><br/><ul><li>3-5 years of experience handling air shipments. </li><li>Spanish skills are a plus. </li><li>Knowledge of geography is preferred. </li><li>Team player with the ability to adapt to a dynamic work environment. </li><li>Strong written and verbal communication skills. </li><li>Proactive problem-solving with diplomacy. </li><li>Respectful interaction with management and coworkers. </li><li>Ability to perform duties without posing a threat to health or safety. </li><li>Positive and effective interaction with coworkers, subordinates, and supervisors. <br/><br/></li></ul>Education/Experience:<br/><br/><ul><li>Familiarity with Cargo Wise and experience in the freight forwarding industry are advantageous. <br/><br/></li></ul>Company Description<br/><br/>Must be able to commute to job site.<br/><br/>Must be able to commute to job site.", "responsibilities": "Prepare and coordinate documentation for efficient, cost-effective, and legal air export activities. Coordinate and monitor cargo pick-up and transfer. Communicate with export authorities, customers, and suppliers across relevant regions to ensure smooth operations. Manage and update carrier/vendor rates; obtain spot rates as needed. Communicate promptly with overseas agents and clients, including pre-alerts, rate requests, and shipment status updates. Track shipments and provide status updates to customers and agents. Create and maintain customer files. Handle customer invoicing and approve payables. Audit files for accuracy and completion. Interact professionally and courteously with coworkers. Enter data and manage documentation in JWS. Assist other departments as needed or requested by management.", "qualifications": {"required": "3-5 years of experience handling air shipments. Spanish skills are a plus. Knowledge of geography is preferred. Team player with the ability to adapt to a dynamic work environment. Strong written and verbal communication skills. Proactive problem-solving with diplomacy. Respectful interaction with management and coworkers. Ability to perform duties without posing a threat to health or safety. Positive and effective interaction with coworkers, subordinates, and supervisors."}, "skills": ["Air Export", "Cargo Wise", "Freight Forwarding", "Spanish", "Geography", "Teamwork", "Communication", "Problem Solving"], "postedDate": "7 hours ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005367562"}