{"jobTitle": "User Operation Specialist", "company": {"name": "BIGO", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development, Marketing, and Advertising", "industry": "Entertainment Providers and Technology, Information and Media", "description": "<strong>Specialist, User Management</strong><p>Location: Century City, Los Angeles, US (3 days hybrid in the office)</p><p><br/></p><p><strong>About This Role</strong></p><p>The User Operations Specialist is responsible for the development, continuous improvement, and delivery of top-quality support. They are customer-obsessed and comfortable leveraging data, partnerships, and technology to develop creative solutions that improve the BIGO LIVE experience.</p><p><br/></p><p><strong>Responsibilities</strong></p><ul><li>Driving in-app operational strategies based on user portraits and user behavior analysis and converting it into actional plan to drive revenue growth</li><li>Familiar with user segmentation and user growth incentive system with user-first mindset</li><li>Manage Comparable Territories of Users for Field and Data Driven Insight and tactics and strategies resulting in Paid User Retention, Acquisition, Customer Satisfaction and Revenue Growth</li><li>Work collaboratively with stakeholders from Operations, Marketing, and Analytics to understand our user behaviors and unearth problems we should be focused on</li><li>Managing user groups to increase user stickiness, user activation and user loyalty</li><li>Uphold a top-quality support experience through the measurement of customer happiness, resolution time, and adherence to a meticulous quality assurance framework</li><li>Ensure clarity around priorities, goals, and metrics</li><li>This position may require travel, both domestically and internationally, as necessary to fulfill job responsibilities. Travel frequency and destinations will vary based on business needs and specific job duties. All travel arrangements will be coordinated in accordance with company policies.</li></ul><p><br/></p><p><br/></p><p><strong>Qualifications</strong></p><p>Bachelor's Degree above</p><p>Preferred experience segmenting an entire user base to create bespoke users journeys for different audiences to drive conversion, retention and monetization</p><p>Strong business communication skills and excellent logical thinking skills, and excellent in discovering valuable regular patterns from massive data</p><p>Comfortable with fast-facing environment</p><p><br/></p><p><strong>Benefits</strong></p><p>Competitive pay package that includes a base salary and performance-related bonus</p><p>Generous paid time off starting at 4 weeks + 10 sick days and 9 Holidays per year</p><p>Free medical, dental, and vision insurance</p><p>401k</p><p>Free gym membership and meal allowance</p><p><br/></p><p><strong>About BIGO</strong></p><p><strong>WHO WE ARE</strong></p><p>BIGO is a fast-growing Singapore technology company established in 2014.</p><p>Dedicated to creating a better-connected world for everyone, BIGO provides a portfolio of video broadcast and VoIP related products and services powered by advanced Artificial Intelligence (AI) technology. The major products include Bigo Live, Likee (Formerly LIKE video), and imo, and the company now has over 300 million monthly active users in over 150 countries.</p><p>To enable people to showcase, discover, and stay connected, BIGO is devoted to continuously innovating its AI capabilities, allowing our users to enjoy a positive, healthy, and creative online environment.</p><p>At present, BIGO has 5 R&amp;D centres, in Singapore, U.S.A., Middle East, India, and China, and over 20 offices around the globe.</p><p>For more information, please visit our website: www.bigo.sg</p><p><br/></p><p><strong>OUR MISSION</strong></p><p>Connect the world and share beautiful moments.</p><p><br/></p><p><strong>OUR VISION</strong></p><p>To be a content platform inspiring one billion people's lives.</p><p><strong>OUR KEY TO SUCCESS</strong></p><p><br/></p><p>BIGO is dedicated to technology innovation. We own over 40 patents in VoIP/Video related technology, and over 60 patents are under the process of application.</p><p><br/></p><p><strong>About Our Product-BIGO LIVE</strong></p><p>BIGO LIVE is founded in March 2016. BIGO LIVE is a leading mobile live stream APP where users live broadcast their life moments, show their talents, interact and send virtual gifts in real time, and enjoy fun live sessions with people worldwide.</p><p>BIGO LIVE has over 200 million users globally in over 80 countries and regions and is currently the market leader in the industry.</p>", "responsibilities": "Driving in-app operational strategies based on user portraits and user behavior analysis and converting it into actional plan to drive revenue growth\nFamiliar with user segmentation and user growth incentive system with user-first mindset\nManage Comparable Territories of Users for Field and Data Driven Insight and tactics and strategies resulting in Paid User Retention, Acquisition, Customer Satisfaction and Revenue Growth\nWork collaboratively with stakeholders from Operations, Marketing, and Analytics to understand our user behaviors and unearth problems we should be focused on\nManaging user groups to increase user stickiness, user activation and user loyalty\nUphold a top-quality support experience through the measurement of customer happiness, resolution time, and adherence to a meticulous quality assurance framework\nEnsure clarity around priorities, goals, and metrics\nThis position may require travel, both domestically and internationally, as necessary to fulfill job responsibilities. Travel frequency and destinations will vary based on business needs and specific job duties. All travel arrangements will be coordinated in accordance with company policies.", "qualifications": {"required": "Bachelor's Degree above\nStrong business communication skills and excellent logical thinking skills, and excellent in discovering valuable regular patterns from massive data\nComfortable with fast-facing environment", "preferred": "Preferred experience segmenting an entire user base to create bespoke users journeys for different audiences to drive conversion, retention and monetization"}, "skills": [], "postedDate": "13 hours ago", "benefits": "Competitive pay package that includes a base salary and performance-related bonus\nGenerous paid time off starting at 4 weeks + 10 sick days and 9 Holidays per year\nFree medical, dental, and vision insurance\n401k\nFree gym membership and meal allowance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005027392"}