{"jobTitle": "Project Coordinator", "company": {"name": "Northeast Community Clinic", "industry": "Hospitals and Health Care", "size": "Not specified", "location": "Alhambra, CA"}, "location": "Alhambra, CA", "jobType": "Not specified", "employmentType": "Other", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Other", "industry": "Hospitals and Health Care", "description": "Position Summary\nPerform routine clerical duties and provide support for the Operations Department.\nSchedule\nFlexible, may require some evening and weekends\nPrimary Duties And Responsibilities\nAssist in the development and the updates of Policies and Procedures.\nAssist in special projects as assigned.\nAssist in licensing and certification of facilities.\nAssist in the creation of systems, planning and implementation of programs and services; operational, facilities, logistics.\nMonitor progress of projects to meet established productivity, schedule adherence, and quality standards.\nAssist in managing vendor relationships.\nProactively mitigate issues by identifying and relaying information to manager.\nCoordinate meetings and maintain/update agendas, minutes and plans.\nCompile information and prepare and maintain logs, files and records; review and verify the accuracy and completeness of various documents; prepare routine reports as directed.\nPerform a variety of routine clerical duties including typing, filing, scanning, faxing, duplicating, and distributing materials.\nPerform other duties as assigned by the Operations Manager.", "responsibilities": "Assist in the development and the updates of Policies and Procedures. Assist in special projects as assigned. Assist in licensing and certification of facilities. Assist in the creation of systems, planning and implementation of programs and services; operational, facilities, logistics. Monitor progress of projects to meet established productivity, schedule adherence, and quality standards. Assist in managing vendor relationships. Proactively mitigate issues by identifying and relaying information to manager. Coordinate meetings and maintain/update agendas, minutes and plans. Compile information and prepare and maintain logs, files and records; review and verify the accuracy and completeness of various documents; prepare routine reports as directed. Perform a variety of routine clerical duties including typing, filing, scanning, faxing, duplicating, and distributing materials. Perform other duties as assigned by the Operations Manager.", "qualifications": {"required": "High school diploma or GED equivalent, One year experience of clinic operations or healthcare experience, Commitment to goals and philosophy of Northeast Community Clinic, Valid State Identification", "preferred": "Bi-lingual Spanish/English (preferred)"}, "skills": ["Microsoft Office", "Excellent Communication Skills", "Excellent Customer Service Skills", "Ability to work as a team player and work independently", "Reliable transportation"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4005231794"}