{"jobTitle": "Expo/Takeout", "company": {"name": "Din Tai Fung North America", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "20.50 - 21.32/hour", "currency": "USD"}, "jobFunction": "Other", "industry": "Restaurants", "description": "DIN TAI FUNG RESTAURANTS<br/><br/>JOB TITLE:  Barista/Expo (Expo/Takeout)<br/><br/>LOCATION: 1164 Galleria Way Glendale, CA 91204 (Glendale Galleria)<br/><br/>PAY RANGE FOR BARISTA / EXPO: $20.50 - $21.32/hour<br/><br/><em>The base salary or hourly wage range for this role will vary based on multiple factors, including but not limited to prior experience, relevant expertise, current business needs, and market factors. Range is not inclusive of potential bonus or benefits. Your recruiter can share more information about the salary range and other factors during the hiring process.<br/><br/></em><ul><li>Hiring Multiple Positions</li><li>Urgently Hiring</li><li>Job Type: Part-time<br/><br/><br/></li></ul>BENEFITS &amp; PERKS:<br/><br/></strong><ul><li>Competitive Pay &amp; Benefits</li><li>Employer Contribution for individuals and eligible dependents' medical insurance</li><li>Dental, Vision, and Life Insurance </li><li>Health Savings Account (HSA)</li><li>Commuter Spending Accounts</li><li>401(k) Plan with company match </li><li>Employee Assistance Program</li><li>Discounts through BenefitHub</li><li>Employee Meal Discounts </li><li>Opportunities for growth; we love promoting within!<br/><br/><br/></li></ul>JOB PURPOSE:<br/><br/>The Barista / Expo (Expo/Takeout) position is one (1) position responsible for making all drinks in the Boba station, plating all the appetizer items in the Side Station, and packing takeout orders in the Packing station according to Din Tai Fung’s established recipes and SOP’s. The Barista / Expo is also responsible for cleaning and maintaining all three stations, taking regular inventory, and restocking necessary items.<br/><br/><em>The Barista / Expo position is a Back of House (Kitchen) position. <br/><br/></em>JOB REQUIREMENTS FOR BARISTA / EXPO (EXPO/TAKEOUT):<br/><br/>We are searching for friendly, energetic, highly motivated people who will thrive in a fast-paced, team-oriented environment.<br/><br/><ul><li>Experience preferred but not required</li><li>Open Availability </li><li>Ability to stand for long periods of time</li><li>Positive and Professional Attitude<br/><br/><br/></li></ul>Note:<br/><br/>This job description in no way states or implies that these are the only duties to be performed by the employee occupying the position. Employees will be required to perform any other job-related duties assigned by their supervisor.<br/><br/><em>Din Tai Fung is an E-Verify and Equal Opportunity Employer and complies with the Fair Chance Initiative. Din Tai Fung is an Equal Employment Opportunity Employer – M/F/D/V<br/><br/></em>As part of our hiring process, all newly hired employees are required to go through E-Verify.<br/><br/>E-Verify is an internet-based system that allows employers to compare information from an employee's Form I-9 to the U.S. Department of Homeland Security and Social Security Administration records. This verification confirms an employee’s eligibility to work in the United States.<br/><br/>Din Tai Fung is committed to employing only individuals who are authorized to work in the United States and who comply with applicable immigration and employment law. As a condition of employment, every individual must provide satisfactory evidence of their identity and legal authority to work in the United States. If the employee cannot verify their right to work in the United States within the time permitted by laws, the Company will be required to terminate their employment immediately.<br/><br/>Applicant must be 18 years of age or older and able to provide documentation to work in the United States legally.", "responsibilities": "The Barista / Expo (Expo/Takeout) position is one (1) position responsible for making all drinks in the Boba station, plating all the appetizer items in the Side Station, and packing takeout orders in the Packing station according to Din Tai Fung’s established recipes and SOP’s. The Barista / Expo is also responsible for cleaning and maintaining all three stations, taking regular inventory, and restocking necessary items.", "qualifications": {"required": "Experience preferred but not required, Open Availability, Ability to stand for long periods of time, Positive and Professional Attitude"}, "skills": [], "postedDate": "2 days ago", "benefits": "Competitive Pay & Benefits, Employer Contribution for individuals and eligible dependents' medical insurance, Dental, Vision, and Life Insurance, Health Savings Account (HSA), Commuter Spending Accounts, 401(k) Plan with company match, Employee Assistance Program, Discounts through BenefitHub, Employee Meal Discounts, Opportunities for growth; we love promoting within!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005395094"}