{"jobTitle": "Buyer", "company": {"name": "Lamsco West, Inc.", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing and Supply Chain", "industry": "Aviation & Aerospace", "description": "<strong>Summary<br/><br/></strong>The <strong>Buyer - Distributed Parts, Chemicals, and Outside Processing</strong> is responsible for procuring C-Class parts, Hardware, Seals, Fasteners, Chemicals, Outside Processing and raw materials as required. The Buyer <strong><em>must be experienced</em></strong> purchasing Aerospace Hardware manufactured by domestic and international sources as well as purchasing from OEM and distribution channels. Capable to read and understand technical specifications and blueprints from Boeing, Northrop, Lockheed, Airbus and other major aerospace standards is required to qualify for this role. Experienced with standard machining, stamping, rolling, forming, manufacturing processes is plus.<br/><br/><strong>Reporting Structure <br/><br/></strong><ul><li>This role reports directly to the Purchasing Supervisor</li><li>Works directly with Engineering Estimators, Product Engineers, Sales and Business Development teams, and Operation team<br/><br/></li></ul><strong>Main Duties And Responsibilities<br/><br/></strong><ul><li>Maintain and grow relationships with suppliers that can best satisfy our material demands, while offering the best quality, price, and lead time</li><li>Responsible for identifying and implementing cost reduction activities</li><li>Support buy/supply/pay practices</li><li>Assist with forecasting components and supplies consumption</li><li>Maintain minimum inventory to support the production schedule, by working with other buyer/planners or operations staff</li><li>Interface with other departments (Shipping, Processing, Engineering, Production Control Quality) to resolve problems within timely resolution</li><li>Demonstrate a commitment to continuous improvement on a daily basis by taking the initiative to resolve purchasing issues by willingly participating with the Production team.</li><li>Develop strong beneficial relationships with all suppliers, while constantly negotiation price and lead time</li><li>Monitor Supplier Performance</li><li>Prepares all required purchase orders and supporting documentation including transaction summaries, price and cost analysis, and negotiation memoranda</li><li>Negotiate and propose beneficial Long-Term Agreements and Contracts</li><li>Work with Production Control and Engineering to solve any material specification issues<br/><br/></li></ul><strong>Additional Comments:</strong> The essential functions have been provided as examples of the type of work performed by employees assigned to this job classification. The Company reserves the right to modify the work assignments and/or to make reasonable accommodations so that qualified employees can perform the essential functions. The job description is not intended to be an all-inclusive list of duties and responsibilities. It is intended to describe the general nature of the position.<br/><br/><strong>Requirements: </strong>Any combination of education and experience providing the required skill and knowledge for successful job performance will be considered. Typical qualifications would be:<br/><br/><ul><li>This position is subject to the International Traffic in Arms Regulations (ITAR) which requires U.S. person status. ITRA defines U.S. person as a U.S. Citizen U.S. Permanent Resident (ie. ‘Green Card Holder’), Political Asylee, or Refugee.</li><li>Bachelor’s degree from an accredited institution or minimum of 2 years of experience in task management, pricing analysis utilizing excel, forecasting requirements, revising and understanding commercial terms and conditions.</li><li>Minimum 3 years of experience purchasing Aerospace Hardware manufactured by domestic and international sources as well as purchasing from OEM and distribution channels such as: fasteners, washers, bushings, bearings, nutplates, etc.</li><li>Capable to read and understand technical specifications and blueprints from Boeing, Northrop, Lockheed, Airbus</li><li>Knowledge of production planning, inventory management, JIT concepts and MRP</li><li>Hands on experience working with a business forecast, production planning or purchasing utilizing excel</li><li>Must have strong Cost/Price analysis skills utilizing excel</li><li>Must be knowledgeable in ITAR, EAR, FAR, DFAR and DPAS requirements</li><li>Proficient in Microsoft Office Suite, including Excel</li><li>Effective interpersonal skills to coordinate efforts and work with other internal and external organizations</li><li>Must be willing to work full-time on site in our facility located in Valencia, California</li><li>Must be willing to visit Suppliers on an occasional basis<br/><br/></li></ul><strong>Some Of Our Competitive Benefits Package Includes<br/><br/></strong><ul><li>Medical, dental, and vision insurance</li><li>Paid vacation for newly hired employees</li><li>401(k) plan that includes employer matching funds</li><li>Life insurance and disability coverage</li><li>And more</li><li>Apply now and be part of the Lamsco Team<br/><br/></li></ul>We provide equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.<br/><br/>This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.", "responsibilities": "The <strong>Buyer - Distributed Parts, Chemicals, and Outside Processing</strong> is responsible for procuring C-Class parts, Hardware, Seals, Fasteners, Chemicals, Outside Processing and raw materials as required. The Buyer <strong><em>must be experienced</em></strong> purchasing Aerospace Hardware manufactured by domestic and international sources as well as purchasing from OEM and distribution channels. Capable to read and understand technical specifications and blueprints from Boeing, Northrop, Lockheed, Airbus and other major aerospace standards is required to qualify for this role. Experienced with standard machining, stamping, rolling, forming, manufacturing processes is plus.<br/><br/><strong>Reporting Structure <br/><br/></strong><ul><li>This role reports directly to the Purchasing Supervisor</li><li>Works directly with Engineering Estimators, Product Engineers, Sales and Business Development teams, and Operation team<br/><br/></li></ul><strong>Main Duties And Responsibilities<br/><br/></strong><ul><li>Maintain and grow relationships with suppliers that can best satisfy our material demands, while offering the best quality, price, and lead time</li><li>Responsible for identifying and implementing cost reduction activities</li><li>Support buy/supply/pay practices</li><li>Assist with forecasting components and supplies consumption</li><li>Maintain minimum inventory to support the production schedule, by working with other buyer/planners or operations staff</li><li>Interface with other departments (Shipping, Processing, Engineering, Production Control Quality) to resolve problems within timely resolution</li><li>Demonstrate a commitment to continuous improvement on a daily basis by taking the initiative to resolve purchasing issues by willingly participating with the Production team.</li><li>Develop strong beneficial relationships with all suppliers, while constantly negotiation price and lead time</li><li>Monitor Supplier Performance</li><li>Prepares all required purchase orders and supporting documentation including transaction summaries, price and cost analysis, and negotiation memoranda</li><li>Negotiate and propose beneficial Long-Term Agreements and Contracts</li><li>Work with Production Control and Engineering to solve any material specification issues<br/><br/></li></ul>", "qualifications": {"required": "This position is subject to the International Traffic in Arms Regulations (ITAR) which requires U.S. person status. ITRA defines U.S. person as a U.S. Citizen U.S. Permanent Resident (ie. ‘Green Card Holder’), Political Asylee, or Refugee.<br/>Bachelor’s degree from an accredited institution or minimum of 2 years of experience in task management, pricing analysis utilizing excel, forecasting requirements, revising and understanding commercial terms and conditions.<br/>Minimum 3 years of experience purchasing Aerospace Hardware manufactured by domestic and international sources as well as purchasing from OEM and distribution channels such as: fasteners, washers, bushings, bearings, nutplates, etc.<br/>Capable to read and understand technical specifications and blueprints from Boeing, Northrop, Lockheed, Airbus<br/>Knowledge of production planning, inventory management, JIT concepts and MRP<br/>Hands on experience working with a business forecast, production planning or purchasing utilizing excel<br/>Must have strong Cost/Price analysis skills utilizing excel<br/>Must be knowledgeable in ITAR, EAR, FAR, DFAR and DPAS requirements<br/>Proficient in Microsoft Office Suite, including Excel<br/>Effective interpersonal skills to coordinate efforts and work with other internal and external organizations<br/>Must be willing to work full-time on site in our facility located in Valencia, California<br/>Must be willing to visit Suppliers on an occasional basis<br/><br/>", "preferred": ""}, "skills": ["ITAR", "EAR", "FAR", "DFAR", "DPAS", "Excel", "Aerospace Hardware", "Purchasing", "OEM", "Blueprints", "Technical Specifications", "Production Planning", "Inventory Management", "JIT", "MRP", "Cost/Price Analysis"], "postedDate": "4 days ago", "benefits": "Medical, dental, and vision insurance<br/>Paid vacation for newly hired employees<br/>401(k) plan that includes employer matching funds<br/>Life insurance and disability coverage<br/>And more<br/>Apply now and be part of the Lamsco Team<br/><br/>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005204929"}