{"jobTitle": "RN Case Manager : Care Transitions CALIFORNIA", "company": {"name": "Molina Healthcare", "industry": "Hospitals and Health Care", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$23.76 - $51.49", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "We are looking for a RN Care Transitions Case Manager who must reside in CALIFORNIA and be able to drive within one of the following county locations: Los Angeles County, San Diego County, San Bernardino County, Riverside County or Sacramento County. We are seeking a RN with a minimum of 1 year hospital experience. Discharge planning and Case Management preferred. Transition Care Case Manager will work in remote and field setting with our Medicaid Population. Excellent computer skills and attention to detail are very important to multitask between systems, talk with members on the phone, and enter accurate contact notes. This is a fast-paced position and productivity is important. Excellent skillset working with EMR's and Microsoft Office. TRAVEL BY CAR WILL BE REQUIRED to do member visits in the surrounding areas. You must be able to do your own driving. A clean DMV driving record, proof of auto insurance, and reliable transportation is required. Home office with internet connectivity of high speed required. You must provide your own home office including desk and chair. Schedule: Monday thru Friday 8:30AM to 5:30PM PACIFIC. Job Description: Molina Healthcare Services (HCS) works with members, providers and multidisciplinary team members to assess, facilitate, plan and coordinate an integrated delivery of care across the continuum, including behavioral health and long-term care, for members with high need potential. HCS staff work to ensure that patients progress toward desired outcomes with quality care that is medically appropriate and cost-effective based on the severity of illness and the site of service.", "responsibilities": "Follows member throughout a 30-day program that starts at hospital admission and continues through transitions from the acute setting to other settings, including nursing facility placement and private home, with the goal of reduced readmissions. Ensures safe and appropriate transitions by collaborating with hospital discharge planners, as well as with hospitalists, outpatient providers, facility staff, and family/support network, as needed or at the request of member. Ensures member transitions to a setting with adequate caregiving and functional support, as well as medical and medication oversight as required. Works with participating ancillary providers, public agencies, or other service providers to make sure necessary services and equipment are in place for a safe transition. Conducts face-to-face visits of all members while in the hospital and home visits of high-risk members post-discharge. Coordinates care and reassesses member's needs using the Coleman Care Transitions Model recommended post-discharge timeline. Educates and supports member focusing on seven primary areas (ToC Pillars): medication management, use of personal health record, follow up care, signs and symptoms of worsening condition, nutrition, functional needs and or Home and Community-based Services, and advance directives. Uses motivational interviewing and Molina clinical guideposts to educate, support and motivate change during member contacts. Assesses for barriers to care, provides care coordination and assistance to member to address concerns. Facilitates interdisciplinary care team meetings and informal ICT collaboration. RNs provide consultation, recommendations, and education as appropriate to non-RN case managers. RNs are assigned cases with members who have complex medical conditions and medication regimens. RNs will conduct medication reconciliation when needed. 40-50% local travel required.", "qualifications": {"required": "Graduate from an Accredited School of Nursing. Bachelor's Degree in Nursing preferred. 1-3 years hospital discharge planning or home health. Active, unrestricted State Registered Nursing (RN) license in good standing. Must have valid driver's license with good driving record and be able to drive within applicable state or locality with reliable transportation.", "preferred": "Bachelor's Degree in Nursing. 3-5 years hospital discharge planning or home health. Active, unrestricted Transitions of Care Sub-Specialty Certification and/or Certified Case Manager (CCM)."}, "skills": [], "postedDate": "3 days ago", "applicationDeadline": "Not specified", "benefits": "Molina Healthcare offers a competitive benefits and compensation package. Molina Healthcare is an Equal Opportunity Employer (EOE) M/F/D/V.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005921302"}