{"jobTitle": "FSQA Manager", "company": {"name": "The Habit Burger Grill", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$130,000.00 to 150,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Restaurants", "description": "<strong>Job Summary<br/><br/></strong><strong> JOB DESCRIPTION <br/><br/></strong>Habit Burger Grill is looking for a Food Safety/Quality Assurance (FSQA) Manager to champion our mission of serving “Taste &amp; Trust in every bite” to our guests. This individual will be responsible for leading the Food Safety and Quality Assurance programs at the Habit Burger, including technical and program management leadership for the FSQA department. Working closely with Yum partners, along with Food Innovation, Operations, Supply Chain, Finance and other internal and external partners, the FSQA Manager assures safe, high-quality products and quality processes by driving compliance and continuous improvement of our Food Safety &amp; Quality Program.<br/><br/><strong>Essential Job Functions<br/><br/></strong><ul><li> Leads the development and implementation of Food Safety and Quality Assurance strategy, goals, and objectives that align with Yum and Habit goals. </li><li> Partners with suppliers and purchasing teams to manage the adherence of Habit Supplier Compliance Requirements (GFSI, GAP, Specifications, RC/CAPAs, etc.). </li><li> Develop Quality Systems Program and Vendor Performance tracking and scorecard program. </li><li> Oversee restaurant and vendor compliance to meet all standards and manage resolution of non-conformances. </li><li> Lead the investigation and root cause analysis of food safety incidents, implementing preventative measures. </li><li> Responsible for quality improvement projects, cost savings projects and alternate vendor approvals working cross-functionally with food and beverage, FSQA, suppliers, distribution, and supply chain. </li><li> Analyze and report Food Safety and Quality data and trends to drive continuous improvement of supplier performance. </li><li> Technical/Risk Assessment subject matter expert on product issues, concerns, product specifications and quality assurance and product evaluation program. </li><li> Develop, edit, and approve all communications related to food safety and quality. </li><li> Lead through partnership with internal key stakeholders to advance food safety initiatives. </li><li> Ensure compliance with all FDA/USDA regulatory guidelines. </li><li> Manage relationships with external regulatory agencies, industry associations, and third-party auditors. </li><li> Ensure internal resources are current with accurate food safety and quality procedures. </li><li> Provides QA support on Crisis Management Team for any product issues/withdrawals. </li><li> Partner with operations to manage escalated issues related to communicable disease, pests, regulatory issues, and restaurant emergency procedures. </li><li> Provide assistance within the QA department as needed. <br/><br/><br/></li></ul><strong>Administrative<br/><br/></strong><ul><li> Ensure proper food safety documentation and reporting is maintained within the QA department. </li><li> Proficient in accurately collecting and documenting large amounts of data/information. <br/><br/><br/></li></ul><strong>Skills And Knowledge Requirements<br/><br/></strong><ul><li> Bachelor’s degree in Food Science, Agriculture, Microbiology, or Health Science/Public Health </li><li> 8 or more years’ experience in fresh produce or meats &amp; dairy Quality and Food Safety role, minimum 2 years supervisory/management experience overseeing direct reports </li><li> Experience working in multi-unit, multi-state QSR strongly preferred </li><li> Previous training, certification (HARPC and FSMA Certification) and experience and strong working knowledge of USDA and FDA Regulations, GAPs, GMPs, Food Code, HARPC and SSOPs </li><li> Current ServSafe Food Safety Manager Certification </li><li> Excellent written and verbal communication skills to effectively collaborate with cross-functional team members (of all seniority levels), suppliers and regulatory officials. </li><li> Excellent project management skills. Must be able to execute projects within timelines and budgets </li><li> Excellent analytical, reasoning, and problem-solving skills </li><li> Computer proficiency including Microsoft Office programs (Word, Excel, Outlook and PowerPoint), generating reports and ability to learn software applications </li><li> Ability to comprehend and apply the applicable laws, guidelines, regulations, ordinances, and policies. </li><li> Excellent customer service skills by being supportive, remaining in a calm and controlled manner while providing guidance in a variety of situations. </li><li> Preferred: Certified Quality Auditor (ASQ), Global GAP Training </li><li> Preferred: Demonstrated success in Performance Management </li><li> Some travel may be required by both air and car </li><li> Ideally work from the Irvine RSC 4 - 5 days a week <br/><br/><br/></li></ul><strong>Compensation<br/><br/></strong>Salary Range: $130,000.00 to 150,000.00 annually + bonus eligibility. <strong>This is the expected salary range for this position. Ultimately, in determining pay, we'll consider the successful candidate’s location, experience, and other job-related factors.<br/><br/></strong>At Yum! Brands and at The Habit Restaurants, LLC, one of our core values is to Believe in ALL People. This means seeing the value in everyone and unlocking their full potential to be their best self. The Habit Restaurants, LLC is proud to be an equal opportunity employer and is committed to equity, inclusion, and belonging for all dimensions of diversity. We do not discriminate based on race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, disability status, age, or any other protected characteristic. We are committed to working with and providing reasonable accommodation to applicants with disabilities or special needs.<br/><br/>US Job Seekers/Employees - Click here to view the “Know Your Rights” poster and supplement and the Pay Transparency Policy Statement.<br/><br/>Employment eligibility to work with Yum! in the U.S. is required as the company will not pursue visa sponsorship for this position.<br/><br/><strong>Benefits<br/><br/></strong><ul><li> Competitive base pay with benefits including:</li><ul><li> Up to 4 weeks of vacation per year plus additional sick days </li><li> Up to 10 Paid Holidays + 1 Floating holidays </li><li> The company provided Recharge Days to unplug and reenergize </li><li> Flexible Hybrid Work Environment </li><li> Competitive bonus program for eligible roles </li><li> Recognition-based culture. <br/><br/></li></ul></ul><strong>Family Benefits<br/><br/></strong><ul><li> Onsite childcare through Bright Horizons </li><li> Comprehensive medical, dental, and vision benefits including prescription drug benefits &amp; 100% preventative care starting on Day 1 </li><li> Healthcare and dependent care flexible spending accounts </li><li> Employee Assistance Program available to all employees and their dependents </li><li> Bereavement time off <br/><br/><br/></li></ul><strong>Additional Perks<br/><br/></strong><ul><li> Onsite gym with brand new equipment and fitness classes </li><li> 401(k) benefit plan with a 6% matching contribution </li><li> Up to 2 Paid Days to Volunteer for any non-profit or charitable organization important to you </li><li> Access to LinkedIn Learning <br/><br/><br/></li></ul><strong>NOTE: This job description is not intended to be all-inclusive. Team Members may perform other related duties as negotiated to meet the ongoing needs of the organization. <br/><br/></strong><strong>About Us<br/><br/></strong>WHO WE ARE?<br/><br/>HABIT stands for Hospitality, Attitude, Be Your Best, Integrity and Teamwork. At the Habit Burger Grill, our people make the difference, which is why since 1969, we’ve prided ourselves on being a people-first culture where each of us are celebrated for bringing our own unique flavor to the table. Our mission is to foster an environment where everyone feels like they are part of The Habit Family through One Habit, One Heart.<br/><br/>The Habit Burger Grill is a burger-centric, fast-casual restaurant concept that specializes in preparing fresh, cooked-to-order chargrilled burgers and handcrafted sandwiches featuring USDA choice tenderloin beef, grilled chicken and sushi-grade Ahi tuna cooked over an open flame. In addition, it features fresh-cut salads and an appealing selection of sides and shakes. The Habit Burger Grill was named the “best tasting burger in America” in July 2014 in a comprehensive survey conducted by one of America's leading consumer magazines.", "responsibilities": "Leads the development and implementation of Food Safety and Quality Assurance strategy, goals, and objectives that align with Yum and Habit goals. Partners with suppliers and purchasing teams to manage the adherence of Habit Supplier Compliance Requirements (GFSI, GAP, Specifications, RC/CAPAs, etc.). Develop Quality Systems Program and Vendor Performance tracking and scorecard program. Oversee restaurant and vendor compliance to meet all standards and manage resolution of non-conformances. Lead the investigation and root cause analysis of food safety incidents, implementing preventative measures. Responsible for quality improvement projects, cost savings projects and alternate vendor approvals working cross-functionally with food and beverage, FSQA, suppliers, distribution, and supply chain. Analyze and report Food Safety and Quality data and trends to drive continuous improvement of supplier performance. Technical/Risk Assessment subject matter expert on product issues, concerns, product specifications and quality assurance and product evaluation program. Develop, edit, and approve all communications related to food safety and quality. Lead through partnership with internal key stakeholders to advance food safety initiatives. Ensure compliance with all FDA/USDA regulatory guidelines. Manage relationships with external regulatory agencies, industry associations, and third-party auditors. Ensure internal resources are current with accurate food safety and quality procedures. Provides QA support on Crisis Management Team for any product issues/withdrawals. Partner with operations to manage escalated issues related to communicable disease, pests, regulatory issues, and restaurant emergency procedures. Provide assistance within the QA department as needed. Ensure proper food safety documentation and reporting is maintained within the QA department. Proficient in accurately collecting and documenting large amounts of data/information.", "qualifications": {"required": "Bachelor’s degree in Food Science, Agriculture, Microbiology, or Health Science/Public Health 8 or more years’ experience in fresh produce or meats &amp; dairy Quality and Food Safety role, minimum 2 years supervisory/management experience overseeing direct reports Experience working in multi-unit, multi-state QSR strongly preferred Previous training, certification (HARPC and FSMA Certification) and experience and strong working knowledge of USDA and FDA Regulations, GAPs, GMPs, Food Code, HARPC and SSOPs Current ServSafe Food Safety Manager Certification Excellent written and verbal communication skills to effectively collaborate with cross-functional team members (of all seniority levels), suppliers and regulatory officials. Excellent project management skills. Must be able to execute projects within timelines and budgets Excellent analytical, reasoning, and problem-solving skills Computer proficiency including Microsoft Office programs (Word, Excel, Outlook and PowerPoint), generating reports and ability to learn software applications Ability to comprehend and apply the applicable laws, guidelines, regulations, ordinances, and policies. Excellent customer service skills by being supportive, remaining in a calm and controlled manner while providing guidance in a variety of situations.", "preferred": "Certified Quality Auditor (ASQ), Global GAP Training Demonstrated success in Performance Management Some travel may be required by both air and car Ideally work from the Irvine RSC 4 - 5 days a week"}, "skills": ["Food Safety", "Quality Assurance", "USDA", "FDA", "GMPs", "HARPC", "SSOPs", "ServSafe", "Project Management", "Microsoft Office", "Customer Service"], "postedDate": "2 days ago", "benefits": "Competitive base pay with benefits including: Up to 4 weeks of vacation per year plus additional sick days Up to 10 Paid Holidays + 1 Floating holidays The company provided Recharge Days to unplug and reenergize Flexible Hybrid Work Environment Competitive bonus program for eligible roles Recognition-based culture. Onsite childcare through Bright Horizons Comprehensive medical, dental, and vision benefits including prescription drug benefits &amp; 100% preventative care starting on Day 1 Healthcare and dependent care flexible spending accounts Employee Assistance Program available to all employees and their dependents Bereavement time off Onsite gym with brand new equipment and fitness classes 401(k) benefit plan with a 6% matching contribution Up to 2 Paid Days to Volunteer for any non-profit or charitable organization important to you Access to LinkedIn Learning", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005131311"}