{"jobTitle": "Project Coordinator", "company": {"name": "Gallagher", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Other", "industry": "Insurance", "description": "<strong>Introduction<br/><br/></strong>Discover a world of endless possibilities at Gallagher Benefit Services, where you'll have the power to shape the future of workplaces across industries. As a member of our team, you become the driving force behind positive change, helping clients build environments where employees thrive. Embrace the opportunity to impact lives, unlock potential, and create a legacy of remarkable transformation.<br/><br/>We believe that every candidate brings something special to the table, including you! So, even if you feel that you’re close but not an exact match, we encourage you to apply.<br/><br/><strong>How You'll Make An Impact<br/><br/></strong>The Branch Client Service Associate I is accountable for delivering high quality and efficient service to both internal and external clients by assisting with the Branch's overall workflow processes and providing routine client support. This role reports directly into either the Branch Client Service Management Manager or the Branch Client Service Supervisor. The Branch Client Service Associate I contributes to key business outcomes such as client retention, client satisfaction, enhancing AJG's value to our clients and prospects, achieving operating/margin targets and fostering a culture of performance and continuous improvement. Supporting the business priorities of Production team members and the Client Service function. Adhering to efficiency/productivity and process standards such as data and documents requirements, timelines, tool usage, etc. Assists with the Branch's overall workflow processes. Creates documents, certificates, etc. using appropriate systems and resources, which may include communications, forms, certificates, reports, etc.<br/><br/><strong>About You<br/><br/></strong>Required: High School diploma/equivalent plus 1 year directly applicable experience. Proficiency in Microsoft Office and basic math skills.<br/><br/>Preferred: Associate's degree, professional certification, or equivalent training and experience preferred. Previous experience managing client relationships.<br/><br/>Behaviors: Exceptional organizational skills, Proficient in using technology as a tool to maximize productivity and quality. Strong written and verbal communication skills.<br/><br/><strong>Compensation And Benefits<br/><br/></strong>On top of a competitive salary, great teams and exciting career opportunities, we also offer a wide range of benefits.<br/><br/>Below are the <strong>minimum core benefits</strong> you’ll get, depending on your job level these benefits may improve:<br/><br/><ul><li>Medical/dental/vision plans, which start from day one!</li><li>Life and accident insurance</li><li>401(K) and Roth options</li><li>Tax-advantaged accounts (HSA, FSA)</li><li>Educational expense reimbursement</li><li>Paid parental leave<br/><br/></li></ul><strong>Other benefits include:<br/><br/></strong><ul><li>Digital mental health services (Talkspace)</li><li>Flexible work hours (availability varies by office and job function) </li><li>Training programs</li><li>Gallagher Thrive program – elevating your health through challenges, workshops and digital fitness programs for your overall wellbeing</li><li>Charitable matching gift program</li><li>And more... <br/><br/></li></ul><strong>We value inclusion and diversity<br/><br/></strong>Click Here to review our U.S. Eligibility Requirements<br/><br/>Inclusion and diversity (I&amp;D) is a core part of our business, and it’s embedded into the fabric of our organization. For more than 95 years, Gallagher has led with a commitment to sustainability and to support the communities where we live and work.<br/><br/>Gallagher embraces our employees’ diverse identities, experiences and talents, allowing us to better serve our clients and communities. We see inclusion as a conscious commitment and diversity as a vital strength. By embracing diversity in all its forms, we live out The Gallagher Way to its fullest.<br/><br/>Gallagher believes that all persons are entitled to equal employment opportunity and prohibits any form of discrimination by its managers, employees, vendors or customers based on race, color, religion, creed, gender (including pregnancy status), sexual orientation, gender identity (which includes transgender and other gender non-conforming individuals), gender expression, hair expression, marital status, parental status, age, national origin, ancestry, disability, medical condition, genetic information, veteran or military status, citizenship status, or any other characteristic protected (herein referred to as “protected characteristics”) by applicable federal, state, or local laws.<br/><br/>Equal employment opportunity will be extended in all aspects of the employer-employee relationship, including, but not limited to, recruitment, hiring, training, promotion, transfer, demotion, compensation, benefits, layoff, and termination. In addition, Gallagher will make reasonable accommodations to known physical or mental limitations of an otherwise qualified person with a disability, unless the accommodation would impose an undue hardship on the operation of our business.", "responsibilities": "The Branch Client Service Associate I is accountable for delivering high quality and efficient service to both internal and external clients by assisting with the Branch's overall workflow processes and providing routine client support. This role reports directly into either the Branch Client Service Management Manager or the Branch Client Service Supervisor. The Branch Client Service Associate I contributes to key business outcomes such as client retention, client satisfaction, enhancing AJG's value to our clients and prospects, achieving operating/margin targets and fostering a culture of performance and continuous improvement. Supporting the business priorities of Production team members and the Client Service function. Adhering to efficiency/productivity and process standards such as data and documents requirements, timelines, tool usage, etc. Assists with the Branch's overall workflow processes. Creates documents, certificates, etc. using appropriate systems and resources, which may include communications, forms, certificates, reports, etc.", "qualifications": {"required": "High School diploma/equivalent plus 1 year directly applicable experience. Proficiency in Microsoft Office and basic math skills.", "preferred": "Associate's degree, professional certification, or equivalent training and experience preferred. Previous experience managing client relationships."}, "skills": ["Microsoft Office"], "postedDate": "2 days ago", "benefits": "On top of a competitive salary, great teams and exciting career opportunities, we also offer a wide range of benefits.<br/><br/>Below are the <strong>minimum core benefits</strong> you’ll get, depending on your job level these benefits may improve:<br/><br/><ul><li>Medical/dental/vision plans, which start from day one!</li><li>Life and accident insurance</li><li>401(K) and Roth options</li><li>Tax-advantaged accounts (HSA, FSA)</li><li>Educational expense reimbursement</li><li>Paid parental leave<br/><br/></li></ul><strong>Other benefits include:<br/><br/></strong><ul><li>Digital mental health services (Talkspace)</li><li>Flexible work hours (availability varies by office and job function) </li><li>Training programs</li><li>Gallagher Thrive program – elevating your health through challenges, workshops and digital fitness programs for your overall wellbeing</li><li>Charitable matching gift program</li><li>And more... <br/><br/></li></ul>", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4005226128"}