{"jobTitle": "Production Coordinator", "company": {"name": "TalentBurst, an Inc 5000 company", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Not specified", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "$20.00/hr - $22.00/hr", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Staffing and Recruiting", "description": "Production Coordinator\nSanta Monica, CA 90404\n4+ Months\nDuties:\n- Support for planning, scheduling, and for monitoring all aspects of production\n- Maintaining clear communication between the Creative, Marketing, A&R, Manufacturing and Production Departments as well as any additional outside design, pre-press and print vendors to ensure timely delivery of all projects.\n- Intensive data input and management of scheduling systems.\n- Learn and master various client specific proprietary software programs\n- Other duties as assigned by company management.", "responsibilities": "Support for planning, scheduling, and for monitoring all aspects of production. Maintaining clear communication between the Creative, Marketing, A&R, Manufacturing and Production Departments as well as any additional outside design, pre-press and print vendors to ensure timely delivery of all projects. Intensive data input and management of scheduling systems. Learn and master various client specific proprietary software programs. Other duties as assigned by company management.", "qualifications": {"required": "Minimum 2 year of experience production or similar role. Must be able to meet deadlines. Ability to multi-task and juggle competing priorities. Must be a critical, agile and creative thinker. Computer experience: Internet research, Microsoft Word, Excel, Outlook, Zoom. Computer savvy in general– competence in mastering new programs and software. Technology-minded. Must have excellent verbal, written, and interpersonal communication skills. Highly motivated and with a desire to work in a team environment. Ability to keep information confidential. Must be self-directed, well organized, possess high attention to detail and good follow-through.", "preferred": ""}, "skills": ["Minimum 2 year of experience production or similar role", "Must be able to meet deadlines", "Ability to multi-task and juggle competing priorities", "Must be a critical, agile and creative thinker", "Computer experience: Internet research, Microsoft Word, Excel, Outlook, Zoom", "Computer savvy in general– competence in mastering new programs and software", "Technology-minded", "Must have excellent verbal, written, and interpersonal communication skills", "Highly motivated and with a desire to work in a team environment", "Ability to keep information confidential", "Must be self-directed, well organized, possess high attention to detail and good follow-through."], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4005390100"}