{"jobTitle": "Sales Account Coordinator - Hollywood", "company": {"name": "Nadel", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Advertising Services", "description": "We are looking for a Sales Account Coordinator to join our Hollywood team to work 100% in an office setting!\n\nAt Nadel, you'll join a company that has the feel of a start-up, but with the stability of an established business. Founded over 60 years ago, Nadel continues to be a leader in its industry. We do what we love, and we love what we do! From the moment we wake up to the moment we fall asleep, our goals are simple: To design and produce dynamic materials for our clients.\n\nWHAT WE OFFER\nWork with us and you’ll quickly find that we are different… in a very good way. Our unique culture starts with our goal to be great. We’re not just here to help our clients’ success – we’re here to help them transform their businesses. Simply put, our services are marketing oriented, rather than product oriented. At Nadel it’s about more than just printing logos on products; it’s about problem solving, exceeding client goals and objectives and always delivering on target and on budget.\n\nYou can expect:\n* Entrepreneurial environment\n* Focus on innovation + customer value\n* Dynamic, work-hard, play-hard collaborative culture\n* Career development opportunities\n* Casual dress\n* Company team events\n\nTHE BASICS\nThis person will work on a wide variety of projects in a fast-paced environment. The Ideal candidate must have a high level of energy and professionalism, think critically, feel confident and comfortable handling multiple tasks, and not be afraid to ask questions. They must also have excellent customer service skills, strong written/verbal skills, be extremely detail-oriented, and have a positive 'can do' attitude.\n\nWHAT YOU'LL DO:\n* Handle all orders from order placement until the product is in the client's hands. This includes but is not limited to, verifying pricing, following up with manufacturers, and tracking orders through delivery.\n* Under the direction of the Sales Consultant, place and follow up on sample orders, project specifications, and client requests.\n* Assist Sales Consultants as needed and provide self-directed, backup client contact when Sales Consultant is out of the office or unavailable.\n* Work directly with Sales Consultants, internal e-commerce team, Clients, and Vendors to ensure proper creation of websites, ongoing customer service, and inventory management.\n* Manage inventory by ensuring quantities on hand are accurate, setting up “triggers” to identify products with low stock, and working with Sales Consultants for approval on product reorders.\n* Constantly monitor product sales and inventory numbers, analyze trends and draw conclusions to determine product reorders, best-selling categories, determine invoicing on purchases and warehousing fees, and other actions by running and analyzing month-end reports\n* Develop materials such as sales letters, PowerPoint presentations, and Microsoft Word proposals for presentation to clients.\n* Drive product research.\n* Maintain great customer service and pleasant communication with all new and existing clients.\n* Manage fulfillment projects as needed.\n* Coordinate with corporate staff (Billing, Accounts Receivable, Accounts Payable, etc.) on client accounts (invoices, aging, etc), billing, and technical issues and confirm Client expectations are being met.\n* Deliver professional, friendly, and timely service to Clients and their employees, addressing any issues and providing problem resolution.\n\nWE'RE LOOKING FOR SOMEONE WITH:\n* Proven ability to work independently in a fast-paced environment; think critically; manage multiple priorities and adhere to strict deadlines.\n* Possess superior customer service skills.\n* Must be highly detail-oriented and very organized with the ability to adapt to a changing environment while following tasks through to completion.\n* Reliable, positive, and professional attitude.\n* Proactive with a team-player outlook.\n* Outgoing, friendly, and approachable personality\n* Excellent phone skills with strong email and writing etiquette.\n* Proficient with Microsoft Word, Excel, and PowerPoint.\n* Skills in Adobe Photoshop and Illustrator\n\nPromotional Product Industry Experience: Minimum 2 years (preferred)\n\nRange: $28-$33 per hour\n\nNadel provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. You may read Equal Employment Opportunity is the Law by clicking on the corresponding link.\n\nNadel is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, you may contact us at hrhelp@nadel.com.\n\nBy submitting your application, you acknowledge and confirm that you have received, read and understand Nadel’s Applicant Privacy Notice and hereby authorize and consent to the Company's use of the personal information and sensitive personal information it collects, receives or maintains for the business purposes identified in disclosure.", "responsibilities": "This person will work on a wide variety of projects in a fast-paced environment. The Ideal candidate must have a high level of energy and professionalism, think critically, feel confident and comfortable handling multiple tasks, and not be afraid to ask questions. They must also have excellent customer service skills, strong written/verbal skills, be extremely detail-oriented, and have a positive 'can do' attitude.\n\nWHAT YOU'LL DO:\n* Handle all orders from order placement until the product is in the client's hands. This includes but is not limited to, verifying pricing, following up with manufacturers, and tracking orders through delivery.\n* Under the direction of the Sales Consultant, place and follow up on sample orders, project specifications, and client requests.\n* Assist Sales Consultants as needed and provide self-directed, backup client contact when Sales Consultant is out of the office or unavailable.\n* Work directly with Sales Consultants, internal e-commerce team, Clients, and Vendors to ensure proper creation of websites, ongoing customer service, and inventory management.\n* Manage inventory by ensuring quantities on hand are accurate, setting up “triggers” to identify products with low stock, and working with Sales Consultants for approval on product reorders.\n* Constantly monitor product sales and inventory numbers, analyze trends and draw conclusions to determine product reorders, best-selling categories, determine invoicing on purchases and warehousing fees, and other actions by running and analyzing month-end reports\n* Develop materials such as sales letters, PowerPoint presentations, and Microsoft Word proposals for presentation to clients.\n* Drive product research.\n* Maintain great customer service and pleasant communication with all new and existing clients.\n* Manage fulfillment projects as needed.\n* Coordinate with corporate staff (Billing, Accounts Receivable, Accounts Payable, etc.) on client accounts (invoices, aging, etc), billing, and technical issues and confirm Client expectations are being met.\n* Deliver professional, friendly, and timely service to Clients and their employees, addressing any issues and providing problem resolution.", "qualifications": {"required": "Proven ability to work independently in a fast-paced environment; think critically; manage multiple priorities and adhere to strict deadlines.\nPossess superior customer service skills.\nMust be highly detail-oriented and very organized with the ability to adapt to a changing environment while following tasks through to completion.\nReliable, positive, and professional attitude.\nProactive with a team-player outlook.\nOutgoing, friendly, and approachable personality\nExcellent phone skills with strong email and writing etiquette.\nProficient with Microsoft Word, Excel, and PowerPoint.\nSkills in Adobe Photoshop and Illustrator", "preferred": "Promotional Product Industry Experience: Minimum 2 years"}, "skills": ["Customer Service", "Microsoft Word", "Excel", "PowerPoint", "Adobe Photoshop", "Adobe Illustrator"], "postedDate": "2 days ago", "salary": {"amount": "28-$33", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005111608"}