{"jobTitle": "Restaurant Team Member", "company": {"name": "Shake Shack", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "Average Rate: $23.00 / hour* (*Average rate includes hourly wage + average hourly tip earnings)<br/><br/><strong>What’s in it for YOU? <br/><br/></strong>Have fun and work hard! As a Shack Team Member, you will be a valued and integral part of our team from Day One. You will have the opportunity to train on every station in the Shack while increasing your responsibility and pay. We value learning &amp; development and provide the ability to grow your career toward Shack Trainer, Cross Trainer, Shift Manager, and beyond at your own pace! <strong>In addition to your hourly base pay, you’ll also have the opportunity to earn tips by showcasing your uplifting hospitality skills!<br/><br/></strong><ul><li>A work environment where you can come as you are, share your ideas, have fun, and work collaboratively</li><li>Competitive rates &amp; weekly pay</li><li>Medical, Dental, &amp; Vision Insurance plan options to fit your needs*</li><li>Discount Programs for Transit, Corporate Fitness, &amp; more</li><li>401k Plan with Company Match*</li><li>Vacation + Wellness time*</li><li>Employee Dining Discount Program </li><li>Referral Bonus for bringing new members in to the #ShackFam</li><li>Online Training Program &amp; access to self-development tools and resources</li><li>Flexible scheduling and self-paced growth opportunities</li><li>Dependent on eligibility<br/><br/></li></ul><strong>What do you bring to the table? <br/><br/></strong>We don’t just value the great work you do, we value the great way you do it! 49% is the stuff you do, 51% is the awesome attitude with which you do it. We are seeking positive and enthusiastic full-time and part-time entry-level team members to join our dynamic team! <br/><br/><ul><li>Previous hospitality and/or food service experience is a plus, though not required – we’ll teach you the rest! </li><li>Motivated to learn quickly and grow in a professional, team-oriented environment. </li><li>We are fast-paced and looking for people who are quick thinkers, committed, and excited to hit the ground running!<br/><br/></li></ul>This is an entry level opportunity with no previous experience required! All you need is the motivation to learn and grow in a professional, fast paced, team-oriented environment! We will provide you with all the tools necessary for a successful Shacksperience, with hands-on training, online learning modules, and a structured path to grow your career.<br/><br/><strong>Job Responsibilities<br/><br/></strong><ul><li>Food prep, customer service, guest interactions, cooking, and cleaning</li><li>Delivering exceptional hospitality to our guests</li><li>Balancing high volume with high quality</li><li>Participating in ongoing training and development<br/><br/></li></ul><strong>Job Qualifications<br/><br/></strong><ul><li>Ability to learn quickly in fast-paced, high volume environment</li><li>Self-motivated achiever interested in taking on additional roles and responsibilities</li><li>Open availability and flexibility is a must – ability to work any shift<br/><br/></li></ul><strong>About Us<br/><br/></strong>Shake Shack is a modern day “roadside” burger stand serving deliciously classic burgers, fries, hot dogs, frozen custard, beer, wine, &amp; more. With our fresh, simple, high-quality food at a great value, Shake Shack is a fun and lively community-gathering place with widespread appeal. Our unique and inspiring culture invites and nurtures motivated people who aspire to be our future leaders. Beginning as a hot dog cart in New York City’s Madison Square Park, Shake Shack has expanded to 330+ locations nationwide and is still growing!<br/><br/><strong>Shake Shack is an Equal Opportunity Employer  <br/><br/></strong>All qualified applicants will receive consideration for employment without regard to race, color, ancestry, national origin, religion, creed, age (over 40), disability (mental and physical), sex, gender identity, sexual orientation, gender expression, medical condition, genetic information, marital, military and veteran status.<br/><br/>Our company will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable laws.<br/><br/>This job opportunity is available on an ongoing basis and there is no deadline for application submissions – we are always hiring Team Members!", "jobFunction": "Management and Manufacturing", "industry": "Hospitality", "postedDate": "4 days ago", "benefits": "A work environment where you can come as you are, share your ideas, have fun, and work collaboratively, Competitive rates &amp; weekly pay, Medical, Dental, &amp; Vision Insurance plan options to fit your needs*, Discount Programs for Transit, Corporate Fitness, &amp; more, 401k Plan with Company Match*, Vacation + Wellness time*, Employee Dining Discount Program, Referral Bonus for bringing new members in to the #ShackFam, Online Training Program &amp; access to self-development tools and resources, Flexible scheduling and self-paced growth opportunities, Dependent on eligibility", "remoteWork": "No", "skills": [], "url": "https://www.linkedin.com/jobs/view/4005305812"}