{"jobTitle": "Administrative Assistant III- Instructional Support Services", "company": {"name": "North Orange County Community College District", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Higher Education", "description": "<strong>North Orange County Community College District<br/><br/></strong><strong>Position Number:</strong> 2015739P<br/><br/><strong>Location:</strong> Fullerton College<br/><br/><strong>Department:</strong> FC Technology &amp; Engineering<br/><br/><strong>Percentage of Employment:</strong> 100%<br/><br/><strong>Months of Employment:</strong> 12 Months Per Year<br/><br/><strong>Work Schedule:</strong> Monday- Friday, 8:00 AM - 5:00 PM (Schedule and shift are subject to change in accordance with department needs.)<br/><br/><strong>Job Description<br/><br/></strong>Perform advanced administrative duties independently and/or at the direction of the Dean of an instructional division within a college or institution or noncredit equivalent; manage daily activities to assure efficient operations; provide information and interact on a daily basis to faculty, staff, students, and the public; answer questions and resolve problems requiring specialized and extensive knowledge of assigned area; address student concerns, including sensitive and complicated issues.<br/><br/>Prepare and maintain class schedules, staff assignments, room assignments, textbook orders, audio-visual, computer equipment, and associated paperwork; assist instructors with preparation of curriculum, forms, applications, and testing materials; ensure classrooms and instructional areas are maintained; assist with probationary tenure reviews; may provide assistance in prerequisite clearance for registration.<br/><br/>Provide support for state mandated reports (e.g., Apportionment Attendance – 320 report) including identifying errors, correcting data, updating Banner with correct coding, providing feedback and/or training for peers and new staff related to course scheduling and/or Banner coding; process reports for hybrid and online courses, making corrections as needed; assist with resolving complex scheduling errors as it relates to state mandated reporting; review information, identify discrepancies and complete analysis of data to ensure accuracy and compliance with applicable policy and regulations and resolve appropriately.<br/><br/>Attend and lead regularly scheduled meetings to maintain knowledge of best practices for data management related to the collection of data intended for the Apportionment Attendance Report system and/or other data related systems; attend District meetings and/or training related to faculty data entry in Banner, learn new processes, and provide feedback; work closely with the District Institutional Research and Planning department to ensure data quality.<br/><br/>Plan and organize special projects, committees, receptions and events as assigned; maintain calendar of activities, events and special meetings; schedule appointments and meetings; prepare agenda items and materials as required; attend meetings and transcribe and distribute minutes. Serve as a liaison with internal and external partners as appropriate in the execution of assigned responsibilities.<br/><br/>Assist in the compilation and preparation of budgets; maintain department expenditures and budgets; approve expenditures within established guidelines; provide budget updates, summaries, and recommendations to appropriate department faculty/staff; calculate and submit time sheets; respond to inquiries regarding financial issues.<br/><br/>Maintain confidential records, including information regarding Board, District, personnel, student, or controversial matters; input and retrieve data as required. Develop, maintain and update specialized and custom forms, databases, logs, files, schedules, lists, certificates, records and reports to support work processes in areas of assigned responsibility.<br/><br/>Compose and prepare correspondence independently; format presentations and reports; develop and revise schedules and forms; compile and prepare complex and difficult statistical and narrative reports from a variety of sources; greet visitors and direct to appropriate personnel; initiate and answer telephone calls; screen and direct calls; receive, open, prioritize, and route mail.<br/><br/>Order supplies and equipment, prepare purchase requisitions or other documents related to grants and/or contracts; track orders to assure delivery and payment; process facilities maintenance requests.<br/><br/>Provide functional work direction to other administrative support staff in area of assignment. Train and provide work direction and guidance to others as directed.<br/><br/>Learns and applies emerging technologies and advances as necessary to perform duties in an efficient, organized, and timely manner.<br/><br/>Participate in District/College efforts to increase the diversity of faculty and staff and to address student achievement gaps; active assistance in the creation of a welcoming and inclusive work and educational environment; attend and participate in diversity, equity and inclusion trainings and events.<br/><br/>Performs related duties as assigned.<br/><br/><strong>Primary Purpose<br/><br/></strong>This position is responsible for performing a wide variety of comprehensive, complex, and specialized administrative duties to support the Dean of an instructional division or noncredit equivalent and manage office functions to assure efficient operations. This requires specialized knowledge in the functional area supported.<br/><br/><strong>Working Relationships<br/><br/></strong>The Administrative Assistant III – Instructional Support Services maintains frequent contact with various District departments and personnel, faculty, students and the public.<br/><br/><strong>Knowledge, Skills, And Abilities<br/><br/></strong>Knowledge of District organization, operations, policies and objectives<br/><br/>Knowledge of applicable sections of State Education Code and other applicable laws<br/><br/>Knowledge of organization, policies, and rules of assigned department or program<br/><br/>Knowledge of modern office practices, procedures and equipment<br/><br/>Knowledge of record-keeping techniques<br/><br/>Knowledge of basic bookkeeping procedures<br/><br/>Knowledge of correct English usage, grammar, spelling, punctuation, and<br/><br/>vocabulary<br/><br/>Knowledge of various computer software applications<br/><br/>Ability to interpret, apply and explain rules, regulations, policies and procedures<br/><br/>Ability to make arithmetic calculations quickly and accurately<br/><br/>Ability to type at 60 wpm from clear copy<br/><br/>Ability to operate a variety of office equipment such as calculator, computer,<br/><br/>copier, etc.<br/><br/>Ability to analyze situations accurately and adopt an effective course of action<br/><br/>Ability to plan, organize and prioritize work<br/><br/>Ability to work independently with little direction<br/><br/>Ability to complete work efficiently with many interruptions<br/><br/>Ability to work confidentially with discretion<br/><br/>Ability to meet schedules and timelines<br/><br/>Ability to understand and follow oral and written directions<br/><br/>Ability to communicate effectively, both orally and in writing<br/><br/>Ability to understand scope of authority in making independent decisions<br/><br/>Ability to review situations accurately and determine appropriate action according to established guidelines<br/><br/>Ability to establish and maintain effective working relationships with others<br/><br/><strong>Special Requirements<br/><br/></strong>This position requires a valid driver’s license. Incumbent may be required to travel off site for business reasons. All employees driving personal, leased, or district-owned vehicles for District related activities must certify possession of a valid Driver’s License. Employees must certify that personal vehicles are covered by automobile insurance as required by California law. (Administrative Procedure 7400, Section 4.0) <strong>If selected as a finalist and/or given an offer of employment for this position, you will be required to provide your valid Driver’s License information. Human Resources will contact the finalist to obtain this required documentation at that phase of the recruitment.<br/><br/>If selected as a finalist, a current three (3) year DMV Driving Record will be accessed and evaluated by the District.<br/><br/></strong>Coursework must be verifiable on a legible transcript. <strong>If selected as a finalist and/or given an offer of employment for this position, you will be required to provide a transcript (may be unofficial). Human Resources will contact the finalist to obtain this required documentation at that phase of the recruitment.<br/><br/></strong><strong>Minimum Qualifications<br/><br/></strong>High school diploma or GED, one (1) year of college-level course work.<br/><br/>Minimum four (4) years of administrative experience; may be supplemented by college courses.<br/><br/>Commitment to diversity. All applicants must have demonstrated sensitivity to and understanding of the diverse academic, socioeconomic, cultural, disability, gender, gender identity, sexual orientation, and ethnic backgrounds of community college students, faculty and staff. The applicant must be able to demonstrate how their experience with these factors relates to successfully achieving the goals of the position.<br/><br/><strong>Desirable Qualifications<br/><br/></strong>Experience working both collaboratively as part of a team and independently with minimal supervision.<br/><br/>Experience managing multiple complex tasks or projects simultaneously.<br/><br/>Experience working collaboratively to remove barriers that impede student and/or program success and implement constructive approaches which support desired outcomes.<br/><br/>Prior experience in approaching work and interactions with colleagues and/or students in an equity minded manner. Ability to provide an inclusive and welcoming work/educational environment.<br/><br/><strong>Working Conditions<br/><br/></strong>College or District office environment; subject to constant interruptions and frequent interaction with others; sitting for long periods at a time (up to 2-3 hours); repetitive use of upper extremities including hand coordination activities.<br/><br/><strong>Salary Range:</strong> $6,191 - $7,479 Per Month<br/><br/><strong>Open Date:</strong> 08/05/2024<br/><br/><strong>Close Date:</strong> 08/26/2024<br/><br/><strong>Special Instructions Summary<br/><br/></strong><strong>Work Schedule: District employees can apply for the Flexible/Hybrid Work Program, working a hybrid schedule of remote work and in-person each week. Approval and number of in-person days may vary by position/department. Questions regarding the work schedule may be discussed with Hiring Manager if selected as an interview candidate.<br/><br/></strong>This is a classified position subject to a one-year probationary period. Initial salary placement will be determined by the Office of Human Resources in accordance with Board Policy and is not negotiable. The candidate selected for employment will be required to provide the following: identification and employment eligibility as outlined in the Immigration Reform and Control Act, fingerprints and required medical certification pursuant to statue. NOCCCD will not sponsor any visa applications.<br/><br/>The District may choose to fill one or more positions from this recruitment within six (6) months.<br/><br/>To ensure consistency and fairness to all applicants, please do not submit materials in addition to those requested. Additional materials will not be considered or returned. Be sure to complete all questions and sections of the application. For questions which may not apply, indicate “N/A” (not applicable). Do not use terms such as “see resume” or “see attached”.<br/><br/>The minimum required number of references for this position is three (3) and will be requested at the finalist and/or offer of employment phase of the hiring process.<br/><br/>All applications will be screened under a process of utmost confidentiality by a committee of representatives from the college community. Possession of the minimum qualifications does not ensure an interview.<br/><br/>Minimum Qualifications – Experience: One year of experience is equivalent to 12 months of experience at a maximum of 40 hours per week (full time). Applicable part-time experience will be converted to the full-time equivalent for the sole purpose of meeting the experience minimum qualification (Example: Twelve (12) months of part time work experience is equivalent to six (6) months full time).<br/><br/>Minimum Qualifications – Education: 24 units are equal to one year of education. As applicable, education must be from a regionally accredited institution and verifiable on a legible unofficial transcript.<br/><br/>Reasonable accommodations for applicants with disabilities may be requested by calling (714) 808-4810 at least three business days in advance of the scheduled examination/interview date.<br/><br/>Evaluations of foreign degrees and/or coursework are required. See our website at <strong>https://www.nocccd.edu/minimum-qualifications</strong> for information regarding evaluation of foreign degrees.<br/><br/>To apply, visit: https://nocccd.peopleadmin.com/postings/7283<br/><br/>Copyright ©2024 Jobelephant.com Inc. All rights reserved.<br/><br/>Posted by the FREE value-added recruitment advertising agency<br/><br/>jeid-47235aeb5f1d7341a930fbd01fad2566 High school diploma or GED, one (1) year of college-level course work. Minimum four (4) years of administrative experience; may be supplemented by college courses.", "responsibilities": "Perform advanced administrative duties independently and/or at the direction of the Dean of an instructional division within a college or institution or noncredit equivalent; manage daily activities to assure efficient operations; provide information and interact on a daily basis to faculty, staff, students, and the public; answer questions and resolve problems requiring specialized and extensive knowledge of assigned area; address student concerns, including sensitive and complicated issues.<br/><br/>Prepare and maintain class schedules, staff assignments, room assignments, textbook orders, audio-visual, computer equipment, and associated paperwork; assist instructors with preparation of curriculum, forms, applications, and testing materials; ensure classrooms and instructional areas are maintained; assist with probationary tenure reviews; may provide assistance in prerequisite clearance for registration.<br/><br/>Provide support for state mandated reports (e.g., Apportionment Attendance – 320 report) including identifying errors, correcting data, updating Banner with correct coding, providing feedback and/or training for peers and new staff related to course scheduling and/or Banner coding; process reports for hybrid and online courses, making corrections as needed; assist with resolving complex scheduling errors as it relates to state mandated reporting; review information, identify discrepancies and complete analysis of data to ensure accuracy and compliance with applicable policy and regulations and resolve appropriately.<br/><br/>Attend and lead regularly scheduled meetings to maintain knowledge of best practices for data management related to the collection of data intended for the Apportionment Attendance Report system and/or other data related systems; attend District meetings and/or training related to faculty data entry in Banner, learn new processes, and provide feedback; work closely with the District Institutional Research and Planning department to ensure data quality.<br/><br/>Plan and organize special projects, committees, receptions and events as assigned; maintain calendar of activities, events and special meetings; schedule appointments and meetings; prepare agenda items and materials as required; attend meetings and transcribe and distribute minutes. Serve as a liaison with internal and external partners as appropriate in the execution of assigned responsibilities.<br/><br/>Assist in the compilation and preparation of budgets; maintain department expenditures and budgets; approve expenditures within established guidelines; provide budget updates, summaries, and recommendations to appropriate department faculty/staff; calculate and submit time sheets; respond to inquiries regarding financial issues.<br/><br/>Maintain confidential records, including information regarding Board, District, personnel, student, or controversial matters; input and retrieve data as required. Develop, maintain and update specialized and custom forms, databases, logs, files, schedules, lists, certificates, records and reports to support work processes in areas of assigned responsibility.<br/><br/>Compose and prepare correspondence independently; format presentations and reports; develop and revise schedules and forms; compile and prepare complex and difficult statistical and narrative reports from a variety of sources; greet visitors and direct to appropriate personnel; initiate and answer telephone calls; screen and direct calls; receive, open, prioritize, and route mail.<br/><br/>Order supplies and equipment, prepare purchase requisitions or other documents related to grants and/or contracts; track orders to assure delivery and payment; process facilities maintenance requests.<br/><br/>Provide functional work direction to other administrative support staff in area of assignment. Train and provide work direction and guidance to others as directed.<br/><br/>Learns and applies emerging technologies and advances as necessary to perform duties in an efficient, organized, and timely manner.<br/><br/>Participate in District/College efforts to increase the diversity of faculty and staff and to address student achievement gaps; active assistance in the creation of a welcoming and inclusive work and educational environment; attend and participate in diversity, equity and inclusion trainings and events.<br/><br/>Performs related duties as assigned.", "qualifications": {"required": "High school diploma or GED, one (1) year of college-level course work. Minimum four (4) years of administrative experience; may be supplemented by college courses. Commitment to diversity. All applicants must have demonstrated sensitivity to and understanding of the diverse academic, socioeconomic, cultural, disability, gender, gender identity, sexual orientation, and ethnic backgrounds of community college students, faculty and staff. The applicant must be able to demonstrate how their experience with these factors relates to successfully achieving the goals of the position.", "preferred": "Experience working both collaboratively as part of a team and independently with minimal supervision. Experience managing multiple complex tasks or projects simultaneously. Experience working collaboratively to remove barriers that impede student and/or program success and implement constructive approaches which support desired outcomes. Prior experience in approaching work and interactions with colleagues and/or students in an equity minded manner. Ability to provide an inclusive and welcoming work/educational environment."}, "skills": [], "postedDate": "1 week ago", "salary": {"amount": "6,191 - $7,479 Per Month", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005277112"}