{"jobTitle": "Material Planning & Logistics Specialist - Remote | WFH", "company": {"name": "Get It Recruit - Transportation", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Human Resources Services", "description": "Are you a supply chain wizard with a passion for optimization?<br/><br/>We're seeking a talented Material Planning and Logistics Specialist to join our fast-growing team! You'll play a vital role in ensuring the smooth flow of materials and products across our operations.<br/><br/><strong>What You'll Do<br/><br/></strong>Master the supply chain: Develop and execute material plans to ensure timely availability of materials.<br/><br/>Build strong relationships: Collaborate with suppliers and internal teams to optimize the supply chain.<br/><br/>Be a data-driven decision-maker: Analyze inventory levels, identify trends, and implement strategies to improve efficiency.<br/><br/>Ensure on-time delivery: Coordinate logistics activities and resolve any shipping issues.<br/><br/>Drive process improvement: Identify opportunities to enhance the supply chain and implement best practices.<br/><br/><strong>What You'll Need<br/><br/></strong>At least 7 years of experience in material planning, logistics, or supply chain management.<br/><br/>A bachelor's degree in supply chain management, business administration, or a related field.<br/><br/>Proficiency in ERP systems and data analysis tools.<br/><br/>Strong analytical and problem-solving skills.<br/><br/>Excellent communication and interpersonal skills.<br/><br/>Ready to take on a challenging and rewarding role?<br/><br/>We offer a competitive salary, opportunity for growth, and the chance to work in a dynamic and innovative company.<br/><br/>Employment Type: Full-Time", "postedDate": "2 days ago", "skills": ["Supply Chain Management", "Material Planning", "Logistics", "ERP Systems", "Data Analysis", "Problem Solving", "Communication", "Interpersonal Skills"], "url": "https://www.linkedin.com/jobs/view/4005940158"}