{"jobTitle": "Online American Sign Language Instructor for High School and Middle School Students", "company": {"name": "Get It Recruit - Educational Services", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Education and Training", "industry": "Human Resources Services", "description": "## Opportunity for American Sign Language Instructors<br/><br/>Are you passionate about teaching American Sign Language (ASL) and eager to engage with students in an online setting? We are seeking enthusiastic instructors to support high school and middle school students in their ASL learning journey.<br/><br/>### Role Overview<br/><br/>In this position, you will teach ASL to students aged 12-18, assisting them in fulfilling their high school World Language requirements. Our curriculum emphasizes real-world communication through interactive and engaging methods, steering away from traditional textbooks. We prioritize Project-Based Learning and align our approach with the ACTFL Can-Do Statements.<br/><br/>### Key Responsibilities<br/><br/><ul><li> Conduct one-on-one online lessons using Microsoft Teams.</li><li> Assign and evaluate homework assignments and projects.</li><li> Track and monitor students' grades and overall progress.</li><li> Create a supportive and engaging learning environment.</li><li> Cultivate respect and encouragement for all students.<br/><br/></li></ul>### Qualifications<br/><br/><ul><li> 1-2+ years of experience teaching ASL in an online or classroom context.</li><li> ASL interpreting skills are a plus.</li><li> A Bachelor's Degree is required.</li><li> Proficiency in technology, particularly Microsoft Office.</li><li> Strong work ethic combined with excellent interpersonal skills.<br/><br/></li></ul>### Additional Information<br/><br/>This is a contract position. Applicants are required to submit a video as part of their application process. We are committed to being an equal-opportunity employer and do not sponsor U.S. work visas. Teachers outside the U.S. will receive an international contract, while teachers residing in the U.S. will be offered a U.S.-based contract.<br/><br/>Join us in making ASL knowledge accessible and engaging for students!<br/><br/>Employment Type: Contractor", "postedDate": "2 days ago", "skills": ["ASL", "Microsoft Teams", "Project-Based Learning", "ACTFL Can-Do Statements", "Microsoft Office"], "url": "https://www.linkedin.com/jobs/view/4005366638"}