{"jobTitle": "Service Coordinator", "company": {"name": "Ollivier Managed Security | Smart Site", "location": "Los Angeles, CA", "industry": "Security and Investigations"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "<strong>Job Description<br/><br/></strong><strong>THIS IS AN IN-PERSON JOB IN DOWNTOWN LOS ANGELES<br/><br/></strong>Primary Duties and Responsibilities:<br/><br/>Customer Service:<br/><br/><ul><li>Manage all customer emails to support email ticket system and all phone calls to the service support line. </li><li>Responding promptly to customer inquiries. </li><li>Maintaining a positive, empathetic, and professional attitude toward customers at all times. </li><li>Ensure customer satisfaction and provide professional customer support. </li><li>Proactively update and communicate with customers regarding work order status and technician scheduling. </li><li>Proactively follow-up with customers when awaiting their response/input</li><li>Acknowledging and resolving customer complaints. </li><li>Conduct first level of troubleshooting</li><li>Cross train with all other Customer Service Personal to become efficient with all client platforms, portals and processes. </li><li>Reports problems to manager. </li><li>Monitoring multiple CCTV alarm systems</li><li>Completes special projects as assigned. </li><li>Monitor and control multiple access control systems</li><li>Quickly reacts to incoming alerts and faithfully follows establish scripts/procedures<br/><br/></li></ul>Coordinating:<br/><br/><ul><li>Providing feedback on the efficiency of the customer service process. </li><li>Maintain accurate Vendor request and information</li><li>Writing service/work order proposals. </li><li>Communicating and coordinating with colleagues as necessary. </li><li>Implement continuous improvement of procedures, processes, standards and programs to gain cost-effectiveness and efficiency with the help of your supervisor</li><li>Follow up and sense of urgency management. </li><li>Work with Service Manager to manage technician responsiveness to service orders and ensure that customer and technician sign the completed service order. </li><li>Responsible for managing on call schedule to ensure that a technician is always available after business hours and on weekends for customer issues. </li><li>Assist technicians with information needed for completing service orders (ex: providing passwords needed to gain remote access, etc.). </li><li>Keeping records of customer interactions, transactions, comments, and complaints. </li><li>Compile reports on service employees' hours, repair time on customer equipment, and machine history. </li><li>Ensuring proper escalation of events/issues to appropriate stakeholders. <br/><br/></li></ul>Data Entry/Reports:<br/><br/><ul><li>Basic computer skills and knowledge of Microsoft Office (Outlook, Word, Excel, etc.) experience</li><li>Knowing our products inside and out so that you can answer questions. </li><li>Logging/data entry. </li><li>Processing orders, forms, applications, and requests. </li><li>Generates daily load sheets and requirement listing. </li><li>Compile reports on service employees' hours, repair time on customer equipment, and machine history. </li><li>Submit Technical reports. Compile reports on service employees' hours, repair time on customer equipment, and machine history. </li><li>Obtain accurate information from vendors relating to shipment dates and expected date of delivery. <br/><br/></li></ul>Company Standards:<br/><br/><ul><li>Must maintain regular attendance and punctuality at the office to execute job responsibilities. </li><li>Must demonstrate discretion, integrity, and fair-mindedness consistent with company standards, practices, policies and procedures. <br/><br/></li></ul>Skills Required:<br/><br/><ul><li>Excellent oral and written communication skills in English are required. Fluency in additional languages a plus</li><li>Excellent customer service skills;</li><li>Complex problem-solving abilities;</li><li>Good working knowledge of basic computer functions, including G-Suite products, Windows, Mac, and Microsoft Office;</li><li>Good working knowledge of security systems for access control, CCTV, employee/guest/vendor badging, alarm monitoring, and dispatch;</li><li>Ability to multitask in a fast-paced work environment, across multiple platforms, departments, time zones, and cultures;</li><li>Ability to work calmly and accurately in crisis situations;</li><li>Excellent Situational Awareness skills;</li><li>Flexibility to work all shifts,</li><li>Attentive, organized, and detail-oriented;</li><li>A desire to work as a dependable, participating team player with a positive attitude; and</li><li>A willingness to work varied shift hours, including overnights, weekends and holidays. <br/><br/></li></ul>Education/Experience Requirements:<br/><br/><ul><li>Degree preferred or relevant experience in lieu of degree;</li><li>Customer Service Experience highly preferred;</li><li>Related Security Operations Center experience preferred;</li><li>Experience with different communication platforms and technologies, including 2-way radios, IP Video Surveillance, and computer databases;</li><li>Experience in conducting research and analysis;</li><li>Authorized to work in the United States required;</li><li>Military experience a plus;<br/><br/></li></ul>Experience:<br/><br/><ul><li>Basic Computer Skills: 1 year (Required)</li><li>Multitasking: 1 year (Required)</li><li>Customer Service: 1 year (Preferred)</li><li>CCTV and Access Control: 1 year(Preferred)</li><li>Logging / Data Entry: 1 year (Required)</li><li>Alarm Monitoring: 1 year (Preferred)</li><li>Command Center: 1 year (Preferred)<br/><br/></li></ul><strong>Company Description<br/><br/></strong>Our culture emphasizes training, growth and teamwork. We have a great benefits package! Ollivier Corporation has been in business since 1987, and is a proven industry leader. Ollivier is a managed security provider. This means that we support all aspects of a clients security program. From security systems to security personnel, Ollivier is a trusted adviser for some of the largest companies in Southern California.<br/><br/>Our culture emphasizes training, growth and teamwork. We have a great benefits package! Ollivier Corporation has been in business since 1987, and is a proven industry leader. Ollivier is a managed security provider. This means that we support all aspects of a clients security program. From security systems to security personnel, Ollivier is a trusted adviser for some of the largest companies in Southern California.", "jobFunction": "Other", "industry": "Security and Investigations", "postedDate": "1 day ago", "skills": ["Customer Service", "Communication", "Problem Solving", "Computer Skills", "Microsoft Office", "Security Systems", "Access Control", "CCTV", "Alarm Monitoring", "Dispatch", "Multitasking", "Situational Awareness", "Research", "Analysis", "Military Experience"], "url": "https://www.linkedin.com/jobs/view/4005371773"}