{"jobTitle": "Coordinator, Content Sales Marketing", "company": {"name": "Warner Bros. Discovery", "location": "Burbank, CA", "industry": "Entertainment Providers"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "42,209.00/yr - $78,389.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Entertainment Providers", "description": "<strong><em>Welcome to Warner Bros. Discovery… the stuff dreams are made of.<br/><br/></em></strong><strong>Who We Are…<br/><br/></strong>When we say, “the stuff dreams are made of,” we’re not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD’s vast portfolio of iconic content and beloved brands, are the <em>storytellers</em> bringing our characters to life, the<em> creators</em> bringing them to your living rooms and the <em>dreamers</em> creating what’s next…<br/><br/>From brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.<br/><br/><strong>Summary Of Position<br/><br/></strong>The Content Sales Marketing Coordinator acts as liaison between Marketing, Creative, Production, Sales and all domestic affiliates/clients (Broadcast Syndication, Cable, Streaming and Global Airlines) to support a wide variety of marketing needs and brand/IP management. The coordinator’s primary responsibility is to assist in the execution of marketing efforts, helping achieve increased ratings, client satisfaction and revenue for Warner Bros. Discovery distributed content. The coordinator is client facing and must always present a positive can-do attitude towards our internal &amp; external clients.<br/><br/><strong>Daily Responsibilities<br/><br/></strong><ul><li>Project Coordination, Marketing Calendars, Meeting Coordination</li><li>Client Marketing Asset Request Review and Approval </li><li>Email &amp; Social Media Marketing</li><li>Some Budget management, including Co-Op</li><li>Some Program Scheduling and programming stunt ideation.</li><li>Creative Ideation for Show Launches and key Sales Events / Campaigns</li><li>Marketing Client Relations and Networking – Developing strong internal and External Partnerships.<br/><br/></li></ul><strong>Qualifications &amp; Experience<br/><br/></strong><ul><li>Minimum 1 - 3 years’ experience in marketing, publicity, promotion at an Agency, Streamer, Studio, Social Media or Tech company, TV Station or Network preferred.</li><li>BA/BS </li><li>Outstanding verbal and written communication skills.</li><li>Creative, with a strong knowledge and love of TV, Film and Marketing</li><li>Superior organizational skills with ability to both multi-task and follow-through on long-term projects.</li><li>Detail-Oriented, Reliable &amp; Trustworthy.</li><li>Ability to collaborate and thrive in a large team environment </li><li>Intrinsic drive to Win, supporting creators to tell their stories and Content Sales to drive revenue!</li><li>Microsoft Outlook, Excel, Word, PowerPoint, Teams</li><li>Knowledge in use of design and A/V software such as Adobe Suite, Canva preferred.</li><li>Knowledge of Email Marketing such as MailChimp</li><li>Knowledge of best practices in Social Media Marketing, design and creation</li><li>A Passion for Warner Bros. Discovery culture and a love of Television &amp; Film.<br/><br/></li></ul><strong>How We Get Things Done…<br/><br/></strong>This last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview.<br/><br/><strong>Championing Inclusion at WBD<br/><br/></strong>Warner Bros. Discovery embraces the opportunity to build a workforce that reflects the diversity of our society and the world around us. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.<br/><br/>If you’re a qualified candidate and you require adjustments or accommodations to search for a job opening or apply for a position, please contact us at recruitadmin@wbd.com.<br/><br/>In compliance with local law, we are disclosing the compensation, or a range thereof, for roles in locations where legally required. Actual salaries will vary based on several factors, including but not limited to external market data, internal equity, location, skill set, experience, and/or performance. Base pay is just one component of Warner Bros. Discovery’s total compensation package for employees. Pay Range: $42,209.00 - $78,389.00 salary per year. Other rewards may include annual bonuses, short- and long-term incentives, and program-specific awards. In addition, Warner Bros. Discovery provides a variety of benefits to employees, including health insurance coverage, an employee wellness program, life and disability insurance, a retirement savings plan, paid holidays and sick time and vacation.", "responsibilities": "The Content Sales Marketing Coordinator acts as liaison between Marketing, Creative, Production, Sales and all domestic affiliates/clients (Broadcast Syndication, Cable, Streaming and Global Airlines) to support a wide variety of marketing needs and brand/IP management. The coordinator’s primary responsibility is to assist in the execution of marketing efforts, helping achieve increased ratings, client satisfaction and revenue for Warner Bros. Discovery distributed content. The coordinator is client facing and must always present a positive can-do attitude towards our internal &amp; external clients.", "qualifications": {"required": "Minimum 1 - 3 years’ experience in marketing, publicity, promotion at an Agency, Streamer, Studio, Social Media or Tech company, TV Station or Network preferred.\nBA/BS \nOutstanding verbal and written communication skills.\nCreative, with a strong knowledge and love of TV, Film and Marketing\nSuperior organizational skills with ability to both multi-task and follow-through on long-term projects.\nDetail-Oriented, Reliable &amp; Trustworthy.\nAbility to collaborate and thrive in a large team environment \nIntrinsic drive to Win, supporting creators to tell their stories and Content Sales to drive revenue!\nMicrosoft Outlook, Excel, Word, PowerPoint, Teams", "preferred": "Knowledge in use of design and A/V software such as Adobe Suite, Canva preferred.\nKnowledge of Email Marketing such as MailChimp\nKnowledge of best practices in Social Media Marketing, design and creation\nA Passion for Warner Bros. Discovery culture and a love of Television &amp; Film."}, "skills": ["Marketing", "Publicity", "Promotion", "TV", "Film", "Social Media", "Microsoft Outlook", "Excel", "Word", "PowerPoint", "Teams", "Adobe Suite", "Canva", "Email Marketing", "MailChimp", "Social Media Marketing"], "postedDate": "3 days ago", "benefits": "WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005221987"}