{"jobTitle": "Vice President Sales", "company": {"name": "PermanTech Search Group", "industry": "Truck Transportation", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Sales and Business Development", "industry": "Truck Transportation", "description": "The VP of Sales is responsible for planning and implementing sales, marketing, and product development programs, both short and long-range, targeted toward existing and new markets by performing the following duties personally and through subordinates.", "responsibilities": "Develops and implements strategic sales plans and forecasts to achieve corporate objectives for products and services. Plans and oversees advertising and promotion activities including print, all forms of digital, and potentially direct mail. Achieves satisfactory profit/loss ratio and market share in relation to preset standards and industry and economic trends. Prepares periodic sales reports showing sales volume, potential sales, and areas of proposed client base expansion. Reviews and analyzes sales performances against programs, quotes, and plans to determine effectiveness. Oversees and evaluates market research and adjusts marketing strategy to meet changing market and competitive conditions. Monitors competitor products, sales, and marketing activities. Establishes and maintains relationships with industry influencers and key strategic partners. Guides preparation of marketing activity reports and presents them to executive management. Establishes and maintains a consistent corporate image throughout all product lines, promotional materials, and events. Ensures effective control of marketing results, and takes corrective action to guarantee that achievement of marketing objectives falls within designated budgets. Communicate seamlessly with key stakeholders and team members across the organization to identify needs, evaluate business solutions and strategies. Directs sales forecasting activities and sets performance goals accordingly. Directs staffing, training, and performance evaluations to develop and control sales and marketing programs. Develops and recommends product positioning, packaging, and pricing strategy to produce the highest possible long-term market share. Develops and manages sales/marketing operating budgets. Directs market channel development activity and coordinates sales distribution by establishing sales territories, quotas, and goals. Reinforce a customer service-oriented approach through best practices. Promote governance and control to ensure compliance with the culture, policies, processes, and standards. Meets with key clients, assisting sales representatives with maintaining relationships and negotiating and closing deals. Coordinates liaison between the sales department and other sales-related units. Analyzes and controls expenditures of the division to conform to budgetary requirements. Assists other departments within the organization to prepare manuals and technical publications.", "qualifications": {"required": "Bachelor’s degree in sales, marketing or business administration preferred.", "preferred": "7-10 years of related experience with progressive management experience. Previous experience as a sales executive or sales and marketing director. Extraordinary attention to detail along with the ability to think big-picture strategy. Ability to communicate, present, and influence all levels of the organization."}, "skills": ["Proven and outstanding verbal and written communication skills", "Proven and outstanding listening, negotiation, and presentation skills", "Adept collaborating and working in a team environment", "Exceptional project management skills", "Proven ability to drive the sales process from plan to close", "Proven ability to articulate the distinct aspects of products and services", "Proven sales executive experience, meeting or exceeding targets", "Proven ability to position products against competitors"], "postedDate": "2 days ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "REMOTE", "url": "https://www.linkedin.com/jobs/view/4005373003"}