{"jobTitle": "Customer Service Manager", "company": {"name": "HIERO Inc", "industry": "Internet Publishing", "size": "Not specified", "location": "Marina del Rey, CA"}, "location": "Marina del Rey, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Other", "industry": "Internet Publishing", "description": "AtH!ERO, everyone plays a vital role in the care we deliver to families across the Torrance area. When you join our Customer Service Manager Trainee staff you become part of a team that works collectively to strengthen our communities and develop as individuals. We strive to continually inspire and empower our Customer Service Manager Trainee to put forth astounding efforts to make a difference in their daily lives. We are the voice of the brand, and a strong relationship between our clients and their customers begins with you!", "responsibilities": "Coordinate services and activities to provide program participants with the necessary tools to sustain essential communication. Analyze and document all consumer data, inventory tracking, and area mapping efficiently and in full detail. Assist consumers by providing relevant information in response to various questions and troubleshooting in-depth issues or concerns on a daily basis. Ensure customer satisfaction is at the forefront of all enrollment activities. Formulate program activities and accurate member records in company databases. Stay up to date with knowledge of client services and products by attending mandatory meetings.", "qualifications": {"required": "High school diploma or equivalent. Experience in Customer Service, Sales, Client Services, or Account Management. Superb leadership, organizational, time management, and problem-solving abilities. Ability to build rapport with clients. Exceptional oral and written communication skills with a diverse population of clientele. Ability to work with professional integrity and discretion. Effective presentation and facilitation skills.", "preferred": "Not specified"}, "skills": ["Customer Service", "Sales", "Client Services", "Account Management", "Leadership", "Organizational Skills", "Time Management", "Problem Solving", "Communication Skills"], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4005861794"}