{"jobTitle": "Administrative Assistant", "company": {"name": "Robert Half", "industry": "Staffing and Recruiting", "size": "N/A", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part Time", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "$21.85/hr - $26.00/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Staffing and Recruiting", "description": "We are in search of a Part Time Administrative Assistant to be part of our team located in Los Angeles, California. In this role, you will be tasked with ensuring that our office operations run smoothly, from maintaining vendor relationships to using various tech-savvy platforms for project management. This job offers contract employment opportunity with the possibility to extend. This role is onsite 7am-11am.", "responsibilities": "Utilize tech platforms such as Slack, Google Workplace, Notion, and Gmail for efficient project management and communication. Carry out administrative duties including data entry, answering inbound calls, and managing email correspondence. Maintain an organized and well-stocked office environment by coordinating with vendors. Schedule appointments and manage calendars using Microsoft Outlook. Create and edit documents or presentations using Microsoft Word, Excel, and PowerPoint. Ensure a quick ramp-up time by leveraging tech stacks and platform.", "qualifications": {"required": "7-11am in-office, Office & clerical duties - facilities management, tracking inventories & supplies, Able to assist with HR, IT, and additional administrative duties, Must be tech savvy, able to quickly grasp Slack, Guite, Notion, Would ideally like to see someone with 2-3 years of office admin assistant experience", "preferred": ""}, "skills": [], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "Benefits are available to contract/temporary professionals, including medical, vision, dental, and life and disability insurance. Hired contract/temporary professionals are also eligible to enroll in our company 401(k) plan.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005615984"}