{"jobTitle": "Patient Care Coordinator", "company": {"name": "Smile Brands Inc.", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "19.00/hr - 21.00/hr", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "<strong>Overview<br/><br/></strong>As a Patient Care Coordinator, you'll have a key role in creating positive patient experiences using our innovative G3 approach (Greeting, Guiding, Gratitude). You'll help patients feel welcome and supported whether they are coming in for treatment or calling to schedule an appointment. You will also assist them with financial arrangements for treatment.<br/><br/><strong>Schedule (days/hours)<br/><br/></strong>9-6 Business hrs days M-Fri Sat 8-3 subject to change<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Greeting: Create a welcoming atmosphere for patients and greet each patient with a warm welcome</li><li>Guiding: Assist patients with check in/check out procedures (including insurance verification), schedule appointments, and provide information about services and payment options, guiding them through their visit with ease and professionalism</li><li>Gratitude: Express appreciation to patients for choosing us for their dental care and treat everyone with respect and professionalism<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>At least one year related experience</li><li>Knowledge of dental terminology</li><li>Strong communication and interpersonal skills, with a focus on delivering exceptional customer service<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Previous experience in a dental or medical office setting<br/><br/></li></ul><strong>Compensation<br/><br/></strong>$19-$21<br/><br/><strong>About<br/><br/></strong>Benefits are determined by employment status/hours worked and include paid time off (“PTO”), health, dental, vision, health savings account, telemedicine, flexible spending accounts, life insurance, disability insurance, employee discount programs, pet insurance, and a 401k plan.<br/><br/><em>Smile Brands supports over 650 affiliated dental practices across 30 states all focused on a single mission of delivering Smiles For Everyone!® Smiles for patients, providers, employees, and community partners. Everyone. Our growing portfolio of affiliated dental brands and practice models range from large regional brands to uniquely branded local practices. This role is associated with the affiliated dental office listed at the top of the job posting on our career site.<br/><br/></em><em>Smile Brands Inc. and all Affiliates are Equal Opportunity Employers. We celebrate diversity and are committed to providing an inclusive workplace for all employees. We are proud to be an equal opportunity employer. We prohibit discrimination and harassment of any kind based on race, color, creed, gender (including gender identity and gender expression), religion, marital status, registered domestic partner status, age, national origin, ancestry, physical or mental disability, sex (including pregnancy, childbirth, breastfeeding or related medical condition), protected hair style and texture (The CROWN Act), genetic information, sexual orientation, military and veteran status, or any other consideration made unlawful by federal, state, or local laws. If you would like to request an accommodation due to a disability, please contact us at careers@smilebrands.com</em>", "responsibilities": "As a Patient Care Coordinator, you'll have a key role in creating positive patient experiences using our innovative G3 approach (Greeting, Guiding, Gratitude). You'll help patients feel welcome and supported whether they are coming in for treatment or calling to schedule an appointment. You will also assist them with financial arrangements for treatment.", "qualifications": {"required": "At least one year related experience, Knowledge of dental terminology, Strong communication and interpersonal skills, with a focus on delivering exceptional customer service", "preferred": "Previous experience in a dental or medical office setting"}, "skills": [], "postedDate": "3 days ago", "benefits": "Benefits are determined by employment status/hours worked and include paid time off (“PTO”), health, dental, vision, health savings account, telemedicine, flexible spending accounts, life insurance, disability insurance, employee discount programs, pet insurance, and a 401k plan.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4005984363"}