{"jobTitle": "Sr. Supply Chain Manager", "company": {"name": "Jobot", "location": "Oxnard, CA"}, "location": "Oxnard, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$90,000.00 - $130,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Human Resources Services, Technology, Information and Internet, and Hospitals and Health Care", "description": "Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!<br/><br/>Job details<br/><br/>This Jobot Job is hosted by Dan Asher<br/><br/>Are you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.<br/><br/>Salary $90,000 - $130,000 per year<br/><br/><strong>A Bit About Us<br/><br/></strong>Our client is a privately owned plastics packaging company in growth mode! Join an industry leader in recycled plastics food-packaging solutions.<br/><br/><strong><br/><br/><strong>Why join us?<br/><br/><br/></strong></strong>Comprehensive medical/dental/vision benefits<br/><br/>401k with company match<br/><br/>Vacation/Sick Time<br/><br/>Growth Opportunities<br/><br/><strong>Job Details<br/><br/></strong>Can be based in EITHER Columbus, OH or Oxnard, CA<br/><br/>Reporting to the VP of Operations, the Supply Chain Manager manages and coordinates activities of personnel engaged in the procurement, Production Planning Departments, and Inventory Admin.<br/><br/><strong>Essential Duties And Responsibilities Include The Following<br/><br/></strong><ul><li> Active participant in the planning safety and protection activities.</li><li> Determine labor requirements necessary to support plan.</li><li> Drive inventory improvement efforts for raw materials, finished goods and component inventories which meet both customer service needs and company inventory objectives.</li><li> Reviews, substantiates and /or authorizes purchase orders, and forecasts.</li><li> Directs and establishes operational activities &amp; procedures, such as</li><li> Verification of incoming and/or outgoing shipments.</li><li> Handling and disposition of materials.</li><li> Formulates changes to provide for increased saving in freight, warehousing, procurement, and labor.</li><li> Negotiates with Trucking Companies, 3PL’s, vendors for the most favorable prices and terms to the company.</li><li> Regularly verifies the most efficient and economical routing and mode of transportation for specific lanes/customers are being used.</li><li> Quotes freight rates for specific lanes and/or special projects.</li><li> Manages the development and adherence to purchasing procedures.</li><li> Manage vendors and contribute to negotiation of fulfillment contracts as needed.</li><li> Initiates changes designed to improve control and efficiency of all Supply Chain Departments.</li><li> Analyze market and delivery conditions to determine present and future material availability and to keep the following as low as possible</li><li> Freight handling costs</li><li> Fuel costs</li><li> Accessorial charges incurred.</li><li> Transfers costs</li><li> In transit difficulties</li><li> Storage constraints</li><li> Develops methods and procedures for transportation of</li><li> Raw goods to Production areas/locations</li><li> Finish Goods/ Shrink Bands to customers.</li><li> Specific Items/SKU’s to Auxiliary warehouse/storage facilities.</li><li> Initiates, investigates, and settle claims against company for</li><li> Drives the approval programs for suppliers of designated raw materials, and for purchasing of facility chemicals.</li><li> Supports material requests for nonconforming inventory related to</li><li> Prepares Department budget. All other duties as assigned by management.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>To perform this job successfully, an individual must possess a bachelor’s degree and / or four years of experience in a related field. He / She must be able to perform each essential duty satisfactorily.<br/><br/>Interested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.<br/><br/><strong>Want to learn more about this role and Jobot?<br/><br/></strong>Click our Jobot logo and follow our LinkedIn page!<br/><br/>", "responsibilities": "Active participant in the planning safety and protection activities. Determine labor requirements necessary to support plan. Drive inventory improvement efforts for raw materials, finished goods and component inventories which meet both customer service needs and company inventory objectives. Reviews, substantiates and /or authorizes purchase orders, and forecasts. Directs and establishes operational activities & procedures, such as Verification of incoming and/or outgoing shipments. Handling and disposition of materials. Formulates changes to provide for increased saving in freight, warehousing, procurement, and labor. Negotiates with Trucking Companies, 3PL’s, vendors for the most favorable prices and terms to the company. Regularly verifies the most efficient and economical routing and mode of transportation for specific lanes/customers are being used. Quotes freight rates for specific lanes and/or special projects. Manages the development and adherence to purchasing procedures. Manage vendors and contribute to negotiation of fulfillment contracts as needed. Initiates changes designed to improve control and efficiency of all Supply Chain Departments. Analyze market and delivery conditions to determine present and future material availability and to keep the following as low as possible Freight handling costs Fuel costs Accessorial charges incurred. Transfers costs In transit difficulties Storage constraints Develops methods and procedures for transportation of Raw goods to Production areas/locations Finish Goods/ Shrink Bands to customers. Specific Items/SKU’s to Auxiliary warehouse/storage facilities. Initiates, investigates, and settle claims against company for Drives the approval programs for suppliers of designated raw materials, and for purchasing of facility chemicals. Supports material requests for nonconforming inventory related to Prepares Department budget. All other duties as assigned by management.", "qualifications": {"required": "To perform this job successfully, an individual must possess a bachelor’s degree and / or four years of experience in a related field. He / She must be able to perform each essential duty satisfactorily."}, "skills": [], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "Comprehensive medical/dental/vision benefits<br/><br/>401k with company match<br/><br/>Vacation/Sick Time<br/><br/>Growth Opportunities", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005158607"}