{"jobTitle": "Store Manager in Training", "company": {"name": "CVS Health", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Internship", "salary": {"amount": "18.50 - 28.67", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Hospitals and Health Care", "description": "Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand — with heart at its center — our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br/><br/>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br/><br/>The Store Manager In Training (SMIT) job is a development focused role that is crafted to prepare you for a CVS Store Manager position.<br/><br/>The SMIT program is designed to enhance your career as a future store leader. We support your development towards the store manager role by participating in a self-paced, collaborative training over the span of 16 weeks.<br/><br/>We provide both virtual and hands on learning experiences to develop you as a leader. Our team of people, that support your growth toward your leadership career include: your District Leader, Human Resources Business Partner, Training Store Manager, and your Store Manager coach.<br/><br/><strong>Some Of The Skills Needed For This Role Are<br/><br/></strong><ul><li>Communicate well verbally and in writing to support and lead your team.</li><li>Perform customer care duties to provide high levels of service.</li><li>Execute merchandising strategies to support store sales growth.</li><li>Manage the store inventory and assets to maintain profitability.<br/><br/></li></ul>We are invested in your growth and anticipate that you will be as well. We expect our SMIT's to:<br/><br/><ul><li>Actively engage with your leader in Key Learning Experiences to support you on your path to promotion during the structured program.</li><li>Support your store as management team member and lead in a manner that is consistent with CVS values and policies.</li><li>Engage your colleagues in support of the company's purpose of \"helping people on their path to better health.\"</li><li>Be willing to accept promotion roles with the market that you work in.<br/><br/></li></ul>Selection for the SMIT position does not guarantee promotion into a Store Manager position. Whether and when you are actually promoted to Store Manager is dependent on a variety of factors, including but not limited to performance and availability of openings.<br/><br/><ul><li> Willingness to accept a promotion to Store Manager role at any location in the designated market.</li><li> Ability to transfer to other CVS Pharmacy stores located within the designated market.</li><li> Ability to work a schedule that may vary based on business needs.</li><li> High School diploma or GED</li><li> Bachelor's Degree</li><li> Retail management experience, or experience as a CVS SupervisorΓÇÉ A high school diploma or GED is required.</li><li> A four year college degree is preferred, or relevant work experience may be considered in lieu of a college degree.<br/><br/></li></ul><strong>Pay Range<br/><br/></strong><strong>The Typical Pay Range For This Role Is<br/><br/></strong>$18.50 - $28.67<br/><br/>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.<br/><br/>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities. The Company offers a full range of medical, dental, and vision benefits. Eligible employees may enroll in the Company’s 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees. The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners. As for time off, Company employees enjoy Paid Time Off (“PTO”) or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.<br/><br/>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br/><br/>We anticipate the application window for this opening will close on: 10/12/2024<br/><br/>Qualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state and local laws.", "responsibilities": "The Store Manager In Training (SMIT) job is a development focused role that is crafted to prepare you for a CVS Store Manager position.<br/><br/>The SMIT program is designed to enhance your career as a future store leader. We support your development towards the store manager role by participating in a self-paced, collaborative training over the span of 16 weeks.<br/><br/>We provide both virtual and hands on learning experiences to develop you as a leader. Our team of people, that support your growth toward your leadership career include: your District Leader, Human Resources Business Partner, Training Store Manager, and your Store Manager coach.", "qualifications": {"required": "High School diploma or GED", "preferred": "Bachelor's Degree"}, "skills": [], "postedDate": "1 week ago", "benefits": "The Company offers a full range of medical, dental, and vision benefits. Eligible employees may enroll in the Company’s 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees. The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners. As for time off, Company employees enjoy Paid Time Off (“PTO”) or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005917442"}