{"jobTitle": "Program Manager, Ads Business Operations", "company": {"name": "Netflix", "location": "New York, United States"}, "location": "New York, United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$70,000 - $420,000"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/>We launched a new ad-supported tier in November 2022 to offer our members more choice in how they consume their content. Our new tier allows us to attract new members at a lower price point, while also creating a compelling path for advertisers to reach audiences that are deeply engaged.<br/><br/>We are looking for a Program Manager with Ads domain experience to drive high impact cross-functional ads programs. This role requires strong collaboration with the business, sales, tooling, product, and operations teams to execute, track and deliver high impact strategic programs in the Ads space.<br/><br/><strong>In This Role, You Will<br/><br/></strong><ul><li>Lead multiple cross-functional programs that span business, sales, tooling, product, and operations teams </li><li>Drive cross-functional collaboration with demonstrated expertise in delivering complex, highly ambiguous programs with multiple stakeholders.</li><li>Lead change management and communications strategies for these initiatives.</li><li>Provide quantitative and qualitative analysis of program performance and track/ensure program and business impact.<br/><br/></li></ul><strong>About You<br/><br/></strong><ul><li>7+ years experience in advertising and/or advertising-related fields.</li><li>Highly skilled, experienced, and enjoys orchestrating multiple programs with many moving parts and creating partnerships with cross-functional teams</li><li>Collaborates effectively and embraces differing perspectives and experiences to make better decisions.</li><li>Demonstrated track record of innovating, challenging assumptions, and implementing better approaches.</li><li>Ability to dive deep as well as understand the big picture.<br/><br/></li></ul>Generally, our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $70,000 - $420,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "Lead multiple cross-functional programs that span business, sales, tooling, product, and operations teams\nDrive cross-functional collaboration with demonstrated expertise in delivering complex, highly ambiguous programs with multiple stakeholders.\nLead change management and communications strategies for these initiatives.\nProvide quantitative and qualitative analysis of program performance and track/ensure program and business impact.", "qualifications": {"required": "7+ years experience in advertising and/or advertising-related fields.\nHighly skilled, experienced, and enjoys orchestrating multiple programs with many moving parts and creating partnerships with cross-functional teams\nCollaborates effectively and embraces differing perspectives and experiences to make better decisions.\nDemonstrated track record of innovating, challenging assumptions, and implementing better approaches.\nAbility to dive deep as well as understand the big picture.", "preferred": ""}, "skills": [], "postedDate": "19 hours ago", "applicationDeadline": "", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4005187422"}