{"jobTitle": "Coordinator, Human Resources", "company": {"name": "NBCUniversal", "location": "Universal City, CA", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "50,000.00 - 65,000.00", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "description": "We create world-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world-renowned theme parks and attractions through Universal Destinations &amp; Experiences. NBCUniversal is a subsidiary of Comcast Corporation.<br/><br/>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever-changing face of the world.<br/><br/><strong>Summary<br/><br/></strong><strong>Job Description<br/><br/></strong>The Human Resources Coordinator provides HR support to Supervisors/Managers and non-exempt employees in the Theme Park, with heavy emphasis on maintaining positive employee relations. Also serve as a liaison with other HR departments including Staffing, Training, Payroll and Benefits in order to manage and resolve issues as well as assist with HR process coordination.<br/><br/><strong>Essential Responsibilities<br/><br/></strong><ul><li>Assist in providing basic HR support to client groups in the areas of staffing, payroll, etc. </li><li>Provide timely support to all client inquiries, working alongside HR team to ensure all issues are resolved and escalated if/when necessary (i.e. timecard corrections, SAP system questions, leave of absence, status changes, separations, all related follow-up paperwork, etc.)</li><li>Partner with Timekeeper team on payroll problems and resolutions. Work closely with HRIS on resolving SAP issues and ensuring accuracy of employee data.</li><li>Educate and empower clients to become self-sufficient on Employee- and Manager- Self-Service and navigating through NBCU resources.</li><li>Responsible for creating a seamless on-boarding experience for all new-hires: Work with Staffing and Talent Acquisition to collect all new hire documentation, coordinate new hire set up, review I9 documentation, etc.</li><li>Proactively manage HR systems in order to ensure data integrity. Leverage SAP for reporting and streamlining of HR processes (new hire, term, transfer). Partner with HRIS on resolving SAP issues.</li><li>Maintain and update job descriptions for client groups.</li><li>Process employee separations: Complete workflow form and paperwork, coordinate exit interview and final check, collect and return Company property, etc.</li><li>Partner with Labor Relations to ensure compliance with collective bargaining agreements and to assist in resolving grievances.</li><li>Maintain employee files (i.e. e-filing and physical files)</li><li>Provide back-up coverage and support for the HR team and additional areas as needed</li><li>Perform other duties as assigned<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>QUALIFICATIONS/REQUIREMENTS<br/><br/></strong><ul><li>Bachelor’s degree from a four-year college or university is required; Human Resources, Business, Communication or related field preferred</li><li>Minimum 1 year of Human Resources experience<br/><br/></li></ul><strong>DESIRED CHARACTERISTICS<br/><br/></strong><ul><li>Professional and personable, always exercising sound judgment</li><li>Effectively handles sensitive and confidential matters</li><li>Demonstrated ability to drive HR processes and to deliver high quality HR services</li><li>Experience in both non-union and union/represented environments in retail or hospitality industry preferred</li><li>Flexibility and adaptability in a fast-paced, constantly changing environment</li><li>Ability to prioritize effectively, think independently and problem solve to ensure all projects are completed in an effective and timely manner</li><li>Ability to work with others and collaborate across the organization to achieve goals</li><li>Self-starter, motivated and proactive</li><li>Strong organization skills, detail oriented, and ability to handle multiple tasks and assignments</li><li>Excellent verbal and written communication</li><li>Ideal candidate demonstrates accountability, thinks critically and demonstrates courage when presenting ideas</li><li>SAP or HRIS experience preferred</li><li>Highly proficient with Microsoft Office (Outlook, Excel, PowerPoint, Word)<br/><br/></li></ul><strong>Additional Requirements<br/><br/></strong><ul><li>This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.</li><li>This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $50,000 - $65,000<br/><br/></li></ul><strong>Additional Information<br/><br/></strong>NBCUniversal's policy is to provide equal employment opportunities to all applicants<br/><br/>and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation,<br/><br/>marital status, pregnancy, veteran status, membership in the uniformed services,<br/><br/>genetic information, or any other basis protected by applicable law.<br/><br/>NBCUniversal will consider for employment qualified applicants with criminal histories,<br/><br/>or arrest or conviction records, in a manner consistent with relevant legal<br/><br/>requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring<br/><br/>Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.<br/><br/>If you are a qualified individual with a disability or a disabled veteran, you have the<br/><br/>right to request a reasonable accommodation if you are unable or limited in your<br/><br/>ability to use or access nbcunicareers.com as a result of your disability. You can<br/><br/>request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.", "responsibilities": "The Human Resources Coordinator provides HR support to Supervisors/Managers and non-exempt employees in the Theme Park, with heavy emphasis on maintaining positive employee relations. Also serve as a liaison with other HR departments including Staffing, Training, Payroll and Benefits in order to manage and resolve issues as well as assist with HR process coordination.", "qualifications": {"required": "Bachelor’s degree from a four-year college or university is required; Human Resources, Business, Communication or related field preferred\nMinimum 1 year of Human Resources experience", "preferred": "Professional and personable, always exercising sound judgment\nEffectively handles sensitive and confidential matters\nDemonstrated ability to drive HR processes and to deliver high quality HR services\nExperience in both non-union and union/represented environments in retail or hospitality industry preferred\nFlexibility and adaptability in a fast-paced, constantly changing environment\nAbility to prioritize effectively, think independently and problem solve to ensure all projects are completed in an effective and timely manner\nAbility to work with others and collaborate across the organization to achieve goals\nSelf-starter, motivated and proactive\nStrong organization skills, detail oriented, and ability to handle multiple tasks and assignments\nExcellent verbal and written communication\nIdeal candidate demonstrates accountability, thinks critically and demonstrates courage when presenting ideas\nSAP or HRIS experience preferred\nHighly proficient with Microsoft Office (Outlook, Excel, PowerPoint, Word)"}, "skills": ["Human Resources", "Staffing", "Payroll", "Benefits", "Employee Relations", "SAP", "HRIS", "Microsoft Office", "Communication", "Problem Solving", "Organization"], "postedDate": "14 hours ago", "benefits": "This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005159992"}