{"jobTitle": "Operations Supervisor", "company": {"name": "CVS Health", "industry": "Hospitals and Health Care", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Hospitals and Health Care", "description": "Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand — with heart at its center — our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br/><br/>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br/><br/><strong>Position Summary<br/><br/></strong>An Operations Supervisor is a key leader supporting the CVS Store Management team in planning and driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor leads the store and supervisory staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li> Management</li><li>Work effectively with store management and store crews</li><li>Supervise the store’s crew through assigning, directing and following up of all<br/><br/></li></ul>activities<br/><br/><ul><li>Effectively communicate information both to and from store management and crews</li><li> Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy<br/><br/></li></ul>and promote a positive shopping experience for all CVS customers<br/><br/>Provide colleagues personalized customer service feedback and coaching (E.g., myImpact coaching; myCustomer feedback; personal observations)<br/><br/><ul><li>Maintain customer/patient confidentiality</li><li> Merchandise/Presentation</li><li>Price merchandise</li><li>Stock shelves</li><li>Support the planning, execute the displays, sign and inventory of weekly,<br/><br/></li></ul>promotional, and seasonal merchandise<br/><br/><ul><li>Support the planning, execute the display and maintenance of off-shelf merchandise<br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong><ul><li>Deductive reasoning ability, analytical skills and computer skills.</li><li>Advanced communication skills, supervision, and influencing skills</li><li>Ability to work a full-time flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed, and to respond to urgent issues at the store when they arise<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Experience as a retail supervisor<br/><br/></li></ul><strong>Education<br/><br/></strong><strong>High School Diploma Or Equivalent Preferred But Not Required.<br/><br/></strong><strong>Pay Range<br/><br/></strong><strong>The Typical Pay Range For This Role Is<br/><br/></strong>$0.00 - $0.00<br/><br/>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.<br/><br/>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities. The Company offers a full range of medical, dental, and vision benefits. Eligible employees may enroll in the Company’s 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees. The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners. As for time off, Company employees enjoy Paid Time Off (“PTO”) or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.<br/><br/>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br/><br/>We anticipate the application window for this opening will close on: 10/17/2024<br/><br/>Qualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state and local laws.", "responsibilities": "An Operations Supervisor is a key leader supporting the CVS Store Management team in planning and driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor leads the store and supervisory staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.", "qualifications": {"required": "Deductive reasoning ability, analytical skills and computer skills.\nAdvanced communication skills, supervision, and influencing skills\nAbility to work a full-time flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed, and to respond to urgent issues at the store when they arise", "preferred": "Experience as a retail supervisor"}, "skills": [], "postedDate": "4 weeks ago", "applicationDeadline": "10/17/2024", "benefits": "The Company offers a full range of medical, dental, and vision benefits. Eligible employees may enroll in the Company’s 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees. The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners. As for time off, Company employees enjoy Paid Time Off (“PTO”) or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.", "remoteWork": "No", "salary": {"amount": "0.00 - 0.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4005923009"}