{"jobTitle": "Account Executive - Los Angeles", "company": {"name": "Paycom", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full Time", "employmentType": "Full-time", "experienceLevel": "Experienced", "salary": {"amount": "$100,000.00/yr - $100,000.00/yr", "currency": "USD"}, "jobFunction": "Sales", "industry": "Software Development and Financial Services", "description": "As an S&P 500 software company with innovation at its core, Paycom empowers employees to manage their own data while equipping businesses with the HR technology they need to thrive.\n\nAt Paycom, our people drive our success. Our values are simple: We innovate, we win, we serve, we care and we believe. Paycom sales employees enjoy a fast-paced, engaging work environment empowering them to set and achieve their personal and professional goals.\n\nOutside Sales Representative Pay Transparency Statement\n\nThis position has a starting salary of $100,000 per annum, consisting of $80,000 base pay and $20,000 supplemental pay with an additional uncapped commission plan. Paycom provides health insurance to employees at an employee cost of $1 per pay period; a 401(k) plan with company match; available flexible spending accounts; $50,000 basic life and AD&D; paid vacation, holidays and sick leave; employee stock purchase plan; paid family leave; and many other benefits.\n\nYour Role at Paycom\n\nAs an Account Executive (internally known as Outside Sales Representative) for Paycom, you will be responsible for selling net new prospects, from generating the first appointment through closing. You’ll contact prospects, set appointments, demonstrate our software, negotiate agreements and secure new business accounts. You will be accountable for hitting weekly metrics that lead to selling Paycom’s human capital management technology products and services to clients in an assigned region, with support from our leadership and sales enablement teams.\n\nResponsibilities\n\n<ul><li> Demonstrate essential skill competencies throughout new-hire training by maintaining and/or exceeding assigned metrics </li><li> Make cold calls to potential clients according to assigned standards and goals </li><li> Set appointments with leads from companies with 50 or more employees when assigned </li><li> Cultivate a consistent sales pipeline to meet goals for new business by holding and progressing in-person meetings with prospects </li><li> Build value-added relationships with decision makers and C-level executives within assigned territory </li><li> Close net new accounts, collecting critical items for implementation quickly and efficiently </li><li> Support new clients by participating in initial kickoff meetings for implementation </li><li> Build and maintain expert knowledge of Paycom products and services, continually enhancing knowledge through weekly team meetings and sales training </li><li> Perform other duties as assigned <br/><br/></li></ul>Travel\n\n<ul><li> Up to 25% travel — may include overnight on all avenues of transportation (plane, train and/or automobile) </li><li> Required to attend in-person new hire, regional and department trainings <br/><br/></li></ul>Perks And Benefits\n\nAt Paycom, we offer unique perks and benefits that support you in all areas of your life. Here’s what you can expect from a Paycom career:\n\n<ul><li> Base salary, transportation allowance and an uncapped commission plan </li><li> $1-per-pay-period individual health insurance coverage for employees </li><li> Paid vacation, sick, holiday and personal days to encourage you to accomplish your goals outside work </li><li> 401(k) with matching + employee stock purchase program to help you build wealth for the future </li><li> Company + team-based events to create community </li><li> Ongoing companywide roundtable discussions called Better Conversations to promote diversity, equity and inclusion </li><li> Paid family leave programs to ensure you have support and time off when you need it most </li><li> Employee referral bonuses to reward you for introducing other great people to Paycom </li><li> Award-winning learning and development programs to enable your long-term growth with Paycom <br/><br/></li></ul>Qualifications\n\nEducation/Certification:\n\n<ul><li> Bachelor’s degree <br/><br/></li></ul>Experience:\n\n<ul><li> Experience in a competitive environment with a record of success exceeding goals, which may be demonstrated through previous sales work, competitive internships or excelling in collegiate sales competitions. <br/><br/></li></ul>Preferred Qualifications\n\nEducation/Certification:\n\n<ul><li> Bachelor’s degree in business or professional selling <br/><br/></li></ul>Experience:\n\n<ul><li> 1-3 years of demonstrated sales experience </li><li> Strategic sales and closing experience <br/><br/></li></ul>Skills/Abilities:\n\n<ul><li> Achieves/exceeds appointment and sales metrics </li><li> Ability to work in a structured and fast-paced team sales environment </li><li> Ability to analyze client needs and provide strategic business solutions </li><li> Solid problem-solving and consultative skills required </li><li> Product and payroll knowledge is a plus </li><li> Excellent written and verbal communication </li><li> Highly self-motivated and results-oriented </li><li> Strong presentation, organization, multitasking and time management skills </li><li> Experience with Microsoft Office, including PowerPoint, Excel and Outlook <br/><br/></li></ul>Culture and commitment to diversity\n\nOur people are our priority. Paycom engages and empowers our employees through a culture steeped in growth and innovation. At Paycom, each team member is equipped with the tools, resources and leadership to become their best selves. This includes our commitment to diversity, equity and inclusion. We have zero tolerance for racism, harassment or discrimination. Our teams are encouraged to form deeper relationships with those around them based on mutual respect, dignity and understanding. To help further these goals, we are committed to equal employment opportunity and affirmative action policies.\n\n Paycom is an equal opportunity employer and prohibits discrimination and harassment of any kind. Paycom makes employment decisions on the basis of business needs, job requirements, individual qualifications and merit. Paycom wants to have the best available people in every job. Therefore, Paycom does not permit its employees to harass, discriminate or retaliate against other employees or applicants because of race, color, religion, sex, sexual orientation, gender identity, pregnancy, national origin, military and veteran status, age, physical or mental disability, genetic characteristic, reproductive health decisions, family or parental status or any other consideration made unlawful by applicable laws. Equal employment opportunity will be extended to all persons in all aspects of the employer-employee relationship. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, training, promotion, discipline, compensation benefits, and separation of employment. The Human Resources Department has overall responsibility for this policy and maintains reporting and monitoring procedures. Any questions or concerns should be referred to the Human Resources Department. ****To learn more about Paycom's affirmative action policy, equal employment opportunity, or to request an accommodation - Click on the link to find more information:", "responsibilities": "<ul><li> Demonstrate essential skill competencies throughout new-hire training by maintaining and/or exceeding assigned metrics </li><li> Make cold calls to potential clients according to assigned standards and goals </li><li> Set appointments with leads from companies with 50 or more employees when assigned </li><li> Cultivate a consistent sales pipeline to meet goals for new business by holding and progressing in-person meetings with prospects </li><li> Build value-added relationships with decision makers and C-level executives within assigned territory </li><li> Close net new accounts, collecting critical items for implementation quickly and efficiently </li><li> Support new clients by participating in initial kickoff meetings for implementation </li><li> Build and maintain expert knowledge of Paycom products and services, continually enhancing knowledge through weekly team meetings and sales training </li><li> Perform other duties as assigned <br/><br/></li></ul>", "qualifications": {"required": "Experience in a competitive environment with a record of success exceeding goals, which may be demonstrated through previous sales work, competitive internships or excelling in collegiate sales competitions.", "preferred": "Bachelor’s degree in business or professional selling, 1-3 years of demonstrated sales experience, Strategic sales and closing experience"}, "skills": ["Sales", "Microsoft Office", "PowerPoint", "Excel", "Outlook"], "postedDate": "1 day ago", "benefits": "<ul><li> Base salary, transportation allowance and an uncapped commission plan </li><li> $1-per-pay-period individual health insurance coverage for employees </li><li> Paid vacation, sick, holiday and personal days to encourage you to accomplish your goals outside work </li><li> 401(k) with matching + employee stock purchase program to help you build wealth for the future </li><li> Company + team-based events to create community </li><li> Ongoing companywide roundtable discussions called Better Conversations to promote diversity, equity and inclusion </li><li> Paid family leave programs to ensure you have support and time off when you need it most </li><li> Employee referral bonuses to reward you for introducing other great people to Paycom </li><li> Award-winning learning and development programs to enable your long-term growth with Paycom <br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005131338"}