{"jobTitle": "Tiktok Content Coordinator - Part Time", "company": {"name": "Haus Labs By Lady Gaga", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$40/hour", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Internet Publishing", "description": "Job Title: Tiktok Content Coordinator (Part Time, Hybrid)<br/><br/><strong>Salary: $40/hour (30 hours/week)<br/><br/></strong>Department: Marketing<br/><br/>Manager: Director, Social Media<br/><br/><ul><li>Please include links to your portfolioor social media to showcase your work<br/><br/></li></ul>Who We Are<br/><br/>Launched by Lady Gaga, Haus Labs is a vegan and cruelty-free cosmetics brand with a mission of spreading kindness, bravery, and creativity. Filled with versatile products that encourage self-expression, this collection boasts high-impact eye makeup, lipsticks, highlighters, and more. Regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics, we want everyone to feel welcome. We are committed to building a diverse and inclusive, equal opportunity workplace.<br/><br/><strong>Overview<br/><br/></strong>We are looking for a part-time TikTok Content Coordinator to join our Social Media Team! This role will be responsible for driving the platform’s content and community strategy from filming and editing to publishing. You will be the go-to person for everything happening in the app, from ideating storylines, executing them and jumping on trends.<br/><br/>Our ideal candidate enjoys creating content applying makeup on camera along with being skilled at creating product-focused content, is organized, has clear communication skills, follows trends closely and goes above and beyond in every piece of content. Most importantly, they must have a sense of humor!<br/><br/>What You’ll Do<br/><br/><ul><li>Responsible for leading the TikTok content creation strategy, and reactively and proactively producing on-brand content</li><li>Create authentic and relatable content by self-applying makeup. Must be comfortable with showing face in videos</li><li>Shoot TikTok-first videos that are relevant and aligned with our messaging guidelines while leveraging in-app features when applicable</li><li>Manage the monthly TikTok calendar that aligns with our overall marketing goals</li><li>Create engaging content in advance for the team’s review and know when to adjust the posting date to keep up with the fast-paced nature of trends</li><li>Craft strategic copy and utilize hashtags when necessary for the Copywriter to review</li><li>Publish content daily during top-performing times once approved by Social and Creative</li><li>Select engaging thumbnails that are on-brand and add copy overlay when applicable</li><li>Host lives to support key calendar moments or product launches</li><li>Source on-brand trending sounds for content that is licensed for commercial use</li><li>Capture behind-the-scenes content at events and tailor it to the platform (photoshoots, launch events, Sephora store visits, etc)</li><li>Actively monitor, engage and address customers on the platform</li><li>Lean into top-performing content by analyzing data and making content recommendations</li><li>End-to-end management of the platform, incl. creating, editing, publishing, copywriting and community management<br/><br/></li></ul>What We Are Looking For<br/><br/><ul><li>Required: Bachelor’s degree</li><li>1-2+ years of industry experience in a similar role, within the beauty industry</li><li>Proficiency in CapCut and Splice for video editing</li><li>Comfortable on-camera with experience in editing within the TikTok app</li><li>Detail-oriented with strong organizational, time management and project management skills</li><li>Ability to work in the office when needed to shoot on-brand office content featuring team members</li><li>Strong verbal and written communication skills</li><li>High proficiency in all social media platforms, including TikTok, Instagram, X, Facebook, Threads, Pinterest, etc</li><li>Self-starter, ability to thrive in a fast-paced, start-up environment</li><li>Passionate about makeup, skincare, and the beauty industry</li><li>Experience with social metrics (i.e. Dash Hudson) is a plus!<br/><br/></li></ul>What We Expect<br/><br/><ul><li>At Haus Labs, how you communicate is as important as what you communicate. We are seeking driven team players with strong communication skills and enthusiasm for collaboration</li><li>You’re a self-starter who possesses an entrepreneurial spirit</li><li>You thrive in a fast-paced, agile environment</li><li>You are a team player who approaches solutions from a place of curiosity and positivity</li><li>We are seeking HAUSmates who welcome constructive criticism and have impeccable attention to detail<br/><br/></li></ul>Our Pillars<br/><br/>ART: We are a creative collective that believes art has the power to shape the future.<br/><br/>SCIENCE: We unlock innovation using science and artistry.<br/><br/>KINDNESS: We are a collective community: universal, inclusive, and non-binary.<br/><br/>Everyone is welcome in our HAUS<br/><br/>“Baby, you were born this way.” Regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics, we want everyone to feel welcome. We are committed to building a diverse and inclusive, equal opportunity workplace.<br/><br/>Powered by JazzHR<br/><br/>vObT4XuwFO", "responsibilities": "Responsible for leading the TikTok content creation strategy, and reactively and proactively producing on-brand contentCreate authentic and relatable content by self-applying makeup. Must be comfortable with showing face in videosShoot TikTok-first videos that are relevant and aligned with our messaging guidelines while leveraging in-app features when applicableManage the monthly TikTok calendar that aligns with our overall marketing goalsCreate engaging content in advance for the team’s review and know when to adjust the posting date to keep up with the fast-paced nature of trendsCraft strategic copy and utilize hashtags when necessary for the Copywriter to reviewPublish content daily during top-performing times once approved by Social and CreativeSelect engaging thumbnails that are on-brand and add copy overlay when applicableHost lives to support key calendar moments or product launchesSource on-brand trending sounds for content that is licensed for commercial useCapture behind-the-scenes content at events and tailor it to the platform (photoshoots, launch events, Sephora store visits, etc)Actively monitor, engage and address customers on the platformLean into top-performing content by analyzing data and making content recommendationsEnd-to-end management of the platform, incl. creating, editing, publishing, copywriting and community management", "qualifications": {"required": "Bachelor’s degree1-2+ years of industry experience in a similar role, within the beauty industryProficiency in CapCut and Splice for video editingComfortable on-camera with experience in editing within the TikTok appDetail-oriented with strong organizational, time management and project management skillsAbility to work in the office when needed to shoot on-brand office content featuring team membersStrong verbal and written communication skillsHigh proficiency in all social media platforms, including TikTok, Instagram, X, Facebook, Threads, Pinterest, etcSelf-starter, ability to thrive in a fast-paced, start-up environmentPassionate about makeup, skincare, and the beauty industry", "preferred": "Experience with social metrics (i.e. Dash Hudson) is a plus!"}, "skills": ["TikTok", "CapCut", "Splice", "Social Media", "Marketing", "Content Creation", "Video Editing", "Communication", "Project Management", "Time Management", "Organization", "Beauty Industry", "Makeup", "Skincare", "Dash Hudson"], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4005279848"}