{"jobTitle": "Front Office Representative", "company": {"name": "Fresh Form Draft", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Architecture and Planning", "description": "Description Description: As a Front Office Representative at TMZ Events, you will be the welcoming face and voice of our organization. You will handle the day-to-day front office operations, ensuring a smooth and professional experience for all visitors and clients. Your role is vital in maintaining our company’s image and providing exceptional customer service.<br/><br/>Key Responsibilities Responsibilities: Greet and welcome visitors and clients with a friendly and professional demeanor. Answer and direct incoming phone calls, providing information or directing inquiries to the appropriate person. Manage the front desk area, ensuring it is tidy and presentable at all times. Handle incoming and outgoing mail, packages, and deliveries. Assist with scheduling appointments and managing calendars for staff members. Maintain accurate records of visitor logs and manage security protocols. Provide general administrative support, including data entry, filing, and maintaining office supplies. Collaborate with other departments to ensure smooth operations and support event preparations. Skills, Knowledge and Expertise Qualifications: High school diploma or equivalent; additional qualifications in office administration are a plus. Previous experience as a Front Office Representative, Receptionist, or in a similar role is preferred. Excellent communication and interpersonal skills. Strong organizational and multitasking abilities. Proficiency in Microsoft Office Suite (Word, Excel, Outlook). Ability to maintain a professional appearance and demeanor at all times. Strong attention to detail and problem-solving skills. Benefits Benefits: Competitive salary with opportunities for career growth. Weekends off to enjoy personal time and recharge. Health insurance benefits, including medical, dental, and vision coverage. Opportunities for ongoing training and professional development. A supportive and collaborative work environment in the heart of Los Angeles. Welcome to Fresh Form Draft – where imagination meets innovation in the world of architecture. Our firm is a dynamic and creative force that is dedicated to transforming spaces into living works of art. With a passion for design excellence and a commitment to pushing the boundaries of architectural possibilities, we pride ourselves on crafting environments that inspire, elevate, and resonate with both aesthetics and functionality. Founded with a vision to redefine the architectural landscape, Fresh Form Draft brings together a team of diverse talents, each contributing their unique expertise to every project we undertake. Our collaborative approach ensures that every client’s aspirations are not only met but exceeded. From conceptualization to realization, we work hand in hand with our clients to bring their dreams to life, weaving their stories and desires into the very fabric of our designs.", "postedDate": "2 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4005805781"}