{"jobTitle": "Account Coordinator", "company": {"name": "Open Influence", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "Do you catch yourself saying \"I saw this TikTok the other day…\" more often than you'd comfortably admit? Are you the friend that plans the itinerary whenever there's a trip? Our team of influencer marketing experts is growing, and we're looking for people who not only understand the social media landscape, but live and breathe on the cutting edge of it.<br/><br/>At Open Influence, we have the privilege of working with some of the world's top brands, such as Amazon, Disney, Coca Cola, T-Mobile, Netflix, L'Oreal. Our recipe for success brings data, innovation and creativity to every brand strategy and creator collaboration. From kickoff to merchandising performance, the campaigns are powered by our best-in-class account management team. That's where you come in…<br/><br/>We won't bury the lead: success in this role requires a creative \"free-range\" mindset, paired with immaculate project management skills and attention to the finer details. We combine our passion for culture with an infectious commitment to driving meaningful results for our clients. Sure, every agency will have a 'work hard, play harder' environment. Our approach is: work smarter, play better.<br/><br/>A job description won't do Open Influence's company culture justice, but we'll give you a snapshot in a few bullets.<br/><br/><ul><li>We understand that culture starts at the top. Our management team has an ''open door' policy at all times, and actively creates safe, inclusive spaces to connect, share, and strategize.</li><li>We recognize and celebrate each other's wins, and pick each other up when we stumble (which, spoiler alert: we all do).</li><li>We aren't afraid to look in the mirror. We continually learn, grow, and improve what we do and how we do it.</li><li>Plus, a bunch of other perks like a professional development stipend, Summer (+ 'No Meeting') Fridays, phone bill reimbursement, full benefits and more.<br/><br/></li></ul>The Account Coordinator is responsible for owning influencer sourcing and communication for various Open Influence clients, working closely with Account Managers throughout campaign execution from kickoff to reporting. Candidates for this position are highly motivated, self-assured team players with strong communication and social media skills. You will be a part of a high-caliber team in an industry that is experiencing rapid and dramatic growth.<br/><br/><em><strong>This role requires a commute to our LA office 1x per week. <br/><br/></strong></em><strong>Role &amp; Responsibilities:<br/><br/></strong><ul><li>Work closely with cross-functional teams to ensure successful campaign execution</li><li>Manage talent communications in accordance with larger campaign strategy</li><li>Analyze campaigns and work with account managers to optimize performance</li><li>Ownership of the influencer search and selection process</li><li>Create, own and update campaign data spreadsheets</li><li>Conduct talent vetting of and negotiations with potential campaign talent</li><li>Ensure influencer content creation is following all brand guidelines and legal requirements</li><li>Conduct detailed screening of campaign analytics &amp; daily monitoring of post-activity</li><li>Craft campaign presentations or campaign briefs for influencers</li><li>Develop streamlined processes using creative problem-solving tactics for unique campaign opportunities<br/><br/></li></ul><strong>Requirements:<br/><br/></strong><ul><li>Minimum 1+ years of experience in marketing or social media is preferred</li><li>Must have a thorough understanding of Instagram, YouTube, and TikTok</li><li>Must be a self-starter with the ability to handle multiple projects, prioritize work assignments, meet deadlines, and work independently in a fast-paced environment</li><li>Exceptional communication and organizational skills</li><li>Should be excited about social strategy and have a passion for influencers</li><li>Must be extremely detail-oriented</li><li>Have a fun and positive working attitude!<br/><br/></li></ul>Open Influence provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.<br/><br/>Click here to view Open Influence's privacy policy", "responsibilities": "The Account Coordinator is responsible for owning influencer sourcing and communication for various Open Influence clients, working closely with Account Managers throughout campaign execution from kickoff to reporting. Candidates for this position are highly motivated, self-assured team players with strong communication and social media skills. You will be a part of a high-caliber team in an industry that is experiencing rapid and dramatic growth.<br/><br/><em><strong>This role requires a commute to our LA office 1x per week. <br/><br/></strong></em><strong>Role &amp; Responsibilities:<br/><br/></strong><ul><li>Work closely with cross-functional teams to ensure successful campaign execution</li><li>Manage talent communications in accordance with larger campaign strategy</li><li>Analyze campaigns and work with account managers to optimize performance</li><li>Ownership of the influencer search and selection process</li><li>Create, own and update campaign data spreadsheets</li><li>Conduct talent vetting of and negotiations with potential campaign talent</li><li>Ensure influencer content creation is following all brand guidelines and legal requirements</li><li>Conduct detailed screening of campaign analytics &amp; daily monitoring of post-activity</li><li>Craft campaign presentations or campaign briefs for influencers</li><li>Develop streamlined processes using creative problem-solving tactics for unique campaign opportunities<br/><br/></li></ul>", "qualifications": {"required": "Minimum 1+ years of experience in marketing or social media is preferred, Must have a thorough understanding of Instagram, YouTube, and TikTok, Must be a self-starter with the ability to handle multiple projects, prioritize work assignments, meet deadlines, and work independently in a fast-paced environment, Exceptional communication and organizational skills, Should be excited about social strategy and have a passion for influencers, Must be extremely detail-oriented, Have a fun and positive working attitude!"}, "skills": ["Instagram", "YouTube", "TikTok", "Social Media", "Marketing", "Project Management", "Communication", "Organization"], "postedDate": "1 day ago", "benefits": "Plus, a bunch of other perks like a professional development stipend, Summer (+ 'No Meeting') Fridays, phone bill reimbursement, full benefits and more.", "url": "https://www.linkedin.com/jobs/view/4005132201"}