{"jobTitle": "Principal Counsel, Netflix Games", "company": {"name": "Netflix", "location": "Los Gatos, CA", "industry": "Entertainment Providers"}, "location": "Los Gatos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$180,000 - $690,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Netflix has been revolutionizing entertainment for years in film and television and is continuing to expand its business through a collection of Netflix curated and produced games. Netflix’s Games initiative is the newest addition to its entertainment offerings and a growing part of the global business. Subscribers all over the world who are already enjoying TV and film content anytime, anywhere, can now download and play mobile games like <em>Grand Theft Auto </em>and <em>Too Hot to Handle </em>any time, anywhere. With plans for an ambitious slate of new games upcoming, Netflix’s Games team is a dynamic and exciting place to be. This is your chance to be at the forefront of Netflix’s video game offering and help shape the path forward for this evolving part of the business.<br/><br/>The Netflix Games Legal Team is seeking a talented and passionate lawyer to join the team and lead its transmedia focus on bringing content to life through interactive entertainment. The successful candidate should have broad-based entertainment experience and an in-depth understanding of both content creation and game-specific matters.<br/><br/><strong>Key Responsibilities<br/><br/></strong>In this role, the successful candidate will:<br/><br/><ul><li>Draft and negotiate agreements related to content and game development and distribution, including license agreements, talent agreements, consultation, production and development services, video game rights acquisition, writer agreements and related materials. </li><li>Review a high volume of content-related agreements, including production services, licensing, and talent agreements, to ascertain rights and perform subsequent rights analysis.</li><li>Support our Internal Games team, focused on native incubation and development of games, and our External Games team, focused on third party licenses and partnerships, across all transmedia efforts. </li><li>Work closely with cross-functional teams, including Business and Legal Affairs, Consumer Products &amp; Experiences, Content, External Games, Internal Games, IP, Labor, Marketing, and Transmedia, to ensure alignment across all key stakeholders. </li><li>Design, update, and implement transmedia-focused processes related to tracking project matters, including rights, approvals, and internal requirements. <br/><br/></li></ul>This role is hybrid and based in either Los Gatos, CA or Los Angeles, CA, and reports to the Head of Games Legal.<br/><br/>The ideal candidate will be intellectually curious, demonstrate great initiative, and be excited and inspired by the Netflix culture.<br/><br/><strong>What We’re Looking For<br/><br/></strong><ul><li>10+ years of relevant experience as a lawyer, including in the entertainment space. Prior in-house experience at a major entertainment studio and within a Games legal team is strongly preferred. </li><li>Highly adept at commercial contracting and negotiating. </li><li>Strong analytical capabilities and judgment. Prior experience analyzing content-related rights issues is strongly preferred. </li><li>Ability to work autonomously and reliably within tight timeframes in a fast-paced and high-performance environment while supporting multiple stakeholders.</li><li>Exceptional interpersonal and communication skills (both oral and written).</li><li>Ability to take initiative to identify and solve problems in a business-friendly and solutions-oriented manner.</li><li>Excellent organizational and time management skills with an ability to multitask, prioritize, and meet deadlines.</li><li>High degree of professional ethics and integrity.</li><li>Flexibility to work across various projects and teams.</li><li>Enthusiasm to work with fast-moving, innovative Netflix Games team.<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $180,000 - $690,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "In this role, the successful candidate will:<br/><br/><ul><li>Draft and negotiate agreements related to content and game development and distribution, including license agreements, talent agreements, consultation, production and development services, video game rights acquisition, writer agreements and related materials. </li><li>Review a high volume of content-related agreements, including production services, licensing, and talent agreements, to ascertain rights and perform subsequent rights analysis.</li><li>Support our Internal Games team, focused on native incubation and development of games, and our External Games team, focused on third party licenses and partnerships, across all transmedia efforts. </li><li>Work closely with cross-functional teams, including Business and Legal Affairs, Consumer Products &amp; Experiences, Content, External Games, Internal Games, IP, Labor, Marketing, and Transmedia, to ensure alignment across all key stakeholders. </li><li>Design, update, and implement transmedia-focused processes related to tracking project matters, including rights, approvals, and internal requirements. <br/><br/></li></ul>", "qualifications": {"required": "10+ years of relevant experience as a lawyer, including in the entertainment space. Prior in-house experience at a major entertainment studio and within a Games legal team is strongly preferred. \nHighly adept at commercial contracting and negotiating. \nStrong analytical capabilities and judgment. Prior experience analyzing content-related rights issues is strongly preferred. \nAbility to work autonomously and reliably within tight timeframes in a fast-paced and high-performance environment while supporting multiple stakeholders.\nExceptional interpersonal and communication skills (both oral and written).\nAbility to take initiative to identify and solve problems in a business-friendly and solutions-oriented manner.\nExcellent organizational and time management skills with an ability to multitask, prioritize, and meet deadlines.\nHigh degree of professional ethics and integrity.\nFlexibility to work across various projects and teams.\nEnthusiasm to work with fast-moving, innovative Netflix Games team.<br/><br/>", "preferred": ""}, "skills": [], "postedDate": "1 day ago", "applicationDeadline": "", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4005139965"}