{"jobTitle": "Retail Store Manager adidas - Century City 6580, Los Angeles, CA", "company": {"name": "adidas", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Sales and Customer Service", "industry": "Manufacturing, Retail, and Sporting Goods Manufacturing", "description": "At adidas we have been challenging the status quo for 70 years and we’re not done yet.<br/><br/>We are calling all Store Managers who don’t accept what “was” or what “is,” but those who want to create what will be, and who share our desire to make a difference. We believe sport has the power to change lives. To bring this mission to life we foster a culture centered on creativity, confidence, and collaboration, and while we will never rest on our laurels, we are humbled that this has allowed us to be recognized as one of the “world’s most attractive employers.”<br/><br/>We also understand that the future runs on diverse and fresh perspectives. True to this spirit, we believe in assembling talented teams from far and wide and unite by a common goal: to be the best sports company in the world. As an international company with over 55 thousand employees and over 160 retail stores across the U.S. alone, adidas employees are exposed to different cultures, languages, and life experiences, which we believe is the fastest way to grow. The future is in your hands.<br/><br/><strong>About<br/><br/></strong>We could list tired, old bullet points about Store Manager tasks but we’re confident you already know that. Here’s a bit about the kind of leaders we look for:<br/><br/>Creators- If you want to build a tomorrow better than the day that came before, you’re a creator Creators find inspiration in unlikely places, look at the world in their own unique way, are confident and have an uncanny ability to connect dots that others just don’t see.<br/><br/>Innovators- You can dive into a complex problem and come out the other end with the simple solution no one else saw coming.<br/><br/>Confident- Be bold and bring a fresh perspective to the table. It’s the people who see the world a little differently than the rest that create the breakthroughs that inspire us all.<br/><br/>Determined - Never settle. Our work space is about discovery. Competition exists...but only by competing with your personal best, not your team members. Discover your boundaries and push them. Discover your team’s strengths and build them.<br/><br/>Collaborators – You thrive on building relationships and creating partnerships to help us be the best sports brand in the world.<br/><br/>Genuine- Be real. Tell it how it is. Being a leader isn’t about winning a popularity contest. Being a leader is about inspiring others to be their very best!<br/><br/>Ready to apply? Here’s what you need to know:<br/><br/><ul><li> Must possess and consistently exhibit the competencies relative to the position</li><li> Excellent Skills in operating personal computers, POS systems, and various software packages including MS office.</li><li> Knowledge and understanding of profit and loss statement and store KPIs to make commercial decisions based on sound financial judgment.</li><li> Strong interpersonal and communication skills including the ability to lead discussions in diverse groups of varying size.</li><li> Excellent time management and problem solving skills as well as the ability to use good judgment and make strong independent decisions.</li><li> Demonstrates an inspirational attitude that contributes to a positive team environment.</li><li> Ability to build and maintain effective working relationships with team members along with willingness to set and maintain high standards of performance.</li><li> Well developed ability to speak, read, comprehend, and write English.</li><li> Ability to maintain reliable and consistent attendance and punctuality.</li><li> Ability and willingness to travel by car and air domestically.</li><li> While performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to stand; walk; use hands to finger, handle, or feel; and reach with hands and arms. The employee is occasionally required to sit; climb or balance; and stoop, kneel, crouch, crawl, and operate a Brannock device.</li><li> The employee must frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds.</li><li> Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, and ability to adjust focus.</li><li> Ability to work for long periods of time, typically 10-12 hours per day during peak seasonal periods.</li><li> Must be 18 years or older.</li><li>4-year college or university degree in business, retail management, or related field or equivalent combination of education and experience</li><li>Minimum 18 months experience working in a sports/fashion customer &amp; commercial focused retail environment with a minimum 12 months of Store Management experience. </li><li>Diversity, Equity, and Inclusion at adidas means championing individual uniqueness and cultivating a culture of belonging in which everyone can create at their best. We embrace diverse backgrounds, experiences, and perspectives and seek to create a workforce that reflects our consumers and communities. </li><li>adidas offers robust and progressive medical, including HSA (Health Savings Account) with employer funding or FSA (Flexible Spending Account) options, dental, vision, prescription drug coverage, fertility support, short and long-term disability, and basic life and AD&amp;D insurance, which can be supplemented with employee-paid coverage. After meeting eligibility criteria, employees are able to enroll in adidas’ 401k plan and Stock Purchase Plan with employer match. Employees accrue prorated flexible time off in the amount .3512 hours per day that increases with years of service and 7 paid holidays a year. </li><li>The anticipated low and high end of the base pay range for this position is $70,803 - $106,205. Actual salary will be based on various factors, such as a candidate’s experience, qualifications, skills and competencies, and proficiency for the role. </li><li>Though our teammates hail from all corners of the world, our working language is English.</li></ul>", "postedDate": "3 days ago", "benefits": "adidas offers robust and progressive medical, including HSA (Health Savings Account) with employer funding or FSA (Flexible Spending Account) options, dental, vision, prescription drug coverage, fertility support, short and long-term disability, and basic life and AD&amp;D insurance, which can be supplemented with employee-paid coverage. After meeting eligibility criteria, employees are able to enroll in adidas’ 401k plan and Stock Purchase Plan with employer match. Employees accrue prorated flexible time off in the amount .3512 hours per day that increases with years of service and 7 paid holidays a year.", "salary": {"amount": "70,803 - 106,205", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4005205143"}