{"jobTitle": "Online Marketing Events Specialist", "company": {"name": "Recooty", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Software Development", "description": "Job Description: Online Marketing Events Specialist<br/><br/>Do you have the following skills, experience and drive to succeed in this role Find out below.<br/><br/>Department: Marketing<br/><br/><strong>Summary<br/><br/></strong>We are seeking a creative and detail-oriented Online Marketing Events Specialist to join our dynamic team in the Hospitality industry. The ideal candidate will be responsible for planning, coordinating, and executing online marketing events to promote our brand and engage with our target audience.<br/><br/><strong>Responsibilities<br/><br/></strong>Develop and implement online marketing event strategies to drive brand awareness and customer engagement<br/><br/>Create compelling event content, including webinars, virtual conferences, and live streams<br/><br/>Coordinate with internal teams and external partners to ensure seamless execution of online events<br/><br/>Analyze event performance metrics and provide recommendations for improvement<br/><br/>Stay up-to-date on industry trends and best practices in online event marketing<br/><br/><strong>Qualifications<br/><br/></strong>Bachelor's degree in Marketing, Communications, or related field<br/><br/>2+ years of experience in online marketing event planning and execution<br/><br/>Proficiency in online event platforms and tools<br/><br/>Strong project management and organizational skills<br/><br/>Excellent written and verbal communication skills<br/><br/>If you are passionate about creating engaging online events and driving brand visibility, we want to hear from you! Apply now to join our team as an Online Marketing Events Specialist.<br/><br/>#J-18808-LjbffrRemote working/work at home options are available for this role.", "postedDate": "4 days ago", "skills": ["Marketing", "Communications", "Online Event Planning", "Event Execution", "Project Management", "Organizational Skills", "Written Communication", "Verbal Communication"], "url": "https://www.linkedin.com/jobs/view/4005167347"}