{"jobTitle": "Operations Associate", "company": {"name": "Retail For The People", "location": "Chino, CA"}, "location": "Chino, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Internet Publishing", "description": "Position: US Operations Associate<br/><br/>Reporting to:Outbound &amp; Returns Manager<br/><br/>We are seeking a dedicated <strong>Operations Associate</strong> to join our Client's team at their <strong>Distribution Center</strong> in <strong>Chino Hills</strong> and uphold our Client's values through exceptional service to their customers, primarily by supporting in outbound and returns tasks. Reporting to the Outbound Returns Manager, this role will play a crucial part in ensuring that all fulfillment Service Level Agreements (SLAs) are met.The role would be 5 days/week onsite (standard hours.)<strong>This will be a temp-to-hire role.<br/><br/></strong><strong>Responsibilities:<br/><br/></strong><ul><li>Provide outstanding service to customers by efficiently managing outbound and returns tasks</li><li>Collaborate closely with the Outbound Returns Manager to meet all fulfillment SLAs</li><li>Prioritizing assistance in manual return processing SOP</li><li>Communicate any issues or updates promptly to internal teams and third-party logistics (3PL) partners</li><li>Work diligently in the warehouse daily, actively engaged in returns manual processes to ensure adherence to SLAs</li><li>Maintain a keen eye for identifying issues in the returns process and escalate them promptly to the manager</li><li>Support with reporting for both Outbound and Returns whenever needed</li><li>Ensure timely processing of returns and provide necessary information to other departments as required</li><li>Follow on Outbound Status Update from 3PL</li><li>Assist with any Outbound/Returns tasks as needed</li><li>Assist with Outbound and Returns Reports when needed<br/><br/></li></ul><strong>Role-Based Competencies:<br/><br/></strong><ul><li>Efficiency. Able to produce significant output with minimum wasted effort</li><li>Organization/Planning. Plans, organizes, and schedules in an efficient manner. Focuses on key priorities</li><li>Efficiency. Able to produce significant output with minimum wasted effort</li><li>Proactive. Acts without being told what to do. Brings new ideas to the company</li><li>Follow-through commitments. Lives up to verbal and written agreements</li><li>Intelligence. Learns quickly. Demonstrates the ability to quickly and proficiently understand and absorb new information</li><li>Persistence. Demonstrates tenacity and willingness to go the distance to get something done</li><li>Ability to troubleshoot and be solution-oriented. Is flexible and adaptable to all changes in the business while emulating company values<br/><br/></li></ul><strong>Culture Competencies:<br/><br/></strong><ul><li>Work ethic. Possesses a strong willingness to work hard and sometimes long hours to get the job done. Has a track record of working hard</li><li>Enthusiasm. Exhibits passion and excitement over work. Has a can-do attitude</li><li>Flexibility/Adaptability. Adjusts quickly to changing priorities and conditions. Copes effectively with complexity and change</li><li>Listening skills. Let’s others speak and seeks to understand their viewpoints</li><li>Openness to criticism and ideas. Often solicits feedback and reacts calmly to criticism or negative feedback<br/><br/></li></ul><strong>Process &amp; Procedures:<br/><br/></strong><ul><li>Follows our procedures to manually process any rejected returns</li><li>Assist with reporting the information to all stakeholders involved</li><li>Supports both the Returns and Outbound Associates</li><li>Ensures that we met our SLA’s for both Outbound and Returns</li><li>Able to assist with any ad-hoc project, as needed<br/><br/></li></ul><strong>Collaboration:<br/><br/></strong><ul><li>In the absence of team lead, serves as a point of escalation for OPS, CX, PR, &amp; 3PL</li><li>Is reliable performing projects, persistent and can be trusted to get the job done</li><li>Support Returns and Outbound Team when needed – Needs Review, escalated returns, and any other tasks related</li><li>Supports Operations Teams where needed<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><strong>Experience:<br/><br/></strong><ul><li>1 year of Customer service experience with a track record of providing excellent customer service</li><li>Previous experience in outbound and returns management is preferred</li><li>Strong attention to detail and ability to work efficiently in a fast-paced environment</li><li>Excellent communication skills to liaise effectively with internal teams and 3PL partners</li><li>Proactive approach to problem-solving, with the ability to identify and address issues promptly</li><li>Flexibility to work in a warehouse setting and contribute to manual processes as needed</li><li>Basic Excel &amp; Google Sheets experience, Ecom Experience<br/><br/></li></ul><strong>Education:<br/><br/></strong><ul><li>2 years of college or related work experience preferred<br/><br/></li></ul>Powered by JazzHR<br/><br/>AcwOYxwqdj", "responsibilities": "Provide outstanding service to customers by efficiently managing outbound and returns tasksCollaborate closely with the Outbound Returns Manager to meet all fulfillment SLAsPrioritizing assistance in manual return processing SOPCommunicate any issues or updates promptly to internal teams and third-party logistics (3PL) partnersWork diligently in the warehouse daily, actively engaged in returns manual processes to ensure adherence to SLAsMaintain a keen eye for identifying issues in the returns process and escalate them promptly to the managerSupport with reporting for both Outbound and Returns whenever neededEnsure timely processing of returns and provide necessary information to other departments as requiredFollow on Outbound Status Update from 3PLAssist with any Outbound/Returns tasks as neededAssist with Outbound and Returns Reports when needed", "qualifications": {"required": "1 year of Customer service experience with a track record of providing excellent customer servicePrevious experience in outbound and returns management is preferredStrong attention to detail and ability to work efficiently in a fast-paced environmentExcellent communication skills to liaise effectively with internal teams and 3PL partnersProactive approach to problem-solving, with the ability to identify and address issues promptlyFlexibility to work in a warehouse setting and contribute to manual processes as neededBasic Excel &amp; Google Sheets experience, Ecom Experience", "preferred": "2 years of college or related work experience preferred"}, "skills": ["Customer Service", "Outbound", "Returns Management", "Communication", "Problem Solving", "Excel", "Google Sheets", "Ecom"], "postedDate": "2 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005553147"}