{"jobTitle": "Social Media Coordinator (Communications & Marketing)", "company": {"name": "SAG-AFTRA", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Entertainment Providers", "description": "<strong>Overview<br/><br/></strong><strong> Who We Are <br/><br/></strong>SAG-AFTRA is the iconic American labor union that represents approximately 160,000 media professionals. SAG-AFTRA employees support our members and thrive on securing the strongest protections by negotiating the best wages, working conditions, health and pension benefits. We preserve and expand members’ work opportunities, vigorously enforce our contracts and protect our members against unauthorized use of their work.<br/><br/><strong>Responsibilities<br/><br/></strong><strong> What You’ll Do <br/><br/></strong>In collaboration with the Social Media Specialist, the Social Media Coordinator creates daily content, manages social media calendars, and provides regular reporting, analytics and recommendations for SAG-AFTRA’s multiple social media channels.<br/><br/><strong> (This section provides a general summary of the most significant job duties performed. It does not explain in detail every single duty performed.) <br/><br/></strong><ul><li> Work with Social Media Specialist to build and maintain social media calendars across various platforms (Facebook, Twitter, Instagram, TikTok, etc.) </li><li> Generate, edit, publish and share daily content (copy, images, videos) that maintains and builds strong, meaningful engagement — and encourages SAG-AFTRA community members to take action, get involved, feel inspired, etc. </li><li> Produce creative graphics, GIFs and video/audio assets to be used across social platforms that are aligned with the brand. </li><li> Work with Social Media Specialist to develop and execut e multiple campaigns across the organization’s social media platforms, and assist with strategic and tactical support for local communications. </li><li> Track social analytics, competitive listening, issue/trend tracking and create reports summarizing key performance metrics. </li><li> Monitor, moderate, respond and escalate convers ations as needed. </li><li> Assist Social Media Specialist with events and union activities by attending and producing live social media content as assigned. </li><li> Collaborate with other internal departments to develop and advance campaigns, identify key players, maintain approvals, and coordinate actions. </li><li> Monitor all applicable third-party social media content (user-generated, like-minded groups, producers) and identif y ways for our organization to continue ongoing social media conversations. </li><li> Work with Social Media Specialist to strategize through competitive research, platform determination, benchmarking, analytics, metrics, messaging and audience identification to expand SAG-AFTRA ’s social media reach . </li><li> Follow and execute official policy, procedure and style guides for all communications </li><li> Work with Social Media Specialist to d ev elop, implement and maintain a social-specific style guide, including tone, voice, look and feel, branding, etc. for each channel. </li><li> Undertake special projects and assignments and other duties as assigned. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong> What You’ll Need <br/><br/></strong><strong> We want to make sure you’re successful. To be considered, you must have: <br/><br/></strong><strong> ( </strong><strong> The individual must possess the following knowledge, skills and abilities and be able to explain and demonstrate that he or she can perform the essential functions of this job with or without reasonable accommodation, using some other combination of skills and abilities.) <br/><br/></strong><strong> Communications &amp; Marketing <br/><br/></strong><ul><li> Experience with multiple social media platforms and their available tools (Facebook Business Manager, Ads Manager, etc.), awareness for emerging and opportunity platforms, and reporting of social analytics and KPIs (experience with Hootsuite a plus). </li><li> Knowledge of social media best practices. </li><li> Excellent written and verbal communication skills are essential (experience with Google Workspace a plus). </li><li> Ability to produce creative, impactful social media content in brand voice and often within strict confines and practices of the organization (must provide examples of published work). </li><li> Experience with design programs such Photoshop, PremierePro, Illustrator and Canva to provide on-brand social graphics, photos, GIFs, etc. </li><li> Skilled in shooting photos and video for social media; ability to edit videos and audio for social. </li><li> Excellent presentation (GoogleSlides) and communication skills. </li><li> High level of attention to detail and fact-checking. </li><li> An eye for content that will generate engagement. </li><li> Knowledge/interest in the entertainment industry and/or labor unions preferred. <br/><br/></li></ul><strong>General<br/><br/></strong><ul><li> Have an understanding and awareness of the importance of labor unions, social justice and worker rights impacting SAG-AFTRA members. </li><li> Have a high sense of ownership and hold yourself and others accountable for a high level of performance and integrity. </li><li> Detailed-oriented, process and deadline driven with the ability to focus and produce results in a fast-paced environment, under tight deadlines without constant supervision. </li><li> Must be available and willing to work extended hours per day or per week (and/or overtime for applicable non-exempt positions), including weekends and holidays, as SAG-AFTRA determines is necessary to meet its business needs. </li><li> Self-motivated with the ability to work independently and be proactive, as well as work effectively in a team and across functional groups. </li><li> Strong organizational and project management skills with ability to stay on a determined timeline, while managing multiple projects simultaneously. </li><li> Must be confident, reliable, energetic with a positive attitude, accept responsibility, and handle pressure well. </li><li> Capable of taking direction from more than one supervisor; flexibility and adaptability to changes in workload and differing work styles of direct supervisors. </li><li> Superlative interpersonal skills: High degree of patience and tact. Must be able to cultivate respectful, strategic and collaborative relationships with people from diverse backgrounds both internally and externally. </li><li> Must be able to work in a challenging environment where constructive feedback from others is encouraged. </li><li> Must maintain regular and acceptable attendance at such level as is determined by SAG-AFTRA’s attendance policy. </li><li> Must be available and willing to travel to such locations and with such frequency as SAG-AFTRA determines is necessary or desirable to meet its business needs </li><li> Ability to initiate and promote process improvement. </li><li> Quick learner, flexible, highly adaptable, independent problem-solving and critical-thinking abilities. </li><li> Motivated and knowledgeable, with the ability to work in an environment where the team is small, geographically diverse and subject to sudden and frequent changes in priorities. <br/><br/></li></ul><strong> In addition, we will assess the following competencies as part of the candidate evaluation process. <br/><br/></strong><ul><li> Creativity </li><li> Communication </li><li> Cultural Awareness </li><li> Integrity and Trust </li><li> Informing </li><li> Listening </li><li> Organizing </li><li> Perspective </li><li> Time Management <br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><strong> Education and/or Experience <br/><br/></strong><ul><li> BA/BS degree in journalism, public relations, communications, marketing, advertising, new media or related field, or equivalent combination of education and experience. </li><li> 1-3 years’ experience in social media marketing, editorial or social department of an ecommerce, entertainment industry, digital media or agency environment, managing brand/organization pages on platforms such as Instagram, Facebook, Twitter, YouTube, TikTok, and LinkedIn. </li><li> Bilingual English/Spanish highly preferred. <br/><br/></li></ul><strong> Please provide a cover letter and attach or provide links to samples of personally written social media campaigns and analytic reports. <br/><br/></strong><strong>Certificates, Licenses, And/or Registrations<br/><br/></strong><ul><li> Certifications such as Hootsuite, Google Analytics and Google AdWords a plus. <br/><br/></li></ul><strong>What You’ll Get<br/><br/></strong><strong> We are a great place to work because we offer: <br/><br/></strong><ul><li> The hourly rate for this position is $25.55 per hour along with excellent employee benefits and perks such as a 35-hour work week. </li><li> Colleagues that are passionate about what we do and how they contribute to our mission </li><li> Balance between work and home life responsibilities </li><li> Affordable and comprehensive medical and dental plans </li><li> Generous pension plan </li><li> Employee discounts and perks</li></ul>", "responsibilities": "In collaboration with the Social Media Specialist, the Social Media Coordinator creates daily content, manages social media calendars, and provides regular reporting, analytics and recommendations for SAG-AFTRA’s multiple social media channels.", "qualifications": {"required": "( The individual must possess the following knowledge, skills and abilities and be able to explain and demonstrate that he or she can perform the essential functions of this job with or without reasonable accommodation, using some other combination of skills and abilities.)", "preferred": "Knowledge/interest in the entertainment industry and/or labor unions preferred."}, "skills": ["Facebook", "Twitter", "Instagram", "TikTok", "Hootsuite", "Google Workspace", "Photoshop", "PremierePro", "Illustrator", "Canva", "GoogleSlides"], "postedDate": "1 day ago", "benefits": "The hourly rate for this position is $25.55 per hour along with excellent employee benefits and perks such as a 35-hour work week. Colleagues that are passionate about what we do and how they contribute to our mission Balance between work and home life responsibilities Affordable and comprehensive medical and dental plans Generous pension plan Employee discounts and perks", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4005122434"}