{"jobTitle": "Project Coordinator", "company": {"name": "PRECISIONvalue", "industry": "Technology, Information and Internet", "size": "Not specified", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$40,000.00 - $60,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Technology, Information and Internet", "description": "Are you looking for a rewarding career in a collaborative environment passionate about growth? To keep pace with our growing agency we are on the hunt for a savvy Project Coordinator to join our team. This role is fully remote! Precision AQ (formally PRECISIONvalue), the leading payer marketing agency, supports global pharmaceutical and life sciences clients in the achievement of commercial excellence. To keep pace with our growing agency we are recruiting for a Project Coordinator to support our team! About You: Consider yourself a highly organized, self-starter with an eye for detail and a pulse on the bottom line? Do you flourish in face-paced environments and relish the particulars? If you're a born problem-solver and enjoy when no day is the same - keep reading. Oh and \"process\" is your middle name. You are interested in collaborating with a team of professionals who are encouraging, driven to succeed, and committed to quality contributions crucial to the successful execution of a variety of initiatives. You work passionately, never satisfied with the status quo. You are flexible, able to handle multiple projects at once and do your best work in an energizing environment. What you can expect day-to-day: You will serve as the main communication hub between all parties- Account and Shared Services- for assigned accounts. You will be responsible for working in conjunction with Account Services in coordinating tasks and tracking deadlines. Essential duties include but are not limited to: Demonstrate job knowledge and a thorough understanding of agency process, routing procedures, roles and responsibilities of team members. Orchestrate day-to-day activities on assigned accounts and become proficient in the preparation of project timelines, internal status reports, daily hot sheets, end of day lists and various other project management and tracking reports as needed. Gain thorough knowledge of clients' systems and procedures for tracking jobs; ensure internal team adheres to client requests accurately and in a timely manner. Organize and conduct internal status and attend job kick off meetings and weekly client status calls for assigned accounts. Prioritize and manage multiple jobs whilst paying strong attention to detail. Display a team approach and ensure communication between Account Services and Shared Services - anticipating problems and offering possible solutions. Specific tasks include: Educate team members when questions arise on agency or client process. Flag team members who are not complying with process and course correct as needed. Trouble-shoot process or system related questions with internal team members. Assist the Business Operations team to maintain the SocialBridge platform. Tasks include creating new accounts, managing and maintain workspaces, adding new team members for assigned accounts in SocialBridge (e-routing platform). Route projects (outlines manuscripts, layouts, mechanicals, and proofs) to internal teams using our e-routing system (SocialBridge) and ensure quality control on all assigned jobs. Qualifications: Bachelor's degree in marketing, communications, advertising or similar field. Minimum 1 year of related experience in an agency setting or marketing related role. Experience in supporting project management or marketing team- assisting in coordinating tasks and tracking deadlines. Working knowledge of timeline/schedule development preferred. Precision is required by law in some states or cities to include a reasonable estimate of the compensation range for this role. This compensation range takes into account the wide range of factors that are considered in making compensation decisions including but not limited to: skill sets, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled. At Precision, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. This role is also eligible for a discretionary annual bonus, health insurance, retirement savings benefits, life insurance and disability benefits, parental leave, and paid time off for sick leave and vacation, among other benefits. Reasonable estimate of the current range $40,000—$60,000 USD. Any data provided as a part of this application will be stored in accordance with our Privacy Policy. For CA applicants, please also refer to our CA Privacy Notice. Precision Medicine Group is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, age, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or other characteristics protected by law. If you are an individual with a disability and require a reasonable accommodation to complete any part of the application process or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact Precision Medicine Group at QuestionForHR@precisionmedicinegrp.com. It has come to our attention that some individuals or organizations are reaching out to job seekers and posing as potential employers presenting enticing employment offers. We want to emphasize that these offers are not associated with our company and may be fraudulent in nature. Please note that our organization will not extend a job offer without prior communication with our recruiting team, hiring managers and a formal interview process.", "responsibilities": "You will serve as the main communication hub between all parties- Account and Shared Services- for assigned accounts. You will be responsible for working in conjunction with Account Services in coordinating tasks and tracking deadlines. Essential duties include but are not limited to: Demonstrate job knowledge and a thorough understanding of agency process, routing procedures, roles and responsibilities of team members. Orchestrate day-to-day activities on assigned accounts and become proficient in the preparation of project timelines, internal status reports, daily hot sheets, end of day lists and various other project management and tracking reports as needed. Gain thorough knowledge of clients' systems and procedures for tracking jobs; ensure internal team adheres to client requests accurately and in a timely manner. Organize and conduct internal status and attend job kick off meetings and weekly client status calls for assigned accounts. Prioritize and manage multiple jobs whilst paying strong attention to detail. Display a team approach and ensure communication between Account Services and Shared Services - anticipating problems and offering possible solutions. Specific tasks include: Educate team members when questions arise on agency or client process. Flag team members who are not complying with process and course correct as needed. Trouble-shoot process or system related questions with internal team members. Assist the Business Operations team to maintain the SocialBridge platform. Tasks include creating new accounts, managing and maintain workspaces, adding new team members for assigned accounts in SocialBridge (e-routing platform). Route projects (outlines manuscripts, layouts, mechanicals, and proofs) to internal teams using our e-routing system (SocialBridge) and ensure quality control on all assigned jobs.", "qualifications": {"required": "Bachelor's degree in marketing, communications, advertising or similar field. Minimum 1 year of related experience in an agency setting or marketing related role. Experience in supporting project management or marketing team- assisting in coordinating tasks and tracking deadlines. Working knowledge of timeline/schedule development preferred.", "preferred": ""}, "skills": [], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "This role is also eligible for a discretionary annual bonus, health insurance, retirement savings benefits, life insurance and disability benefits, parental leave, and paid time off for sick leave and vacation, among other benefits.", "remoteWork": "Fully remote", "url": "https://www.linkedin.com/jobs/view/4005292947"}