{"jobTitle": "Receptionist", "company": {"name": "Erewhon", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "20 ‒ 22 Hourly", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Food & Beverages", "description": "Los Angeles, CA<br/><br/>$20 ‒ $22 Hourly<br/><br/>Corporate<br/><br/>Corporate<br/><br/>J<strong>oin the movement! Erewhon market is trailblazing in the health and wellness industry, and we’re rapidly expanding! Our culture comes from unstoppable leaders, inspiring staff, and the best food and wellness products on the planet. 10+ locations and growing. <br/><br/></strong><strong>What We Offer<br/><br/></strong><ul><li>$20 - $22 / hour (based on experience) </li><li>50% off organic meals daily</li><li>20% off in-store purchases </li><li>HUGE opportunities for career growth</li><li>401k with 4% match, Paid Vacation, Health Benefits and much more…<br/><br/></li></ul><strong>What You'll Do<br/><br/></strong><ul><li>Serves visitors by greeting, welcoming, and directing them appropriately.</li><li>Notifies company personnel of visitor arrival.</li><li>Keeps a safe and clean reception area by complying with procedures, rules, and regulations.</li><li>Assisting colleagues with administrative tasks.</li><li>Assisting with a variety of administrative tasks including copying, faxing and taking notes.</li><li>Maintain files and documentation thoroughly and accurately, in accordance with company policy.</li><li>Provide excellent customer service.</li><li>Additional duties and projects as assigned by Manager.<br/><br/></li></ul><strong>What You'll Bring<br/><br/></strong><ul><li>At least one year experience in customer service, phone answering experience and office administration experience required.</li><li>Possess professionalism and friendly, team player personality.</li><li>Basic knowledge of MS Excel functions required.</li><li>Excellent communication and administrative skills.</li><li>Exceptional organization and time management skills.</li><li>Dependable, self-starter and great multitasker.<br/><br/></li></ul><strong><strong><strong>Erewhon has many opportunities for career development and growth as we expand across Southern California with ten current stores (</strong><strong>Beverly Hills, </strong><strong>Calabasas, Culver City, Grove (Fairfax), Pasadena, Pacific Palisades, Santa Monica, Silver Lake, Studio City, and Venice).<br/><br/></strong></strong></strong><em>Erewhon Market is an equal opportunity employer and we are committed to Equal Employment Opportunity regardless of race, color, national origin, gender, sexual orientation, age, religion, veteran status, disability, history of disability or perceived disability, and per the Fair Chance Ordinance will consider qualified applications with criminal histories in a manner consistent with the ordinance.<br/><br/></em><em>To all recruitment agencies: We do not accept unsolicited agency resumes and are not responsible for any fees related to unsolicited resumes.<br/><br/></em><em>By applying, you agree to Erewhon's Notice of Collection policy and all its terms and conditions: https://www.erewhonmarket.com/notice_at_collection_applicant/</em>", "postedDate": "2 days ago", "skills": ["Customer Service", "Phone Answering", "Office Administration", "MS Excel", "Communication", "Administrative", "Organization", "Time Management"], "url": "https://www.linkedin.com/jobs/view/4005511757"}