{"jobTitle": "Production Planner", "company": {"name": "Jobot", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$80,000.00 - $95,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Manufacturing, Machinery Manufacturing, and Computers and Electronics Manufacturing", "description": "Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!<br/><br/>Job details<br/><br/><strong>Looking for a Production Planner to join our growing Supply Chain team!<br/><br/></strong>This Jobot Job is hosted by Chris Ochoa<br/><br/>Are you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.<br/><br/>Salary $80,000 - $95,000 per year<br/><br/><strong>A Bit About Us<br/><br/></strong>We are an established global manufacturing powerhouse, spanning diverse sectors such as Aerospace, Defense, Automotive, Electronics, Biotechnology, Food and Beverage, among others. Our dedication lies in delivering top-notch solutions to our clientele, propelled by our commitment to excellence and ethical conduct in both business and community engagement. Currently, we are seeking Production Planner to join our Supply Chain team in Valencia, Ca.<br/><br/><strong><br/><br/><strong>Why join us?<br/><br/><br/></strong></strong><ul><li> Strong Compensation </li><li> Benefits </li><li> Growth Opportunity </li><li> Room for advancement </li><li> Complex manufacturing environment<br/><br/></li></ul><strong>Job Details<br/><br/></strong>Job Details<br/><br/>We are seeking a dynamic and experienced Production Planner to join our team. This role is integral to our business operations and will be responsible for the planning and coordination of production processes. The successful candidate will have a hands-on role in managing production schedules, inventory, and supply chain processes to ensure efficient and timely production of goods. This is an excellent opportunity to make a significant impact within a fast-paced manufacturing environment, using state-of-the-art ERP/MRP systems.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Develop, maintain, and manage detailed production schedules to ensure optimal productivity in line with company goals.</li><li> Collaborate with cross-functional teams to forecast demand and determine production requirements.</li><li> Manage inventory levels to meet production needs while minimizing costs and maintaining quality standards.</li><li> Analyze manufacturing processes and procedures for efficiency and make recommendations for improvements.</li><li> Coordinate with Supply Chain Management to ensure a smooth flow of materials for production.</li><li> Use ERP/MRP systems to track, analyze, and report on production-related data.</li><li> Participate in product development processes to ensure manufacturability of new products.</li><li> Implement strategic planning to improve productivity, quality, and efficiency of operations.</li><li> Address issues or delays in production in a timely and effective manner.</li><li> Ensure compliance with industry regulations and standards related to manufacturing.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Minimum of 3 years of experience in production planning within the Manufacturing or Aerospace industry.</li><li> Proficient in ERP/MRP systems.</li><li> Strong knowledge of manufacturing processes and supply chain management.</li><li> Proven experience in production scheduling and inventory management.</li><li> Excellent understanding of Material Requirement Planning (MRP).</li><li> Experience working with cross-functional teams.</li><li> Proven ability in forecasting and strategic planning.</li><li> Solid understanding of product development processes.</li><li> Excellent problem-solving skills and the ability to make decisions under pressure.</li><li> Strong communication and interpersonal skills.</li><li> Bachelor's degree in Business, Engineering, Supply Chain Management, or related field is preferred.</li><li> APICS CPIM certification is a plus. <br/><br/></li></ul>Join us and be a part of a collaborative and innovative team dedicated to maintaining and improving our manufacturing processes. If you are a detail-oriented professional with a passion for efficiency and productivity, we would love to hear from you.<br/><br/>Interested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.<br/><br/><strong>Want to learn more about this role and Jobot?<br/><br/></strong>Click our Jobot logo and follow our LinkedIn page!<br/><br/>", "responsibilities": "<ul><li> Develop, maintain, and manage detailed production schedules to ensure optimal productivity in line with company goals.</li><li> Collaborate with cross-functional teams to forecast demand and determine production requirements.</li><li> Manage inventory levels to meet production needs while minimizing costs and maintaining quality standards.</li><li> Analyze manufacturing processes and procedures for efficiency and make recommendations for improvements.</li><li> Coordinate with Supply Chain Management to ensure a smooth flow of materials for production.</li><li> Use ERP/MRP systems to track, analyze, and report on production-related data.</li><li> Participate in product development processes to ensure manufacturability of new products.</li><li> Implement strategic planning to improve productivity, quality, and efficiency of operations.</li><li> Address issues or delays in production in a timely and effective manner.</li><li> Ensure compliance with industry regulations and standards related to manufacturing.<br/><br/></li></ul>", "qualifications": {"required": "Minimum of 3 years of experience in production planning within the Manufacturing or Aerospace industry.", "preferred": "Bachelor's degree in Business, Engineering, Supply Chain Management, or related field is preferred.\nAPICS CPIM certification is a plus. <br/><br/>"}, "skills": ["ERP/MRP systems", "Manufacturing processes", "Supply chain management", "Production scheduling", "Inventory management", "Material Requirement Planning (MRP)", "Forecasting", "Strategic planning", "Product development processes", "Problem-solving", "Communication", "Interpersonal skills"], "postedDate": "2 days ago", "benefits": "Strong Compensation, Benefits, Growth Opportunity, Room for advancement, Complex manufacturing environment", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005393993"}