{"jobTitle": "Internet Sales and Leasing Consultant (Auto)", "company": {"name": "Mark Christopher Auto Center", "location": "Ontario, CA"}, "location": "Ontario, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$50,000.00 - $150,000.00", "currency": "USD"}, "jobFunction": "Sales and Management", "industry": "Motor Vehicle Manufacturing", "description": "Mark Christopher Auto Center in Ontario, CA is ready to hire experienced Internet Sales Consultants with at least 2 years of experience within the automotive industry to join our fast-paced team. At Mark Christopher Auto Center, we strive to make every customer a customer for life.<br/><br/>Happy employees make happy customers and we reward individuals who are ready to work hard and stay motivated. Every employee at Mark Christopher Auto Center is absolutely critical to our success. Our promise is to keep delivering the same award winning service and value that our community has come to expect from our dealership through the years.<br/><br/>In this role:<br/><br/><ul><li>You will be the link between the buyer and their future vehicle. </li><li>You will learn about all of the newest vehicles and technologies on the market. </li><li>You will sell all 4 GM Brands including Chevrolet, GMC, Buick, Cadillac. </li><li>You will have access to a massive selection of used and Certified pre-owned vehicles. </li><li>You will assist the customer with questions regarding the company, perspective vehicles, and their ability to purchase or lease. <br/><br/></li></ul>What We Offer:<br/><br/>Aggressive pay plans with weekend bonuses and monthly bonuses. We have in-house training available dedicated to your success also offering on-line and in-store training programs with our manufacturers.<br/><br/><ul><li>Medical and Dental</li><li>401K Plan</li><li>Paid time off and vacation</li><li>Growth opportunities</li><li>Paid Training</li><li>Employee vehicle purchase plans</li><li>Family owned and operated</li><li>Long term job security</li><li>Saturday Lunches</li><li>Discounts on products and services<br/><br/></li></ul>Responsibilities and Expectations:<br/><br/><ul><li>Answer customer calls and establish follows-up with sales appointments Respond quickly to internet, phone and live chat inquiries using email, phone and live chat scripts and templates Provide customers with initial product information; direct them to the appropriate dealership resources Present initial financing options based on customer needs Follow up with leads that are not ready to make an appointment or no-show Participate in team and process development sessions - keeping positive relationships with teammates, sales teams and dealership management Utilize CRM tracking system daily Qualifications Possess at least 2 years of previous experience based in customer service role Possess at least 2 years of experience within the automotive Internet sales industry team player attitude Prompt and courteous and great communication skills Enthusiastic personality Must have strong written and computer skills Willing to submit to a pre-employment background check and drug screen. <br/><br/></li></ul>Please send resume or apply in person and ask for Greg Hess<br/><br/>Job Type: Full-time<br/><br/>Pay: $50,000.00 - $150,000.00 per year<br/><br/>Experience:<br/><br/><ul><li>Internet Car Sales: 2 years (Required)<br/><br/></li></ul>License:<br/><br/><ul><li>California Sales Person (Required)<br/><br/></li></ul><strong>Company Description<br/><br/></strong>Mark Christopher Auto Center services and sells all brands of General Motors vehicles. We have one of the largest parts inventories in the IE and are an extremely busy store with lots of potential to make money.<br/><br/>Mark Christopher Auto Center services and sells all brands of General Motors vehicles. We have one of the largest parts inventories in the IE and are an extremely busy store with lots of potential to make money.", "responsibilities": "Answer customer calls and establish follows-up with sales appointments Respond quickly to internet, phone and live chat inquiries using email, phone and live chat scripts and templates Provide customers with initial product information; direct them to the appropriate dealership resources Present initial financing options based on customer needs Follow up with leads that are not ready to make an appointment or no-show Participate in team and process development sessions - keeping positive relationships with teammates, sales teams and dealership management Utilize CRM tracking system daily", "qualifications": {"required": "Possess at least 2 years of previous experience based in customer service role Possess at least 2 years of experience within the automotive Internet sales industry team player attitude Prompt and courteous and great communication skills Enthusiastic personality Must have strong written and computer skills Willing to submit to a pre-employment background check and drug screen."}, "skills": ["Customer Service", "Sales", "Automotive", "CRM", "Communication"], "postedDate": "1 day ago", "benefits": "Aggressive pay plans with weekend bonuses and monthly bonuses. We have in-house training available dedicated to your success also offering on-line and in-store training programs with our manufacturers.<br/><br/><ul><li>Medical and Dental</li><li>401K Plan</li><li>Paid time off and vacation</li><li>Growth opportunities</li><li>Paid Training</li><li>Employee vehicle purchase plans</li><li>Family owned and operated</li><li>Long term job security</li><li>Saturday Lunches</li><li>Discounts on products and services<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005361991"}