{"jobTitle": "Program Coordinator", "company": {"name": "Gay For Good", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "23.00/hr - 25.00/hr", "currency": "USD"}, "jobFunction": "Other", "industry": "Civic and Social Organizations", "description": "<strong>Make a Difference as a Program Coordinator at Gay for Good!</strong>\n\n<strong> </strong>\n\nLocation: Hybrid (Long Beach, CA) - <strong>Candidates local to Long Beach, CA are strongly preferred.</strong>\n\nHours: Full Time\n\n \n\nAre you passionate about volunteerism and eager to make a tangible impact in the LGBTQ+ community? Gay for Good is looking for a dynamic and motivated Program Coordinator to join our team! If you're someone who thrives in a mission-driven environment, enjoys working with diverse communities, and can balance multiple responsibilities with ease, this might be the perfect role for you.\n\n \n\nWho We Are: Gay for Good is a nonprofit that mobilizes LGBTQ+ volunteers and allies to create positive change in communities across the country. We organize inclusive volunteer events to increase LGBTQ+ visibility and representation and build bridges between diverse communities while helping animals, the environment and people in need.  \n\n \n\nWho You Are:\n\n<ul>\n<li><strong>Experience</strong>: At least 2-3 years of experience in managing volunteers or similar roles. Familiarity with tools like Mailchimp, Canva, and WordPress is a plus!</li>\n<li><strong>Skills</strong>: Strong communication skills, both written and verbal. Ability to inspire and lead others, multitask, and stay organized, especially under pressure.</li>\n<li><strong>Mindset</strong>: Self-motivated, detail-oriented, and committed to making a difference. Comfortable working both independently and as part of a remote team. You thrive on managing a lot of little details.</li>\n<li><strong>Location</strong>: This role is hybrid, with a mix of remote and in-office work. <strong>We strongly prefer candidates who are local to Long Beach, California</strong>, as this will enable more effective participation in on-site activities and local community events.</li>\n</ul>\n\n \n\nWhat You'll Do:\n\n<ul>\n<li><strong>Support Chapter Leaders</strong>: Help onboard, train, and provide ongoing support to our amazing chapter leaders across the country.</li>\n<li><strong>Engage Volunteers</strong>: Manage volunteer communications, assist with our volunteer management system, and ensure everyone feels included and valued.</li>\n<li><strong>Community Outreach</strong>: Identify new partnership opportunities, represent Gay for Good at community events, and help us expand our reach.</li>\n<li><strong>Special Events</strong>: Plan and support national service events, fundraisers, and other exciting projects that bring our mission to life.</li>\n<li><strong>Administrative Tasks</strong>: Keep our operations running smoothly by managing communications, reporting on volunteer activities, and more.</li>\n</ul>\n\n \n\nWhat's In It for You:\n\n<ul>\n<li><strong>Competitive Compensation</strong>: We offer competitive hourly compensation.</li>\n<li><strong>Benefits</strong>: Qualified Small Employer Health Reimbursement Arrangement (QSEHRA), generous paid time off, and telecom stipend.</li>\n<li><strong>Growth Opportunities</strong>: We support your professional development with access to training, workshops, and the potential for career advancement within our growing organization.</li>\n<li><strong>Make an Impact</strong>: You'll be directly contributing to our mission, helping to create inclusive communities and lasting change.</li>\n</ul>\n\n \n\nHow to Apply: Ready to join our team? <strong>Submit your resume on Linkedin and email a cover letter </strong>detailing your passion for our mission and how your experience aligns with the role to <strong>admin@gayforgood.org</strong>. \n\n \n\nEqual Opportunity Employer: We celebrate diversity and are committed to creating an inclusive environment for all employees. Gay for Good does not discriminate based on race, color, religion, gender, sexual orientation, gender identity, national origin, disability, veteran status, or any other protected status.", "responsibilities": "Support Chapter Leaders: Help onboard, train, and provide ongoing support to our amazing chapter leaders across the country.\nEngage Volunteers: Manage volunteer communications, assist with our volunteer management system, and ensure everyone feels included and valued.\nCommunity Outreach: Identify new partnership opportunities, represent Gay for Good at community events, and help us expand our reach.\nSpecial Events: Plan and support national service events, fundraisers, and other exciting projects that bring our mission to life.\nAdministrative Tasks: Keep our operations running smoothly by managing communications, reporting on volunteer activities, and more.", "qualifications": {"required": "Experience: At least 2-3 years of experience in managing volunteers or similar roles. Familiarity with tools like Mailchimp, Canva, and WordPress is a plus!\nSkills: Strong communication skills, both written and verbal. Ability to inspire and lead others, multitask, and stay organized, especially under pressure.\nMindset: Self-motivated, detail-oriented, and committed to making a difference. Comfortable working both independently and as part of a remote team. You thrive on managing a lot of little details.\nLocation: This role is hybrid, with a mix of remote and in-office work. We strongly prefer candidates who are local to Long Beach, California, as this will enable more effective participation in on-site activities and local community events."}, "skills": ["Mailchimp", "Canva", "WordPress", "Communication", "Leadership", "Organization", "Remote Work"], "postedDate": "2 days ago", "benefits": "Competitive hourly compensation, Qualified Small Employer Health Reimbursement Arrangement (QSEHRA), generous paid time off, and telecom stipend.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005892441"}