{"jobTitle": "Senior Manager, Retail Communication", "company": {"name": "Alo Yoga", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$120,000.00- $140,000", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": "<strong>WHY JOIN ALO?<br/><br/></strong>Mindful movement. It’s at the core of why we do what we do at Alo—it’s our calling. Because mindful movement in the studio leads to better living. It changes who yogis are off the mat, making their lives and their communities better. That’s the real meaning of studio-to-street: taking the consciousness from practice on the mat and putting it into practice in life.<br/><br/><strong>OVERVIEW<br/><br/></strong>As the Manager of Retail Communications &amp; Field Engagement, you’ll support Alo’s rapid expansion. You’ll be the driving force behind retail communication strategies, cultivating strong relationships and engaging our retail teams. You will work under our Global Retail Operations team, which includes Customer experience &amp; training, Workforce Management and Asset Protection. We’re looking for a team player who is passionate about retail, eager to learn and build relationships with our stores. Exceptional communication skills, proactivity and a strategic mindset are the key to the success of this role.<br/><br/><strong>RESPONSIBILITIES<br/><br/></strong><ul><li>Retail Communication Planning &amp; Execution </li><ul><li>Develop and implement a cohesive retail communication strategy aligned with Alo Yoga's brand vision, values, and business objectives.</li><li>Cultivate strong relationships with stores, internal teams, and other stakeholders to ensure a unified approach and consistent communication across all touchpoints.</li><li>Participate in store visits and immersion to build a detailed understanding of Alo’s operating model, developing expertise in policy and procedure across all areas of the business.</li><li>Manage the end-to-end communication workflow including request intake, writing, review, and publishing.</li><li>Create targeted communication and change management plans for company initiatives, product launches, promotions, and other key brand messages.</li><li>Manage the Retail Calendar, including intake, prioritization, and scheduling of initiatives, launches, and communication ensuring balanced workload and change management in support of Alo’s associate experience.</li></ul><li>Communication Platform Administration </li><ul><li>Oversee and manage Alo’s communication and task management platform (Zipline) to facilitate effective communication, task assignment, and reporting within the retail teams.</li><li>Ensure the platform is utilized efficiently for scheduling, task prioritization, announcements, and real-time updates, streamlining operations across all retail locations.</li></ul><li>Field Engagement &amp; Meeting/Event Planning </li><ul><li>Lead engagement initiatives to ensure alignment and enthusiasm among field teams, including store associates and field leadership (e.g., monthly newsletters, focus groups).</li><li>Organize and lead annual in-person and virtual events to foster team cohesion, share best practices, and celebrate achievements.</li><li>Manage regular field meeting cadence including weekly store manager meetings.</li></ul><li>Liaison Stores - Headquarters </li><ul><li>Collaborate with internal departments such as Marketing, E-Commerce, and Product Development to collect and share relevant information to stores.</li><li>Oversee Alo’s field feedback process, including feedback collection, reviewing feedback for insights and themes, distribution to corporate partners, and follow up with field teams. Compile and analyze feedback, identifying trends and actionable insights to enhance retail strategies and operations.<br/></li></ul></ul><strong>QUALIFICATIONS<br/><br/></strong><ul><li>Required minimum 3-5 years of experience in a communications management role focused on store and field-based audience.</li><li>Bachelor's degree in Marketing, Communications, Business, or a related field.</li><li>Proven track record of developing and executing successful communication strategies that align with brand objectives and drive results.</li><li>Strong ability to influence and collaborate across different levels of the organization.</li><li>Exceptional written and verbal communication skills, including the ability to craft compelling messages and presentations.</li><li>Strong organizational abilities with impeccable attention to detail.</li><li>Experience with retail marketing, visual merchandising, and store operations.</li><li>Proficiency in Microsoft Office Suite, and experience with retail communication/task platforms (Zipline preferred)</li><li>Ability to travel to local stores as needed.<br/><br/></li></ul>The base salary range for this position is $120,000.00- $140,000 per year which represents the current range for the base salary for this exempt position. Please note that actual salaries will vary based on factors including but not limited to location, experience, and performance. As such, on occasion and when applicable, there is the possibility that the final, agreed-upon base salary may be outside of the upper end of the range. Please also note the range listed is just one component of the company’s total rewards package for exempt employees. Other rewards may include performance bonuses, long term incentives, a PTO policy, and many other progressive benefits.<br/><br/>Please review our company California Job Applicant Privacy Policy HERE.<br/><br/>", "responsibilities": "As the Manager of Retail Communications &amp; Field Engagement, you’ll support Alo’s rapid expansion. You’ll be the driving force behind retail communication strategies, cultivating strong relationships and engaging our retail teams. You will work under our Global Retail Operations team, which includes Customer experience &amp; training, Workforce Management and Asset Protection. We’re looking for a team player who is passionate about retail, eager to learn and build relationships with our stores. Exceptional communication skills, proactivity and a strategic mindset are the key to the success of this role.", "qualifications": {"required": "Required minimum 3-5 years of experience in a communications management role focused on store and field-based audience.\nBachelor's degree in Marketing, Communications, Business, or a related field.\nProven track record of developing and executing successful communication strategies that align with brand objectives and drive results.\nStrong ability to influence and collaborate across different levels of the organization.\nExceptional written and verbal communication skills, including the ability to craft compelling messages and presentations.\nStrong organizational abilities with impeccable attention to detail.\nExperience with retail marketing, visual merchandising, and store operations.\nProficiency in Microsoft Office Suite, and experience with retail communication/task platforms (Zipline preferred)\nAbility to travel to local stores as needed."}, "skills": ["Retail Communication", "Communication Strategy", "Relationship Building", "Change Management", "Retail Operations", "Microsoft Office Suite", "Zipline"], "postedDate": "4 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005140145"}