{"jobTitle": "Supervisor, Registration", "company": {"name": "AHMC HealthCare", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Hospitals and Health Care", "description": "This position is responsible for the direction, coordination and integration of the operations of the ED Registration Department. Responsibilities include coordinating patient registration activities, orienting/training employees, and serving as a communication resource to patients, visitors, physicians, staff and ancillary personnel. Oversees and maintains compliance with the maintenance of records, order entry functions, and reporting with Patient Accounting. Collaborates with the healthcare team towards achieving fiscal and quality care goals<br/><br/><ul><li>This position requires the full understanding and active participation in fulfilling the mission of Anaheim Memorial Medical Center and MHS. It is expected that the employee demonstrate behavior consistent with the core values of AMMC and MHS. The employee shall support Anaheim Memorial Medical Center’s strategic plan and goals and direction of the performance improvement plan. The employee will also be expected to support all organizational expectations including, but not limited to; Customer Service, Patient’s Rights, Confidentiality of Information, Environment of Care and MemorialCare initiatives.</li><li>Bachelor’s Degree preferred</li><li>Minimum 3 years Supervisor/ Management of hospital Admitting Department, physician or business office background desired</li><li>Strong interpersonal and customer service skills</li><li>Strong organizational skills</li><li>Ability to communicate effectively</li><li>Positive work ethic</li><li>Computer and typing skills</li><li>Medical terminology preferred</li></ul>", "postedDate": "4 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4005218845"}