{"jobTitle": "Music Channel Programming Producer", "company": {"name": "AdsWizz", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Advertising Services", "description": "Who We Are<br/><br/>Any additional information you require for this job can be found in the below text Make sure to read thoroughly, then apply.SiriusXM and its brands (Pandora, SiriusXM Media, AdsWizz, Simplecast, and SiriusXM Connect) are leading a new era of audio entertainment and services by delivering the most compelling subscription and ad-supported audio entertainment experience for listeners -- in the car, at home, and anywhere on the go with connected devices. Our vision is to shape the future of audio, where everyone can be effortlessly connected to the voices, stories and music they love wherever they are.This is the place where a diverse group of emerging talent and legends alike come to share authentic and purposeful songs, stories, sounds and insights through some of the best programming and technology in the world. Our critically-acclaimed, industry-leading audio entertainment encompasses music, sports, comedy, news, talk, live events, and podcasting. No matter their individual role, each of our employees plays a vital part in bringing SiriusXM’s vision to life every day.SiriusXM<br/><br/>is the leading audio entertainment company in North America, and the premier programmer and platform for subscription and digital advertising-supported audio products. SiriusXM’s platforms collectively reach approximately 150 million listeners, the largest digital audio audience across paid and free tiers in North America, and deliver music, sports, talk, news, comedy, entertainment and podcasts. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM's subsidiaries Simplecast and AdsWizz make it a leader in podcast hosting, production, distribution, analytics and monetization. The Company’s advertising sales organization, which operates as SiriusXM Media, leverages its scale, cross-platform sales organization and ad tech capabilities to deliver results for audio creators and advertisers. SiriusXM, through SiriusXM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers.How you’ll make an impact:Conceptualizes, develops and produces full-length or short form programs, and/or segments of larger programs, while maintaining the channel's creative vision. Makes decisions related to creative processes, content development and production. Works independently on standard programs, and assists with larger, complex and high-profile programs. Exercises a high level of creativity and executes programming assignments with minimal oversight. May be assigned to more than one program and perform slightly different functions across programs.What you’ll do:Pre-ProductionWorks with Hosts and Program Director to design overall sound and image of program(s), consistent with platform goals.Creates, coordinates, writes and produces original programs, productions, segments, daily promos and/or specials.Researches topics and themes to write scripts, copy, and develop show content for hosts.Develops novel and creative ways to present content.Participates in creative meetings to brainstorm ideas, select programming content and delegate work assignments.Identifies, selects and books musical, celebrity, expert and lifestyle guests with the programming team.Researches guest backgrounds, develops interview questions and pre-interviews guests.Coaches hosts and guests, and provides relevant information to hosts for on-air interviews.Schedules program elements prior to air, ensuring that rotation and policies are followed.Conducts interviews that will be used in shows, imaging and promos.Manages all aspects of show promo copy and live reads.ProductionDetermines the appropriate mix of sound elements for assigned shows, and ensures that levels are mixed properly.Ensures that on-air product is up to broadcast standards before it leaves the studios.Ensures that personnel are assigned to monitor sound equipment during air time, and that clip information, music and non-music elements have been entered into audio software.Establishes programming clocks with team so that all content and advertisements are featured as planned.Trains and leads the work of Associate Producers, Production Assistants, Board Operators and Interns.Post-ProductionMonitors assigned channels for quality control and reports content error and technical issues to the appropriate individuals for correction.Manages the consistent flow of communication among program staff.Reviews completed programs and leads audio editing assignments.Supervises special projects.What you’ll need:To live in the Los Angeles CA areaBachelor's degree preferredAt least 4 years of experience at a radio station or audio production facility.Excellent creative writing and communication skills for radio.Ability to recognize stories with potential and develop them into compelling broadcast entertainment.Strong background in talent bookings.Ability to execute ideas.Highly detail oriented.Strong interest in current events and pop culture, as related to assigned channels / programs.Comfortable working with talent, artists and high profile individuals.Excellent time management skills, with the ability to prioritize and multi-task, and work under shifting deadlines in a fast-paced environment.Proficiency in: Microsoft Office, Prophet, SAW, SoundForge, Music Master, Pro Tools, Cool Edit, Adobe Audition.Mixing sound elements into a professional sounding product.Operating an audio board.Must have legal right to work in the U.S.<br/><br/>#J-18808-Ljbffr", "responsibilities": "Conceptualizes, develops and produces full-length or short form programs, and/or segments of larger programs, while maintaining the channel's creative vision. Makes decisions related to creative processes, content development and production. Works independently on standard programs, and assists with larger, complex and high-profile programs. Exercises a high level of creativity and executes programming assignments with minimal oversight. May be assigned to more than one program and perform slightly different functions across programs.", "qualifications": {"required": "To live in the Los Angeles CA areaBachelor's degree preferredAt least 4 years of experience at a radio station or audio production facility.Excellent creative writing and communication skills for radio.Ability to recognize stories with potential and develop them into compelling broadcast entertainment.Strong background in talent bookings.Ability to execute ideas.Highly detail oriented.Strong interest in current events and pop culture, as related to assigned channels / programs.Comfortable working with talent, artists and high profile individuals.Excellent time management skills, with the ability to prioritize and multi-task, and work under shifting deadlines in a fast-paced environment.Proficiency in: Microsoft Office, Prophet, SAW, SoundForge, Music Master, Pro Tools, Cool Edit, Adobe Audition.Mixing sound elements into a professional sounding product.Operating an audio board.Must have legal right to work in the U.S.", "preferred": ""}, "skills": ["Microsoft Office", "Prophet", "SAW", "SoundForge", "Music Master", "Pro Tools", "Cool Edit", "Adobe Audition"], "postedDate": "1 day ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005161998"}