{"jobTitle": "Engineering Manager", "company": {"name": "Howmet Aerospace", "industry": "Aviation and Aerospace Component Manufacturing", "size": "Not specified", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$85,000.00 - $130,000.00", "currency": "USD"}, "jobFunction": "Engineering", "industry": "Aviation and Aerospace Component Manufacturing", "description": "Howmet Fastening Systems (HFS) is seeking an Engineering Manager in our Torrance, CA location. HFS is a business unit of Howmet Aerospace, headquartered in Torrance, California. We hold the number one global position in aerospace fastening systems, and we’re the North American leader in commercial transportation fasteners. Our high-tech, multi-material fastening systems are found nose to tail on aircraft and aerospace engines. Our products are also critical components of industrial gas turbines, automobiles, commercial transportation vehicles, and construction and industrial equipment.", "responsibilities": "Directs and coordinates activities of engineering department to design, manufacture, and test components, products, and systems by performing the following duties personally or through direct reports. Directs department activities to design new products, modify existing designs, improve production techniques, and develop test procedures. Resolves problems using solutions that involve new techniques, technologies, or concepts. Analyzes technology trends, human resource needs, and market demand to plan projects. Confers with management, production, and marketing staff to determine engineering feasibility, cost effectiveness, and customer demand for new and existing products. Forecasts operating costs of department and directs preparation of budget requests. Advises management of new developments which may affect profit, schedule, costs, customer relations, and/or inter-departmental relations. Provides direction and example for interpretation and application of company policies and procedures to the engineering activities. Maintains a working knowledge of new technologies which may improve operations, and develops recommendations accordingly. Maintains a working knowledge of safety policies and regulations to ensure duties of self and others are performed in a safe manner. Represent specialty on cross-functional teams (i.e., operations), and at times lead these teams. Plan and organize complex projects, driving across multiple subject areas. Act as a team leader and/or mentor to junior employees.", "qualifications": {"required": "Bachelor's degree (B.S.) in Engineering or a related field from a four-year college or university. Minimum of 5 years of Engineering experience. Minimum of 3 years of leadership experience. Employees must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.", "preferred": ""}, "skills": ["Ability to read, analyze, and interpret general business periodicals, professional journals, technical procedures, or governmental regulations.", "Ability to write reports, business correspondence, and procedure manuals.", "Ability to effectively present information and respond to questions from groups of managers, clients, customers, and the general public.", "Ability to work with mathematical concepts such as probability and statistical inference, and fundamentals of plane and solid geometry and trigonometry.", "Ability to apply concepts such as fractions, percentages, ratios, and proportions to practical situations.", "Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists.", "Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form.", "To perform this job successfully, an individual should be computer literate in Microsoft Office Programs (Word, Excel, PowerPoint).", "Ability to read, interpret and understand blueprints and drawings.", "Knowledge of CAD and Engineering concepts."], "postedDate": "3 days ago", "applicationDeadline": "Not specified", "benefits": "The position includes competitive wages and a comprehensive benefits package, including health insurance (medical, dental, vision), excellent 401k matching program, paid holidays and vacation.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4005140166"}