{"jobTitle": "Sr. Manager of SEO & CRO", "company": {"name": "Single Grain | Start Growing", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "<em>Please put \"SEO is cool\" as the first line of your cover letter or as your headline or your application will be disqualified.<br/><br/></em>As the Sr. Manager of SEO &amp; CRO at Single Grain, you will play a pivotal role in driving exceptional results for our clients through innovative search engine optimization and conversion rate optimization strategies. You'll be a key player in connecting our SEO and CRO initiatives, helping us continue to foster a culture of excellence and continuous improvement in our fast-paced, dynamic environment.<br/><br/><strong><strong>Who We Are:<br/><br/></strong></strong>Single Grain is an award-winning digital marketing agency that has been dedicated to driving persistent growth for remarkable companies like Amazon, Uber, and Salesforce since 2009.<br/><br/>We do this by providing industry-leading services around Paid Media, SEO, Content Marketing, CRO, and more.<br/><br/>We are a team of digital marketers. We love what we do, and we help pioneers grow by empowering our clients with winning strategies that lead to faster growth. As a top digital marketing agency, we understand how fast-paced the marketing industry is. We pride ourselves on staying up to date with new algorithms, technology, and trends because that's what keeps us one step ahead of the competition.<br/><br/>As a testament to our digital marketing expertise, we have a Digital Marketing blog with over 200,000 visitors/month, a podcast called ‘Marketing School' with over 100 million total downloads, and a YouTube channel with more than 140,000 subscribers.<br/><br/>It's our mission to level up every human by educating and moving the marketing industry forward. Our goal is to help you level up and succeed. We accomplish this through mentoring or training but also by providing great resources and tools.<br/><br/>Check out our website for more on our company culture and values.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Act as the primary point of contact for all client accounts, including:</li><ul><li>Building and maintaining strong working relationships with client contacts</li><li>Developing and executing sophisticated SEO &amp; CRO strategies that drive down-funnel business results</li><li>Building insightful, compelling reports with key actionable insights</li><li>Collaborate with cross-functional teams to ensure cohesive implementation strategies and maximize time to value for clients</li></ul><li>Drive innovation in our SEO and CRO service offerings</li><li>Monitoring the latest trends and changes in SEO, CRO and the digital industry at large</li><li>Proactively seeking frameworks and tools to increase efficiency in your work<br/><br/></li></ul><strong>Requirements<br/><br/></strong>You are someone who:<br/><br/><ul><li>Has a proven track record of measurable success in both SEO and CRO, with 5+ years of experience in digital marketing</li><li>Possesses deep expertise in technical SEO, on-page optimization, link building, and conversion rate optimization</li><li>Has a strong grasp on CRO methodologies, including A/B testing, multivariate testing, user experience optimization, and data-driven design principles</li><li>Demonstrates strong analytical skills and data-driven decision-making abilities</li><li>Excels in client communication and relationship management</li><li>Stays ahead of industry trends and algorithm updates proactively pivoting strategies to meet your client's needs</li><li>Is passionate about driving measurable results and business growth</li><li>Has a talent for connecting strategies across different digital marketing disciplines</li><li>Adapts quickly to changing circumstances demonstrating flexibility and an open attitude towards new approaches and strategies<br/><br/><br/></li></ul><strong>Prior Experience:<br/><br/></strong><ul><li>5+ years of experience in SEO and CRO services, and at least 3 years at an agency</li><li>Proven track record of driving organic traffic growth and improving conversion rates for diverse clients</li><li>Experience with SEO tools (e.g., Ahrefs, SEMrush, Screaming Frog, SurferSEO)</li><li>Experience with CRO tools and methodologies (e.g., Google Optimize, VWO, Convert, A/B testing)</li><li>Experience with heat mapping / user behavior tracking softwares (e.g. Clarity, HotJar)</li><li>Experience with leveraging AI tools (e.g. ChatGPT, Perplexity.ai, Claude)</li><li>Strong understanding of web analytics platforms (e.g., Google Analytics, Adobe Analytics, GSC)<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Medical, Dental, and Vision Insurance</li><li>Flexible PTO</li><li>Home Office Stipend</li><li>MacBook Provided</li><li>100% Remote</li></ul>", "responsibilities": "Act as the primary point of contact for all client accounts, including:Building and maintaining strong working relationships with client contactsDeveloping and executing sophisticated SEO &amp; CRO strategies that drive down-funnel business resultsBuilding insightful, compelling reports with key actionable insightsCollaborate with cross-functional teams to ensure cohesive implementation strategies and maximize time to value for clientsDrive innovation in our SEO and CRO service offeringsMonitoring the latest trends and changes in SEO, CRO and the digital industry at largeProactively seeking frameworks and tools to increase efficiency in your work", "qualifications": {"required": "Has a proven track record of measurable success in both SEO and CRO, with 5+ years of experience in digital marketingPossesses deep expertise in technical SEO, on-page optimization, link building, and conversion rate optimizationHas a strong grasp on CRO methodologies, including A/B testing, multivariate testing, user experience optimization, and data-driven design principlesDemonstrates strong analytical skills and data-driven decision-making abilitiesExcels in client communication and relationship managementStays ahead of industry trends and algorithm updates proactively pivoting strategies to meet your client's needsIs passionate about driving measurable results and business growthHas a talent for connecting strategies across different digital marketing disciplinesAdapts quickly to changing circumstances demonstrating flexibility and an open attitude towards new approaches and strategies", "preferred": "5+ years of experience in SEO and CRO services, and at least 3 years at an agencyProven track record of driving organic traffic growth and improving conversion rates for diverse clientsExperience with SEO tools (e.g., Ahrefs, SEMrush, Screaming Frog, SurferSEO)Experience with CRO tools and methodologies (e.g., Google Optimize, VWO, Convert, A/B testing)Experience with heat mapping / user behavior tracking softwares (e.g. Clarity, HotJar)Experience with leveraging AI tools (e.g. ChatGPT, Perplexity.ai, Claude)Strong understanding of web analytics platforms (e.g., Google Analytics, Adobe Analytics, GSC)"}, "skills": ["SEO", "CRO", "Digital Marketing", "Technical SEO", "On-page Optimization", "Link Building", "Conversion Rate Optimization", "A/B Testing", "Multivariate Testing", "User Experience Optimization", "Data-driven Design", "Analytics", "Client Communication", "Relationship Management", "Algorithm Updates", "Business Growth", "Digital Marketing Strategies", "Flexibility", "SEO Tools", "CRO Tools", "Heat Mapping", "User Behavior Tracking", "AI Tools", "Web Analytics"], "postedDate": "3 days ago", "benefits": "Medical, Dental, and Vision InsuranceFlexible PTOHome Office StipendMacBook Provided100% Remote", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005992448"}