{"jobTitle": "Senior Associate,, Merchant Strategy & Operations", "company": {"name": "DoorDash", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "About The Team<br/><br/>On the Merchant Strategy &amp; Operations team, our mission is to have best-in class restaurant selection, build cutting-edge services for our merchants to grow their business, and help our partners operate efficiently on the platform. We act as the conduit between our sales and product teams by building effective go-to-market strategies for product initiatives and features, while influencing the product roadmap based on the needs of our partners.<br/><br/>About The Role<br/><br/>As a Merchant Strategy &amp; Operations Senior Associate, you’ll work cross-functionally between product and customer experience teams, marketing, analytics, sales, account management, and operations to drive adoption of our growing merchant product suite and ensure merchants can grow effectively on our marketplace.<br/><br/>As a Merchant Strategy &amp; Operations Senior Associate, you’ll drive adoption and growth of our full suite of merchant products and services, with a focus on helping Merchants accelerate marketplace growth during seasonal and cultural moments (think Black Friday). You’ll set our product go-to-market strategy, operationalize plans, collect learnings, and establish the foundation for new ideas to scale. This will include building and executing playbooks to scale multiple products and introducing new services to hit growth targets.<br/><br/>You will sit at the intersection of our revenue generation engine and our business teams, and as such will require prioritization and data-driven decision-making to ensure our teams are working against the right goals and have the tools needed to achieve them. You will report to the Manager, Mechant Strategy &amp; Operations.<br/><br/>You’re Excited About This Opportunity Because...<br/><br/>\n<ul><li>You’ll strategize – Build the strategy for new product features and initiatives, including which merchant segments to target and how to effectively drive engagement</li><li>You’ll implement – Drive go-to-market planning &amp; execution for new initiatives to help our merchants grow </li><li>You’ll analyze – Build models to define product success, new product KPIs, and support our cross-functional teams</li><li>You’ll experiment – Use data-driven decision-making and sound business judgment to execute tests on everything from adoption to growth</li><li>You’ll influence – Work cross-functionally with our product, operations, marketing, account management, finance, and analytics teams to land key initiatives<br/><br/></li></ul>We’re Excited About You Because…<br/><br/>\n<ul><li>You have 2+ years of experience in strategy consulting, investment banking, internal strategy or strategic finance/analytics or related experience in technology; high-growth or early-stage startup experience is a plus</li><li>You have a Bachelor’s Degree or higher </li><li>You’re an excellent analytical thinker who can deliver actionable recommendations out of complex datasets; bonus points for SQL experience</li><li>You have a proven track record of working on highly cross-functional initiatives, managing towards ambitious goals, and succeeding in a complex environments</li><li>You have expert interpersonal and communication skills</li><li>You’re a self-starter – You have a bias towards action and are proactive in identifying opportunities and solutions, and areas to add value</li><li>You’re naturally curious – You always look for ways to innovate and improve</li><li>You’re gritty – You roll up your sleeves and do whatever it takes to make things successful</li><li>You’re a relationship-builder – You can influence and motivate people at all levels across a variety of job functions</li><li>You’re a problem solver – You can independently translate high-level goals into actionable plans<br/><br/></li></ul>We expect this position to be filled by 10/21/24<br/><br/>We use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on June 20, 2024.<br/><br/>Please see the independent bias audit report covering our use of Covey here.<br/><br/>Compensation<br/><br/>The successful candidate's starting pay will fall within the pay range listed below and is determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions. Base salary is localized according to an employee’s work location. Ranges are market-dependent and may be modified in the future.<br/><br/>In addition to base salary, the compensation for this role includes opportunities for equity grants. Talk to your recruiter for more information.<br/><br/>DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.<br/><br/>To learn more about our benefits, visit our careers page here.<br/><br/>The base pay for this position ranges from our lowest geographical market up to our highest geographical market within California, Colorado, District of Columbia, Hawaii, New Jersey, New York and Washington.<br/><br/>$79,900—$117,500 USD<br/><br/>About DoorDash<br/><br/>At DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users—from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods.<br/><br/>DoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees’ happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.<br/><br/>Our Commitment to Diversity and Inclusion<br/><br/>We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.<br/><br/>Statement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on “protected categories,” we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce – people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.<br/><br/>If you need any accommodations, please inform your recruiting contact upon initial connection.", "responsibilities": "As a Merchant Strategy &amp; Operations Senior Associate, you’ll drive adoption and growth of our full suite of merchant products and services, with a focus on helping Merchants accelerate marketplace growth during seasonal and cultural moments (think Black Friday). You’ll set our product go-to-market strategy, operationalize plans, collect learnings, and establish the foundation for new ideas to scale. This will include building and executing playbooks to scale multiple products and introducing new services to hit growth targets.", "qualifications": {"required": "You have 2+ years of experience in strategy consulting, investment banking, internal strategy or strategic finance/analytics or related experience in technology; high-growth or early-stage startup experience is a plus\nYou have a Bachelor’s Degree or higher \nYou’re an excellent analytical thinker who can deliver actionable recommendations out of complex datasets; bonus points for SQL experience\nYou have a proven track record of working on highly cross-functional initiatives, managing towards ambitious goals, and succeeding in a complex environments\nYou have expert interpersonal and communication skills\nYou’re a self-starter – You have a bias towards action and are proactive in identifying opportunities and solutions, and areas to add value\nYou’re naturally curious – You always look for ways to innovate and improve\nYou’re gritty – You roll up your sleeves and do whatever it takes to make things successful\nYou’re a relationship-builder – You can influence and motivate people at all levels across a variety of job functions\nYou’re a problem solver – You can independently translate high-level goals into actionable plans<br/><br/>", "preferred": ""}, "skills": ["Strategy Consulting", "Investment Banking", "Internal Strategy", "Strategic Finance", "Analytics", "Technology", "SQL", "Cross-Functional Initiatives", "Ambitious Goals", "Complex Environments", "Interpersonal Skills", "Communication Skills", "Self-Starter", "Innovation", "Problem Solving"], "postedDate": "15 hours ago", "benefits": "DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.", "remoteWork": "No", "salary": {"amount": "79,900—$117,500", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4005176995"}