{"jobTitle": "Senior Reporting Accountant - Up to $120k + 10% bonus", "company": {"name": "Vaco", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "100,000.00/yr - $120,000.00/yr", "currency": "USD"}, "jobFunction": "Accounting/Auditing, Finance, and Strategy/Planning", "industry": "Commercial and Industrial Equipment Rental", "description": "Our client is a national leader in the oversight of and production services for entertainment studios and media production sites worldwide. They are extremely acquisitive and looking for a senior reporting accountant to join their team. <br/><br/><strong>Essential Functions:</strong><ul><li>Fiscal oversight of international entities to ensure reporting consistency, proper controllership review and adherence to contractual obligations.</li><li>Assist with M&amp;A integration activities including technical accounting issues, tax consequence identification and financial reporting.</li><li>Ensure global cash flow statements are prepared in accordance with GAAP and assist with associated cash flow and distribution forecasting.</li><li>Support interim and YE external audit process including writing first comprehensive draft of year-end financial statements with footnotes.</li><li>Perform monthly detailed analysis of subsidiaries performance including variance explanations.</li><li>Provide standard and ad-hoc analyses as needed, including balance sheet reconciliations, annual impairment testing analysis, and assist in <strong>M&amp;A transactions</strong> (including post acquisition integration).<br/></li></ul> <strong>Required Education and Experience: </strong><ul><li>Big 4 experience, CPA required</li><li>Bachelor's degree in finance, accounting, or related field of study.</li><li>Experience preparing and/or reviewing financial statements. </li><li>Strong work ethic with a commitment to excellence and integrity.</li><li>Able to work in a dynamic, fast-paced environment, to adapt quickly and to manage changing priorities.</li><li>Strong commitment to meet deadlines and take on special projects.</li><li><em>Prior experience with M&amp;A and complex reporting matters is a plus</em></li></ul>", "postedDate": "3 days ago", "qualifications": {"required": "Big 4 experience, CPA required, Bachelor's degree in finance, accounting, or related field of study., Experience preparing and/or reviewing financial statements., Strong work ethic with a commitment to excellence and integrity., Able to work in a dynamic, fast-paced environment, to adapt quickly and to manage changing priorities., Strong commitment to meet deadlines and take on special projects.", "preferred": "Prior experience with M&amp;A and complex reporting matters is a plus"}, "skills": ["GAAP", "M&A", "Financial Reporting", "Financial Statements", "Accounting", "Auditing", "Tax", "Cash Flow", "Forecasting", "Audit", "Analysis", "Balance Sheet", "Impairment Testing", "Integration"], "benefits": null, "remoteWork": null, "responsibilities": "Fiscal oversight of international entities to ensure reporting consistency, proper controllership review and adherence to contractual obligations. Assist with M&A integration activities including technical accounting issues, tax consequence identification and financial reporting. Ensure global cash flow statements are prepared in accordance with GAAP and assist with associated cash flow and distribution forecasting. Support interim and YE external audit process including writing first comprehensive draft of year-end financial statements with footnotes. Perform monthly detailed analysis of subsidiaries performance including variance explanations. Provide standard and ad-hoc analyses as needed, including balance sheet reconciliations, annual impairment testing analysis, and assist in M&A transactions (including post acquisition integration).", "applicationDeadline": null, "url": "https://www.linkedin.com/jobs/view/4005979988"}