{"jobTitle": "Sustainability-Focused Supply Chain and Social Responsibility Manager", "company": {"name": "Get It Recruit - Transportation", "location": "Duarte, CA"}, "location": "Duarte, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Human Resources Services", "description": "**Join an Innovative Team Committed to Sustainability**<br/><br/>We are dedicated to creating a sustainable future and are looking for a talented individual to enhance our supply chain operations while upholding ethical and environmentally responsible practices. This remote-friendly opportunity will allow you to make a significant impact in our organization.<br/><br/>**Key Responsibilities**<br/><br/><ul><li> **Supply Chain Optimization:** Develop and implement strategies aimed at improving efficiency within the supply chain.</li><li> **Logistics Management:** Oversee logistics operations including warehousing, transportation, and inventory, ensuring smooth processes.</li><li> **Vendor Relations:** Cultivate strong relationships with vendors and negotiate beneficial agreements.</li><li> **Sustainability Leadership:** Design and implement programs that significantly reduce our environmental footprint.</li><li> **Social Responsibility Compliance:** Ensure adherence to social responsibility standards, focusing on fair labor practices and ethical sourcing.</li><li> **Cross-Department Collaboration:** Work collaboratively with team members across various departments to achieve collective objectives.</li><li> **Industry Awareness:** Stay informed on the latest trends in supply chain management and corporate social responsibility to keep us competitive.<br/><br/></li></ul>**Qualifications**<br/><br/><ul><li> A bachelor's degree in supply chain management, business administration, environmental science, or a related field; a master's degree or certifications such as CPSM or CSCP are advantageous.</li><li> Between 5 to 7 years of experience in supply chain management, logistics, or a related area.</li><li> Proven experience in developing and managing corporate social responsibility (CSR) programs or sustainability initiatives.</li><li> Comprehensive knowledge of supply chain processes, logistics, and procurement.</li><li> Strong relationship-building skills and contract negotiation expertise.<br/><br/></li></ul>**Preferred Attributes**<br/><br/><ul><li> Ability to excel in fast-paced environments with a knack for creative problem-solving.</li><li> Leadership qualities that inspire and motivate team members.</li><li> A genuine passion for sustainability and ethical business practices.</li><li>Why Work With Us?**</li><li> **Make a Meaningful Impact:** Your contributions will play a crucial role in driving sustainability within our company.</li><li> **Flexible Work Environment:** Enjoy the adaptability of a remote work setting that promotes productivity.</li><li> **Opportunities for Development:** Focus on personal and professional growth in a vibrant and dynamic atmosphere.</li><li> **Attractive Compensation Package:** Benefit from competitive pay and comprehensive benefits including health insurance and paid time off.<br/><br/></li></ul>Join us if you're ready to be part of a forward-thinking team that prioritizes sustainable practices in the supply chain.<br/><br/>Employment Type: Full-Time", "responsibilities": "Develop and implement strategies aimed at improving efficiency within the supply chain. Oversee logistics operations including warehousing, transportation, and inventory, ensuring smooth processes. Cultivate strong relationships with vendors and negotiate beneficial agreements. Design and implement programs that significantly reduce our environmental footprint. Ensure adherence to social responsibility standards, focusing on fair labor practices and ethical sourcing. Work collaboratively with team members across various departments to achieve collective objectives. Stay informed on the latest trends in supply chain management and corporate social responsibility to keep us competitive.", "qualifications": {"required": "A bachelor's degree in supply chain management, business administration, environmental science, or a related field; a master's degree or certifications such as CPSM or CSCP are advantageous. Between 5 to 7 years of experience in supply chain management, logistics, or a related area. Proven experience in developing and managing corporate social responsibility (CSR) programs or sustainability initiatives. Comprehensive knowledge of supply chain processes, logistics, and procurement. Strong relationship-building skills and contract negotiation expertise.", "preferred": "Ability to excel in fast-paced environments with a knack for creative problem-solving. Leadership qualities that inspire and motivate team members. A genuine passion for sustainability and ethical business practices."}, "skills": ["Supply Chain Management", "Logistics", "Sustainability", "Corporate Social Responsibility", "Vendor Relations", "Negotiation", "Problem Solving", "Leadership"], "postedDate": "1 day ago", "benefits": "Make a Meaningful Impact: Your contributions will play a crucial role in driving sustainability within our company. Flexible Work Environment: Enjoy the adaptability of a remote work setting that promotes productivity. Opportunities for Development: Focus on personal and professional growth in a vibrant and dynamic atmosphere. Attractive Compensation Package: Benefit from competitive pay and comprehensive benefits including health insurance and paid time off.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005363981"}