{"jobTitle": "Senior Buyer", "company": {"name": "Air Liquide", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00/yr - $100,000.00/yr", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Chemical Manufacturing", "description": "World leader in gases, technologies and services for Industry and Health, Air Liquide is present in 80 countries with approximately 66,000 employees and serves more than 3,6 million customers and patients. Oxygen, nitrogen and hydrogen have been at the core of the company’s activities since its creation in 1902. Air Liquide’s ambition is to be the leader in its industry, delivering long-term performance and acting responsibly.\n\nResponsible for procurement of products and services, secured at competitive cost, quality for a manufacturing industry and delivery levels consistent with Company policy, procedures and performance standards. To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed in the Job description are representative of the knowledge, skills, abilities and physical demands required.\n\n\n* Initiate purchase orders for materials, parts and services; arrange for submission and inspection of sample products as required. Must have experience with castings, raw materials, forging, Bearings, Skids and machined components.\n* Secure and analyze quotations; negotiate prices and terms with suppliers, recommend suppliers with respect to cost, quality, and delivery competitiveness for assigned responsibilities complying to company procurement procedure.\n* Confer with vendors to obtain product or service information such as price, availability, and delivery schedule, and to track the status of requisitions and orders or to resolve discrepancies with quantity and quality. \n* Negotiate long term supply agreements with suppliers and analyze whether supply programs such as Kanban, consignment or vendor managed inventory would benefit the company\n* Monitor in-house inventory movement to determine if inventory quantities are sufficient for needs, ordering more materials when necessary.\n* Review requisitions to verify accuracy.\n* Prepare, maintain, and review purchasing files, reports, and price lists. \n* Assist in the resolution of production, design, quality and delivery problems.\n* Coordinate quality matters and engineering changes or developments between the company and suppliers. \n* Data entry of all purchase orders into the SAP system. \n* Overdue PO follow up and updates, expedites etc\n* Perform other duties as assigned.\n\n\nRequired Qualifications And Competencies\n\n\n* Bachelor’s Degree in business/purchasing/Supply Chain or 5 plus years of relevant buying experience from a manufacturing Industry,\n* Knowledge of raw materials, production processes, quality control, costs, and other techniques for maximizing the effective manufacture and distribution of products. \n* Knowledge of business and management principles involved in strategic planning, resource allocation, production methods, coordination of resources, purchasing policies, processes and procedures. \n* Verbal communication skills: speaks clearly and persuasively to convey information effectively; actively listens to understand, asks questions as appropriate and responds well to questions. \n* Written communication skills: writes clearly and informatively and presents numerical data effectively.\n* Negotiation skills: develops cooperative working relationships with vendors and suppliers to effectively negotiate for best possible prices and terms. \n* Organizational skills: Manages and completes multiple tasks on time and plans, prioritizes, and organizes work to achieve goals and objectives with excellent follow through and follow up. \n* Interpersonal skills: Builds positive team spirit by developing constructive and cooperative working relationships and interdepartmental group commitments to effectively achieve production goals and objectives. \n* Computer skills: Proficiency in G Suite; proficient in the use of SAP systems.\n* Technical skills: Ability to read an engineering drawing and bill of materials. \n* Ability to work under pressure, meet deadlines, and work independently with little supervision. \n* Ability to be self-motivated, persistent, hands-on, results-oriented with a strong sense of urgency, the ability to take initiative and accomplish goals. \n* Ability to demonstrate a high degree of professionalism and maturity with good judgment. \n* Ability to maintain consistent and regular attendance during regular business hours and potential extra hours as needed for special projects/meetings.\n* Excellent computer skills (Excel, Microsoft Word, PowerPoint, G Suite). \n* SAP \n* Critical thinking and negotiation skills. \n* Strong communication skills, both written and verbal.\n\n\n**The annual base salary range for this position in California is $90,000 - $100,000. Please note that the salary information is a general guideline only. Air Liquide considers factors such as (but not limited to) scope and responsibilities of the position, candidate’s work experience, education/ training, key skills as well as market and business considerations when extending an offer. **\n\n\nBenefits offered: Medical, Dental, Vision, Life Insurance, Short-Term Disability, Long-Term Disability, 401(k) match, Flexible Spending Accounts, EAP, Education Assistance, Parental Leave, Paid time off, and Holidays.", "responsibilities": "Responsible for procurement of products and services, secured at competitive cost, quality for a manufacturing industry and delivery levels consistent with Company policy, procedures and performance standards. To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed in the Job description are representative of the knowledge, skills, abilities and physical demands required.", "qualifications": {"required": "Bachelor’s Degree in business/purchasing/Supply Chain or 5 plus years of relevant buying experience from a manufacturing Industry,\nKnowledge of raw materials, production processes, quality control, costs, and other techniques for maximizing the effective manufacture and distribution of products. \nKnowledge of business and management principles involved in strategic planning, resource allocation, production methods, coordination of resources, purchasing policies, processes and procedures. \nVerbal communication skills: speaks clearly and persuasively to convey information effectively; actively listens to understand, asks questions as appropriate and responds well to questions. \nWritten communication skills: writes clearly and informatively and presents numerical data effectively.\nNegotiation skills: develops cooperative working relationships with vendors and suppliers to effectively negotiate for best possible prices and terms. \nOrganizational skills: Manages and completes multiple tasks on time and plans, prioritizes, and organizes work to achieve goals and objectives with excellent follow through and follow up. \nInterpersonal skills: Builds positive team spirit by developing constructive and cooperative working relationships and interdepartmental group commitments to effectively achieve production goals and objectives. \nComputer skills: Proficiency in G Suite; proficient in the use of SAP systems.\nTechnical skills: Ability to read an engineering drawing and bill of materials. \nAbility to work under pressure, meet deadlines, and work independently with little supervision. \nAbility to be self-motivated, persistent, hands-on, results-oriented with a strong sense of urgency, the ability to take initiative and accomplish goals. \nAbility to demonstrate a high degree of professionalism and maturity with good judgment. \nAbility to maintain consistent and regular attendance during regular business hours and potential extra hours as needed for special projects/meetings.\nExcellent computer skills (Excel, Microsoft Word, PowerPoint, G Suite). \nSAP \nCritical thinking and negotiation skills. \nStrong communication skills, both written and verbal.", "preferred": ""}, "skills": ["SAP", "G Suite", "Negotiation", "Communication", "Purchasing", "Supply Chain", "Manufacturing", "Quality Control", "Inventory Management", "Engineering", "Microsoft Word", "Excel", "PowerPoint"], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "Benefits offered: Medical, Dental, Vision, Life Insurance, Short-Term Disability, Long-Term Disability, 401(k) match, Flexible Spending Accounts, EAP, Education Assistance, Parental Leave, Paid time off, and Holidays.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005843647"}