{"jobTitle": "SAP - SuccessFactors - Manager - Consulting - Location OPEN", "company": {"name": "EY", "location": "Westlake Village, CA"}, "location": "Westlake Village, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "141,200.00/yr - 258,900.00/yr", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting", "description": "At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better.<br/><br/>The exceptional EY experience. It's yours to build.<br/><br/>EY focuses on high-ethical standards and integrity among its employees and expects all candidates to demonstrate these qualities.<br/><br/>EY focuses on high-ethical standards and integrity among its employees and expects all candidates to demonstrate these qualities. At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture, and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.<br/><br/>Our objective is to provide clients with a unique business perspective on how to leverage SAP technology to enhance their operations. This is rooted in EY's SAP service line capabilities including Supply Chain, FICO, BPC, Data &amp; Analytics, Customer, Tech/Arch and SuccessFactors. Our focus is on helping clients elevate performance and productivity.<br/><br/><strong>The opportunity<br/><br/></strong>We are currently seeking a proactive SAP Technical Manager to join our dynamic SuccessFactors team. Leveraging SAP technology, we help tackle the challenges organizations confront in the digital era. Our approach goes beyond mere technology implementation, encompassing a complete, business-centered viewpoint that addresses strategy, customer value, user experience, processes, and operational impacts combined.<br/><br/><strong>Your Key Responsibilities<br/><br/></strong><ul><li>Demonstrate in-depth technical capabilities and possess strong business acumen</li><li>Demonstrate ability to assimilate to new knowledge</li><li>Consistently deliver quality client services. Monitor progress, manage risk and ensure key stakeholders are kept informed about progress and expected outcomes</li><li>Establish relationships with client personnel at appropriate levels <br/><br/></li></ul><strong>Skills And Attributes For Success<br/><br/></strong>In a typical engagement, you will work with the key stakeholders to understand their needs and advise on SAP SuccessFactors system capabilities. The role involves initiating requirement gathering, considering impacts across modules, conducting tests, and completing required documentation. You will also be called to design functional solutions after conducting thorough analyses. Your role will involve acting as a liaison between stakeholders and the technical team, translating needs into effective business solutions. You will also be responsible for completing configurations and/or integrations with both SAP and non-SAP systems.<br/><br/><strong>To qualify for the role you must have<br/><br/></strong><ul><li>A bachelor's degree and at least 8 years of related work experience</li><li>5+ years of experience working with SAP SuccessFactors system</li><li>Strong written and verbal communication, presentation, client service and technical writing skills</li><li>The ability to research client inquiries and emerging issues, including regulations, industry practices, and new technologies</li><li>A flexibility and willingness to travel to meet client needs; travel is estimated at 40-60%<br/><br/></li></ul><strong>Ideally, you'll also have<br/><br/></strong><ul><li>Prior consulting industry experience or deep functional experience</li><li>SAP SuccessFactors certification/s </li><li>Experience with at least four full cycle implementations of your core module <br/><br/></li></ul><strong>What We Look For<br/><br/></strong>Knowledge of leading practices, benchmarking, peer company environments and prior consulting experience relevant to SAP and functional role<br/><br/>#FY25SAP<br/><br/><strong>What We Offer<br/><br/></strong>We offer a comprehensive compensation and benefits package where you’ll be rewarded based on your performance and recognized for the value you bring to the business. The base salary range for this job in all geographic locations in the US is $141,200 to $258,900. The salary range for New York City Metro Area, Washington State and California (excluding Sacramento) is $169,500 to $294,300. Individual salaries within those ranges are determined through a wide variety of factors including but not limited to education, experience, knowledge, skills and geography. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Join us in our team-led and leader-enabled hybrid model. Our expectation is for most people in external, client serving roles to work together in person 40-60% of the time over the course of an engagement, project or year. Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.<br/><br/><ul><li>Continuous learning: You’ll develop the mindset and skills to navigate whatever comes next.</li><li>Success as defined by you: We’ll provide the tools and flexibility, so you can make a meaningful impact, your way.</li><li>Transformative leadership: We’ll give you the insights, coaching and confidence to be the leader the world needs.</li><li>Diverse and inclusive culture: You’ll be embraced for who you are and empowered to use your voice to help others find theirs.<br/><br/></li></ul>EY accepts applications for this position on an on-going basis. <strong>If you can demonstrate that you meet the criteria above, please contact us as soon as possible.<br/><br/></strong>EY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.<br/><br/>Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.<br/><br/>Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.<br/><br/>For those living in California, please click here for additional information.<br/><br/>EY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, pregnancy, genetic information, national origin, protected veteran status, disability status, or any other legally protected basis, including arrest and conviction records, in accordance with applicable law. <br/><br/>EY is committed to providing reasonable accommodation to qualified individuals with disabilities including veterans with disabilities. If you have a disability and either need assistance applying online or need to request an accommodation during any part of the application process, please call 1-800-EY-HELP3, select Option 2 for candidate related inquiries, then select Option 1 for candidate queries and finally select Option 2 for candidates with an inquiry which will route you to EY’s Talent Shared Services Team (TSS) or email the TSS at ssc.customersupport@ey.com", "responsibilities": "<ul><li>Demonstrate in-depth technical capabilities and possess strong business acumen</li><li>Demonstrate ability to assimilate to new knowledge</li><li>Consistently deliver quality client services. Monitor progress, manage risk and ensure key stakeholders are kept informed about progress and expected outcomes</li><li>Establish relationships with client personnel at appropriate levels <br/><br/></li></ul>", "qualifications": {"required": "<ul><li>A bachelor's degree and at least 8 years of related work experience</li><li>5+ years of experience working with SAP SuccessFactors system</li><li>Strong written and verbal communication, presentation, client service and technical writing skills</li><li>The ability to research client inquiries and emerging issues, including regulations, industry practices, and new technologies</li><li>A flexibility and willingness to travel to meet client needs; travel is estimated at 40-60%<br/><br/></li></ul>", "preferred": "<ul><li>Prior consulting industry experience or deep functional experience</li><li>SAP SuccessFactors certification/s </li><li>Experience with at least four full cycle implementations of your core module <br/><br/></li></ul>"}, "skills": ["SAP", "SuccessFactors", "Business Acumen", "Client Services", "Communication", "Presentation", "Technical Writing", "Research", "Travel"], "postedDate": "2 days ago", "benefits": "We offer a comprehensive compensation and benefits package where you’ll be rewarded based on your performance and recognized for the value you bring to the business. The base salary range for this job in all geographic locations in the US is $141,200 to $258,900. The salary range for New York City Metro Area, Washington State and California (excluding Sacramento) is $169,500 to $294,300. Individual salaries within those ranges are determined through a wide variety of factors including but not limited to education, experience, knowledge, skills and geography. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Join us in our team-led and leader-enabled hybrid model. Our expectation is for most people in external, client serving roles to work together in person 40-60% of the time over the course of an engagement, project or year. Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.<br/><br/><ul><li>Continuous learning: You’ll develop the mindset and skills to navigate whatever comes next.</li><li>Success as defined by you: We’ll provide the tools and flexibility, so you can make a meaningful impact, your way.</li><li>Transformative leadership: We’ll give you the insights, coaching and confidence to be the leader the world needs.</li><li>Diverse and inclusive culture: You’ll be embraced for who you are and empowered to use your voice to help others find theirs.<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005148638"}