{"jobTitle": "Strategy and Operations Associate, Global YouTube Marketing", "company": {"name": "Google", "location": "San Bruno, CA"}, "location": "San Bruno, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "90,500.00/yr - 132,000.00/yr", "currency": "USD"}, "jobFunction": "Sales, Advertising, and Marketing", "industry": "Information Services and Technology, Information and Internet", "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: **San Bruno, CA, USA; New York, NY, USA; Los Angeles, CA, USA; Chicago, IL, USA**. **Minimum qualifications:**<br/><br/> <ul><li>Bachelor's degree or equivalent practical experience.</li><li>2 years of experience in strategy consulting, investment banking, project management, or a related role.</li><li>Experience with data analysis tools (spreadsheet, etc.).<br/><br/></li></ul> **Preferred qualifications:**<br/><br/> <ul><li>Experience with process mapping and improvement techniques.</li><li>Familiarity with business intelligence or data visualization tools.</li><li>Ability to work in ambiguous, fast-changing environments.</li><li>Ability to work across teams, build relationships, and influence executives.</li><li>Proficiency with project management methodologies and tools.<br/><br/></li></ul> **About The Job**<br/><br/> The YouTube Strategy and Operations team unlock the magic of YouTube Marketing by enabling execution with improved tools and processes, influencing decision making with objective insights and analytics, and fostering a culture that maximizes our potential.<br/><br/> Our mission is to shape and enable YouTube Marketing’s strategic priorities to unlock lasting business impact by being an objective partner to all of YouTube Marketing, and be an exceptional team that prioritizes respect for each other and sustained professional development in everything we do.<br/><br/> As the Strategy and Operations Associate, you will play a pivotal role in driving the organization's success by supporting key strategic initiatives and ensuring smooth operational processes. You will work closely with senior leadership to translate high-level goals into actionable plans. company's growth and development.<br/><br/> Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google's products solve the world's problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.<br/><br/> The US base salary range for this full-time position is $90,500-$132,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/> Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.<br/><br/> **Responsibilities**<br/><br/> <ul><li>Act as a strategic partner to the business supporting the leadership on service transformations, operational accuracy, organizational initiatives, and helping chart out and fulfill big bets for the business.</li><li>Define and maintain strategic operations programs to keep the business running as efficiently as possible. Define and drive strategic and analytical initiatives to improve marketing outcomes, improve internal and external facing processes and operations, working closely with cross-functional teams, executive stakeholders, and senior leadership.</li><li>Be able to problem-solve with senior leaders to deliver strategic insights and recommendations based on business analyses.</li><li>Collaborate with cross-functional stakeholders in annual business planning, headcount management, key organizational metrics, and other operationally strategic projects.</li><li>Identify gaps and propose changes to existing policy, systems, and process frameworks. Develop scalable solutions and work to manage risks across the organization and develop best practices.<br/><br/><br/></li></ul> Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Act as a strategic partner to the business supporting the leadership on service transformations, operational accuracy, organizational initiatives, and helping chart out and fulfill big bets for the business.</li><li>Define and maintain strategic operations programs to keep the business running as efficiently as possible. Define and drive strategic and analytical initiatives to improve marketing outcomes, improve internal and external facing processes and operations, working closely with cross-functional teams, executive stakeholders, and senior leadership.</li><li>Be able to problem-solve with senior leaders to deliver strategic insights and recommendations based on business analyses.</li><li>Collaborate with cross-functional stakeholders in annual business planning, headcount management, key organizational metrics, and other operationally strategic projects.</li><li>Identify gaps and propose changes to existing policy, systems, and process frameworks. Develop scalable solutions and work to manage risks across the organization and develop best practices.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience.\n2 years of experience in strategy consulting, investment banking, project management, or a related role.\nExperience with data analysis tools (spreadsheet, etc.).", "preferred": "Experience with process mapping and improvement techniques.\nFamiliarity with business intelligence or data visualization tools.\nAbility to work in ambiguous, fast-changing environments.\nAbility to work across teams, build relationships, and influence executives.\nProficiency with project management methodologies and tools."}, "skills": [], "postedDate": "20 hours ago", "applicationDeadline": "", "benefits": "bonus + equity + benefits", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4005639846"}