{"jobTitle": "Senior Accountant, Revenue", "company": {"name": "Jobs via eFinancialCareers", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Accounting/Auditing and Finance", "industry": "Staffing and Recruiting", "description": "Circle is a financial technology company at the epicenter of the emerging internet of money, where value can finally travel like other digital data - globally, nearly instantly and less expensively than legacy settlement systems. This ground-breaking new internet layer opens up previously unimaginable possibilities for payments, commerce and markets that can help raise global economic prosperity and enhance inclusion. Our infrastructure - including USDC, a blockchain-based dollar - helps businesses, institutions and developers harness these breakthroughs and capitalize on this major turning point in the evolution of money and technology.<br/><br/><strong>What you'll be part of:<br/><br/></strong>Circle is committed to visibility and stability in everything we do. As we grow as an organization, we're expanding into some of the world's strongest jurisdictions. Speed and efficiency are motivators for our success and our employees live by our company values: Multistakeholder, Mindfulness, Driven by Excellence and High Integrity. Circlers are consistently evolving in a remote world where strength in numbers fuels team success. We have built a flexible and diverse work environment where new ideas are encouraged and everyone is a stakeholder.<br/><br/><strong>What you'll be responsible for: <br/><br/></strong>Circle is looking for an exceptional Senior Accountant to support the Revenue team. As a Senior Accountant, you will be the lead representative in the Revenue transactional flow accounting needs including reconciliations, journal entries, exception monitoring and analysis, data integrity, reporting disclosures and process automation. As a multi-entity, international company, you will work with international accounting teams for cross-trainings, month-end close, reporting disclosures and audit support. You will also work closely with the data and engineering, product, treasury, risk and general finance teams.<br/><br/><strong>What you'll work on: <br/><br/></strong><ul><li>Supporting month-end close processes.</li><li>Performing fluctuation analysis and analyzing changes in accounts to ensure balances are accurately recorded in our GL and financial statements. </li><li>Supporting key reporting disclosures and regulatory filings. </li><li>New deal reviews and ensuring revenue recognition is recorded in accordance with US GAAP standards, including ASC 606. </li><li>Identifying process improvement areas, and working cross-functionally with Engineering, Product, Treasury, Compliance, FinOps and Data teams to drive automation and improvements in reporting. </li><li>Providing reporting requirements to cross functional partners and validate that it is complete and accurate for existing and new product launches.</li><li>Assisting with relevant SOX, audit, and tax requirements.</li><li>Performing special accounting analysis and projects, as requested.<br/><br/><br/></li></ul><strong>You will aspire to our four core values:<br/><br/></strong><ul><li>Multistakeholder - you have dedication and commitment to our customers, shareholders, employees and families and local communities.</li><li>Mindful - you seek to be respectful, an active listener and to pay attention to detail. </li><li>Driven by Excellence - you are driven by our mission and our passion for customer success which means you relentlessly pursue excellence, that you do not tolerate mediocrity and you work intensely to achieve your goals. </li><li>High Integrity - you seek open and honest communication, and you hold yourself to very high moral and ethical standards. You reject manipulation, dishonesty and intolerance.<br/><br/><br/></li></ul><strong>What you'll bring to Circle: <br/><br/></strong><ul><li>Bachelor's degree in Accounting, Finance or Business.</li><li>Minimum of 4+ years of accounting experience.</li><li>Big 4 experience and CPA preferred.</li><li>Direct experience performing detailed and data intensive reconciliations.</li><li>Strong technical accounting skills and experience/familiarity with ASC 606 concepts.</li><li>A passion for process improvement and automation.</li><li>Strong organizational skills, attention to detail, a proactive and self-motivated working style, ability to work collaboratively and multi-task, and creativity.</li><li>Excellent oral and written communication skills.</li><li>Proven ability to excel in a fast-paced environment.</li><li>Ability to prioritize workloads and ensure tasks are completed timely.</li><li>High integrity and ability to handle confidential information.</li><li>Experience/familiarity with Slack, Apple MacOS and GSuite.<br/><br/><br/></li></ul><strong>Additional Information:<br/><br/></strong><ul><li>This position is eligible for day-one PERM sponsorship for qualified candidates.<br/><br/><br/></li></ul>Circle is on a mission to create an inclusive financial future, with transparency at our core. We consider a wide variety of elements when crafting our compensation ranges and total compensation packages.<br/><br/>Starting pay is determined by various factors, including but not limited to: relevant experience, skill set, qualifications, and other business and organizational needs. Please note that compensation ranges may differ for candidates in other locations.<br/><br/>Base Pay Range: $102,500 - $137,500<br/><br/>Annual Bonus Target: 12.5%<br/><br/>Also Included: Equity &amp; Benefits (including medical, dental, vision and 401(k)). Circle has a discretionary vacation policy. We also provide 10 days of paid sick leave per year and 11 paid holidays per year in the U.S.<br/><br/>We are an <strong>equal opportunity employer</strong> and value diversity at Circle. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Additionally, Circle participates in the <strong>E-Verify Program</strong> in certain locations, as required by law.<br/><br/>", "postedDate": "3 days ago", "skills": ["US GAAP", "ASC 606", "Accounting", "Finance", "Process Improvement", "Automation", "Data Analysis", "Reporting", "SOX", "Audit", "Tax", "Slack", "Apple MacOS", "GSuite"], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005922436"}