{"jobTitle": "Data Analyst, Santa Ana, CA", "company": {"name": "Orange County's Credit Union", "industry": "Banking", "size": "Not specified", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$27.00/hr - $34.00/hr", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Banking", "description": "Exciting Opportunity at Orange County's Credit Union\n\nCREDIT UNION’S PURPOSE: Simple Banking. For People, Not Profit.\n\nCREDIT UNION’S CORE VALUES: Integrity, Service Excellence, Growth & Development, High Performance, Mutual Respect, Community, and Fun\n\nWorkplace Excellence. Through our associates' opinions and voices, Orange County's Credit Union is a proud recipient of the Peter Barron Stark Best of the Best Award for highest associate satisfaction in the workplace! As a leading financial service provider with over 80 years of experience serving 123,000+ members, Orange County's Credit Union is currently $2+ billion in assets & growing.\n\nGenerous Benefits Including\n- Anthem Vivity HMO & Delta Care USA Dental - Orange County's Credit Union (OCCU) covers 100% of the associates' monthly premium\n- Life insurance at no cost to employee.\n- 401(k) – OCCU automatically contributes 3% of the employee’s earnings PLUS matches up to 5% of the employee’s contribution (dollar for dollar)\n- Vacation hours – 13 days per year and rolls over year to year, and increases with tenure\n- Sick hours – 7 days per year and rolls over year to year\n- Paid Holidays – 12 days per year plus 3 partial days\n- Annual performance merit increases\n- Professional and personal development programs, including educational grants up to $2k per year, and step progression opportunities\n- Annual discretionary bonus\n- Professional, friendly work environment focused on achieving goals, recognizing successes, and excelling at member service.\n\nPosition Summary\nCollaborate with delivery team and engage with organizational stakeholders (Business and IT) to design, develop and deliver end-to-end enterprise data analytics solutions to enable data-driven insights and decision making.\nTranslate business requirements to technical solutions by applying technical knowledge and strong business acumen.\nSolve business problems and complex data requirements/challenges by incorporating standards and best practices into engineering solutions, and leveraging modern data science programming languages (e.g., SQL, Python, R, Scala, SAS) and Azure data and analytics services.\nDevelop and implement database designs (logical and physical) and data models (normalized and dimensional) to support the new analytics platform.\nDesign, implement and maintain data ingestion/integration and end-to-end data pipeline processes using Azure technologies for a wide variety of traditional and non-traditional data sources/formats (structured, unstructured, and semi-structured) through various protocols (e.g., REST, SOAP, SFTP, MQ, etc).\nLead in utilizing data visualization best practices to tell stories that drive both engagement and action.\nCreate and scope projects that shape new analytics products or services.\nManage associate analytics product backlog, create and prioritize user stories, define acceptance criteria and obtain requirements sign-off.\nInfluence associates to integrate data into decision-making, increase data literacy, and build acceptance of tools, programs, and services.\nWork with large data sets, advanced statistical models, and Python/R/SAS/other coding to effectively and efficiently execute models for purposes including stress testing, allowance calculations, and forecasting.\nDevelop data models to meet the needs of multiple lines of business.\nDevelop analytics around model results for enhancing forecast performance.", "responsibilities": "Collaborate with delivery team and engage with organizational stakeholders (Business and IT) to design, develop and deliver end-to-end enterprise data analytics solutions to enable data-driven insights and decision making. Translate business requirements to technical solutions by applying technical knowledge and strong business acumen. Solve business problems and complex data requirements/challenges by incorporating standards and best practices into engineering solutions, and leveraging modern data science programming languages (e.g., SQL, Python, R, Scala, SAS) and Azure data and analytics services. Develop and implement database designs (logical and physical) and data models (normalized and dimensional) to support the new analytics platform. Design, implement and maintain data ingestion/integration and end-to-end data pipeline processes using Azure technologies for a wide variety of traditional and non-traditional data sources/formats (structured, unstructured, and semi-structured) through various protocols (e.g., REST, SOAP, SFTP, MQ, etc). Lead in utilizing data visualization best practices to tell stories that drive both engagement and action. Create and scope projects that shape new analytics products or services. Manage associate analytics product backlog, create and prioritize user stories, define acceptance criteria and obtain requirements sign-off. Influence associates to integrate data into decision-making, increase data literacy, and build acceptance of tools, programs, and services. Work with large data sets, advanced statistical models, and Python/R/SAS/other coding to effectively and efficiently execute models for purposes including stress testing, allowance calculations, and forecasting. Develop data models to meet the needs of multiple lines of business. Develop analytics around model results for enhancing forecast performance.", "qualifications": {"required": "5+ years of experience in one or a combination of the following: reporting, analytics, or data modeling demonstrated through work, education or military experience in a medium to large enterprises with complex Business and IT environment. 3+ years of experience performing data modeling and analysis across multiple product classes, systems, and organizations using modern cloud-based data technologies (e.g., Azure, Synapse, Data Factory, etc.). 3+ years SQL, R, Python, Spark, Scala or SAS programming. 3+ years business intelligence and data visualizations using modern tools (e.g., Tableau, PowerBI, SSRS). 2+ years modeling data and creating data pipelines. 2+ years leading / guiding less experienced analyst.", "preferred": ""}, "skills": ["SQL", "Python", "R", "Scala", "SAS", "Azure", "Data Visualization", "Tableau", "PowerBI", "SSRS"], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "Generous Benefits Including: Anthem Vivity HMO & Delta Care USA Dental - Orange County's Credit Union (OCCU) covers 100% of the associates' monthly premium, Life insurance at no cost to employee, 401(k) – OCCU automatically contributes 3% of the employee’s earnings PLUS matches up to 5% of the employee’s contribution (dollar for dollar), Vacation hours – 13 days per year and rolls over year to year, and increases with tenure, Sick hours – 7 days per year and rolls over year to year, Paid Holidays – 12 days per year plus 3 partial days, Annual performance merit increases, Professional and personal development programs, including educational grants up to $2k per year, and step progression opportunities, Annual discretionary bonus, Professional, friendly work environment focused on achieving goals, recognizing successes, and excelling at member service.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4005171117"}