{"jobTitle": "Regional Sales Director - Central California", "company": {"name": "Shockwave Medical", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Medical Equipment Manufacturing", "description": "Shockwave Medical, Inc. is a pioneer in the development and commercialization of Intravascular Lithotripsy (IVL) to treat complex calcified cardiovascular disease. Shockwave Medical aims to establish a new standard of care for medical device treatment of atherosclerotic cardiovascular disease through its differentiated and proprietary local delivery of sonic pressure waves for the treatment of calcified plaque.<br/><br/><strong>Position Overview<br/><br/></strong>The Regional Sales Director will build and develop a regional sales team to deliver best in class performance for revenue and growth. Responsible for building and managing the regional sales force and generating revenue and creating a successful strategy. Work closely with Marketing, R&amp;D and Area VP of Sales to identify market needs and execute on the sale/commercialization of new products.<br/><br/><strong>Essential Job Functions<br/><br/></strong><ul><li> Build, oversee and help drive a team of regional field sales representatives that maximize sales revenues, attain corporate objectives and exceed sales goals </li><li> Forecast annual, quarterly, and monthly sales revenue streams accurately </li><li> Identify, develop, and implement effective sales plans and strategies </li><li> Develop specific revenue plans for sales teams as needed to ensure growth in all products/services targeted by the organization </li><li> Provide coaching, advice, support, motivation or information to help individuals meet and ideally exceed their defined sales objectives </li><li> Train and coach sales representatives to structure deals that exceed revenue expectations </li><li> Serve as escalation point for issues beyond team authority; resolve team conflicts as necessary </li><li> Perform sales activities for an assigned geographic area to achieve or exceed assigned revenue objectives </li><li> Develop and test new sales strategies and tactics, replicating those that are most successful </li><li> Keep abreast of and disseminate new product and industry knowledge to the team </li><li> Work closely with Marketing on go-to market strategies and see them through to successful completion </li><li> Participate in sales team meetings, sales management meetings and quarterly business reviews </li><li> Other duties as assigned. These job requirements are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel. <br/><br/></li></ul><strong> Requirements <br/><br/></strong><ul><li> BA/BS degree or equivalent relevant experience </li><li> Proven track record of leading sales in the medical device or disposable device markets </li><li> 5+ years of demonstrated success leading and managing a sales team and exceeding team quotas in cardiovascular medical devices </li><li> Strong sales, recruiting, leadership, organization, planning and prioritization </li><li> Results oriented with multiple years of meeting or exceeding quota with experience in bringing innovative market defining products to market </li><li> Good interpersonal skills to align and foster positive working relationships across the organization (internal and external) </li><li> Ability to develop and critically analyze a sales pipeline and forecast </li><li> Excellent verbal and written communication skills </li><li> Ability to travel over 50% if needed </li><li> Ability to work in a fast-paced environment while managing multiple priorities </li><li> Operate as a team and/or independently while demonstrating flexibility to changing requirements <br/><br/></li></ul><strong>Market Range:</strong> $200,000 + commission<br/><br/><strong>Benefits<br/><br/></strong>Shockwave Medical offers a competitive total compensation package as well as the following benefits and perks.<br/><br/><strong>Core Benefits:</strong> Medical, Dental, Vision, Pre-tax and Roth 401k options with a fully vested match, Short-Term and Long-Term Disability, and Life Insurance, Employer contribution toward Health Savings Account (HSA), Competitive PTO balance<br/><br/><strong>Perks:</strong> Calm App, Pet Insurance, Student Loan Refinancing, Spot Bonus awards<br/><br/><strong>EEO Employer</strong>", "responsibilities": "The Regional Sales Director will build and develop a regional sales team to deliver best in class performance for revenue and growth. Responsible for building and managing the regional sales force and generating revenue and creating a successful strategy. Work closely with Marketing, R&amp;D and Area VP of Sales to identify market needs and execute on the sale/commercialization of new products.", "qualifications": {"required": "BA/BS degree or equivalent relevant experience, Proven track record of leading sales in the medical device or disposable device markets, 5+ years of demonstrated success leading and managing a sales team and exceeding team quotas in cardiovascular medical devices, Strong sales, recruiting, leadership, organization, planning and prioritization, Results oriented with multiple years of meeting or exceeding quota with experience in bringing innovative market defining products to market, Good interpersonal skills to align and foster positive working relationships across the organization (internal and external), Ability to develop and critically analyze a sales pipeline and forecast, Excellent verbal and written communication skills, Ability to travel over 50% if needed, Ability to work in a fast-paced environment while managing multiple priorities, Operate as a team and/or independently while demonstrating flexibility to changing requirements"}, "skills": [], "postedDate": "3 days ago", "benefits": "Shockwave Medical offers a competitive total compensation package as well as the following benefits and perks.<br/><br/><strong>Core Benefits:</strong> Medical, Dental, Vision, Pre-tax and Roth 401k options with a fully vested match, Short-Term and Long-Term Disability, and Life Insurance, Employer contribution toward Health Savings Account (HSA), Competitive PTO balance<br/><br/><strong>Perks:</strong> Calm App, Pet Insurance, Student Loan Refinancing, Spot Bonus awards", "remoteWork": "No", "salary": {"amount": "200,000 + commission", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4005945191"}