{"jobTitle": "LOGISTIC COORDINATOR NEEDED", "company": {"name": "Tile Tech Pavers", "location": "Vernon, CA"}, "location": "Vernon, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "22.00 - 26.75", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Wholesale Building Materials", "description": "Top building supplier in Los Angeles is seeking a dedicated individual to ensure the timely and accurate shipment of orders. Our ideal candidate has a friendly, customer-first attitude, is highly organized, and handles pressure like a pro!<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Utilize software to track, check, prioritize, and route orders efficiently. </li><li>Manage essential documents such as advanced shipping notices, packing slips, and bills of lading. </li><li>Prepare shipments and negotiate rates for commercial conveyance, selecting the most cost-effective and efficient shipping methods and containers. </li><li>Collaborate with warehouse, purchasing, and other managers to streamline processes and improve efficiency. </li><li>Resolve any issues or discrepancies related to shipped orders promptly. </li><li>Ensure strict compliance with legal regulations and company policies. </li><li>Provide regular reports to management on operational activities and challenges. <br/><br/></li></ul><strong>Desired Requirements:<br/><br/></strong><ul><li>Proven experience as a shipping coordinator or similar role. </li><li>Solid knowledge of logistics procedures and shipping documentation. </li><li>Proficiency in preparing routine administrative paperwork. </li><li>Computer savvy with excellent knowledge of MS Office (especially Excel); experience with Sage 50 is a plus. </li><li>Experience in international, state-to-state, and local logistics. </li><li>Excellent organizational and communication skills. Bilingual a plus. </li><li>Strong problem-solving abilities. </li><li>High school diploma required; BS/BA in supply chain, logistics, or a related field preferred. </li><li>Ability to work independently and collaboratively as part of a team. </li><li>Must have great customer service. </li><li>Management of orders being packed. </li><li>Able to work overtime when needed. <br/><br/></li></ul><strong>Job Type:</strong> Full-time<br/><br/><strong>Pay:</strong> $22.00 - $26.75 per hour<br/><br/><strong>Benefits:</strong> 401(k)<br/><br/><strong>Schedule:</strong> 8-hour shifts, Monday to Friday with overtime opportunities.<br/><br/><strong>Experience Preferred:<br/><br/></strong><ul><li>Logistics shipping: 5 years</li><li>Sage: 5 years<br/><br/></li></ul><strong>Work Location:</strong> Commerce. This is an in-house position.<br/><br/>If you are a dedicated and detail-oriented individual looking to join a top building supplier, we encourage you to apply. We look forward to potentially working with you!<br/><br/><strong>Company Description<br/><br/></strong>We are leading construction and building materials manufacturer.<br/><br/>We are leading construction and building materials manufacturer.", "responsibilities": "Utilize software to track, check, prioritize, and route orders efficiently. Manage essential documents such as advanced shipping notices, packing slips, and bills of lading. Prepare shipments and negotiate rates for commercial conveyance, selecting the most cost-effective and efficient shipping methods and containers. Collaborate with warehouse, purchasing, and other managers to streamline processes and improve efficiency. Resolve any issues or discrepancies related to shipped orders promptly. Ensure strict compliance with legal regulations and company policies. Provide regular reports to management on operational activities and challenges.", "qualifications": {"required": "Proven experience as a shipping coordinator or similar role. Solid knowledge of logistics procedures and shipping documentation. Proficiency in preparing routine administrative paperwork. Computer savvy with excellent knowledge of MS Office (especially Excel); experience with Sage 50 is a plus. Experience in international, state-to-state, and local logistics. Excellent organizational and communication skills. Bilingual a plus. Strong problem-solving abilities. High school diploma required; BS/BA in supply chain, logistics, or a related field preferred. Ability to work independently and collaboratively as part of a team. Must have great customer service. Management of orders being packed. Able to work overtime when needed.", "preferred": "Logistics shipping: 5 years, Sage: 5 years"}, "skills": ["Logistics", "Shipping", "Sage", "Excel", "MS Office", "Customer Service", "Communication", "Problem Solving", "Organization"], "postedDate": "15 hours ago", "benefits": "401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005367591"}