{"jobTitle": "Supply Chain Analyst", "company": {"name": "LHH", "industry": "Human Resources Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$70,000.00 - $80,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Human Resources Services", "description": "Our dynamic team is looking for a skilled Supply Chain Analyst to join our client. If you are passionate about optimizing supply chain processes and driving operational excellence, we want to hear from you!", "responsibilities": "Analyze and interpret supply chain data to identify trends, issues, and opportunities for improvement. Develop and implement strategies to optimize supply chain processes, including inventory management, procurement, and logistics. Collaborate with suppliers, vendors, and internal teams to ensure timely and cost-effective delivery of goods and services. Monitor and report on key performance indicators (KPIs) related to supply chain performance. Conduct risk assessments and develop contingency plans to mitigate supply chain disruptions. Utilize advanced analytics tools and software to enhance data-driven decision-making. Prepare and present reports to senior management on supply chain performance and improvement initiatives.", "qualifications": {"required": "Bachelor’s degree in Supply Chain Management, Business Administration, Logistics, or a related field. Relevant certifications (e.g., APICS, CSCP) are a plus. Proven experience (3+ years) in supply chain analysis, logistics, or a related field. Strong analytical skills with the ability to interpret complex data and generate actionable insights. Proficiency in supply chain management software and tools (e.g., ERP systems, Excel, Tableau). Excellent communication and interpersonal skills, with the ability to work effectively across departments. Detail-oriented with strong organizational skills and the ability to manage multiple projects simultaneously. Knowledge of supply chain best practices and industry trends.", "preferred": ""}, "skills": [], "postedDate": "5 days ago", "applicationDeadline": "Not specified", "benefits": "Competitive salary and benefits package. Opportunities for professional growth and development. A collaborative and inclusive work environment.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4005211498"}