{"jobTitle": "Director Operations Member Services", "company": {"name": "Kaiser Permanente", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Director", "jobFunction": "Management and Manufacturing", "industry": "Hospitals and Health Care", "description": "<strong>Description<br/><br/></strong><strong>Job Summary:<br/><br/></strong>Provide leadership, overall management, strategic direction, and support to the Local Member Services professional staff, across multiple sites. Responsible for Member Services daily operations, initiatives, oversight of case processing, issue resolution, quality of information and service provided by staff to both internal and external customers. Support and represent Kaiser Foundation Health Plan Member Services, and strategize with Regional and Local leadership, facility personnel, and physicians to minimize the financial risk to the organization and ensure contract integrity for our members as well as Kaiser Permanente. Provide performance based consulting to department management and facilities throughout Northern California. Provide service recovery in order to assist in the retention of our members. Drive the mission and business results for Kaiser Permanente while meeting budgetary guidelines to ensure responsible stewardship of our members dues.<br/><br/><strong>Essential Responsibilities<br/><br/></strong><ul><li>Provides leadership (responsibility and oversight/management) for member services at the medical center and medical offices for designated facilities, including budgetary, compliance, service and quality oversight.</li><li>Identifies member and non-member pain points, and works with area leaders to drive continuous service improvements, partnering with these local and regional leaders to reduce complaints and grievances, while increasing member satisfaction, growth and retention.</li><li>Acts as key liaison with the medical group; develops programs and service improvements in conjunction with key medical group personnel, managers, and physicians, to improve member experience and resolve member issues as quickly and effectively as possible.</li><li>Handles high risk issues by managing timely communication with medical facilities.</li><li>Provides ongoing information, reports and recommendations to facility departments and physician chiefs related to data analysis and provision of reports and information related to services and concerns that arise in specific departments.</li><li>Oversees the daily operations of the member services department, including linkage with auditing, training and analyst work to best meet the needs of staff, members, key stakeholders, and leadership.</li><li>Identifies member-system conflict in an effort to prevent professional liability, minimize financial penalties to the organization, and retain satisfied members.</li><li>Hires, supervises, coaches/trains and develops staff who handle sensitive and multi-faceted member issues and requests.</li><li>Creates a team atmosphere and structure that promotes self-directed work through the development and empowerment of staff.</li><li>Orients and educates facility departments, physicians and other professional staff regarding health plan products, benefits, regulatory guidelines, resolution of member questions, complaints and grievances.</li><li>Fosters a service oriented work environment with an emphasis on dedication to serving members, affording respect to individuals, achievement of highest standards of quality, identifying and supporting opportunities for innovation, supporting teamwork and implementing policies and practices that reflect the vision of KP.<br/><br/></li></ul><strong>Experience<br/><br/></strong><strong>Basic Qualifications:<br/><br/></strong><ul><li> Minimum eight (8) years of management/leadership experience in a complex healthcare (preferably HMO) or service-oriented organization.</li><li> Minimum three (3) years of experience in customer service improvement and process redesign, with openness to creative and innovative approaches to providing service, including cultural sensitivity, respect and polite communication with patients and all clientele.</li><li> Minimum three (3) years of experience working with accreditation and regulatory agencies and/or preparing information for regulatory audits as requested, (including, but not limited to Department of Health Services (DHS), Department of Managed Healthcare (DMHC), National Committee for Quality Assurance (NCQA), and Center for Medicare/Medicaid Services (CMS).<br/><br/></li></ul>Education<br/><br/><ul><li> Bachelor's degree in Health Care Administration, Business Management, Science or Business or four (4) years of experience in a directly related field.</li><li> High School Diploma or General Education Development (GED) required.<br/><br/></li></ul>License, Certification, Registration<br/><br/><ul><li> N/A<br/><br/></li></ul><strong>Additional Requirements<br/><br/></strong><ul><li> Outstanding interpersonal/communication and mediation skills with ability to effectively partner with a wide group of stakeholders, including professional and medical staff.</li><li> Demonstrated management and leadership skills, including working with varied levels of staff, budgeting, delegation, staff development, coaching, resource allocation planning, and performance management.</li><li> Excellent presentation/public speaking skills and experience.</li><li> Demonstrated ability in development of team focus, partnership, service orientation, influence and change leadership.</li><li> Demonstrated expertise in results orientation, taking initiative.</li><li> Demonstrated awareness of how one's emotions impact decisions, action and desired outcomes.</li><li> Demonstrated awareness in emotional intelligence as modeled in day-to-day leadership responsibilities.</li><li> Demonstrated ability to lead, collaborate, communicate, influence and partner effectively with senior leadership and a broad base of business and functional leadership.</li><li> Strong written and verbal communication skills.</li><li> Proven ability and commitment to work collaboratively in a Labor Management Partnership.</li><li> Demonstrates a level of proficiency in the following tools: Word (compose executive summaries/reports), Excel (open spreadsheets, create graphs), Power Point (create executive presentations), Electronic Medical Record, Statistical Analysis Programs.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Excellent investigation, problem solving, and documentation skills preferred.</li><li> Master's degree preferred. <br/><br/></li></ul><strong>Primary Location:</strong> California,Anaheim,Kraemer I Medical Offices <strong>Scheduled Weekly Hours:</strong> 40 <strong>Shift:</strong> Day <strong>Workdays:</strong> Mon, Tue, Wed, Thu, Fri <strong>Working Hours Start:</strong> 08:00 AM <strong>Working Hours End:</strong> 05:00 PM <strong>Job Schedule:</strong> Full-time <strong>Job Type:</strong> Standard <strong>Worker Location:</strong> Onsite <strong>Employee Status:</strong> Regular <strong>Employee Group/Union Affiliation:</strong> NUE-SCAL-01|NUE|Non Union Employee <strong>Job Level:</strong> Director/Senior Director <strong>Department:</strong> OC Lakeview Medical Center - Mbr Svc-Member Relations - 0808 <strong>Pay Range:</strong> $112300 - $145310 / year The ranges posted above reflect the location in the job posting. The salary range may vary if you reside in a different location or state than the location posted. <strong>Travel: </strong> No <strong>On-site:</strong> Work location is on-site (KP designated office, medical office building or hospital). Worker location must align with Kaiser Permanente's Authorized States policy. At Kaiser Permanente, equity, inclusion and diversity are inextricably linked to our mission, and we aim to make it a part of everything we do. We know that having a diverse and inclusive workforce makes Kaiser Permanente a better place to receive health care, a more supportive partner in our communities we serve, and a more fulfilling place to work. Working at Kaiser Permanente means that you agree to and abide by our commitment to equity and our expectation that we all work together to create an inclusive work environment focused on a sense of belonging and wellbeing.<br/><br/>Kaiser Permanente is an equal opportunity employer committed to a diverse and inclusive workforce. Applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), age, sexual orientation, national origin, marital status, parental status, ancestry, disability, gender identity, veteran status, genetic information, other distinguishing characteristics of diversity and inclusion, or any other protected status. Submit Interest", "responsibilities": "Provide leadership, overall management, strategic direction, and support to the Local Member Services professional staff, across multiple sites. Responsible for Member Services daily operations, initiatives, oversight of case processing, issue resolution, quality of information and service provided by staff to both internal and external customers. Support and represent Kaiser Foundation Health Plan Member Services, and strategize with Regional and Local leadership, facility personnel, and physicians to minimize the financial risk to the organization and ensure contract integrity for our members as well as Kaiser Permanente. Provide performance based consulting to department management and facilities throughout Northern California. Provide service recovery in order to assist in the retention of our members. Drive the mission and business results for Kaiser Permanente while meeting budgetary guidelines to ensure responsible stewardship of our members dues.", "qualifications": {"required": "Minimum eight (8) years of management/leadership experience in a complex healthcare (preferably HMO) or service-oriented organization. Minimum three (3) years of experience in customer service improvement and process redesign, with openness to creative and innovative approaches to providing service, including cultural sensitivity, respect and polite communication with patients and all clientele. Minimum three (3) years of experience working with accreditation and regulatory agencies and/or preparing information for regulatory audits as requested, (including, but not limited to Department of Health Services (DHS), Department of Managed Healthcare (DMHC), National Committee for Quality Assurance (NCQA), and Center for Medicare/Medicaid Services (CMS). Bachelor's degree in Health Care Administration, Business Management, Science or Business or four (4) years of experience in a directly related field. High School Diploma or General Education Development (GED) required. Outstanding interpersonal/communication and mediation skills with ability to effectively partner with a wide group of stakeholders, including professional and medical staff. Demonstrated management and leadership skills, including working with varied levels of staff, budgeting, delegation, staff development, coaching, resource allocation planning, and performance management. Excellent presentation/public speaking skills and experience. Demonstrated ability in development of team focus, partnership, service orientation, influence and change leadership. Demonstrated expertise in results orientation, taking initiative. Demonstrated awareness of how one's emotions impact decisions, action and desired outcomes. Demonstrated awareness in emotional intelligence as modeled in day-to-day leadership responsibilities. Demonstrated ability to lead, collaborate, communicate, influence and partner effectively with senior leadership and a broad base of business and functional leadership. Strong written and verbal communication skills. Proven ability and commitment to work collaboratively in a Labor Management Partnership. Demonstrates a level of proficiency in the following tools: Word (compose executive summaries/reports), Excel (open spreadsheets, create graphs), Power Point (create executive presentations), Electronic Medical Record, Statistical Analysis Programs.", "preferred": "Excellent investigation, problem solving, and documentation skills preferred. Master's degree preferred."}, "skills": ["Leadership", "Management", "Healthcare", "Customer Service", "Process Redesign", "Accreditation", "Regulatory Compliance", "Communication", "Presentation", "Public Speaking", "Teamwork", "Problem Solving", "Documentation", "Microsoft Word", "Microsoft Excel", "Microsoft PowerPoint", "Electronic Medical Records", "Statistical Analysis"], "postedDate": "5 days ago", "salary": {"amount": "112300 - 145310", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005157877"}