{"jobTitle": "Shipping Clerk", "company": {"name": "Bunzl Distribution NA", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "20.00 - 23.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Liberty Safety, a division of Bunzl, is seeking a Shipping Clerk for our facility in City of Industry. The Shipping Clerk will assist with a variety of functions within the warehouse, including processing daily shipping requirements accurately and in a timely manner. This position will also assist with freight rate comparisons for each order and use the ERP system to create shipments.<br/><br/>Your career path has many avenues available for you to succeed. Are you looking to advance at a rate that matches your ambition and skill set? At Bunzl, we understand and want to invest in you. With our multi-career options, you’ll not only be able to find the adventure you are looking for today, but can be confident that new opportunities will be there for advancement in your future.<br/><br/>At Bunzl, we know that our employees are our number one asset. We seek to recruit and retain the right people who are passionate about our business and we provide opportunities for our employees so that they may progress within our company based on their talents, experiences, and their aptitude.<br/><br/><em><strong>Requirements:<br/><br/></strong></em><ul><li>Assist in freight rate comparisons for each order.</li><li>Generate RMA and file claims with carriers (LTL) and small parcel (UPS/FedEx).</li><li>Use company ERP system to create shipments.</li><li>Prepare shipping documents for the warehouse.</li><li>Communicate with carriers to arrange pick up for daily shipments.</li><li>Process shipments through UPS World Ship and FedEx Ship Manager.<br/><br/></li></ul><em><strong>Requirements:<br/><br/></strong></em><ul><li>High school diploma or GED is preferred</li><li>Familiarity with ERP systems</li><li>Prior experience with UPS World Ship and FedEx Ship Manager</li><li>Strong computer skills, including Microsoft Outlook, Word and Excel</li><li>Good communication skills (written and verbal)</li><li>Detail-oriented</li><li>Superior organizational and time management skills</li><li>Ability to multi-task</li><li>Self-motivated and works well in a team environment<br/><br/></li></ul>Liberty California salary range: $20 - $23 per hour based on experience, education, and geographic location.<br/><br/><strong>So, what are you waiting for? A new career awaits you with endless opportunities.<br/><br/></strong>Bunzl is a global leader in the Cleaning &amp; Hygiene, Food Processing, Grocery, Health Care, Non-Food Retail, and Safety industries. We have grown both organically and through acquisitions to sales in excess of $10 billion. Bunzl North America is headquartered in St. Louis, Missouri. Bunzl North America owns and operates more than 100 warehouses and serves all 50 states, Puerto Rico, Canada and parts of the Caribbean and Mexico. With more than 5,000 employees and 400,000 plus supplies, Bunzl is regarded as a leading supplier in North America.<br/><br/><em>Bunzl Distribution offers competitive salaries, a comfortable work environment, and a full range of benefits including a 401k with a company match.<br/><br/></em><em>Click here to view the California Employee/Applicant Privacy Policy<br/><br/></em><em>Bunzl Distribution has a tradition of commitment to equal employment opportunity. It is the established policy to attract and retain the best qualified people without regard to race, color, religion, national origin, sex/gender (including pregnancy), sexual orientation, age, disability or veteran status as provided by law.<br/><br/></em>Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities", "responsibilities": "Assist in freight rate comparisons for each order.\nGenerate RMA and file claims with carriers (LTL) and small parcel (UPS/FedEx).\nUse company ERP system to create shipments.\nPrepare shipping documents for the warehouse.\nCommunicate with carriers to arrange pick up for daily shipments.\nProcess shipments through UPS World Ship and FedEx Ship Manager.", "qualifications": {"required": "High school diploma or GED is preferred\nFamiliarity with ERP systems\nPrior experience with UPS World Ship and FedEx Ship Manager\nStrong computer skills, including Microsoft Outlook, Word and Excel\nGood communication skills (written and verbal)\nDetail-oriented\nSuperior organizational and time management skills\nAbility to multi-task\nSelf-motivated and works well in a team environment"}, "skills": ["ERP", "UPS World Ship", "FedEx Ship Manager", "Microsoft Outlook", "Microsoft Word", "Microsoft Excel", "Communication", "Time Management"], "postedDate": "2 days ago", "benefits": "Bunzl Distribution offers competitive salaries, a comfortable work environment, and a full range of benefits including a 401k with a company match.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005936469"}