{"jobTitle": "Talent Acquisition Partner - Marketing", "company": {"name": "Red Bull", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$101,365.00/yr - $112,034.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Food and Beverage Services", "description": "Reporting to the Senior Manager, Talent Acquisition for Red Bull North America and Red Bull Media House, you will source extraordinary talent across the functions Marketing & Media. You will help foster a diverse and inclusive workforce by following progressive, fair, and unbiased recruitment practices.<br/><br/><strong>All the responsibilities we'll trust you with:<br/><br/></strong><strong>FIND EXTRAORDINARY TALENT<br/><br/></strong>Support full lifecycle recruitment (profiling, process, sourcing, interviewing, and evaluating) for openings across all departments within RBNA Ensure Marketing & Media talent expertise, leveraging insights from the external market, talent trends, and cultivating pipeline both internally and externally Advise hiring teams to fuel Red Bull with extraordinary talent Use hiring resources, provide talent context, and use your networking skills to help meet talent needs Review, interview, assess, and provide feedback on candidates Manage the offer process and provide sound recommendations by partnering with hiring teams and members of Talent<br/><br/><strong>SHARE YOUR EXPERTISE<br/><br/></strong>Work with the Senior Manager, Talent Acquisition to identify opportunities for future talent needs and pipelines Promote transparency in the TA process by ensuring regular communication with hiring teams and members of Talent Stay current on market dynamics, talent landscape, and industry news<br/><br/><strong>Your areas of knowledge and expertise that matter most for this role:<br/><br/></strong><ul><li>2+ years of experience in full cycle recruiting/talent acquisition with an emphasis on DE&amp;I</li><li>Knowledge of media, marketing, &amp; marketing communications recruiting strongly preferred</li><li>Knowledge of CPG a plus</li><li>Adaptable communication skills and the ability to influence and drive decision making</li><li>A history of proactive delivery against talent needs<br/><br/></li></ul>The base salary range for this position is $101,365 to 112,034 + cash incentives Actual salary offer may vary based on work experience. The base pay range is subject to change and may be modified in the future.<br/><br/>Our current Benefits include:<br/><br/>Comprehensive Medical, Dental and Vision Plans, 401k Match, Family Leave, PTO &amp; Paid Holiday Schedule, Pet, Legal, and Life Insurance, Tuition Reimbursement (Benefits listed may vary depending on the nature of your employment and/or work location)<br/><br/>Red Bull North America, Inc. is an Equal Opportunity Employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, veteran status, age, or any other classification protected by Federal, state, or local law. We will consider for employment all qualified Applicants, including those with Criminal Histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.", "responsibilities": "Support full lifecycle recruitment (profiling, process, sourcing, interviewing, and evaluating) for openings across all departments within RBNA Ensure Marketing & Media talent expertise, leveraging insights from the external market, talent trends, and cultivating pipeline both internally and externally Advise hiring teams to fuel Red Bull with extraordinary talent Use hiring resources, provide talent context, and use your networking skills to help meet talent needs Review, interview, assess, and provide feedback on candidates Manage the offer process and provide sound recommendations by partnering with hiring teams and members of Talent Work with the Senior Manager, Talent Acquisition to identify opportunities for future talent needs and pipelines Promote transparency in the TA process by ensuring regular communication with hiring teams and members of Talent Stay current on market dynamics, talent landscape, and industry news", "qualifications": {"required": "2+ years of experience in full cycle recruiting/talent acquisition with an emphasis on DE&amp;I Knowledge of media, marketing, &amp; marketing communications recruiting strongly preferred Knowledge of CPG a plus Adaptable communication skills and the ability to influence and drive decision making A history of proactive delivery against talent needs", "preferred": null}, "skills": ["DE&amp;I", "Media", "Marketing", "Marketing Communications", "CPG", "Communication", "Talent Acquisition", "Recruiting"], "postedDate": "4 days ago", "applicationDeadline": null, "benefits": "Comprehensive Medical, Dental and Vision Plans, 401k Match, Family Leave, PTO &amp; Paid Holiday Schedule, Pet, Legal, and Life Insurance, Tuition Reimbursement (Benefits listed may vary depending on the nature of your employment and/or work location)", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4005128265"}