{"jobTitle": "Human Resources Generalist", "company": {"name": "Cynet Systems", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Human Resources", "industry": "Information Technology & Services", "description": "<strong>Job Description:<br/> <br/> Pay Range: $30.61hr - $34.61hr<br/> <br/> Responsibilities:</strong> <ul><li> <span>  Drives the interactive process for all reasonable accommodation and leave of absence requests. </span> </li><li> <span>  Collaborates and communicates with internal (including Management, Health Services, HR Business Partners, and Legal) and external (including Leave Administrator and Worker's Compensation) partners, as needed.</span> </li><li> <span>  In coordination with third-party leave administrator, processes and tracks the day-to-day requests for leave and accommodation requests for union and non-union employees. </span> </li><li> <span>  Review process with leave administrator to ensure compliance with applicable leave and accommodation laws, including FMLA, CFRA, FEHA, USERRA, and ADA.</span> </li><li> <span>  Works with HR Coordinator – LOA for processing and tracking of all leaves, including leaves for Disability, Workers' Compensation, Parental, Personal, and Professional.</span> </li><li> <span>  Acts as point person for employees with inquiries about leaves of absence and reasonable accommodations. </span> </li><li> <span>  Educates employees on leave and reasonable accommodation topics and empowers them to become self-sufficient navigating resources and with third-party leave administrators.</span> </li><li> <span>  Maintains employee leave and accommodation files, including through internal HR workflow systems and tracking programs. </span> </li><li> <span>  Submits HR transactions and workflow forms for day-to-day processing of leaves of absence.</span> </li><li> <span>  Partners with HR Business Partners on leave, accommodation, and attendance situations.</span> </li><li> <span>  Leverages HR systems and Microsoft Office Suite to streamline HR processes.</span> </li><li> <span>  Engages in interactive conversations with Team Members. </span> </li><li> <span>  Drafts and sends communication throughout the process via email and regular mail.</span> </li><li> <span>  Helps mentor relevant HR partners, including HR Coordinator – LOA.</span> </li><li> <span>  Provides backup coverage and support for the HR team and additional areas as needed.</span> </li><li> <span>  Perform other duties as assigned.</span> </li> </ul> <span>  Qualifications/Requirements:</span>  <ul><li> <span>  Bachelor’s degree from a four-year college or university is preferred; Human Resources, Business, Communication or related field preferred or Certified in Leave of Absences.</span> </li><li> <span>  Minimum 2 years of Human Resources (HR) experience with knowledge of LOA and disability principles or 1 year of LOA and disability-specific HR experience required.</span> </li><li> <span>  Knowledge of state and federal (FMLA) regulations, ADA, and Worker’s Compensation is required.</span> </li><li> <span>  Knowledge of medical disability management is required.</span> </li> </ul> <span>  Desired Characteristics:</span>  <ul><li> <span>  Experience in both non-union and union/represented environments in the retail or hospitality industry preferred.</span> </li><li> <span>  Excellent verbal and written communication.</span> </li><li> <span>  SAP or other HRIS experience preferred.</span> </li><li> <span>  Proficient with Microsoft Office (Outlook, Excel, PowerPoint, Word, Teams) preferred.</span> </li><li> <span>  Professional and personable with the ability to exercise sound judgment when dealing with sensitive and confidential matters.</span> </li><li> <span>  Demonstrated ability to drive HR processes and to deliver high-quality HR services.</span> </li><li> <span>  Flexibility and adaptability in a fast-paced, constantly changing environment.</span> </li><li> <span>  Ability to prioritize effectively, think independently, and problem-solve to ensure all projects are completed in an effective and timely manner.</span></li></ul>", "postedDate": "23 hours ago", "salary": {"amount": "30.61/hr - 34.61/hr", "currency": "USD"}, "skills": ["HRIS", "Leave of Absence", "Disability Management", "FMLA", "ADA", "Worker's Compensation", "Microsoft Office", "SAP", "Communication", "Problem Solving"], "url": "https://www.linkedin.com/jobs/view/4005100044"}