{"jobTitle": "Government, Business Development Manager", "company": {"name": "PeakMetrics", "industry": "Software Development", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-Time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$180,000.00 - $230,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Software Development", "description": "At PeakMetrics, we stand at the forefront of narrative intelligence, harnessing the power of advanced machine learning to safeguard enterprises and government agencies from social media manipulation and narrative attacks. Our platform rapidly sifts through millions of unstructured, cross-channel media datasets, transforming them into actionable insights. By identifying adversarial online messaging, understanding its audience, and providing crucial context such as source credibility, we empower our customers to effectively respond to digital threats. Our team tackled some of today's most intricate media challenges, from crisis management to thwarting state-sponsored disinformation campaigns. Our goal is unwavering: to shield our clients from the risks of social media manipulation and emerging narrative threats by detecting and remediating from harmful online trends.", "responsibilities": "Develop a DoD / Government customer pipeline, Drive business development efforts to engage with potential customers and close federal contract opportunities, Maintain a CRM to keep track of ongoing conversations and relationships, Develop a strong understanding of PeakMetrics’ capabilities and how they can provide value to customers, Identify and monitor relevant opportunities through channels such as Sam.gov and Govtribe, Develop proposals for relevant solicitations, RFP's, and other contract opportunities, Travel to support on-site customer meetings and conferences.", "qualifications": {"required": "4+ years working in the DoD, 4+ years working in a BD role with a commercial technology company selling to DoD/USG, Proven track record of winning and maintaining six and seven-figure deals with Defense and Government agencies, Familiarity with DoD and USG procurement processes, Experience engaging with and briefing senior leadership, Excellent written and verbal communication skills, US Citizenship", "preferred": "2+ years working at a PAI/OSINT technology company selling software to DoD/USG, Experience working with OIE teams, Experience working in or selling to Combatant Commands, Experience working with a startup or small business"}, "skills": [], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "Remote-first culture, Compensation: Base + Variable = OTE, Health insurance, 401(k) and other benefits, Flexible work schedule and unlimited time off, Opportunities for professional growth and development, A vibrant and inclusive company culture", "remoteWork": "Remote, Washington DC preferred.", "url": "https://www.linkedin.com/jobs/view/4005286419"}