{"jobTitle": "Merchandiser Retail Sales", "company": {"name": "Acosta Group", "location": "Simi Valley, CA"}, "location": "Simi Valley, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "17.50/hr - 17.50/hr", "currency": "USD"}, "jobFunction": "Purchasing", "industry": "Retail", "description": "General Information<br/><br/>Company: ACO-US<br/><br/>Location: SIMI VALLEY, California, 93065<br/><br/>Ref #: 67584<br/><br/>Pay Rate: $ 17.50<br/><br/>Experience/skills and/or location may influence position wage rate<br/><br/>Range Minimum: $ 17.50<br/><br/>Range Maximum: $ 17.50<br/><br/>Function: Merchandising<br/><br/>Employment Duration: Full-time<br/><br/><strong>Benefits<br/><br/></strong><ul><li>Medical, dental and vision insurance </li><li>Company-paid life insurance, short-term and long-term disability </li><li>401k program </li><li>Generous Paid Time Off (PTO) program <br/><br/></li></ul><strong>Description And Requirements<br/><br/></strong>As the Retail Sales Merchandiser, you'll be responsible for optimizing product visibility and driving sales in retail stores. Your duties include conducting store visits, collaborating with store managers, utilizing technology for data collection and maintaining product display standards. You'll provide retail sales merchandising, complete special projects, and build strong relationships with store managers to help increase sales for our clients.<br/><br/>What's in it for you?<br/><br/><ul><li>Be a part of a collaborative and culture-oriented team. </li><li>Enjoy flexible schedules with no weekend work. </li><li>Full benefits package for Full-Time associates. <br/><br/></li></ul>What will you do?<br/><br/><ul><li>Cover a set territory of retailers, ensuring merchandising coverage goals are met through regular store visits. </li><li>Support store managers on retail initiatives such as new product introductions and contests. </li><li>Work with technology, including a company-furnished tablet, to collect and report data from store visits. </li><li>Ensure full distribution and display of products in assigned accounts, including cleaning, stocking, rotating, and pricing merchandise. </li><li>Conduct audits to check data codes ensure adherence to approved plan-o-grams, and report observations to the Unit Manager. </li><li>Consult with management, meet objectives and goals, and report store-level observations related to client product and customer needs. </li><li>Advocate for clients through identifying sales opportunities, shelf work and building relationships with store mangers. </li><li>Ensure merchandising coverage goals are met by executing the retail territory coverage plan. <br/><br/></li></ul>How will you succeed?<br/><br/><ul><li>Adhere to store policies and procedures while representing the clients you serve as an expert. </li><li>Be detail-oriented, ensuring accuracy and precision in tasks such as product display and audits. </li><li>Prioritize customer service, building positive relationships with store managers, and customers. </li><li>Communicate effectively with team members, management, and clients, ensuring clear and concise communication. </li><li>Be comfortable using technology, such as a tablet, for data collection and reporting. </li><li>Be able to work without a supervisor, have strong communication skills and manage time effectively. <br/><br/></li></ul><strong>Experience And Qualifications<br/><br/></strong><ul><li>High School Diploma/GED required. </li><li>Prior retail experience preferred, but not required. </li><li>Strong demonstration of core competency including quality commitment, attention to detail, customer service, and communication skills. </li><li>Ability to lift up to 30 pounds and stand and/or walk for long periods. </li><li>Must have reliable transportation and be able to drive a car for extended periods. </li><li>Must be at least 18 years of age. <br/><br/></li></ul>So, are you the next Retail Sales Merchandiser?<br/><br/><em>By submitting your application you agree with and accept the Acosta Group Privacy Statement and Terms of Conditions.<br/><br/></em>US: http://acosta.jobs/privacy-policy-us/<br/><br/>Canada: http://acosta.jobs/privacy-policy-ca/<br/><br/>The Acosta Group utilizes E-Verify for validating the ability to work in the United States for all job candidates. If you want more information on what this entails and your rights as a job applicant, please use the link provided to access information on our use of E-Verify and your right to work. Employer Resources (e-verify.gov)<br/><br/>Equal Opportunity Employer (Disabled, Veteran) | Under applicable requirements, such as the San Francisco FCO and the Los Angeles FCHIO, we consider for employment qualified applicants with arrest and conviction records or criminal histories | E-Verify Employer<br/><br/><ul><li>Premium, in good faith, believes that any posted range of compensation is the accurate range for this role at the time of this posting. Premium may ultimately pay more or less than the posted range depending on candidate qualifications and locations. This range may be modified in the future.<br/><br/></li></ul>PipelineDetail: 53957", "responsibilities": "As the Retail Sales Merchandiser, you'll be responsible for optimizing product visibility and driving sales in retail stores. Your duties include conducting store visits, collaborating with store managers, utilizing technology for data collection and maintaining product display standards. You'll provide retail sales merchandising, complete special projects, and build strong relationships with store managers to help increase sales for our clients.", "qualifications": {"required": "High School Diploma/GED required. ", "preferred": "Prior retail experience preferred, but not required."}, "skills": ["Customer Service", "Communication", "Technology", "Data Collection", "Retail Merchandising"], "postedDate": "3 days ago", "benefits": "Medical, dental and vision insurance, Company-paid life insurance, short-term and long-term disability, 401k program, Generous Paid Time Off (PTO) program", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005988656"}