{"jobTitle": "Senior Analyst, Sales Pipeline Operations", "company": {"name": "ServiceTitan", "location": "Glendale, CA", "industry": "Software Development"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Software Development", "description": "<strong>Ready to be a Titan?<br/><br/></strong>The Senior Analyst- Sales Pipeline Operations is an integral role on the Revenue Strategy &amp; Operations team contributing to ServiceTitan’s expansion. They will drive highly visible and critical strategic initiatives for the revenue organization.<br/><br/>The primary focus of the role will be on market expansion programs with a secondary focus on transformative “special projects.” The individual has a well-rounded background - including analytic rigor, ability to handle multiple projects at once, and a mix of strategic and operational work.<br/><br/><strong><strong>What you'll do:<br/><br/><br/></strong></strong><ul><li>Execute, and effectively communicate analysis (in collaboration with cross functional partners) into highest priority strategic topics (e.g., Inter-Sales teams operations, sales workflow and execution, and leadership strategy)</li><li>Conduct full lifecycle of analytics projects, including pulling, manipulating, analyzing and reporting findings and key performance indicators, provide ongoing reports, and recommend business plan updates</li><li>Partner cross-functionally with different teams as a steward of the programs you support and their full-lifecycle outcomes</li><li>Present to cross-functional stakeholders and effectively communicate findings, insights, status updates, and recommendations to bring data to action</li><li>Interpret data and analyze results using analytics, research methodologies, and statistical techniques with both quantitative and qualitative data</li><li>Support development of priorities, resource planning, goal setting for the broader Revenue teams<br/><br/></li></ul><strong><strong>What you'll bring:<br/><br/><br/></strong></strong><ul><li>3-5 years of work experience in a combination of high growth tech companies and/or management consulting</li><li>Functional experience in operations/business operations, strategy and/or growth within the SaaS space is preferred</li><li>Experience conducting quantitative and qualitative analyses (e.g., customer research, data analysis, customer segmentation strategies, competitive assessments, etc.) </li><li>Experience in Excel / Google Sheets; Salesforce, Tableau, and other advanced analytics experience are nice-to-have</li><li>Ability to distill complex issues into concrete action plans, manage execution, and drive results</li><li>Energized by ambiguity and dynamic working environments that provide a diverse experience and opportunity to tackle different problems</li><li>Knows how to balance getting the details right while still moving fast</li><li>Demonstrated excellence in cross-functional communication, with the ability to simplify and explain complex problems to stakeholders of all levels<br/><br/></li></ul><strong><strong>Be Human With Us:<br/><br/></strong></strong>Being human isn’t about checking every box on a list. It’s about the experiences we have, people we meet, and the perspectives we share. So, if you have the skills but are hesitant to apply because of your background, apply anyway. We need amazing people like you to help us challenge the conventional and think differently about the problems that we’re solving. We’re in this together. Come be human, with us.<br/><br/><strong><strong>What We Offer:<br/><br/></strong></strong>When you join our team, you’re not just accepting a job. You’re making a career move. Here’s how we’ll support you in doing some of the most impactful work of your career:<br/><br/><br/><ul><li>Flextime, recognition, and support for autonomous work: Flexible time off with ample learning and development opportunities to continue growing your career. We offer a comprehensive onboarding program, leadership training for Titans at all levels, and other programs and events. Great work is rewarded through Bonusly, peer-nominated awards, and more. </li><li>Holistic health and wellness benefits: Company-paid medical, dental, and vision (with 100% employer paid options and 90% coverage for dependents), FSA and HSA, 401k match, and telehealth options including memberships to Headspace, Galileo, One Medical, Ginger and more. </li><li>Support for Titans at all stages of life: Parental leave and support, up to $20k in adoption reimbursement, on demand maternity support through Maven Maternity, free breast milk shipping through Maven Milk, pet insurance, legal advisory services, financial planning tools, and more.<br/><br/></li></ul>At ServiceTitan, we celebrate individuality and uniqueness. We believe that the convergence of fresh perspectives and experiences from all walks of life is what makes our product and culture so great. We strongly encourage people from underrepresented groups to apply. We do not discriminate against employees based on race, color, religion, sex, national origin, gender identity or expression, age, disability, pregnancy (including childbirth, breastfeeding, or related medical condition), genetic information, protected military or veteran status, sexual orientation, or any other characteristic protected by applicable federal, state or local laws.<br/><br/>ServiceTitan is committed to fair and equitable compensation for all of our employees. We thoughtfully consider a wide range of factors when determining individual compensation. The expected salary range for this role for candidates residing in the United States is between $95,000 USD - $137,000 USD. Compensation for candidates residing outside the United States will vary by location and the specific salary range will be discussed during the hiring process. Actual compensation for an individual may vary depending on skills, performance over time, qualifications, experience, and location. In addition to the base salary, the total compensation package also includes an annual bonus, equity and a holistic suite of benefits.", "responsibilities": "The Senior Analyst- Sales Pipeline Operations is an integral role on the Revenue Strategy &amp; Operations team contributing to ServiceTitan’s expansion. They will drive highly visible and critical strategic initiatives for the revenue organization.<br/><br/>The primary focus of the role will be on market expansion programs with a secondary focus on transformative “special projects.” The individual has a well-rounded background - including analytic rigor, ability to handle multiple projects at once, and a mix of strategic and operational work.", "qualifications": {"required": "3-5 years of work experience in a combination of high growth tech companies and/or management consulting, Functional experience in operations/business operations, strategy and/or growth within the SaaS space is preferred, Experience conducting quantitative and qualitative analyses (e.g., customer research, data analysis, customer segmentation strategies, competitive assessments, etc.), Experience in Excel / Google Sheets; Salesforce, Tableau, and other advanced analytics experience are nice-to-have, Ability to distill complex issues into concrete action plans, manage execution, and drive results, Energized by ambiguity and dynamic working environments that provide a diverse experience and opportunity to tackle different problems, Knows how to balance getting the details right while still moving fast, Demonstrated excellence in cross-functional communication, with the ability to simplify and explain complex problems to stakeholders of all levels"}, "skills": ["SaaS", "Sales Operations", "Analytics", "Business Development", "Strategy", "Market Research", "Data Analysis", "Customer Segmentation", "Competitive Analysis", "Excel", "Google Sheets", "Salesforce", "Tableau"], "postedDate": "3 days ago", "benefits": "Flextime, recognition, and support for autonomous work: Flexible time off with ample learning and development opportunities to continue growing your career. We offer a comprehensive onboarding program, leadership training for Titans at all levels, and other programs and events. Great work is rewarded through Bonusly, peer-nominated awards, and more. \nHolistic health and wellness benefits: Company-paid medical, dental, and vision (with 100% employer paid options and 90% coverage for dependents), FSA and HSA, 401k match, and telehealth options including memberships to Headspace, Galileo, One Medical, Ginger and more. \nSupport for Titans at all stages of life: Parental leave and support, up to $20k in adoption reimbursement, on demand maternity support through Maven Maternity, free breast milk shipping through Maven Milk, pet insurance, legal advisory services, financial planning tools, and more.", "remoteWork": "No", "salary": {"amount": "$95,000 USD - $137,000 USD", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4005283801"}