{"jobTitle": "Travel Experience Consultant", "company": {"name": "Get.It Recruit - Administrative", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-Time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Human Resources Services", "description": "**Role Overview**<br/><br/>We are seeking a talented individual passionate about creating exceptional travel experiences for clients worldwide. This position involves personalized travel planning and crafting memorable journeys that cater to each client's unique preferences.<br/><br/>**Customer Engagement**<br/><br/><ul><li> Interact with clients via phone, email, and chat to understand their travel needs and preferences.</li><li> Provide customized recommendations for destinations, accommodations, transportation, and activities.</li><li> Address inquiries, concerns, and complaints with a focus on professionalism and efficiency.<br/><br/></li></ul>**Booking and Itinerary Management**<br/><br/><ul><li> Arrange reservations for flights, hotels, rental cars, tours, and various travel services aligned with client preferences.</li><li> Coordinate itineraries to align with schedules and budgets, ensuring a seamless travel experience.</li><li> Confirm bookings and deliver detailed itineraries to clients.<br/><br/></li></ul>**Destination Expertise**<br/><br/><ul><li> Stay updated on travel trends, visa requirements, and safety information for diverse destinations.</li><li> Offer insights and suggestions that enhance the travel experience based on client interests.<br/><br/></li></ul>**Administrative Responsibilities**<br/><br/><ul><li> Maintain accurate records of bookings, payments, and client interactions using a CRM system.</li><li> Process payments and manage invoicing as necessary.<br/><br/></li></ul>**What We Offer**<br/><br/><ul><li> Competitive salary with performance-based bonuses.</li><li> Remote work opportunities with flexible hours to support work-life balance.</li><li> Professional development and training within the travel industry.</li><li> Exclusive discounts and perks for travel.</li><li> A collaborative and supportive team environment.<br/><br/></li></ul>**Basic Qualifications**<br/><br/><ul><li> Previous experience in customer service or the travel industry.</li><li> Strong communication skills in written and spoken English; additional languages are a plus.</li><li> Proficient in booking platforms and CRM systems.</li><li> Excellent problem-solving skills and attention to detail.</li><li> Ability to work independently or as part of a team while prioritizing customer satisfaction.<br/><br/></li></ul>**Join us!**<br/><br/>Be part of a team that transforms travel dreams into reality while providing outstanding service to clients globally!<br/><br/>Employment Type: Full-Time", "postedDate": "2 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4005135953"}