{"jobTitle": "Litigation Calendaring Clerk", "company": {"name": "LHH", "location": "Cerritos, CA"}, "location": "Cerritos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "60,000.00 to 75,000.00", "currency": "USD"}, "jobFunction": "Legal", "industry": "Human Resources Services", "description": "A regional law firm of 150+ attorneys is seeking an experienced Calendaring/Docketing Clerk for their Cerritos office. This position will be working with a team of clerks to manage all firm litigation deadlines in CompuLaw, the firm's calendar/docketing system.<br/><br/>Duties:<br/><br/><ul><li>Calculate and track all state, federal, appellate and OAH deadlines. </li><li>Review all incoming and outgoing mail, emails and e-filings to ensure deadlines are entered into the system. </li><li>Create regular reports to ensure accurate data and distribute as needed. <br/><br/></li></ul>Qualifications:<br/><br/><ul><li>Over 2 years of experience of litigation calendaring experience. </li><li>Proficiency in a docketing software, preferably CompuLaw. </li><li>Ability to work onsite daily in Cerritos. </li><li>Ability to work overtime when needed to meet the department's needs. <br/><br/></li></ul>The compensation range for this position is $60,000-$75,000. Additional benefits include health benefits (medical, dental, and vision), Health Savings Account, Flexible Spending Account, Dependent Care, 401(k) match, profit sharing plan, and 16 vacation/sick days to start.<br/><br/>If you are a qualified calendaring clerk interested in hearing more about this opportunity, please apply today!<br/><br/><em>Equal opportunity employer. Minorities / Women / Veterans / Disabled are strongly encouraged to apply!<br/><br/></em><strong>Pay Details:</strong> $60,000.00 to $75,000.00 per year<br/><br/><strong>Search managed by:</strong> Christina Lee<br/><br/>Equal Opportunity Employer/Veterans/Disabled<br/><br/>To read our Candidate Privacy Information Statement, which explains how we will use your information, please navigate to https://www.lhh.com/us/en/candidate-privacy<br/><br/>The Company will consider qualified applicants with arrest and conviction records subject to federal contractor requirements and/or security clearance requirements.", "responsibilities": "Calculate and track all state, federal, appellate and OAH deadlines. Review all incoming and outgoing mail, emails and e-filings to ensure deadlines are entered into the system. Create regular reports to ensure accurate data and distribute as needed.", "qualifications": {"required": "Over 2 years of experience of litigation calendaring experience. Proficiency in a docketing software, preferably CompuLaw. Ability to work onsite daily in Cerritos. Ability to work overtime when needed to meet the department's needs."}, "skills": ["CompuLaw", "Litigation Calendaring"], "postedDate": "2 days ago", "benefits": "health benefits (medical, dental, and vision), Health Savings Account, Flexible Spending Account, Dependent Care, 401(k) match, profit sharing plan, and 16 vacation/sick days to start.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005187663"}