{"jobTitle": "Senior Manager - Communications", "company": {"name": "Squeeze Massage", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Consumer Services", "description": "We’re Squeeze, a feel-good company, from the Founders of Drybar.<br/><br/>Considering making an application for this job Check all the details in this job description, and then click on Apply.<br/><br/>A bit about us: Squeeze was designed to revolutionize the massage experience, from our forward-thinking technology to our dedication to team member experience. We are focused on the human side of business, and we work to foster an inclusive environment, where everyone can shine bright. It's so important that we've made it our company mission to be the best part of our guests’ and team members’ day.<br/><br/>Our revolutionary app-based booking and payment platform makes scheduling, paying, tipping, and rating easy, breezy, Squeezy. Similar to Postmates and Uber, after a Squeeze massage, instead of dealing with a clunky, stressful checkout process, our guests simply float out with the ability to tip and rate their therapist at their leisure post-massage. Personalized services allow guests to select massage preferences as well as control in-room settings from lighting to sound, all in a beautifully designed space. It’s a completely fresh approach to a way better massage experience.<br/><br/>We are seeking an experienced Communications Manager to lead our overarching communication strategy for Squeeze Massage. The ideal candidate will have exceptional written and verbal skills with extensive experience in copywriting, corporate communications management, people management, and call center management. This role demands excellent organization, responsiveness, and collaboration across the organization. This role will report to the Senior Vice President of Operations.<br/><br/>What You'll Do<br/><br/>Manage Incoming and Outgoing Communication<br/><br/>Gatekeeper for all incoming questions from Operating Partners across the U.S. with the ability to problem solve and route to the applicable internal departmentMaintain the voice of the brand, using on-brand language and style in all communicationsDevelop templates for outbound communication to Operating Partners and external vendorsDevelop bi-weekly Support Updates to be sent system-wide<br/><br/>Oversee Call Center<br/><br/>Oversee the Guest Experience team, who fields all calls, texts, and emails from guests of Squeeze across the U.S.Experience with Zenoti and Zendesk and/or Kustomer preferredExceptional customer service and experience with guest escalations<br/><br/>Maintain Virtual Brand Identity<br/><br/>Manage the organization's presence on sites such as LinkedIn, Glassdoor, and Indeed by posting regularly and refining the content on each pageManage responses to both positive and negative reviews that are posted and escalate to the operations team as necessaryDevelop and distribute system-wide monthly surveys, and compile feedback, performance analytics, and action items by shop<br/><br/>Internal Programs<br/><br/>Manage all internal recognition programsCommunicate internally about updates, celebrations, trainings, and enrichment programs<br/><br/>What You Have<br/><br/>Bachelor's degree in Communications, or a related fieldMinimum of 8 years of experience in communications management, with experience in service, retail and franchising projects preferredCopywriting experience, with attention to detail in written communication and flawless, error-proof grammar and spellingDemonstrated ability to multi-task, manage a large mailbox, and get responses out in a timely mannerAbility to learn and retain an extensive handbook of standard operating procedures and recall and search for information efficientlyAbility to collaborate with executive roles, including the CEO and COO, to strategically package information and updatesStrong public speaking skills to present to large audiences, key leaders, and vendorsStrong team management experience with a proven ability to care personally and challenge directlyExceptional customer service skills and experience managing a call center, preferably for a franchised systemExcellent technology skills with advanced experience in Google Suite, LMS platforms (e.g. Lessonly), customer service/CRM software (e.g. Zendesk, Kustomer), and medspa software (e.g. Zenoti)Exceptional organizational and project management skillsWillingness to travel for company meetings, off-sites, and other business needs (~10%)Benefits &amp; Perks<br/><br/>100% work from homeCompetitive salaryUnlimited paid time offHealth, dental, &amp; vision benefitsA revolutionary, feel-good cultureFeel-good partnership with Canine Companions (for every membership sold, we donate a day of canine support to a person with a disability)<br/><br/>#J-18808-Ljbffr", "responsibilities": "Manage Incoming and Outgoing Communication\n\nGatekeeper for all incoming questions from Operating Partners across the U.S. with the ability to problem solve and route to the applicable internal departmentMaintain the voice of the brand, using on-brand language and style in all communicationsDevelop templates for outbound communication to Operating Partners and external vendorsDevelop bi-weekly Support Updates to be sent system-wide\n\nOversee Call Center\n\nOversee the Guest Experience team, who fields all calls, texts, and emails from guests of Squeeze across the U.S.Experience with Zenoti and Zendesk and/or Kustomer preferredExceptional customer service and experience with guest escalations\n\nMaintain Virtual Brand Identity\n\nManage the organization's presence on sites such as LinkedIn, Glassdoor, and Indeed by posting regularly and refining the content on each pageManage responses to both positive and negative reviews that are posted and escalate to the operations team as necessaryDevelop and distribute system-wide monthly surveys, and compile feedback, performance analytics, and action items by shop\n\nInternal Programs\n\nManage all internal recognition programsCommunicate internally about updates, celebrations, trainings, and enrichment programs", "qualifications": {"required": "Bachelor's degree in Communications, or a related fieldMinimum of 8 years of experience in communications management, with experience in service, retail and franchising projects preferredCopywriting experience, with attention to detail in written communication and flawless, error-proof grammar and spellingDemonstrated ability to multi-task, manage a large mailbox, and get responses out in a timely mannerAbility to learn and retain an extensive handbook of standard operating procedures and recall and search for information efficientlyAbility to collaborate with executive roles, including the CEO and COO, to strategically package information and updatesStrong public speaking skills to present to large audiences, key leaders, and vendorsStrong team management experience with a proven ability to care personally and challenge directlyExceptional customer service skills and experience managing a call center, preferably for a franchised systemExcellent technology skills with advanced experience in Google Suite, LMS platforms (e.g. Lessonly), customer service/CRM software (e.g. Zendesk, Kustomer), and medspa software (e.g. Zenoti)Exceptional organizational and project management skillsWillingness to travel for company meetings, off-sites, and other business needs (~10%)", "preferred": ""}, "skills": ["Communication", "Copywriting", "Corporate Communications", "Call Center Management", "Customer Service", "Public Speaking", "Team Management", "Google Suite", "LMS", "CRM", "Zendesk", "Kustomer", "Zenoti", "Project Management"], "postedDate": "2 days ago", "benefits": "100% work from homeCompetitive salaryUnlimited paid time offHealth, dental, &amp; vision benefitsA revolutionary, feel-good cultureFeel-good partnership with Canine Companions (for every membership sold, we donate a day of canine support to a person with a disability)", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005167488"}