{"jobTitle": "Property Manager, High Rise Office", "company": {"name": "Douglas Emmett", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Management", "industry": "Real Estate", "description": "<strong>Job Description<br/><br/></strong>We are seeking a high-energy, customer service-oriented Property Manager to join our commercial property management team.<br/><br/><strong><em>General Job Responsibilities:<br/><br/></em></strong>Under the supervision of the Regional Manager, a Property Manager is responsible for all phases of the operation of a property. This includes, but is not limited to, the general administration and maintenance of the property, direction and control of all personnel and resources while maintaining a stabilized fiscal operation.<br/><br/><strong><em>Operational Duties:<br/><br/></em></strong><ul><li> Review and understand all vendor contracts and enforce all requirements of the contract</li><li> Ensure maintenance requests are completed in a timely manner</li><li> Quick response to emergency situations at designated property</li><li> Compile weekly/monthly reports/inspections advising on the status of the property, including but not limited to:</li><li>Physical condition of the property</li><li>Liability concerns</li><li>Leased occupancies (weekly)</li><li>Staffing</li><li>Advertising – current and suggested</li><li>Incident reports</li><li>Leasing</li><li>Tenant improvement projects<br/><br/></li></ul><strong><em>Financial Duties:<br/><br/></em></strong><ul><li> Generate monthly Variance Reports</li><li> Collection of rents, notices to pay or quit and unlawful detainer actions</li><li> Maintain necessary records of all financial transactions of the property</li><li> Be responsible for and maintain all petty cash funds and records</li><li> Adhere to all appropriate company accounting directives, including budgeting<br/><br/></li></ul><strong><em>Supervisory Duties:<br/><br/></em></strong><ul><li> Train and be responsible for work performed by all staff members under their direction, including administrative and maintenance staff</li><li> Hire, counsel and terminate employees in accordance with the company’s policy and under the direction of the Portfolio Manager</li><li> Perform written evaluations of employees and make recommendations for advancement</li><li> Establish schedules and assign personnel for routine maintenance and emergency coverage. </li><li> Conduct weekly staff meetings<br/><br/></li></ul><strong><em>Requirements:<br/><br/></em></strong><ul><li> Real Estate License</li><li> Broad knowledge of California Tenant/Landlord law</li><li> Class A property management experience strongly preferred</li><li> Excellent customer service skills</li><li> Exceptional supervisory skills and leadership ability</li><li> Ability to exercise independent judgment and to define problems, formulate and implement solutions</li><li> Strong computer skills, including Microsoft Word and Excel, with prior experience with MRI is a plus</li><li> Demonstrates initiative, professionalism, integrity, and exercises confidentiality of all areas of performance</li><li> College degree preferred but not required<br/><br/></li></ul><strong>Company Description<br/><br/></strong>Douglas Emmett operates approximately 18 million square feet of Class A office space and over 5,000 luxury apartment units in nine highly desirable submarkets in Los Angeles County, six of which are located in Los Angeles' Westside - Brentwood, Century City, Santa Monica, Beverly Hills, the Olympic Corridor, and Westwood - and three submarkets in the San Fernando Valley - Sherman Oaks/Encino, Warner Center/Woodland Hills, and Burbank. The Company's Honolulu office portfolio is located in the downtown central business district with multifamily properties in nearby suburban communities.<br/><br/>The Company utilizes the same focused business strategy that was implemented by its founding principals - managing, developing, redeveloping, and acquiring multifamily and commercial real estate in high barrier-to-entry submarkets that exhibit strong economic characteristics such as population and job growth, as well as inherent supply constraints, such as limited developable land due to natural and political barriers. The Company strives to capitalize on the experience of its seasoned management team to create continued value.<br/><br/>Douglas Emmett operates approximately 18 million square feet of Class A office space and over 5,000 luxury apartment units in nine highly desirable submarkets in Los Angeles County, six of which are located in Los Angeles' Westside - Brentwood, Century City, Santa Monica, Beverly Hills, the Olympic Corridor, and Westwood - and three submarkets in the San Fernando Valley - Sherman Oaks/Encino, Warner Center/Woodland Hills, and Burbank. The Company's Honolulu office portfolio is located in the downtown central business district with multifamily properties in nearby suburban communities. The Company utilizes the same focused business strategy that was implemented by its founding principals - managing, developing, redeveloping, and acquiring multifamily and commercial real estate in high barrier-to-entry submarkets that exhibit strong economic characteristics such as population and job growth, as well as inherent supply constraints, such as limited developable land due to natural and political barriers. The Company strives to capitalize on the experience of its seasoned management team to create continued value.", "postedDate": "1 day ago", "skills": ["Real Estate", "California Tenant/Landlord law", "Customer Service", "Supervisory Skills", "Leadership", "Microsoft Word", "Microsoft Excel", "MRI"], "url": "https://www.linkedin.com/jobs/view/4005384986"}