{"jobTitle": "Executive Assistant, Casting", "company": {"name": "Warner Bros. Discovery", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Entertainment Providers", "description": "<strong><em>Welcome to Warner Bros. Discovery… the stuff dreams are made of.<br/><br/></em></strong><strong>Who We Are…<br/><br/></strong>When we say, “the stuff dreams are made of,” we’re not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD’s vast portfolio of iconic content and beloved brands, are the <em>storytellers</em> bringing our characters to life, the<em> creators</em> bringing them to your living rooms and the <em>dreamers</em> creating what’s next…<br/><br/>From brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.<br/><br/><strong>Your New Role...<br/><br/></strong>Provides administrative support to the Senior Vice President, Head of Casting.<br/><br/><strong>Your Role Accountabilities...<br/><br/></strong><ul><li>Schedules appointments, meetings, etc. with clear sense of calendar priorities. </li><li>Answers telephones, screens, logs and places calls.</li><li>Acts as point on many projects to streamline and create efficiencies. Creates systems for internal department and division-wide information sharing. Helps to identify areas for corporate synergy as it relates to equity and inclusion strategies.</li><li>Occasionally assists in facilitating approvals of role breakdowns and audition materials. </li><li>Maintains and organizes a filing system for dept. head. Occasionally works within the main casting database on WBTV and DC projects both current and future.</li><li>Drafts emails, agendas, notes and prepares expense reports.</li><li>Coordinates the communication between various independent casting directors and production teams for series and pilots.</li><li>If needed, assist the Casting Liaison by coordinating the test deal paperwork, travel or start paperwork for Casting Directors.</li><li>Performs additional related duties as required<br/><br/></li></ul><strong>Qualifications &amp; Experience...<br/><br/></strong><ul><li>Previous Executive Admin experience required.</li><li>Previous Casting experience preferred.</li><li>Previous entertainment industry experience required. </li><li>College degree preferred. </li><li>Must be able to prioritize multiple meeting requests and escalate concerns when needed.</li><li>Must have strong communication and organization skills.</li><li>Knowledge of PC’s, Macs, MS Office, video editing (iMovie and other platforms).</li><li>Knowledge of casting software (Castit, Breakdown Services, etc) preferred.</li><li>Knowledge of TV/Film, actors, agents and managers helpful.<br/><br/></li></ul><strong>Other Requirements<br/><br/></strong>Position supports a busy Head of Casting who oversees nearly 70 projects. The ideal candidates must be motivated self-starters, able to multitask with a positive attitude and genuine interest in casting who wants to grow in the role. Main duties would include, but are not limited to, coordinating a demanding calendar, answering busy phones, and overall department management that necessitates stellar communication. Applicants with experience in casting offices and/or agency, management offices will be prioritized.<br/><br/><strong>How We Get Things Done…<br/><br/></strong>This last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview.<br/><br/><strong>Championing Inclusion at WBD<br/><br/></strong>Warner Bros. Discovery embraces the opportunity to build a workforce that reflects the diversity of our society and the world around us. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.<br/><br/>If you’re a qualified candidate and you require adjustments or accommodations to search for a job opening or apply for a position, please contact us at recruitadmin@wbd.com.<br/><br/>In compliance with local law, we are disclosing the compensation, or a range thereof, for roles in locations where legally required. Actual salaries will vary based on several factors, including but not limited to external market data, internal equity, location, skill set, experience, and/or performance. Base pay is just one component of Warner Bros. Discovery’s total compensation package for employees. Pay Range: $42,224.00 - $78,416.00 salary per year. Other rewards may include annual bonuses, short- and long-term incentives, and program-specific awards. In addition, Warner Bros. Discovery provides a variety of benefits to employees, including health insurance coverage, an employee wellness program, life and disability insurance, a retirement savings plan, paid holidays and sick time and vacation.", "responsibilities": "Provides administrative support to the Senior Vice President, Head of Casting.<br/><br/><strong>Your Role Accountabilities...<br/><br/></strong><ul><li>Schedules appointments, meetings, etc. with clear sense of calendar priorities. </li><li>Answers telephones, screens, logs and places calls.</li><li>Acts as point on many projects to streamline and create efficiencies. Creates systems for internal department and division-wide information sharing. Helps to identify areas for corporate synergy as it relates to equity and inclusion strategies.</li><li>Occasionally assists in facilitating approvals of role breakdowns and audition materials. </li><li>Maintains and organizes a filing system for dept. head. Occasionally works within the main casting database on WBTV and DC projects both current and future.</li><li>Drafts emails, agendas, notes and prepares expense reports.</li><li>Coordinates the communication between various independent casting directors and production teams for series and pilots.</li><li>If needed, assist the Casting Liaison by coordinating the test deal paperwork, travel or start paperwork for Casting Directors.</li><li>Performs additional related duties as required<br/><br/></li></ul>", "qualifications": {"required": "Previous Executive Admin experience required.\nPrevious entertainment industry experience required. \nMust be able to prioritize multiple meeting requests and escalate concerns when needed.\nMust have strong communication and organization skills.\nKnowledge of PC’s, Macs, MS Office, video editing (iMovie and other platforms).", "preferred": "Previous Casting experience preferred.\nCollege degree preferred. \nKnowledge of casting software (Castit, Breakdown Services, etc) preferred.\nKnowledge of TV/Film, actors, agents and managers helpful."}, "skills": ["Executive Assistant", "Casting", "Entertainment", "MS Office", "Video Editing", "iMovie", "Casting Software", "Castit", "Breakdown Services", "TV/Film", "Actors", "Agents", "Managers"], "postedDate": "2 days ago", "benefits": "WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.", "salary": {"amount": "42,224.00 - 78,416.00", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005952956"}