{"jobTitle": "Shipping & Receiving Clerk", "company": {"name": "FactoryFix", "location": "La Mirada, CA"}, "location": "La Mirada, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "17.45/hr - 17.45/hr", "currency": "USD"}, "jobFunction": "Manufacturing", "industry": "Automation Machinery Manufacturing", "description": "**Shipping and Receiving Clerk**<br/><br/>Here at Siemens, we take pride in enabling sustainable progress through technology. We do this through empowering customers by combining the real and digital worlds. Improving how we live, work, and move today and for the next generation! We know that the only way a business thrive is if our people are thriving. That’s why we always put our people first. Our global, diverse team would be happy to support you and challenge you to grow in new ways. Who knows where our shared journey will take you?<br/><br/>We are looking for a Shipping and Receiving Clerk to join our production team at our La Mirada, CA facility. This position will work our \"Alternate\" Shift: Monday-Friday 10am - 6:30pm.<br/><br/><strong>Role Responsibilities<br/><br/></strong><ul><li>Picks/Packs materials to prepare for assembly or shipment, breaks down pallets, sorts material and separates, unloads material from incoming trailers and places in staging areas.</li><li>Stocks and maintains accurate inventory levels.</li><li>Uses SAP to do receipts, transfers, and shipping transactions.</li><li>Initiates scrap tickets to generate part replacement orders, discards scrap and/or defected materials that are not serviceable.</li><li>Operates and maintains forklift and any other powered/manual material lifting/ handling equipment for loading material onto, or unloading from trailers.<br/><br/><br/></li></ul><strong>You’ll win us over by having the following qualifications:<br/><br/></strong><strong>Basic Qualifications<br/><br/></strong><ul><li>Minimum of 1 year of experience performing shipping and receiving</li><li>Willingness to learn all equipment operated in the facility, and follow established processes!</li><li>Ability to lift parts or sub-assemblies that weigh up to 50 lbs.</li><li>Completed High School Diploma or GED</li><li>Legally authorized to work in the United States on a continual and permanent basis without company sponsorship<br/><br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Previous Forklift driver experience<br/><br/><br/></li></ul><strong>You’ll benefit from:<br/><br/></strong><ul><li>Siemens offers a variety of health and wellness benefits to employees. Details regarding our benefits can be found here:https://www.benefitsquickstart.com/siemens/index.html.</li><li>The pay range for this position is $17.45. The actual wage offered may be lower or higher depending on budget and candidate experience, knowledge, skills, qualifications, and premium geographic location.<br/><br/><br/></li></ul><strong>Create a better #TomorrowWithUs<br/><br/></strong><strong>About Siemens:<br/><br/></strong>We are a global technology company focused on industry, infrastructure, transport, and healthcare. From more resource-efficient factories, resilient supply chains, and smarter buildings and grids, to sustainable transportation as well as advanced healthcare, we create technology with purpose adding real value for customers.<br/><br/><ul><li>Siemens Corporation</li><li> is a U.S. subsidiary of Siemens AG, a leading technology company focused on industry, infrastructure, transport, and healthcare. From more resource-efficient factories, resilient supply chains, and smarter buildings and grids, to cleaner and more comfortable transportation as well as advanced healthcare, the company creates technology with purpose adding real value for customers. By combining the real and the digital worlds, Siemens empowers its customers to transform their industries and markets, helping them to transform the everyday for billions of people. Siemens also owns a majority stake in the publicly listed company Siemens Healthineers, a globally leading medical technology provider shaping the future of healthcare. In fiscal 2023, which ended on September 30, 2023, the Siemens Group USA generated revenue of $19.9 billion and employs approximately 45,000 people serving customers in all 50 states and Puerto Rico.<br/><br/><br/></li></ul><strong>Our Commitment to Diversity, Equity, and Inclusion:<br/><br/></strong>We value your unique identity and perspective. We are fully committed to providing equitable opportunities and building a workplace that reflects the diversity of society. Come bring your authentic self and create a better tomorrow with us. Learn more about our commitment to DEIhere.<br/><br/>Protecting the environment, conserving our natural resources, fostering the health and performance of our people as well as safeguarding their working conditions are core to our social and business commitment at Siemens. They are an integral part of our Business Conduct Guidelines and our corporate strategy.<br/><br/><ul><li>Equal Employment Opportunity Statement<br/><br/><br/></li></ul>**<br/><br/>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br/><br/>**<br/><br/>EEO is the Law<br/><br/>**<br/><br/>Applicants and employees are protected under Federal law from discrimination. To learn more,<br/><br/>[Click here<br/><br/>](https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm).<br/><br/><ul><li>Pay Transparency Non-Discrimination Provision<br/><br/><br/></li></ul>**<br/><br/>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more,<br/><br/>[Click here<br/><br/>](https://www.dol.gov/sites/dolgov/files/OFCCP/pdf/pay-transp<em>%20English</em>formattedESQA508c.pdf).<br/><br/><ul><li>California Privacy Notice<br/><br/><br/></li></ul>**<br/><br/>California residents have the right to receive additional notices about their personal information. To learn more, click<br/><br/>[here.<br/><br/>](https://new.siemens.com/us/en/general/legal/us-internet-privacy-notice-state-rights.html)<br/><br/>You should be proficient in:<br/><br/><ul><li>Forklift Licensed</li><li>Packaging Experience</li><li>Experience in a Manufacturing Environment<br/><br/><br/></li></ul>ID:yUx7fb Ref #: 338683<br/><br/>", "responsibilities": "Picks/Packs materials to prepare for assembly or shipment, breaks down pallets, sorts material and separates, unloads material from incoming trailers and places in staging areas. Stocks and maintains accurate inventory levels. Uses SAP to do receipts, transfers, and shipping transactions. Initiates scrap tickets to generate part replacement orders, discards scrap and/or defected materials that are not serviceable. Operates and maintains forklift and any other powered/manual material lifting/ handling equipment for loading material onto, or unloading from trailers.", "qualifications": {"required": "Minimum of 1 year of experience performing shipping and receiving Willingness to learn all equipment operated in the facility, and follow established processes! Ability to lift parts or sub-assemblies that weigh up to 50 lbs. Completed High School Diploma or GED Legally authorized to work in the United States on a continual and permanent basis without company sponsorship", "preferred": "Previous Forklift driver experience"}, "skills": ["Forklift Licensed", "Packaging Experience", "Experience in a Manufacturing Environment"], "postedDate": "2 days ago", "benefits": "Siemens offers a variety of health and wellness benefits to employees. Details regarding our benefits can be found here:https://www.benefitsquickstart.com/siemens/index.html.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005229112"}