{"jobTitle": "Executive Assistant, Ring", "company": {"name": "Ring", "location": "Hawthorne, CA"}, "location": "Hawthorne, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "50,000.00/year - 107,100.00/year", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Computers and Electronics Manufacturing", "description": "Ring is looking for a full-time Executive Assistant to support two executives on our leadership team. The ideal candidate must be organized, detail-oriented, have a knack for problem solving, and be a team player.<br/><br/>Key job responsibilities<br/><br/><ul><li> Ownership of calendar management for 2-3 leaders. Plan, negotiate, and schedule meetings to accommodate managers and others. Use discretion and judgment to determine priority of meetings.</li><li> Manage complex domestic and international travel arrangements.</li><li> Complete business expense claims promptly and follow up on reimbursements if necessary.</li><li> Communications (editing, writing, emailing, announcements, reviewing etc).</li><li> Utilize time management and organizational skills to juggle responsibilities and strategize efficiency and priority.</li><li> Organize and maintain information that may be sensitive, confidential or technical in nature.</li><li> Identify opportunities to improve work processes to leverage own and department's workload.</li><li> Collaborate with other Executive Assistants and business partners on key business events and meetings.<br/><br/></li></ul>A day in the life<br/><br/>Candidate must be able to understand business priorities, demonstrate ability to proactively anticipate needs, and drive improvements to build capacity for the leadership team. They will need to operate with a high-level of integrity and discretion as well as professionalism in dealing with senior executives inside and outside of the company. A successful candidate will be an expert in completing complex tasks quickly with limited guidance, reacting with appropriate urgency to situations that require a quick turnaround, and taking effective action with little to no guidance. This person must be able to work successfully in a team environment and build effective working relationships across the organization.<br/><br/><strong>About The Team<br/><br/></strong>This team supports Ring's Design team. Core EA responsibilities including calendar, travel, expenses, team development planning through off-sites, all-hands, and fun community-building activities. Special projects to support the team and develop project management skills.<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> 2+ years of senior level leadership support, or 1+ years of Amazon experience</li><li> High school or equivalent diploma</li><li> Experience with Microsoft Office products and applications</li><li> Experience with executive level calendar management<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Experience in a fast-paced, high-tech company</li><li> Experience managing multiple calendars<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $50,000/year in our lowest geographic market up to $107,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2737432", "responsibilities": "Ownership of calendar management for 2-3 leaders. Plan, negotiate, and schedule meetings to accommodate managers and others. Use discretion and judgment to determine priority of meetings.\nManage complex domestic and international travel arrangements.\nComplete business expense claims promptly and follow up on reimbursements if necessary.\nCommunications (editing, writing, emailing, announcements, reviewing etc).\nUtilize time management and organizational skills to juggle responsibilities and strategize efficiency and priority.\nOrganize and maintain information that may be sensitive, confidential or technical in nature.\nIdentify opportunities to improve work processes to leverage own and department's workload.\nCollaborate with other Executive Assistants and business partners on key business events and meetings.", "qualifications": {"required": "2+ years of senior level leadership support, or 1+ years of Amazon experience\nHigh school or equivalent diploma\nExperience with Microsoft Office products and applications\nExperience with executive level calendar management", "preferred": "Experience in a fast-paced, high-tech company\nExperience managing multiple calendars"}, "skills": ["Calendar Management", "Travel Arrangements", "Expense Reports", "Communication", "Time Management", "Organization", "Problem Solving", "Teamwork", "Microsoft Office", "Executive Level Support", "Amazon Experience"], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005287774"}