{"jobTitle": "Lean Manufacturing Manager (OpEx)", "company": {"name": "Oldcastle BuildingEnvelope", "location": "Vernon, CA", "industry": "Wholesale Building Materials, Aviation and Aerospace Component Manufacturing, and Glass Product Manufacturing"}, "location": "Vernon, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$111,111.00/yr - $135,555.00/yr", "currency": "USD"}, "jobFunction": "Management, Manufacturing, and Engineering", "industry": "Wholesale Building Materials, Aviation and Aerospace Component Manufacturing, and Glass Product Manufacturing", "description": "The Operational Excellence Manager in our Vernon, CA facility isn’t just a job – it’s a starting point to an awesome career with a great company. We hire motivated individuals who want to grow with us. We will equip you with the knowledge and skills you need to succeed. We have an incredible track record of promoting from within at our facility. Opportunities to advance into higher roles of responsibility and pay are everywhere. You can be our next success story!\n\nSalary Range: MIN $111,200 / MID $139,100\n\nThis role is perfect for an individual who approaches their work professionally, loves to be a part of a team, and wants to help us get better every day. If that sounds like you, come join this industry leader!\n\nThe Operational Excellence Manager is responsible for overseeing Continuous Improvement and Process Improvement activities to drive operational excellence. Reports to the VP of manufacturing.\n\nCulture\n\nThis role will help to lead a company that has a leading end market position, strong earnings, and cash flow profile, and transform it into a great company that will prosper well beyond the leadership team. With a Mission of “Together, we build excellence every day…” and working consistently with our Virtues of Safety, Integrity, Performance Culture, Teamwork, Customer Centric and Agility, this role is a key member of the leadership team that will transform a good company into a great company. The right person for this role will thrive in a changing environment, will be a builder of teams, systems, and business processes, and a person who is confident in leading change and making decisions with less than perfect information.\n\nEssential Duties and Responsibilities\n\nImplement and manage CRL Operational Excellence system to support and drive efforts within the leadership team and with employee-based process teams to achieve zero harm, improve quality, reduce waste, and maximize process performance.\n\n* Develop factory Operational Excellence roll out strategy, initiatives, activities, coaching and training.\n* Identify areas of process improvement and execute specific Operational Excellence production projects.\n* Implement improved quality processes and change by conducting workshops and improvement projects utilizing OpEx toolbox and methods.\n* Develop control plans and facilitate training to ensure proper execution & recording of quality testing.\n* Validate results to assure compliance with industry standards and/or specific project requirements.\n* Lead site planning process to maximize floor space, minimize lead time, and optimize flow.\n* Drive operational excellence principles such as constraint management, one-piece flow production, pull systems, workplace organization and setup reduction.\n* Initiate, communicate and manage investigations into process issues and quality (internal & external) issues to identify root causes, develop corrective actions, and implement solutions.\n* Seek best practices from other CRL locations and external sources, as well as document and share local best practices to help accelerate implementation throughout the organization.\n* Monitor, track and report implementation plans and progress in pursuit of projects and KPI’s\n* Ensure constant application of company procedures and policies.\n\n Education and Experience Requirements\n\n* Bachelor’s degree in engineering, Business Administration or a related field from a four-year college or university; plus, five or more years of relevant experience within a manufacturing environment.\n* Experience working in a lean environment and leading lean activities is required.\n* Previous lean manufacturing experience leading a plant lean transformation is desired.\n* Practical experience leading kaizen events and teaching and coaching and implementing operational excellence tools.\n* High degree of technical aptitude with a demonstrated knowledge of manufacturing processes and logistics flows\n* Previous experience developing and implementing quality systems, including but not limited to tools such as PFMEA, control plans, standardized work and layer audits is required.\n* Ability to influence-decision makers in the organization.\n* Ability to prioritize and manage multiple tasks in a fast-paced and changing work environment.\n* Excellent leadership skills and demonstrated ability to teach, coach and persuade.\n* Strong analytical and problem-solving skills, in addition to interpersonal, teamwork skills\n* Strong written and oral communication and presentation skills with the ability to speak and communicate effectively with various audiences at the site level. Capacity to effectively present information and respond to questions from supervisors and managers at the site level.\n* Previous experience managing large projects and teams within budgetary and time constraints as well as minimum supervision.\n* Strong personal computer skills, to include but not limited to: Microsoft Office software applications.\n* An uncompromising safety-first approach in the workplace. At CRL we have each other’s back.\n\n   \n\nPhysical Requirements\n\n* Frequently required to stand, sit, bend, and kneel.\n* Frequently required to use hands and fingers to handle/reach tools, machines, and equipment", "responsibilities": "Implement and manage CRL Operational Excellence system to support and drive efforts within the leadership team and with employee-based process teams to achieve zero harm, improve quality, reduce waste, and maximize process performance.", "qualifications": {"required": "Bachelor’s degree in engineering, Business Administration or a related field from a four-year college or university; plus, five or more years of relevant experience within a manufacturing environment.\nExperience working in a lean environment and leading lean activities is required.\nPrevious lean manufacturing experience leading a plant lean transformation is desired.\nPractical experience leading kaizen events and teaching and coaching and implementing operational excellence tools.\nHigh degree of technical aptitude with a demonstrated knowledge of manufacturing processes and logistics flows\nPrevious experience developing and implementing quality systems, including but not limited to tools such as PFMEA, control plans, standardized work and layer audits is required.\nAbility to influence-decision makers in the organization.\nAbility to prioritize and manage multiple tasks in a fast-paced and changing work environment.\nExcellent leadership skills and demonstrated ability to teach, coach and persuade.\nStrong analytical and problem-solving skills, in addition to interpersonal, teamwork skills\nStrong written and oral communication and presentation skills with the ability to speak and communicate effectively with various audiences at the site level. Capacity to effectively present information and respond to questions from supervisors and managers at the site level.\nPrevious experience managing large projects and teams within budgetary and time constraints as well as minimum supervision.\nStrong personal computer skills, to include but not limited to: Microsoft Office software applications.\nAn uncompromising safety-first approach in the workplace. At CRL we have each other’s back.", "preferred": ""}, "skills": ["Operational Excellence", "Lean Manufacturing", "Continuous Improvement", "Process Improvement", "Kaizen", "Quality Systems", "PFMEA", "Control Plans", "Standardized Work", "Layer Audits", "Leadership", "Teamwork", "Communication", "Presentation", "Project Management", "Microsoft Office"], "postedDate": "3 days ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4005861166"}