{"jobTitle": "Field Talent Acquisition Manager - Los Angeles", "company": {"name": "Cartier", "industry": "Retail Luxury Goods and Jewelry"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$110,000 - $120,000", "currency": "USD"}, "jobFunction": "Training, Education, and Human Resources", "industry": "Retail Luxury Goods and Jewelry", "description": "Field Talent Acquisition Manager - Cartier <br/><br/><strong>Based remotely in Los Angeles, CA<br/><br/></strong>Richemont owns a portfolio of leading international ‘Maisons’ (brands) which are recognized for their distinctive heritage, craftsmanship, and creativity. At Richemont, we are proud to employ talent from many different backgrounds, experiences, and identities. We believe that when diversity and inclusion are fully embraced and empowered, creativity and knowledge emerge to deliver excellence. We continue to work towards creating a workforce that represents the diversity of our clients and our communities.<br/><br/><strong>The Challenge<br/><br/></strong>You are a vital part of the talent team, working to implement the recruitment strategy and enhance the candidate experience for boutique level and corporate positions. Your day to day consists of screening &amp; qualifying potential candidates, partnering with our HR Business Partners &amp; Hiring Managers to provide job market awareness, and proactively building a talent pipeline; demonstrating end-to-end ownership of the full lifecycle recruitment process. Networking, building relationships, and creating memorable experiences are at the core of our talent principles, and we hope you are as excited about people, as much as we are.<br/><br/><strong>What You'll Do<br/><br/></strong><strong>Research<br/><br/></strong><ul><li>Proactively build talent pipelines utilizing our ATS, social media, job boards, and field recruitment.</li><li>Understand and communicate labor market trends, regional compensation benchmarks, and talent availability.</li><li>Identify &amp; recommend innovative recruitment initiatives, best practices, and digital enhancements. <br/><br/></li></ul><strong>Partner<br/><br/></strong><ul><li>Develop &amp; maintain relationships with Hiring Managers to understand their needs, create an interview matrix, provide market feedback, and consistently communicate updates throughout the interview process.</li><li>Work closely with the Talent Director to create recruitment strategies by Maison and function to minimize time to fill.</li><li>Participate in staffing committees and talent sharing meetings to identify &amp; highlight strong candidates.</li><li>Work closely with our Talent Coordinator to ensure data integrity.</li><li>Engage &amp; manage external vendors utilized on key searches. <br/><br/></li></ul><strong>Execute<br/><br/></strong><ul><li>Lead &amp; conduct intake meetings to understand vacancies, share potential profiles from pipeline, define the interview cadence, and share labor market intelligence.</li><li>Interview potential candidates against position specific competencies and behaviors for current vacancies, conduct exploratory calls to identify high-potential candidates, and establish &amp; maintain relationships with referrals while being the ultimate brand ambassador. </li><li>Provide Hiring Managers with short list of candidates.</li><li>Create unique digital job ads for social media.</li><li>Attend networking events &amp; job fairs to establish brand awareness and visibility.</li><li>Establish &amp; maintain a high-touch candidate experience.<br/><br/></li></ul><strong>Report<br/><br/></strong><ul><li>Track and communicate interviews, placements, retention, and agency submissions &amp; spend.</li><li>Utilize &amp; maintain our ATS providing detailed notes &amp; submissions on candidates, facilitating the interview/hiring process, and building our talent pools. </li><li>Present to Executives and senior leadership on recruitment activity. <br/><br/></li></ul><strong>What You Need To Succeed<br/><br/></strong>You are a people magnet &amp; expert communicator! Enthusiastic &amp; passionate about luxury retail, it’s history, heritage and craftsmanship. You must be able to manage a high requisition count (+20), while maintaining strong relationships with candidates and internal clients; with 3 - 5 years’ experience in retail recruitment at the boutique and corporate levels. No position is too small. No partnership is too little. You must love to work as a team; sharing resources, energy and candidates. You must have the ability to work across time zones maintaining flexibility in your approach to meet the needs of boutique level and corporate leaders. We use our ATS, social media, digital platforms, and Microsoft (Excel, PowerPoint, and Word) daily - you must be digitally savvy. It's human resources - integrity &amp; confidentiality are a must. A few more things we look for: flexibility to adapt quickly, empathy in working with people and challenging circumstances, ability to influence &amp; negotiate, and strong presentation skills.<br/><br/>If you're interested in telling us about yourself &amp; learning more about our culture, principles, &amp; company please apply.<br/><br/><strong>Travel<br/><br/></strong>RNA is based in Manhattan with offices in Midtown East. Some team members are based in other locations, and periodic travel may be required to Shelton, CT; Dallas, TX; Mississauga, ON. Occasional travel to Richemont’s headquarters in Geneva, Switzerland, may be necessary.<br/><br/> <br/><br/><strong>WE OFFER<br/><br/></strong>We care about our associates health and wellbeing and offer a comprehensive benefits program to support you and your loved ones. Our core benefits include medical, dental, and vision programs. Health savings and flexible spending accounts are available to support your financial needs, along with access to the employee assistance program for you and your household members. The company offers income protection solutions including life insurance, disability benefits, and 401(k) with employer match. Understanding the importance of wellness and work-life-balance, our package includes a wellness reimbursement benefit and paid time off. We also encourage associates to give back to their local community by using their volunteer time off days to support important initiatives that drive change. At Richemont, We Craft the Future!<br/><br/>Expected salary range: $110,000 - $120,000<br/><br/>Please note, hourly pay will be negotiated based on relevant skills and experience.<br/><br/>", "responsibilities": "Proactively build talent pipelines utilizing our ATS, social media, job boards, and field recruitment. Understand and communicate labor market trends, regional compensation benchmarks, and talent availability. Identify &amp; recommend innovative recruitment initiatives, best practices, and digital enhancements. Develop &amp; maintain relationships with Hiring Managers to understand their needs, create an interview matrix, provide market feedback, and consistently communicate updates throughout the interview process. Work closely with the Talent Director to create recruitment strategies by Maison and function to minimize time to fill. Participate in staffing committees and talent sharing meetings to identify &amp; highlight strong candidates. Work closely with our Talent Coordinator to ensure data integrity. Engage &amp; manage external vendors utilized on key searches. Lead &amp; conduct intake meetings to understand vacancies, share potential profiles from pipeline, define the interview cadence, and share labor market intelligence. Interview potential candidates against position specific competencies and behaviors for current vacancies, conduct exploratory calls to identify high-potential candidates, and establish &amp; maintain relationships with referrals while being the ultimate brand ambassador. Provide Hiring Managers with short list of candidates. Create unique digital job ads for social media. Attend networking events &amp; job fairs to establish brand awareness and visibility. Establish &amp; maintain a high-touch candidate experience. Track and communicate interviews, placements, retention, and agency submissions &amp; spend. Utilize &amp; maintain our ATS providing detailed notes &amp; submissions on candidates, facilitating the interview/hiring process, and building our talent pools. Present to Executives and senior leadership on recruitment activity.", "qualifications": {"required": "You are a people magnet &amp; expert communicator! Enthusiastic &amp; passionate about luxury retail, it’s history, heritage and craftsmanship. You must be able to manage a high requisition count (+20), while maintaining strong relationships with candidates and internal clients; with 3 - 5 years’ experience in retail recruitment at the boutique and corporate levels. No position is too small. No partnership is too little. You must love to work as a team; sharing resources, energy and candidates. You must have the ability to work across time zones maintaining flexibility in your approach to meet the needs of boutique level and corporate leaders. We use our ATS, social media, digital platforms, and Microsoft (Excel, PowerPoint, and Word) daily - you must be digitally savvy. It's human resources - integrity &amp; confidentiality are a must. A few more things we look for: flexibility to adapt quickly, empathy in working with people and challenging circumstances, ability to influence &amp; negotiate, and strong presentation skills."}, "skills": ["ATS", "Social Media", "Job Boards", "Field Recruitment", "Labor Market Trends", "Regional Compensation Benchmarks", "Talent Availability", "Recruitment Initiatives", "Best Practices", "Digital Enhancements", "Hiring Managers", "Interview Matrix", "Market Feedback", "Recruitment Strategies", "Staffing Committees", "Talent Sharing Meetings", "Data Integrity", "External Vendors", "Intake Meetings", "Potential Profiles", "Interview Cadence", "Labor Market Intelligence", "Position Specific Competencies", "Behaviors", "Exploratory Calls", "High-Potential Candidates", "Referrals", "Brand Ambassador", "Short List of Candidates", "Digital Job Ads", "Networking Events", "Job Fairs", "Brand Awareness", "Visibility", "High-Touch Candidate Experience", "Interviews", "Placements", "Retention", "Agency Submissions", "Spend", "Detailed Notes", "Submissions", "Talent Pools", "Executives", "Senior Leadership", "People Magnet", "Expert Communicator", "Luxury Retail", "History", "Heritage", "Craftsmanship", "Requisition Count", "Relationships with Candidates", "Internal Clients", "Retail Recruitment", "Boutique Levels", "Corporate Levels", "Teamwork", "Time Zones", "Flexibility", "Digital Savvy", "Integrity", "Confidentiality", "Adaptability", "Empathy", "Influence", "Negotiation", "Presentation Skills", "Excel", "PowerPoint", "Word"], "postedDate": "2 days ago", "benefits": "We care about our associates health and wellbeing and offer a comprehensive benefits program to support you and your loved ones. Our core benefits include medical, dental, and vision programs. Health savings and flexible spending accounts are available to support your financial needs, along with access to the employee assistance program for you and your household members. The company offers income protection solutions including life insurance, disability benefits, and 401(k) with employer match. Understanding the importance of wellness and work-life-balance, our package includes a wellness reimbursement benefit and paid time off. We also encourage associates to give back to their local community by using their volunteer time off days to support important initiatives that drive change. At Richemont, We Craft the Future!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005286637"}