{"jobTitle": "Care Manager, RN", "company": {"name": "Shriners Children's", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "11,008.00/yr - $106,974.40/yr", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "Shriners Children’s is a family that respects, supports, and values each other. We are engaged in providing excellence in patient care, embracing multi-disciplinary education, and research with global impact. We foster a learning environment that values evidenced based practice, experience, innovation, and critical thinking. Our compassion, integrity, accountability, and resilience defines us as leaders in pediatric specialty care for our children and their families.<br/><br/>We currently have an opening for a full-time Care Manager, RN to join our Pasadena, CA team. The RN Care Manager position requires a thorough understanding of clinical, financial, administrative, and psychosocial components of the healthcare continuum The RN Care Manager is responsible for providing assessments, planning, interventions and follow-up for patients and family members at Shriners Children's across the continuum of care. These services are provided face to face or telephonically to facilitate the creation of and adherence to, a treatment plan and optimize patient health. In conjunction with the interdisciplinary team, this position proactively addresses potential or actual clinical and/or psychosocial needs identified through screening to ensure developmental, level of care and health status transitions are safe, seamless, and coordinated.<br/><br/>This position is full time, exempt and benefits eligible. The pay range for this position is $106,974.40 - $11,008.00 annually. Compensation is determined based on years of experience and departmental equity.<br/><br/><ul><li>Accountability for the achievement of optimal outcomes within the standards of practice. This is accomplished by recognizing and demonstrating shared accountability, both at the individual and the team levels. </li><li>Demonstrates professionalism by emulating the standards of practice of care management guided by the Shriners Hospitals for Children professional practice model FOCUSED. </li><li>Collaborates by working with patients, families, caregivers, and the health care team locally and within the SHC system to jointly communicate, problem solve, and share accountability for optimal outcomes. </li><li>Coordinates the plan of care to achieve desired outcomes and integrates the work of the health care team, including the patient’s Primary Care/Medical Home by coordinating resources and services necessary to accomplish agreed-upon goals.</li><li>Arranges services among community agencies, physicians, patients, family, caregivers, and others involved in the plan of care. Ensures timely sequencing of interventions for optimal results and smooth transition along the continuum. Identifies barriers to achieving recommended goals identified in the plan of care.<br/><br/><br/></li></ul>This is not an all inclusive list of this job's responsibilities. The incumbent may be required to perform other related duties and participate in special projects as assigned.<br/><br/><strong>Required<br/><br/></strong><ul><li>Bachelor in Nursing</li><li>RN licensure in CA</li><li>Case Management Certification (CMC, ACM or ANCC) or required within 12 months of hire</li><li>3 years experience in Nursing</li><li>Bilingual English-Spanish</li><li>BLS, ACLS, and PALS<br/><br/><br/></li></ul><strong>Preferred<br/><br/></strong><ul><li>Master's in Nursing or other healthcare related field</li><li>1 year experience in Care Management in Pediatrics</li><li>5 years clinical experience in 1 or more of facilities service lines (SCL, Pediatric Orthopedic Burn Care, cleft lip and palate)</li></ul>", "responsibilities": "Accountability for the achievement of optimal outcomes within the standards of practice. This is accomplished by recognizing and demonstrating shared accountability, both at the individual and the team levels.  Demonstrates professionalism by emulating the standards of practice of care management guided by the Shriners Hospitals for Children professional practice model FOCUSED.  Collaborates by working with patients, families, caregivers, and the health care team locally and within the SHC system to jointly communicate, problem solve, and share accountability for optimal outcomes.  Coordinates the plan of care to achieve desired outcomes and integrates the work of the health care team, including the patient’s Primary Care/Medical Home by coordinating resources and services necessary to accomplish agreed-upon goals. Arranges services among community agencies, physicians, patients, family, caregivers, and others involved in the plan of care. Ensures timely sequencing of interventions for optimal results and smooth transition along the continuum. Identifies barriers to achieving recommended goals identified in the plan of care.<br/><br/><br/>This is not an all inclusive list of this job's responsibilities. The incumbent may be required to perform other related duties and participate in special projects as assigned.", "qualifications": {"required": "Bachelor in Nursing, RN licensure in CA, Case Management Certification (CMC, ACM or ANCC) or required within 12 months of hire, 3 years experience in Nursing, Bilingual English-Spanish, BLS, ACLS, and PALS", "preferred": "Master's in Nursing or other healthcare related field, 1 year experience in Care Management in Pediatrics, 5 years clinical experience in 1 or more of facilities service lines (SCL, Pediatric Orthopedic Burn Care, cleft lip and palate)"}, "skills": ["Nursing", "Case Management", "Bilingual", "BLS", "ACLS", "PALS"], "postedDate": "4 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005129398"}