{"jobTitle": "Social Media & Influencer Partnerships Intern", "company": {"name": "Bee Street Co.", "industry": "Advertising Services, Marketing Services, Social Networking Platforms", "size": "Not specified", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Internship", "employmentType": "Internship", "experienceLevel": "Internship", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Administrative, Art/Creative, and Business Development", "industry": "Advertising Services, Marketing Services, Social Networking Platforms", "description": "As a Social Media and Influencer Partnerships Intern at Bee Street, you will have the exciting opportunity to immerse yourself in the world of digital marketing, social media management, and influencer relations. You will work closely with our Accounts team to execute strategic initiatives aimed at maximizing our online presence, increasing engagement, and fostering meaningful relationships with influencers. *This is an unpaid part time internship - must be able to receive school credit", "responsibilities": "Social Media Management: Assist in managing and curating content for our social media platforms, including but not limited to TikTok, Instagram, and LinkedIn. Develop and implement creative strategies to enhance engagement, reach, and followership. Generate engaging and compelling content tailored to each platform, with a focus on TikTok and Instagram. Provide insights and recommendations based on emerging trends and industry developments. Influencer Partnerships: Research and identify potential influencers aligned with our brand values and target audience. Support in outreach efforts and communication with influencers for collaboration opportunities. Help coordinate influencer campaigns, including content creation, posting schedules, and performance tracking. Assist in mailings (inventory boxes and inclusions, work on project builds, arrange messengers) Working alongside the Bee Street team on day-to-day projects", "qualifications": {"required": "Currently enrolled in a Bachelor's degree program in Marketing, Communications, Digital Media, or related field. Available 2 days a week, 10am - 6pm. We would like candidates to come into our office located in West Hollywood, CA. Fluency in the digital, social and influencer landscapes. Fluency in Microsoft suite programs. Creativity and a love for social media.", "preferred": "Not specified"}, "skills": ["Social Media Management", "Influencer Relations", "Digital Marketing", "Content Creation", "Research", "Communication"], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "School credit available for eligible candidates. Flexible start date in September.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4005873860"}