{"jobTitle": "Work From Home Scheduling", "company": {"name": "Voyage Canvas", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-Time/Part-Time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Project Management and Information Technology", "industry": "Internet Publishing", "description": "<strong>About Us:<br/><br/></strong>Voyage Canvas is at the forefront of delivering tailor-made travel and event experiences. We are known for our meticulous attention to detail and our commitment to creating unforgettable moments for our clients. Joining our team means being part of an innovative company that prides itself on excellence and creativity.<br/><br/><strong>Location:</strong>Remote<br/><br/><strong>Type:</strong>Full-Time/Part-Time<br/><br/><strong>Overview:<br/><br/></strong>Work From Home Scheduling at Voyage Canvas is crucial for orchestrating the complex logistics that make our customized travel itineraries and events come to life. This role demands an individual who is highly organized, adept at problem-solving, and possesses excellent communication skills.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Develop and manage detailed schedules for travel and events, ensuring all aspects run smoothly</li><li>Coordinate with vendors and partners to confirm bookings and ensure quality standards</li><li>Communicate schedule changes and details effectively to clients and the client service team</li><li>Identify and resolve scheduling conflicts or issues promptly</li><li>Perform quality checks on all arrangements and maintain accurate scheduling records</li><li>Collaborate across departments to ensure a unified approach to service delivery<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>A degree or relevant experience in hospitality, tourism, event management, or similar</li><li>Experience in scheduling or logistics within the travel, hospitality, or events sector</li><li>Exceptional organizational and multitasking skills</li><li>Strong communication and team collaboration abilities</li><li>Familiarity with scheduling software and Microsoft Office</li><li>Flexibility and a keen eye for detail<br/><br/></li></ul><strong>Why Voyage Canvas?<br/><br/></strong>Joining Voyage Canvas means being part of a passionate team that values innovation and quality. We offer a supportive environment with opportunities for growth, aiming to create memorable experiences for our clients and employees alike.<br/><br/>Powered by JazzHR<br/><br/>PgcXoArQlf", "postedDate": "2 days ago", "skills": ["Scheduling", "Logistics", "Hospitality", "Tourism", "Event Management", "Microsoft Office", "Communication", "Teamwork", "Organization", "Multitasking"], "url": "https://www.linkedin.com/jobs/view/4005278829"}