{"jobTitle": "Business Data Analyst(s) (Remote)", "company": {"name": "Integrated Data Services", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000-$120,000", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Software Development", "description": "Company Overview:<br/><br/>Integrated Data Services (IDS) is a leading provider of custom software products and Government financial management services. IDS was founded in 1997 in El Segundo, CA, and since that time has seen tremendous growth and success. Currently, IDS has offices supporting customers nationwide. By providing customers with fast, efficient and reliable information systems and support services, IDS has become a preferred provider of financial and programmatic systems, services and solutions across a wide variety of government agencies.<br/><br/>Position Description:<br/><br/>IDS is seeking an ambitious self-starter to provide data analytics support for our Air Force Contracting (SAF/AQC) customer. This position will work with SAF/AQC to perform data extraction, cleansing, analysis, visualization and storytelling. Successful candidates will have experience analyzing data from Air Force or DoD business systems (Contracting, Acquisition, Finance, Logistics, Personnel, etc.), work well in a collaborative environment, think creatively, thrive under pressure, and be able to adjust to shifting priorities quickly. Candidates will possess effective oral and written communication, diplomatic and time management skills.<br/><br/>Responsibilities include, but are not limited to, the following:<br/><br/>Gather business requirements, analyze source systems, define underlying data sources and transformation requirements, design data models, and develop metadata for data analysis and visualization<br/><br/>Acquire and analyze data and metrics across the enterprise to learn how they can be incorporated into data visualizations and dashboards<br/><br/>Collaborate with business areas and project teams to elicit, identify, prioritize, and document data visualization and business intelligence requirements<br/><br/>Serve as a functional and technical data visualization and business intelligence subject matter expert<br/><br/>Translate business analysis and business needs into prototypes concepts of reports and dashboards and contribute to design and visualization best practices<br/><br/>Utilize business intelligence tools to take dashboard requirements and develop deliverable solutions<br/><br/>Document data acquisition, data management and data governance processes<br/><br/>Make and implement process improvements and efficiencies<br/><br/>Create training materials and user guides<br/><br/>Conduct group and one-on-one training sessions with end users<br/><br/>Knowledge and Skills:<br/><br/>This position requires a minimum of five (5) years of business intelligence, data analytics or report development experience<br/><br/>This position requires a minimum of three (3) years of DoD contracting, acquisition, financial management, program management, logistics management, manpower/personnel management or related experience within a DoD organization<br/><br/>Candidates with experience using Business Intelligence (BI) and self-service data visualization tools such as Qlik Sense, Qlik View, Tableau or Power BI are preferred<br/><br/>Candidates with Qlik Sense and Air Force experience are highly desired<br/><br/>Education and Work Experience:<br/><br/>This position requires a minimum of a Bachelors degree from an accredited college or university in business management, engineering, computer science, mathematics, accounting, economics or other related discipline<br/><br/>Experience in lieu of education may be considered if the individual has ten (10) or more years of equivalent technical training or work/military experience<br/><br/>Physical &amp; Mental Qualifications:<br/><br/>Must be able to sit, type, hear, see, and speak for extended periods of time<br/><br/>Must consistently work and type on a computer for prolonged periods of time<br/><br/>Must be able to able to communicate accurate information and ideas so others will understand<br/><br/>Must be able to lift/carry at least 15 lbs.<br/><br/>May be required to move about inside an office to access file cabinets, office supplies, etc.<br/><br/>Security Clearance:<br/><br/>Applicants selected for employment will be subject to a Federal background investigation and must meet additional eligibility requirements for access to classified information or materials<br/><br/>Travel:<br/><br/>Some travel may be required<br/><br/>Hours:<br/><br/>Normal work schedule hours may vary, Monday through Friday. May be required to work additional hours and/or weekends, as needed, to meet deadlines or to fulfill travel obligations<br/><br/>Salary Range:<br/><br/>$80,000-$120,000 per year<br/><br/>The estimated salary range listed is a good faith determination of potential base compensation that may be offered to a successful applicant for this position at the time of this job posting and may be modified in the future. The disclosed salary range estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled. When determining an applicants compensation, various factors are taken into consideration including, but not limited to: geographic location, relevant prior work experience, relevant training, special skills/competencies, education, clearance, licenses/certifications, labor categories/contract rates and other business needs.<br/><br/>IDS offers a robust benefits package including employer paid health, dental, vision, disability, AD&amp;D and life insurance plans for eligible employees. IDS also offers a variety of elective plans to eligible employees including flexible spending accounts, voluntary life insurance and supplemental insurance plans. Benefits become effective the first of the month following the start date of employment unless starting on the 1st of the month, in which case benefits are effective immediately upon the eligible employees start date. IDS offers eligible employees eleven (11) paid holidays, generous PTO accruals starting at three (3) weeks per year, as well as a 401(k) safe harbor contribution upon eligibility. IDS also offers generous employee referral bonuses.<br/><br/>IDS is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regards to age (40 and over), color, physical or mental disability, gender identity or expression, genetic information (including family medical history), national origin or ancestry, race, religion, sex, pregnancy (including childbirth and related medical conditions), sexual orientation, citizenship status, veteran status, uniformed service member status, or any other characteristic protected by federal, state, or local law. IDS participates in E-Verify. To learn more about E-Verify, including your rights and responsibilities, please visit www.e-verify.gov/. A submission of a resume is an expression of interest and not considered an application.<br/><br/>For more information, visit www.get-integrated.com.<br/><br/>Disclaimer: This job description is intended to provide an overview of job responsibilities that are subject to change.<br/><br/>**U.S. citizenship is required; H1-B visas and other visas are not being sponsored. Relocation expenses are NOT compensated. All jobs are employer paid; no fees to candidates. Third parties or agency inquiries are not being accepted at this time.**<br/><br/>#IDS", "responsibilities": "Gather business requirements, analyze source systems, define underlying data sources and transformation requirements, design data models, and develop metadata for data analysis and visualization<br/><br/>Acquire and analyze data and metrics across the enterprise to learn how they can be incorporated into data visualizations and dashboards<br/><br/>Collaborate with business areas and project teams to elicit, identify, prioritize, and document data visualization and business intelligence requirements<br/><br/>Serve as a functional and technical data visualization and business intelligence subject matter expert<br/><br/>Translate business analysis and business needs into prototypes concepts of reports and dashboards and contribute to design and visualization best practices<br/><br/>Utilize business intelligence tools to take dashboard requirements and develop deliverable solutions<br/><br/>Document data acquisition, data management and data governance processes<br/><br/>Make and implement process improvements and efficiencies<br/><br/>Create training materials and user guides<br/><br/>Conduct group and one-on-one training sessions with end users", "qualifications": {"required": "This position requires a minimum of five (5) years of business intelligence, data analytics or report development experience<br/><br/>This position requires a minimum of three (3) years of DoD contracting, acquisition, financial management, program management, logistics management, manpower/personnel management or related experience within a DoD organization", "preferred": "Candidates with experience using Business Intelligence (BI) and self-service data visualization tools such as Qlik Sense, Qlik View, Tableau or Power BI are preferred<br/><br/>Candidates with Qlik Sense and Air Force experience are highly desired"}, "skills": ["Business Intelligence", "Data Analytics", "Report Development", "DoD Contracting", "Acquisition", "Financial Management", "Program Management", "Logistics Management", "Manpower/Personnel Management", "Qlik Sense", "Qlik View", "Tableau", "Power BI", "Air Force"], "postedDate": "2 days ago", "benefits": "IDS offers a robust benefits package including employer paid health, dental, vision, disability, AD&amp;D and life insurance plans for eligible employees. IDS also offers a variety of elective plans to eligible employees including flexible spending accounts, voluntary life insurance and supplemental insurance plans. Benefits become effective the first of the month following the start date of employment unless starting on the 1st of the month, in which case benefits are effective immediately upon the eligible employees start date. IDS offers eligible employees eleven (11) paid holidays, generous PTO accruals starting at three (3) weeks per year, as well as a 401(k) safe harbor contribution upon eligibility. IDS also offers generous employee referral bonuses.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005967415"}