{"jobTitle": "Office Administrator", "company": {"name": "TAG", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "20.00/hr - 27.00/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Travel Arrangements", "description": "<strong>The Who<br/><br/></strong>In 1988, our founders had an ambitious dream to form the largest specialized travel company in the world—to set the example of how touring and travel should be done. The belief that travel is one of the most emotive experiences you undertake and our ambition to make this experience the absolute best it can be for the traveller, has become the guiding principle for TAG.<br/><br/>We believe that through a bespoke, high-touch and personal service, we can alleviate the stress and complexity of travel. So, whether it is a business meeting to close a deal, an event to meet industry peers or a gig for 50,000 screaming fans, we will get our clients to where they need to be feeling ready to take on the world.<br/><br/><strong>The Why <br/><br/></strong>At TAG, our company values matter. We appreciate our staff working as a<strong> T</strong>eam, having <strong>A</strong>mbition and being<strong> G</strong>enuine.<br/><br/>You will have a passion for the job you do, as well as a drive to want to do better—in return, TAG will support your growth and development, as well as offer opportunities to progress or maybe even change tack!<br/><br/><strong>The What<br/><br/></strong>As an Office Administrator, you will have a diverse and varied role. Here are just some of the things you’ll be getting involved with: <br/><br/><ul><li>Maintain and regularly update front of the house policies and procedures manual.</li><li>Greet all visitors, including but not limited to suppliers, vendors, clients, in a friendly and professional manner and direct them to the appropriate contact person.</li><li>Plan and prepare for internal group meetings, including note taking, meal ordering, setup and clean-up, when necessary.</li><li>Setup Staff Training and/or Educational sessions as needed.</li><li>Provide administrative support to the management team and assist with ad-hoc activities when directed by management as needed.</li><li>Coordinate administrative activities for the office and perform a variety of administrative and clerical duties to assist in running the organization efficiently.</li><li>Respond to questions and requests for information from clients and office personnel. Maintain internal and external lists.</li><li>Compose correspondence including memos, emails, reports, and PowerPoint presentations.</li><li>Accurately administer Word processing, data entry, and filing tasks, and create and manage variety of spreadsheets.</li><li>Manage office and maintenance supplies, snacks and groceries for the office by monitoring stock, anticipating needs, placing orders, and verifying receipt of supplies against orders.</li><li>Manage outgoing and incoming mail.</li><li>Always maintain a clean and tidy office.</li><li>Maintain contact lists and provide administration assistance in Salesforce and Pardot.</li><li>Answer and route incoming calls effectively and courteously and assume other receptionist duties.</li><li>Ensure a thorough understanding of given tasks and handle them in accordance with deadlines.</li><li>Adhere to PCI regulations in accordance with Company policy.</li><li>Additional responsibilities based on business need include:</li><ul><li>assisting with client reporting, updating reporting data, and invoice delivery in Travcom.</li><li>assisting with loading supplier and service files into TAG Desktop.</li><li>completing ad-hoc Finance related tasks including client credit card reconciliations.</li><li>obtaining and chasing client weekly folios and invoices from suppliers.</li><li>processing credit card payment authorizations accurately as requested.</li><li>hotel data clean-ups for TAG’s Desktop database.</li><li>building and maintaining client profile data in TAG desktop.</li><li>providing high level of assistance to departments in all aspects of the management of client travel requirements.</li><li>adding and processing transaction fees accurately in TAG Desktop service files.</li><li>inputting data on movement sheets with exceptional accuracy.</li></ul><li>Order Transit checks for the staff and communicating order details to HR in a timely manner to ensure the correct deductions from individual employees (NY only);</li><li>Respond to all communications and correspondence proactively, promptly, efficiently, and accurately.</li><li>Apply a high level of attention to detail at all times.</li><li>Perform other duties as assigned.<br/><br/></li></ul><strong>The How<br/><br/></strong>To be successful at TAG is as much about mindset and attitude as it is about skill set and qualifications. We’re a team who share the same desire and passion to go above and beyond for each and every client. We revel in making the seemingly impossible possible, always rising to the challenge with ambition and a genuine, open attitude.<br/><br/>We work flexibly to accommodate our TAG team colleagues, meaning on occasion there could be requirements outside of office hours to manage time zones and other work commitments. As an Office Administrator there are several credentials and attributes which would be advantageous, but a determined attitude and willingness to learn, are equally important.<br/><br/><ul><li>High School Diploma or equivalent required OR</li><li>AA/AS or BA/BS degree preferred</li><li>Minimum of 2 years of administrative experience in a corporate environment required</li><li>Working experience utilizing Excel at Intermediate Level </li><li>Ability to adapt to a changing environment, to work in a pressurized and demanding environment, to work to agreed deadlines and be able to prioritize workload</li><li>Intermediate proficiency in Microsoft Office Suite</li><li>Strong verbal and written communication skills</li><li>Must be organized and detail oriented</li><li>Ability to work independently or within a team environment</li><li>Ability to accept instructions or directions and see through to completion</li><li>Ability to multitask<br/><br/><br/></li></ul><strong>The Where and When <br/><br/></strong>This is a full-time role (40 hours per week) based in our Los Angeles office. This position is required to report into the office 5 days a week. We ask that only applicants willing to work out of the office apply!<br/><br/>You will report into the Team Lead, who is based in Los Angeles. There are other regional teams based in Singapore, UK and Australia that you may work closely with, too.<br/><br/><strong>The Important Bit <br/><br/></strong>As passionate as you may be about changing the face of travel, let’s be honest – you're not doing this for free. So, here’s our promise to you:<br/><br/><ul><li>Competitive salary DOE</li><li>Wellness/EAP program</li><li>Employee discounts<br/><br/><br/></li></ul>We are also committed to offering an equal opportunity for all employees and applicants.<br/><br/><strong>P</strong>lease make sure you’re eligible to work in the USA!", "responsibilities": "Maintain and regularly update front of the house policies and procedures manual. Greet all visitors, including but not limited to suppliers, vendors, clients, in a friendly and professional manner and direct them to the appropriate contact person. Plan and prepare for internal group meetings, including note taking, meal ordering, setup and clean-up, when necessary. Setup Staff Training and/or Educational sessions as needed. Provide administrative support to the management team and assist with ad-hoc activities when directed by management as needed. Coordinate administrative activities for the office and perform a variety of administrative and clerical duties to assist in running the organization efficiently. Respond to questions and requests for information from clients and office personnel. Maintain internal and external lists. Compose correspondence including memos, emails, reports, and PowerPoint presentations. Accurately administer Word processing, data entry, and filing tasks, and create and manage variety of spreadsheets. Manage office and maintenance supplies, snacks and groceries for the office by monitoring stock, anticipating needs, placing orders, and verifying receipt of supplies against orders. Manage outgoing and incoming mail. Always maintain a clean and tidy office. Maintain contact lists and provide administration assistance in Salesforce and Pardot. Answer and route incoming calls effectively and courteously and assume other receptionist duties. Ensure a thorough understanding of given tasks and handle them in accordance with deadlines. Adhere to PCI regulations in accordance with Company policy. Additional responsibilities based on business need include: assisting with client reporting, updating reporting data, and invoice delivery in Travcom. assisting with loading supplier and service files into TAG Desktop. completing ad-hoc Finance related tasks including client credit card reconciliations. obtaining and chasing client weekly folios and invoices from suppliers. processing credit card payment authorizations accurately as requested. hotel data clean-ups for TAG’s Desktop database. building and maintaining client profile data in TAG desktop. providing high level of assistance to departments in all aspects of the management of client travel requirements. adding and processing transaction fees accurately in TAG Desktop service files. inputting data on movement sheets with exceptional accuracy. Order Transit checks for the staff and communicating order details to HR in a timely manner to ensure the correct deductions from individual employees (NY only); Respond to all communications and correspondence proactively, promptly, efficiently, and accurately. Apply a high level of attention to detail at all times. Perform other duties as assigned.", "qualifications": {"required": "High School Diploma or equivalent required OR AA/AS or BA/BS degree preferred Minimum of 2 years of administrative experience in a corporate environment required Working experience utilizing Excel at Intermediate Level Ability to adapt to a changing environment, to work in a pressurized and demanding environment, to work to agreed deadlines and be able to prioritize workload Intermediate proficiency in Microsoft Office Suite Strong verbal and written communication skills Must be organized and detail oriented Ability to work independently or within a team environment Ability to accept instructions or directions and see through to completion Ability to multitask", "preferred": ""}, "skills": ["Excel", "Microsoft Office", "Salesforce", "Pardot", "Communication", "Administrative", "Organization", "Teamwork"], "postedDate": "3 days ago", "applicationDeadline": "", "benefits": "Competitive salary DOE Wellness/EAP program Employee discounts", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005277318"}