{"jobTitle": "Marketing and Sales Assistant", "company": {"name": "Diamond Executives", "industry": "Marketing Services", "size": "Not specified", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Sales and Business Development", "industry": "Marketing Services", "description": "We successfully analyze, adapt, and improve marketing and sales solutions for our clients. Many of our current clients are long-term partners, trusting us to understand the Southern California market and telecommunications industry to provide them with the engagement and marketing results they seek. Joining our team as a Marketing and Sales Assistant will involve working directly with our client representatives and local community to determine service solutions for current and potential customers. We always focus on communication, learning, and realistic expectations with new team members.", "responsibilities": "Introduce client products or services to potential consumers through direct communication and education. Expedite sales by providing knowledgeable insight and service solutions regarding the client's products, industry standards, benefits, and discounts. Develop a strong understanding of the client's expectations through entry-level training and exposure to the local community's experience. Become efficient in utilizing client-provided technology devices to assist in providing efficient customer service. Regularly collaborate with the Director, Chief of Staff, and other management members to review metrics, sales goals, and ensure that client expectations are being met.", "qualifications": {"required": "High school diploma or GED required", "preferred": "Previous knowledge of customer service, sales, marketing, business, communications, or related fields preferred. 1-4 years of higher education preferred, but will always be ready to train the ideal candidate. Friendly and professional demeanor, both within the office and when conversing with customers. Willing to learn and implement entry-level training in all client-related topics. Reliability in time management and communication to ensure all daily and weekly duties are completed. Ability to adjust to and accommodate new marketing and sales trends, business developments, and client expectations."}, "skills": [], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4006325204"}