{"jobTitle": "Peer Navigator", "company": {"name": "SSG Project 180", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "21.32-$23.45/hour", "currency": "USD"}, "jobFunction": "Other, Information Technology, and Management", "industry": "Internet Publishing", "description": "<strong>Title:</strong> Peer Navigator, RDP<br/><br/><strong>Division:</strong> Project 180<br/><br/><strong>Pay Scale:</strong> $21.32-$23.45/hour<br/><br/><strong>The Organization<br/><br/></strong>SSG-Project 180 turns lives around through innovative, wraparound services that keep people out of<br/><br/>institutions and in their communities. Project 180 is a leader in the forensic treatment space, offering<br/><br/>high-quality, specialized treatment programs that serve thousands of justice-involved individuals. Our<br/><br/>programs span criminal justice intercepts and include pre-arrest interventions, court-based diversions, jail in-reach, and intensive post-release services. Project 180 operates in partnership with County agencies including the Department of Mental Health (DMH), the Department of Health Services (DHS), and the Justice, Care and Opportunities Department (JCOD).<br/><br/><strong>The Program<br/><br/></strong>The Rapid Diversion Program (RDP) is a County-operated program that diverts criminal defendants out<br/><br/>of the criminal legal system at the early stages of the court process. The program provides in-court mental health evaluation, linkage to treatment services, and case management support to participants, whose criminal case is dismissed upon successful program completion.<br/><br/><strong>The Position<br/><br/></strong>The Peer Navigator provides peer to peer support and counseling drawing from lived experience to target recovery goals. The Peer Navigator supports clients in increasing community engagement and<br/><br/>independence in their activities of daily living, primarily through transportation services. The Peer<br/><br/>Navigator reports to the Program Supervisor. A successful Peer Navigator is able to develop unique<br/><br/>connections to the clients we serve and stewards clients in making progress towards their personal<br/><br/>recovery goals.<br/><br/><strong>Essential Functions<br/><br/></strong><strong>Assist clients in safely attending community appointments and linkages<br/><br/></strong><ul><li>Accompany clients into the field and assist with linkage to needed community resources</li><li>Pick clients up from LA County Jail and support the team with welcoming them, as the first agency contact they have</li><li>Assist clients through use of deescalation and problem solving skills. Escalate client issues to supervisor or emergency personnel as appropriate</li><li>Actively communicate with treatment team members regarding scheduled appointments and any client observations or concerns</li><li>Provide excellent customer service by treating clients and community partners in a friendly and professional manner</li><li>Complete other administrative runs/pickups (i.e. transporting medications and program supplies) as scheduled</li><li>Follow traffic safety laws and engage in defensive driving techniques to minimize the risk of accidents and incidents<br/><br/></li></ul><strong>Provide peer-to-peer support and counseling drawing from lived experience<br/><br/></strong><ul><li>Shares life experiences and successes with history of homelessness, incarceration and substance use and mental health recovery when appropriate</li><li>Encourage clients in the development of and active participation in meaningful roles in the community (i.e. family reunification, employment/volunteerism, participation in community groups)</li><li>Teach clients skills for community independence (i.e. prosocial communication, navigating public transit, organization, etc.) through modeling and prompts</li><li>Service delivery is consistent with ethical standards and a harm reduction, strength based, trauma informed framework<br/><br/></li></ul><strong>Fulfill baseline Project 180 staff expectations<br/><br/></strong><ul><li>Regular attendance required. Holiday or weekend work may be required</li><li>Maintain and uphold Agency mission statement, values, policies, procedures, and principles</li><li>Perform other duties as needed</li><li>Maintain active license and/or registrations as applicable (i.e. BBS, CCAPP)<br/><br/></li></ul><strong>Skills and Abilities<br/><br/></strong><ul><li>Empathetic, strong communication and relationship-building skills</li><li>Culturally competent: Understands and is sensitive to diverse backgrounds and needs</li><li>Collaborative: Able to work in diverse teams to solve complex issues</li><li>Persistent and optimistic in overcoming obstacles</li><li>Adaptive to changing circumstances and client needs in a dynamic environment</li><li>Strong critical thinking and problem solving skills<br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><strong>Required:<br/><br/></strong><ul><li>Lived experience with mental health/substance use recovery or the criminal justice system</li><li>Experience working with culturally diverse populations</li><li>Valid CA driver’s license, proof of insurance and own vehicle required. Ability to transport clients in personal vehicle as needed</li><li>Must not be on any type of legal supervision (probation or parole)</li><li>Verification of Employment Eligibility and Background Check</li><li>Basic computer skills<br/><br/></li></ul><strong>Preferred:<br/><br/></strong><ul><li>Experience working with mental health, criminal legal system and/or homeless population</li><li>Spanish speaking<br/><br/></li></ul><strong>Supervisory Responsibilities<br/><br/></strong>None<br/><br/><strong>Environmental Conditions (Working Conditions)<br/><br/></strong>Job duties are to be performed both in office and field settings.<br/><br/><strong>Physical Requirements<br/><br/></strong>The employee is expected to move about the worksite throughout the day, which may involve walking,<br/><br/>standing, and climbing stairs, or using a mobility device, or similar. The employee is expected to drive,<br/><br/>carry a maximum of 20 lbs, listen, and speak in order to complete job requirements.<br/><br/><strong>Mental Requirements<br/><br/></strong>The employee must be able to do any/all of the following: perform complex and varied tasks such as<br/><br/>synthesizing information and making decisions without immediate supervision; handle routine<br/><br/>distractions, interruptions, noise, and uncontrollable changes in priorities/work schedules; interact<br/><br/>professionally and diplomatically in high-stress situations; create and follow plans; meet deadlines.<br/><br/>Powered by JazzHR<br/><br/>uTlnGKOMqB", "responsibilities": "The Peer Navigator provides peer to peer support and counseling drawing from lived experience to target recovery goals. The Peer Navigator supports clients in increasing community engagement and\nindependence in their activities of daily living, primarily through transportation services. The Peer\nNavigator reports to the Program Supervisor. A successful Peer Navigator is able to develop unique\nconnections to the clients we serve and stewards clients in making progress towards their personal\nrecovery goals.", "qualifications": {"required": "Lived experience with mental health/substance use recovery or the criminal justice system, Experience working with culturally diverse populations, Valid CA driver’s license, proof of insurance and own vehicle required. Ability to transport clients in personal vehicle as needed, Must not be on any type of legal supervision (probation or parole), Verification of Employment Eligibility and Background Check, Basic computer skills", "preferred": "Experience working with mental health, criminal legal system and/or homeless population, Spanish speaking"}, "skills": ["Communication", "Relationship Building", "Cultural Competence", "Collaboration", "Problem Solving", "Critical Thinking", "Adaptability", "Customer Service", "Transportation", "Driving", "De-escalation", "Computer Skills"], "postedDate": "5 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4006307496"}