{"jobTitle": "Full Time Entry Level Sales Representative", "company": {"name": "Sunset AcquisitionsInc", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "We are immediately hiring an Entry Level Sales Representative to work on our newest project working with a premier technological giant. These brand new products are being released into the surrounding areas, and our team is tasked to bring them to market. The Entry Level Sales Representative will interact with numerous decision-makers articulating the benefits these products bring, the improvements in efficiency they will see, and the peace of mind they'll feel with no hidden agenda (or fees).<br/><br/>We take immense pride in delivering quality sales solutions and having the opportunity to work with a client that is at the very forefront of technological evolution. Our success is primarily due to our team and the core values that have guided us since our inception:<br/><br/><ul><li>Courage &amp; a Community. If you're going to take a risk, you need a team willing to dive headfirst with you</li><li>Work Ethic. An innate ability to work hard is something that money cannot buy</li><li>Tenacity. If you believe you can do it, then you can</li><li>Vision. Vision with action makes a powerful reality<br/><br/></li></ul>As an Entry Level Sales Representative, those four core values are at the forefront of everything you do. From the internal training and mentorship we provide and to each conversation you have with a customer.<br/><br/>What You'll Do:<br/><br/>You will be the voice and face of this newest project as we trailblaze the market with these brand-new internet solutions and increase our client's market share. You will initially start with us and partake in comprehensive training that includes learning product knowledge programs and role-play exercises.<br/><br/>Primary job responsibilities include:<br/><br/><ul><li>Prospect for new customers using a generated lead list to effectively grow a book of business and create a referral pipeline</li><li>Deliver interactive product presentations on the newest and most advanced technological solutions in the industry</li><li>Create and maintain positive relationships with all customers and clients even after the sale is complete</li><li>Regularly participate in ongoing training, virtual webinars, and brainstorming sessions</li><li>Collaborate with peers and industry partners to bring the most reliable, efficient, and innovative sales solutions available to businesses</li><li>Maintain detailed reports of sales activities, including the customers reached, presentations completed, orders processed, and any customer relationship issues<br/><br/></li></ul>Essential Skills &amp; Qualities Needed:<br/><br/><ul><li>Work experience in industries such as sales, technology, hospitality, retail, customer service, or any other applicable client-facing enterprise</li><li>Acute communication and active listening skills, including a high level of emotional intelligence and empathy</li><li>Must be self-motivated with a high level of ambition and passion for working in an entrepreneurial environment</li><li>Uncanny ability to build relationships with a multitude of people and establish a level of trust fairly quickly</li><li>Confidence and perseverance are critical attributes to being successful in this role</li><li>Ability to set reasonable and measurable goals and achieve them<br/><br/></li></ul>Powered by JazzHR<br/><br/>5roEQOM8Ms<br/><br/>", "postedDate": "3 days ago", "skills": ["Sales", "Technology", "Hospitality", "Retail", "Customer Service", "Communication", "Active Listening", "Emotional Intelligence", "Empathy", "Self-Motivation", "Ambition", "Entrepreneurial", "Relationship Building", "Trust", "Confidence", "Perseverance", "Goal Setting"], "url": "https://www.linkedin.com/jobs/view/4006306718"}