{"jobTitle": "Air Export Specialist", "company": {"name": "JAS Worldwide", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "JAS is an international, non-asset-based supply chain services and solutions company. Our services include air and ocean freight forwarding, contract logistics, customs brokerage, distribution, inbound logistics, truckload brokerage and other supply chain management services, including consulting, the coordination of purchase orders and customized management services.<br/><br/>Responsible to facilitate the movement of products/equipment/materials out of the country, via air freight, in accordance with organizational policy and procedure, and within compliance of relevant local, country and international laws and processes. To provide customer service to exporting customers: bookings, rates, document production, accounting, agent interaction, and problem resolution.<br/><br/><strong>ESSENTIAL FUNCTIONS</strong><strong>:<br/><br/></strong><ul><li>Prepare/coordinate the necessary documentation for the efficient, cost-effective and lawful execution of all air export activities.</li><li>Coordinate cargo pick up/transfer. Monitor status.</li><li>Communicate with export related authorities, and customers and suppliers, in all relevant territories and countries, as necessary to ensure efficient, positive and lawful relations, support and activities.</li><li>Manage/update carrier/vendor rates. Obtain spot rates when necessary.</li><li>Communicate/correspond with overseas agents and clients in a timely manner. To include pre alert, rate requests, shipment status.</li><li>Track shipments and update customers/agents of status.</li><li>Create and maintain customer files.</li><li>Customer invoicing and payable approval.</li><li>Audit files to ensure accuracy and completion.</li><li>Interaction with coworkers in a professional and courteous manner.</li><li>JWS entry and documentation.</li><li>Assist other departments/divisions as needed, or when requested by department or branch manager.<br/><br/></li></ul><strong>SUPERVISORY RESPONSIBILITIES</strong><strong>:<br/><br/></strong>None<br/><br/><strong>QUALIFICATIONS</strong><strong>: <br/><br/></strong><ul><li>Minimum 3 -5 years’ experience in handling air shipments.</li><li>High School Diploma or GED.</li><li>Additional languages are a plus.</li><li>Geographical knowledge requested</li><li>Team player.</li><li>Ability to work in a fluid work environment and be able to effectively deal with unexpected situations.</li><li>Excellent written and verbal communication skills.</li><li>Think pro-actively and address work challenges with diplomacy, using effective problem resolution skills.</li><li>Be respectful to management and co-workers.</li><li>Able to perform the essential duties of this position without posing a “direct threat” to the health or safety of self or others.</li><li>Able to interact positively and effectively with co-workers, subordinates and supervisors.<br/><br/></li></ul><strong>EDUCATION/EXPERIENCE</strong><strong>:<br/><br/></strong><ul><li>High School Diploma or GED.</li><li>Additional languages are a plus.</li><li>Geographical knowledge requested.</li><li>Previous knowledge of Cargo Wise, a plus.</li><li>Experience in freight forwarding industry is a plus<br/><br/></li></ul><strong>ENVIRONMENT</strong><strong>:<br/><br/></strong>100% performed in climate-controlled internal office environment working under normal office conditions. Travel will be (up to__ %) required in support of the position’s responsibilities.<br/><br/>While performing the duties of this job, the employee is regularly required to sit, stand, walk, use hands and fingers to feel and handle, reach with arms and hands, talk and hear. While performing the duties of this job, the employee frequently is required to stop, kneel and crouch, lift weight or exert a force up to a maximum of 25 pounds. This position requires employee to frequently work in a fluid, fast paced environment.<br/><br/><strong>ADDITIONAL:<br/><br/></strong>The responsibilities associated with this job will change from time to time in accordance with the Company’s business needs. More specifically, the incumbent may be required to perform additional and/or different responsibilities from those set forth above.<br/><br/>The above declarations are not intended to be an all-inclusive list of the duties and responsibilities of the job described, nor are they intended to be such a listing of the skills and abilities required to do the job. Rather, they are intended only to describe the general nature of the job.<br/><br/>As an equal opportunity employer, we comply with the California pay transparency law. We will not discriminate against any applicant or employee based on race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, genetic information, or any other applicable legally protected basis. The base salary range for this position is $50,000 to $60,000 annually, in accordance with the California pay transparency law.<br/><br/>DEFINITIONS: (if any abbreviation, the meaning needs to be inserted)<br/><br/><strong><em>Management retains discretion to add or change duties of this position at any time.<br/><br/></em></strong><em>JAS Forwarding (USA), Inc. is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, ethnicity, disability, religion, national origin, gender, gender identity, gender expression, marital status, sexual orientation, age, protected veteran status, or any other characteristic protected by law.<br/><br/>Where required by state law and/or city ordinance; this employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS), with information from each new employee’s Form I-9 to confirm work authorization.<br/><br/></em><strong>NOTICE TO APPLICANTS<br/><br/></strong>JAS USA IS A CUSTOMS BROKER, GOVERNED BY FEDERAL REGULATION. FEDERAL REGULATIONS PROVIDE THAT JAS MAY HAVE IT BROKERAGE LICENSE SUSPENDED OR REVOKED IF IT “KNOWINGLY EMPLOYED, OR CONTINUES TO EMPLOY, ANY PERSON WHO HAS BEEN CONVICTED OF A FELONY, WITHOUT WRITTEN APPROVAL OF THAT EMPLOYMENT FROM THE ASSISTANT COMMISSIONER.” JAS WILL PERFORM A BACKGROUND CHECK TO DETERMINE IF YOU HAVE BEEN CONVICTED OF A FELONY AND IF SO, ABSENT SPECIAL CIRCUMSTANCES, YOU WILL NOT BE HIRED OR WILL BE TERMINATED IMMEDIATELY.", "responsibilities": "Responsible to facilitate the movement of products/equipment/materials out of the country, via air freight, in accordance with organizational policy and procedure, and within compliance of relevant local, country and international laws and processes. To provide customer service to exporting customers: bookings, rates, document production, accounting, agent interaction, and problem resolution.", "qualifications": {"required": "Minimum 3 -5 years’ experience in handling air shipments.", "preferred": "High School Diploma or GED., Additional languages are a plus., Geographical knowledge requested., Previous knowledge of Cargo Wise, a plus., Experience in freight forwarding industry is a plus"}, "skills": ["Air Freight", "Customer Service", "Documentation", "Freight Forwarding", "International Logistics", "Supply Chain Management"], "postedDate": "2 days ago", "salary": {"amount": "50,000.00 - 60,000.00", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4006139455"}