{"jobTitle": "Junior Digital Marketing Compliance Specialist", "company": {"name": "GOBankingRates", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "60,000.00 - 65,000.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "GOBankingRates.com is a personal finance news and features website dedicated to helping visitors Live Richer™<br/><br/>From tips on saving money to investing for retirement or finding a good interest rate, GOBankingRates helps turn financial goals into milestones and money dreams into realities. Its content is regularly featured on top-tier media outlets, including MSN, Yahoo!, FOX Business, CNBC, Business Insider, USA Today and dozens of others. GOBankingRates specializes in connecting consumers with the financial institutions and products that best match their needs<br/><br/><strong>What's Interesting About This Role?<br/><br/></strong>You'll play a crucial role in maintaining and enhancing our advertiser relationships by ensuring strict adherence to regulatory standards. You will provide final approval on all organic content our editorial team produces, ensuring we are complying with all card issuer regulations. You'll stay ahead of industry changes, execute vital updates in WordPress, and provide strategic support to our Credit Card team, driving growth and optimization. If you're detail-oriented, a strong writer, and passionate about personal finance, this is the perfect opportunity to make a significant impact! If you thrive in a fast-paced, collaborative environment and want to make an immediate impact on our day-to-day operations then this is the role for you!<br/><br/><strong>How Will You Make an Impact?<br/><br/></strong><ul><li>Support all compliance-related aspects of our advertiser relationships, working directly with the advertising platforms to deliver on their requests.</li><li>Keep abreast of regulatory developments as well as evolving best practices. Keep an organized timeline of all upcoming compliance changes and advertiser updates.</li><li>Execute all advertiser updates within our content management system in WordPress.</li><li>Conduct audits to ensure adherence to standards and regulations.</li><li>Prepare reports for senior management and external regulatory bodies as appropriate. </li><li>Rewrite copy from the editorial team, taking complex regulatory rules and implementing them in a way consumers can understand. </li><li>Become a credit card compliance expert, updating internal teams on specific changes within the industry that will impact how they create and promote our content.</li><li>Provide additional operational support to the Credit card team, facilitating the growth of our credit card vertical including landing page optimization, competitive analysis, and organic and paid social campaign management.<br/><br/></li></ul><strong>What Do You Bring To Us?<br/><br/></strong><ul><li>Bachelor's degree or equivalent work experience</li><li>Self-motivated with at least 2 years of experience in Digital Operations, Compliance, Advertiser Management, or Digital Marketing </li><li>Extremely detail-oriented and organized </li><li>Ability to manage complex projects in a fast-changing environment </li><li>Strong interpersonal and written communication skills </li><li>Computer Skills; Microsoft Excel, Microsoft Word, PowerPoint </li><li>Basic knowledge of html a plus </li><li>Experience with WordPress, Jira, Tableau, and Confluence a plus </li><li>Intermediate analytical skills (We have an Analytics team, but we all make data driven decisions daily!) <br/><br/></li></ul><strong>The salary range for this role ranges from $60,000 - $65,000 annually depending on </strong><strong>job-related knowledge, skills, </strong><strong>experience, and location.<br/><br/></strong><strong>Benefits<br/><br/></strong><ul><li>Competitive salary with excellent growth opportunity; we pride ourselves in having a team that exudes leadership, high initiative, creativity and passion.</li><li>Awesome medical, dental and vision plans with heavy employer contribution</li><li>Paid maternity leave and paternity leave programs</li><li>Paid vacation, sick days and holidays</li><li>Company funding for outside classes and conferences to help you improve your skills</li><li>Contribution to student loan debt payments after the first year of employment</li><li>401(k) -- employees can start contributing immediately. After the first year, GOBankingRates matches your contribution up to 4% of your salary<br/><br/></li></ul>A note about our new norm: The world has changed and we know it's important to adapt and to do our part to do what's best for our team. Our number one priority is to have our team feel safe, balanced and connected. We're committed to providing our teams with the best resources and tools to navigate this new virtual world that we're living in. We've also reinvented the ways in which we recognize, celebrate, and engage with each other to keep our culture strong!<br/><br/>Here's a peek into our world at GOBankingRates - <br/><br/><ul><li>Our teams are working remotely 100% for the foreseeable future. We're in the digital media space, so we're mobile and flexible!</li><ul><li>*Option to work from an office (if you need to get away!)</li></ul><li>Tools &amp; resources are available to keep our team connected across North America. (JIRA, Trello, Slack, Zoom and so much more!)</li><li>To keep our community engaged and connected, virtual team building events are held weekly and monthly.</li><li>For wellness and balance, weekly virtual fitness classes such as yoga are available.</li><li>To care for the local communities that we're a part of across the U.S our team members host socially distanced philanthropic events every quarter.</li><li>And most importantly, we've committed to consistent and transparent communication to help us all stay informed, engaged and to keep us on our path to success and #greatness.<br/></li></ul><em>We are an equal-opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.</em>", "responsibilities": "You'll play a crucial role in maintaining and enhancing our advertiser relationships by ensuring strict adherence to regulatory standards. You will provide final approval on all organic content our editorial team produces, ensuring we are complying with all card issuer regulations. You'll stay ahead of industry changes, execute vital updates in WordPress, and provide strategic support to our Credit Card team, driving growth and optimization.", "qualifications": {"required": "Bachelor's degree or equivalent work experience, Self-motivated with at least 2 years of experience in Digital Operations, Compliance, Advertiser Management, or Digital Marketing, Extremely detail-oriented and organized, Ability to manage complex projects in a fast-changing environment, Strong interpersonal and written communication skills, Computer Skills; Microsoft Excel, Microsoft Word, PowerPoint, Basic knowledge of html a plus, Experience with WordPress, Jira, Tableau, and Confluence a plus, Intermediate analytical skills (We have an Analytics team, but we all make data driven decisions daily!)"}, "skills": ["WordPress", "Jira", "Tableau", "Confluence", "Microsoft Excel", "Microsoft Word", "PowerPoint", "HTML"], "postedDate": "3 days ago", "benefits": "Competitive salary with excellent growth opportunity; we pride ourselves in having a team that exudes leadership, high initiative, creativity and passion., Awesome medical, dental and vision plans with heavy employer contribution, Paid maternity leave and paternity leave programs, Paid vacation, sick days and holidays, Company funding for outside classes and conferences to help you improve your skills, Contribution to student loan debt payments after the first year of employment, 401(k) -- employees can start contributing immediately. After the first year, GOBankingRates matches your contribution up to 4% of your salary", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4006368431"}