{"jobTitle": "Operations Coordinator", "company": {"name": "Essex Property Trust", "industry": "Real Estate", "size": "51-200 employees", "location": "Fountain Valley, CA"}, "location": "Fountain Valley, CA", "jobType": "Operations", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$22.60 - $31.73", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Real Estate", "description": "The Operations Coordinator position is responsible for a variety of maintenance related tasks to ensure the efficient daily operations of a business. Duties typically include performing administrative tasks, assisting with project management, and ensuring compliance.", "responsibilities": "Prioritizes, assigns, and monitors service requests via Sightplan. In coordination with the Maintenance Supervisor, establishes daily work schedules of maintenance personnel. Schedules pre-move out inspections and final move out inspections with resident. Creates purchase orders for vendor related services. Schedules vendors for unit turns based on pre-move out inspection and final move out inspection information provided by Maintenance Supervisor. Inputs unit turnover vendor and maintenance work orders into Sightplan and monitors accordingly. Follows up on CMS projects with property and CMS Manager including preventative maintenance needs with resource management to ensure efficient and thorough completion. Contacts residents verbally or electronically ensuring the work was completed professionally, thoroughly, and requesting completion of survey upon receipt. Recommends and implements improvements where appropriate based on feedback received. In partnership with Maintenance Supervisor, purchases supplies, equipment, and services as necessary with orders provided via Maintenance Supervisor. Monitors and escalates as needed budgeted variances to General Community Manager.", "qualifications": {"required": "High school diploma or equivalent required, college degree preferred. Customer service experience preferred. Proven organizational and time management skills. Valid driver license and automobile insurance. Knowledge of Microsoft Suite and property management software.", "preferred": ""}, "skills": ["Customer Service", "Organizational Skills", "Time Management", "Microsoft Suite", "Property Management Software"], "postedDate": "3 days ago", "applicationDeadline": "", "benefits": "Competitive salaries, career growth, medical, dental, vision, paid parental leave, 401k employer match, excellence rewards, wellness programs, 10 paid holidays, 15 PTO days, housing discount of 20%.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4006143506"}