{"jobTitle": "Drybar Shops", "company": {"name": "Drybar", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Retail", "description": "At Drybar, our philosophy is simple Focus on one thing and be the best at it. For us that’s blowouts. Our tagline says it all No cuts. No color. Just blowouts.<br/><br/><strong>Drybar Assistant Shops</strong>®<strong> Manager / Cosmetologist Benefits<br/><br/></strong><ul><li>Competitive hourly wages beginning at $22.00 per hour plus tips, retail &amp; productivity bonuses, $100 anniversary gift and referral bonuses! ($1.50 for every add-on performed. Over 20 blowouts, you make $3 extra for each blowout, get up to $10 for every membership you sell)</li><li>Medical, Dental &amp; Vision Benefits for ALL employees. Access to Wellable and EAP access!</li><li>Paid Training on “Proper Anatomy of a Drybar Blowout!”</li><li>Complimentary access &amp; discounts to Vidal Sassoon online membership program for continued education.</li><li>We LOVE to promote from within! If you have what it takes, we got you covered.</li><li>FREE BLOWOUTS for all employees!<br/><br/><br/></li></ul><strong>We are looking for an Assistant Shop Manager who has<br/><br/></strong><ul><li>A current and valid cosmetology license for the state in which you are applying.</li><li>Shampoo, blow-dry and amazing hair styling &amp; finishing skills. Ability to do a blowout in under 45 minutes!</li><li>Supervise shop staff on any given shift assigned Bartenders &amp; Stylist &amp; Shift Lead.</li><li>Lead team members to enhance field performance, client experience, product sales, cost control, staffing, team development, client experience and membership sales.</li><li>Ensure talent development within shop to maximize performance, drive revenue, and achieve annual business goals.</li><li>Work closely with Human Resources to cultivate employee relations, performance management, culture &amp; development, values, safety initiatives and training.</li><li>Monitor shop inventory regularly check back bar and retail supplies, place orders when needed to meet supply level standards.</li><li>Work closely with your Area Manager to maximize the shops financial potential, by achieving daily sales metrics and labor budget goals.</li><li>Train new staff educate on using Booker and Drybar’s 10 core values. Ensure Stylists are completing blowouts in under 45 minutes.</li><li>A desire to provide exceptional service not only to our clients but to our staff. Implement problem solving strategies and maintain awareness.</li><li>Responsible for reporting all shop inventory, regularly check all retail supplies, assist with stocking products and supplies.</li><li>Strong communication skills and a commitment and dedication to customer service.</li><li>Ensure that all company procedures and policies, federal, state, and local regulations are followed. Ensure all Drybar’s timekeeping policy and supervisor policy addendum.</li><li>Responsible for reporting all time worked for self and others in a timely fashion.</li><li>Resolve team member relations and customer issues ensuring the company is protected against liability with mindfulness of shop morale and culture. When in doubt, ask for help! We’re here for you! #wearefamily<br/><br/><br/></li></ul>Apply today to see if the Drybar Shops® brand is a great fit for you. We would love to meet you and discuss the possibility of a long and rewarding career!<br/><br/>©2024 DB Franchise, LLC (“DBF”). Each Drybar® shop is independently owned and operated. Franchise owners are solely responsible for all employment decisions and matters regarding their independently owned and operated Shops. All individuals hired by franchise owners’ shops are their employees, not those of DBF. Drybar® + design is are registered trademarks owned by Helen of Troy Limited and used by DBF under license.", "postedDate": "3 days ago", "salary": {"amount": "10.00 - 19.50", "currency": "USD"}, "skills": [], "url": "https://www.linkedin.com/jobs/view/4006368280"}