{"jobTitle": "Shipping & Receiving Clerk", "company": {"name": "ABL Space Systems", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "23 - 30", "currency": "USD"}, "jobFunction": "Distribution and Supply Chain", "industry": "Truck Transportation", "description": "ABL Space Systems is driven by the vision that in ten years, missions to space will launch every day from around the world. We've set out to assure global access to space through the development of a low-cost launch vehicle and a modular ground system, RS1 and GS0.<br/><br/>Behind our business model is an exceptional team. Engineers, technicians and operators at ABL thrive on creating simple yet effective systems to tackle the challenge that space launch presents.<br/><br/>Launch is just the beginning. Join ABL in paving the way for the next-generation space platform.<br/><br/>As a Shipping &amp; Receiving Clerk, you will be responsible for the expedient movement of designated items needed to support production, test, and launch operations. Primary functions of the Shipping &amp; Receiving Clerk include the packaging, manifesting, and tracking of materials as requested by internal customers and external vendors. As well as to process all incoming deliveries routing them to the designated destinations, whether that be to Inventory, Inspection, the Production floor, or to someone's desk.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Process all outbound shipments via the shipping request queue, coordinate with carriers and freight forwarders for pick-up and delivery scheduling.</li><li>Package and manifest various shipments (parcel, LTL, large freight), ensuring product integrity and accurate documentation.</li><li>Ensure compliance with shipping regulations, including hazardous shipping and international trade requirements.</li><li>Receive incoming packages, verify conformity with paperwork, and manage receipt transaction accuracy within the SIA system.</li><li>Deliver received packages to the proper drop zone areas (receiving Inspection, inventory, production floor or to the personal package racks)<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>High school diploma or GED</li><li>1+ years in a shipping and receiving role.<br/><br/></li></ul><strong>Preferred Skills And Experience<br/><br/></strong><ul><li>2+ years in a shipping and receiving role</li><li>Experience?with ERP system(s)</li><li>Strong computer skills, including familiarity with the Microsoft, Excel and Power Point</li><li>Comprehension of shipping international goods</li><li>Comprehension of HAZMAT shipping and receiving</li><li>Comprehension of shipping and receiving temperature sensitive item</li><li>Comprehension of shipping and receivingESD sensitive item</li><li>Experience with scanning equipment (RF scanner, handheld scanner, etc.)</li><li>Experience operating?a forklift or other material handling motorized vehicles and equipment<br/><br/></li></ul>$23 - $30 an hour<br/><br/>This is the lowest to highest compensation range we reasonably and in good faith believe we would pay for this role at the time of this posting. We may ultimately pay more or less than the posted range, and the range may be modified in the future. An employee's pay position within the compensation range will be based on several factors including, but not limited to, relevant education, qualifications, certifications, experience, skills, geographic location, performance, and business or organizational needs.<br/><br/><strong>In Addition To Salary And Equity, We Offer<br/><br/></strong><ul><li>Low cost medical, dental, and vision insurance plans</li><li>Company paid life insurance LTD coverage</li><li>4% 401k match</li><li>Student loan repayment assistance program</li><li>Paid parental leave</li><li>Family planning assistance program</li><li>Company paid financial wellness program</li><li>Flexible vacation policy for exempt employees</li><li>Relocation bonus offered to qualified candidates<br/><br/></li></ul>ITAR Requirement<br/><br/>This position requires access to information protected under US export control laws, including the International Traffic in Arms Regulations and/or the Export Administration Regulations. As such, US person status (including US citizens, U.S. permanent residents, individuals granted U.S. asylum status, or individuals admitted in U.S. refugee status) is a required qualification for this position.<br/><br/>Equal Opportunity Employer<br/><br/>We are an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), sexual orientation, gender identity and/or expression, national origin, protected veteran status, disability, genetics, or citizenship status (when otherwise legally authorized to work and access export-controlled data) and will not be discriminated against on the basis of such characteristics or any other status protected by the laws or regulations in the locations where we operate. We encourage applicants of all ages.", "responsibilities": "Process all outbound shipments via the shipping request queue, coordinate with carriers and freight forwarders for pick-up and delivery scheduling. Package and manifest various shipments (parcel, LTL, large freight), ensuring product integrity and accurate documentation. Ensure compliance with shipping regulations, including hazardous shipping and international trade requirements. Receive incoming packages, verify conformity with paperwork, and manage receipt transaction accuracy within the SIA system. Deliver received packages to the proper drop zone areas (receiving Inspection, inventory, production floor or to the personal package racks)", "qualifications": {"required": "High school diploma or GED 1+ years in a shipping and receiving role.", "preferred": "2+ years in a shipping and receiving role Experience?with ERP system(s) Strong computer skills, including familiarity with the Microsoft, Excel and Power Point Comprehension of shipping international goods Comprehension of HAZMAT shipping and receiving Comprehension of shipping and receiving temperature sensitive item Comprehension of shipping and receivingESD sensitive item Experience with scanning equipment (RF scanner, handheld scanner, etc.) Experience operating?a forklift or other material handling motorized vehicles and equipment"}, "skills": ["ERP", "Microsoft", "Excel", "PowerPoint", "HAZMAT", "Forklift"], "postedDate": "5 days ago", "benefits": "Low cost medical, dental, and vision insurance plans Company paid life insurance LTD coverage 4% 401k match Student loan repayment assistance program Paid parental leave Family planning assistance program Company paid financial wellness program Flexible vacation policy for exempt employees Relocation bonus offered to qualified candidates", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4006843607"}