{"jobTitle": "Retail Sales Representative", "company": {"name": "MarketSource Inc.", "industry": "Advertising Services", "size": "Not specified", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Sales and Business Development", "industry": "Advertising Services", "description": "MarketSource, Inc. is a premier provider of integrated sales & marketing solutions to Fortune 500 companies. We offer a dynamic environment that fosters creativity and provides unlimited opportunities for personal and professional growth. MarketSource is currently searching for a full-time Retail Sales Representative to work at major retailer locations. This position is designed to increase sales and revenue within the wireless ecosystem: electronics, mobile phones, accessories, and digital service. As a full-time sales representative you will be responsible for proactively approaching customers within retailer and assisting in various wireless products and accessory sales while providing extraordinary customer service.", "responsibilities": "Driving sales productivity and customer satisfaction within retail locations on various Wireless products, accessories and services to customers. Engaging in side-by-side selling with retail associates. Participating in in-store promotions, and coordinating with appropriate personnel. Participating in wireless sales events in retailer locations.", "qualifications": {"required": "Physical ability to perform tasks that may require prolonged bending, stooping, reaching, twisting, lifting, pushing, pulling, walking, standing and moving items. Requires the ability to move around the store, assist customers and maneuver merchandise when necessary. Performs additional duties as assigned.", "preferred": "Not specified"}, "skills": [], "postedDate": "5 days ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4006585118"}