{"jobTitle": "Pricing Analyst, Virtual Interlining (Remote)", "company": {"name": "Hopper", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "100,000.00/yr - $230,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "About The Job<br/><br/>Virtual Interlining offers customers additional travel options by combining together multiple individual travel segments through self-transfers. These unique itineraries unlock new destinations, save customers time and money, and offer customers increased selection when they are booking travel.<br/><br/>Hopper has developed its own Virtual Interlining engine and has been selling this content within our OTA business for several years. More recently, we’ve started to offer this type of content to other businesses selling travel. This new branch of the business, HTS Connect, distributes Virtual Interlining itineraries via white-label websites and API integrations to businesses selling travel outside of the Hopper ecosystem.<br/><br/>As the Pricing Analyst on Virtual Interlining, you will be responsible for providing insights into our inventory’s competitiveness and performance across channels. You will build reporting and analyses to ensure we are consistently providing our customers with the best travel options worldwide.<br/><br/>What Would Your Day-to-day Look Like<br/><br/>\n<ul><li>Create dashboards and visualizations providing insights into airline pricing trends and changes over time</li><li>Provide daily insights and reporting benchmarking our contents’ performance against the market competition</li><li>Analyze internal and external data including industry trends, pricing strategies, and competitor pricing</li><li>Identify opportunities to improve our competitiveness in key markets through adding additional inventory, making pricing modifications, adjusting routing, or other strategies</li><li>Drill down into pricing and purchase trends to identify the causes<br/><br/></li></ul>An Ideal Candidate Has<br/><br/>\n<ul><li>2-4 years experience working in an analytical role with airlines or OTAs</li><li>Strong SQL skills (joins, group bys, window functions)</li><li>Strong analysis and critical thinking</li><li>Experience using Microsoft Excel or Google Sheets (formulas, pivot tables)</li><li>Ability to communicate effectively verbally and in writing with all levels of management and people of varying technical backgrounds</li><li>Experience with Bigquery and Looker Studio is a plus </li><li>Demonstrated ability to work autonomously to plan and organize work with minimal supervision<br/><br/></li></ul>Perks And Benefits Of Working With Us<br/><br/>\n<ul><li>Well-funded and proven startup with large ambitions, competitive salary and the upsides of pre-IPO equity packages.</li><li>Unlimited PTO.</li><li>Carrot Cash travel stipend.</li><li>Access to co-working space on demand through FlexDesk AND Work-from-home stipend.</li><li>Please ask us about our very generous parental leave, much above industry standards!.</li><li>Entrepreneurial culture where pushing limits and taking risks is everyday business.</li><li>Open communication with management and company leadership.</li><li>Small, dynamic teams = massive impact.</li><li>100% employer paid Medical, Dental and Vision coverage for employees.</li><li>Access to Disability &amp; Life insurance.</li><li>Health Reimbursement Account (HRA).</li><li>DCA/ FSA and access to 401k plan.<br/><br/></li></ul>#posttoexternal<br/><br/>More About Hopper<br/><br/>At Hopper, we are on a mission to become the leading travel platform globally – powering Hopper’s mobile app, website and our B2B business, HTS (Hopper Technology Solutions). By leveraging massive amounts of data and advanced machine learning algorithms, Hopper combines its world-class travel agency offering with proprietary fintech products to bring transparency, flexibility and savings to travelers globally. We have developed several unique fintech solutions that address everything from pricing volatility to trip disruptions – helping people travel better and save more on their trips.<br/><br/>The Hopper platform serves hundreds of millions of travelers globally and continues to capture market share around the world. Ranked the third largest online travel agency in North America, the Hopper app has been downloaded over 120 million times and has become largely popular among younger travelers – with 70% of its users being Gen Z and millennials.<br/><br/>While everyone knows us as the Gen Z and Millennial travel app, Hopper has evolved to become much more than that. In recent years, we’ve grown into a global travel agency and travel fintech provider that powers some of the world’s largest brands.<br/><br/>Through HTS, our B2B division, the company supercharges its partners’ direct channels by integrating our fintech products on their sites or powering end-to-end travel portals. Today, our partners include leading travel brands like Capital One, Nubank, Air Canada and many more.<br/><br/>Here are just a few stats that demonstrate the company’s recent growth:<br/><br/>Hopper sells billion worth of travel and travel fintech every year. In 2023, over 1.3 billion trips were planned through the Hopper app and our HTS partnerships.<br/><br/>Our fintech products – including Price Freeze, Flexibility for Any Reason and Flight Disruption Assistance – have exceptionally strong CSAT because the terms are always clear, and customers receive instant, no-questions-asked resolutions.<br/><br/>Almost 30% of our app customers purchase at least one fintech product when making a booking; and consumers are 1.6x more likely to repurchase if they add fintech to their booking vs if they booked just travel.<br/><br/>Given the success of its fintech products, Hopper launched a B2B initiative, HTS (Hopper Technology Solutions), which represents more than 50% of the business.<br/><br/>Through HTS, any travel provider (airlines, hotels, banks, travel agencies, etc.) can integrate and seamlessly distribute Hopper’s fintech or travel inventory on their direct channels. As its first HTS partnership, the company partnered with Capital One to co-develop Capital One Travel, a new travel portal designed specifically for cardholders. Other HTS partners include Air Canada, Uber, CommBank, Nubank, Flair Airlines with many more in the pipeline.<br/><br/>Featured in Apple’s Best of the App Store list of Essential Travel Apps in 2023 and recognized by the likes of Fast Company’s Most Innovative Companies, Hopper has been downloaded over 120 million times and continues to have millions of new installs each month. Hopper is now the #3 largest online travel agency in North America and 70% of our app customers are Gen-Z and millennials travelers.<br/><br/>Hopper has raised over $750 million USD of private capital and is backed by some of the largest institutional investors and banks in the world. Hopper is primed to continue its acceleration as the world’s fastest-growing mobile-first travel marketplace.<br/><br/>Come take off with us!<br/><br/>The yearly total compensation for this position ranges from $100,000 to $230,000 USD. Compensation will be determined by candidates' relevant qualifications, knowledge, skills and work experience. Total compensation can include a solid base salary and can also include equity (options / RSUs), sign-on bonus and other potential incentives.", "responsibilities": "Create dashboards and visualizations providing insights into airline pricing trends and changes over time\nProvide daily insights and reporting benchmarking our contents’ performance against the market competition\nAnalyze internal and external data including industry trends, pricing strategies, and competitor pricing\nIdentify opportunities to improve our competitiveness in key markets through adding additional inventory, making pricing modifications, adjusting routing, or other strategies\nDrill down into pricing and purchase trends to identify the causes", "qualifications": {"required": "2-4 years experience working in an analytical role with airlines or OTAs\nStrong SQL skills (joins, group bys, window functions)\nStrong analysis and critical thinking\nExperience using Microsoft Excel or Google Sheets (formulas, pivot tables)\nAbility to communicate effectively verbally and in writing with all levels of management and people of varying technical backgrounds\nDemonstrated ability to work autonomously to plan and organize work with minimal supervision", "preferred": "Experience with Bigquery and Looker Studio is a plus"}, "skills": ["SQL", "Analysis", "Microsoft Excel", "Google Sheets", "Communication", "Bigquery", "Looker Studio"], "postedDate": "1 day ago", "benefits": "Well-funded and proven startup with large ambitions, competitive salary and the upsides of pre-IPO equity packages.\nUnlimited PTO.\nCarrot Cash travel stipend.\nAccess to co-working space on demand through FlexDesk AND Work-from-home stipend.\nPlease ask us about our very generous parental leave, much above industry standards!.\nEntrepreneurial culture where pushing limits and taking risks is everyday business.\nOpen communication with management and company leadership.\nSmall, dynamic teams = massive impact.\n100% employer paid Medical, Dental and Vision coverage for employees.\nAccess to Disability &amp; Life insurance.\nHealth Reimbursement Account (HRA).\nDCA/ FSA and access to 401k plan.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4006111636"}