{"jobTitle": "Account Manager - Entry Level", "company": {"name": "Visionary Marketing Group", "industry": "Internet Publishing", "size": "Not specified", "location": "Fullerton, CA"}, "location": "Fullerton, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Our firm has a very high success rate of developing SPORTS MINDED individuals into TOP PERFORMERS in a management capacity. We are seeking inexperienced professionals that would like to take their “winning mindsets\" and apply them to lucrative marketing and business careers. We're looking for full-time TEAM LEADS to take on immediate marketing and account management responsibilities. Applicants must be highly motivated, sports-minded, well organized, ambitious, and \"people first\" oriented. There is NOT a glass ceiling - growth potential should be your biggest priority here. Position Benefits: Company Events, Merit-based advancement, Uncapped bonuses & incentive plan, Competitive wages, Company-paid travel opportunities, Weekly bonuses such as gift cards, tickets, sports events, dinners, and concerts, electronics, Work-life balance, Employee achievement and recognition, Mentorship, Formal rotational training, Personal/sick days, Vacation days, Fun company events for philanthropy, team building, networking opportunities, etc. Responsibilities Include: Acquisition of new accounts, Retention of existing accounts, Team management, Campaign management, Face to Face Negotiations and Sales Presentations. Areas of Training: People skills and sales skills, Leadership development, Business and organizational skills, Time management, Finances (personal and business). We Provide: The fast-paced, fun work environment, Career advancement opportunities, Thorough on the job training.", "responsibilities": "Acquisition of new accounts, Retention of existing accounts, Team management, Campaign management, Face to Face Negotiations and Sales Presentations", "qualifications": {"required": "Ability to work in a fast-paced environment, taking initiative & prioritizing multiple tasks with minimal supervision, Ability to work in a demanding and dynamic environment with the flexibility to adjust to changing priorities and deadlines, Must be resourceful in unfamiliar tasks, Understanding of analytical techniques applied to human resource management, Strong interpersonal, organizational, verbal, and written communication skills, Ability to work with all levels throughout the organization and cross-functionally, Ability to maintain confidentiality and professionalism, Displayed strong attention to detail, the ability to prioritize, handle multiple tasks, and keep deadlines with minimal supervision", "preferred": "Not specified"}, "skills": [], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "Company Events, Merit-based advancement, Uncapped bonuses & incentive plan, Competitive wages, Company-paid travel opportunities, Weekly bonuses such as gift cards, tickets, sports events, dinners, and concerts, electronics, Work-life balance, Employee achievement and recognition, Mentorship, Formal rotational training, Personal/sick days, Vacation days, Fun company events for philanthropy, team building, networking opportunities, etc.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4006309649"}