{"jobTitle": "Account Manager - Entry Level", "company": {"name": "OMI", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Maritime", "description": "Have you heard the phrase “love what you do, and you will never work a day in your life”? <br/><br/>At our firm we live that, every day. When you’re passionate about what you do, you love the people you do it with, and you’re constantly growing as a person, time flies, and you’re always having fun.<br/><br/><ul><li>Are you driven and looking for a career that will not only empower your personal and professional growth but will also allow you to build the career and future you desire?</li><li>Are you often described as a confident and collaborative leader?</li><li>Are you looking to BUILD opportunities for yourself and for others?<br/><br/></li></ul><strong>If the above describes you, then please keep reading!<br/><br/></strong><strong>Entry Level Account Manager Responsibilities<br/><br/></strong><ul><li>Through training become a master in our sales and marketing techniques designed to engage the consumer, educate them on their product/service options and close the best possible deal for their household</li><li>We know not every interaction ends in a sale. Your ultimate goal is to deliver an outstanding customer experience, build strong relationships with the brand and represent the company with integrity to facilitate future sales</li><li>Track new customer acquisitions, follow compliance protocols, and leverage for referrals in the local area</li><li>Once you are an expert in all things customer service and sales support, then it’s time to elevate your role to its purest form as a corporate trainer and leader. Here you will be responsible for training and developing new hires for maximum performance and setting the right example as a supportive and competent leader.</li><li>Ensure your team has accurate account updates, meets customer service and sales goals, as well as market representation.<br/><br/></li></ul><strong>Entry Level Account Manager Development<br/><br/></strong><ul><li>Interviewing</li><li>Sales and marketing training fundamentals</li><li>Team building and mentoring</li><li>Human Resources and administration duties</li><li>Basic business management, finances, and accounting<br/><br/></li></ul><strong>Qualifications Of An Entry Level Account Manager<br/><br/></strong><ul><li>2+ years in a related industry with demonstrated leadership ability</li><li>Competitive nature with a winning mentality needed to excel in a leadership role</li><li>Sports minded and Energetic team players</li><li>Team captains ready to grow and train</li><li>Positive Energy</li><li>Candidates who are serious about a long term career<br/><br/></li></ul><strong>Why Us?<br/><br/></strong><ul><li>We start all our assistant managers in a complete training program for the sole purpose of developing a strong leadership team from within</li><li>We do not believe in tenure or seniority, we promote to management those who get the job done and are top performers in our sales and marketing departments</li><li>We focus on developing and enhancing the competitive nature and leadership potential within every potential candidate. This is a valuable opportunity for those who have experience in sports marketing, advertising, team leadership, sales, entrepreneurship, and anybody with a competitive mindset. In the past, our top Assistant Managers have participated in Soccer, Football, Basketball, Lacrosse, Tennis, Golf, Dance, Baseball, and Hockey as a team-player, coach, or captain.<br/><br/></li></ul>Powered by JazzHR<br/><br/>", "postedDate": "3 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4006320821"}