{"jobTitle": "Virtual Account Executive", "company": {"name": "Bronson Kinkade Consulting", "location": "Altadena, CA"}, "location": "Altadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Note: We don't consider International candidates.<br/><br/>Excited to Begin Your Sales Adventure?<br/><br/>Join our enthusiastic team as a Virtual Account Executive on a 1099 contract basis. Whether you're a seasoned sales expert or just beginning your career, this opportunity allows you to make a substantial impact while enjoying the perks of remote work. With our support, you can unlock your earning potential and craft a rewarding and fulfilling career.<br/><br/>Responsibilities for Virtual Account Executive:<br/><br/><ul><li>Develop and nurture client relationships through effective communication</li><li>Create compelling and insightful product presentations</li><li>Conduct virtual demonstrations, showcasing key features and benefits</li><li>Strive to achieve individual and team sales targets</li><li>Clearly communicate value propositions to potential customers</li><li>Engage with warm leads, guiding them through the sales process</li><li>Maintain precise and up-to-date records of all sales activities<br/><br/></li></ul>What's in it for You as a Virtual Account Executive at Our Organization?<br/><br/><ul><li>Work remotely, eliminating commute times and allowing you to create a workspace that suits you</li><li>Benefit from an uncapped commission system, where your earnings are directly influenced by your performance in this 1099 role</li><li>No prior sales experience required; comprehensive training on our products/services, sales techniques, and virtual communication tools will be provided</li><li>No cold calling; we offer access to top-quality leads, enabling you to concentrate on closing deals and reaching your full potential<br/><br/></li></ul>Start your fulfilling sales career with us and take the first step on your journey today!<br/><br/>Disclaimer: This is a 1099 commission only position. You will be offering financial products like IUL’s, Annuities, Life Insurance, etc. to people who have reached out requesting more information.<br/><br/>Powered by JazzHR<br/><br/>0ExhcUiDd1", "postedDate": "3 days ago", "remoteWork": "Yes", "skills": [], "url": "https://www.linkedin.com/jobs/view/4006846249"}