{"jobTitle": "Business Analyst (US)", "company": {"name": "Cleeng", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Analyst", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "<strong>Overview<br/><br/></strong>Founded in 2011, Cleeng is the Subscriber Retention Management® Company. Focusing on the Media &amp; Entertainment industry, we help our clients create a long-lasting relationship with their subscribers by providing the best D2C operational tools as well as predictive analytics. Our solutions are used by many leading broadcasters worldwide including NFL, CBC, NHL, CHL, Big10Network, MXGP, Nordisk Film, Optus Sport &amp; Sinclair Broadcasting. Cleeng's fully SaaS solution is built for scalability, flexibility, robustness and innovation.<br/><br/>Working at Cleeng is rewarding, fun and challenging. We thrive on innovation, are fast growing &amp; generate a profitable business. Come join our team, make a real contribution, and help shape the future of video consumption.<br/><br/><strong>Your mission:<br/><br/></strong>Your primary mission will be to closely support key client business growth through actionable data insights and subscriber retention strategies. Your role will involve leveraging your expertise to understand clients' key business goals, providing strategically relevant recommendations through data analysis, and supporting client's analytics-related enquiries. You will be responsible for translating key client needs around data into internal initiatives, helping the client make data-driven decisions to fuel their success.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Act as the primary point of contact and subject matter expert for data and analytics-related inquiries</li><li>Develop a deep understanding of key client's business, including their objectives, challenges and KPIs. </li><li>Collaborate closely with strategic personnel on the client side to align priorities, identify areas where data can drive actionable insights and value</li><li>Conduct in-depth data analysis, extract meaningful insights and present in a clear and concise manner to stakeholders. Develop and maintain key client reports. </li><li>Work closely with internal teams, including key account, data and product teams, to ensure the successful implementation of owned projects</li><li>Serve as a key contact for data quality and integrity enquiries, working closely with internal stakeholders to ensure client data accuracy</li><li>Foster strong relationships with key stakeholders on the client side, actively seeking feedback and continuously improving the value delivered by the BI team<br/><br/><br/></li></ul><strong>Requirements:<br/><br/></strong><ul><li>5 + years of experience as a Business Analyst</li><li>Strong analytical and problem-solving skills, with the ability to translate complex data into actionable insights</li><li>Proficiency in SQL and other data analysis skills is desirable</li><li>Ability to organizing information according to needs and stakeholders (presentation, document, process, diagram, etc)</li><li>Vigorously curious to understand the continuously evolving bigger picture</li><li>Excellent skills in data storytelling, effective in conveying insights effectively to stakeholders of different backgrounds &amp; context</li><li>Pragmatic &amp; bias for action, able to prioritize real-world business impact in a fast-paced environment</li><li>Strong project and stakeholder management skills, with proven ability to build relationships and deliver results across multiple concurrent projects</li><li>Keen attention to detail and exceptional perseverance for problem-solving</li><li>Looker / BI tools proficiency</li><li>PowerPoint / Google Slides<br/><br/><br/></li></ul><strong>We offer:<br/><br/></strong><ul><li>Flexible working hours and form of employment;</li><li>Possibility to work 100% remotely;</li><li>15 days of Holidays annually</li><li>100 % paid sick leave within the agreed limits;</li><li>Healthcare covered (up to $716/ month for individuals or up to $1440/month for</li><li>family package). The Annual Value of Healthcare covered by Cleeng is $ 8 592 for</li><li>Individual Coverage and $ 17 286 for Family Coverage</li><li>Ability to contribute to your own 401k (unmatched) and other perks managed through Trinet</li><li>Work with an international team of well - rounded experts in Amsterdam (HQ), Poznan, Manila, NYC. 16 nationalities and counting!</li><li>Work on unique, market-leading, SaaS products, with clients all over the world, from New Zealand, Japan, Europe, US, and Latam;</li><li>Cleeng also offers excellent opportunities for career growth, remote flexibility, and occasional company-sponsored team activities</li></ul>", "postedDate": "1 day ago", "skills": ["SQL", "Data Analysis", "Data Storytelling", "Project Management", "Stakeholder Management", "Looker", "BI Tools", "PowerPoint", "Google Slides"], "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4006592209"}