{"jobTitle": "Business Analyst 2", "company": {"name": "Superbeo", "location": "Rosemead, CA"}, "location": "Rosemead, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Research, Analyst, and Information Technology", "industry": "Information Technology & Services", "description": "Bachelor's degree in Business, Finance, Accounting, Statistics or related field or an equivalent combination of education, training and experience. The candidate must possess the demonstrated ability to perform moderately complex quantitative analysis with the ability to gather, document, analyze and draw conclusions on data and information. The candidate will possess three to five years of experience in the field of analysis. Responsible for developing strategies that support business need for efficient and effective use of best practices.Identify requirements, approach, solutions, costs, risks and options to address business need. Lead implementation activities of an initiative, application or feature set. Responsible for project documentation including definition, requirements, conversion, testing, implementation and training. Able to priorities initiatives by assessing business value for effort and develop options. Collaborates with vendor to understand product direction, release strategy, and timeframe. Maintain a broad knowledge of current and emerging state-of-the-art computer/network systems technologies, architectures and products. Worker Location<br/><br/><strong>Additional Details<br/><br/></strong><ul><li>Worker Location : 0429 | CA-Southern Region Office B</li><li>Physical Address Worker Will Report To : 1 Innovation Way, Pomona, CA. 91770 (3rd Flr)</li><li>Engagement Type/Reason : FT Replacement</li><li>Please indicate the type of shift. Example: M-F 8-5, M-Th 4/10, etc. : 7-3:30 M-F</li><li>SONGS Worker? : No</li><li>Education Requirement : C. Bachelor's Degree</li><li>Day-to-Day Responsibilities/Workload : Manages Email Inboxes Update and Track recurring tasks Performs work order data analysis and update databases Generates reports</li><li>Required Skills/Attributes : Advanced knowledge of Microsoft programs ( PowerPoint, Excel, SharePoint, Outlook) Strong verbal and written communication skills Ability to identify issues and come up with data-driven solutions</li><li>Desired Skills/Attributes : Ability to create visual representations of data in PowerBI</li><li>Resource Type : Recruited</li><li>Background Check Required? : Yes</li><li>Badge Access Required? : Yes</li></ul>", "postedDate": "1 day ago", "skills": ["PowerPoint", "Excel", "SharePoint", "Outlook", "PowerBI"], "url": "https://www.linkedin.com/jobs/view/4006895780"}