{"jobTitle": "Sr. Designer, Cut & Sew Knits - Walmart Division", "company": {"name": "NYC Alliance", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Design", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "NYC Alliance Company LLC is seeking a talented and experienced Sr. Designer specializing in Cut & Sew Knits for our Walmart Division. As a Sr. Designer, you will be responsible for creating and developing innovative and commercially viable designs for our Cut & Sew Knits category. Working closely with cross-functional teams, you will play a key role in driving the product development process and ensuring the successful execution of designs that meet the brand's aesthetic and market demands.<br/><br/>NYC Alliance Company LLC is a leading multi-channel apparel company committed to delivering high-quality fashion products to our customers. With a focus on creating a responsive supply chain, we strive to stay ahead of the latest industry trends and deliver exceptional value to our partners.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Conceptualize, design, and develop a range of Cut & Sew Knits products in line with brand aesthetic and market trends</li><li>Create detailed technical sketches, specifications, and design presentations for production</li><li>Collaborate closely with the product development team to ensure designs are translated into commercially viable products</li><li>Identify and evaluate new fabrications, trims, and techniques to enhance product quality and innovation</li><li>Stay up-to-date with current fashion trends, market research, and consumer preferences in Cut & Sew Knits</li><li>Ensure all designs meet quality and industry standards, as well as Walmart's specific requirements</li><li>Provide guidance and direction to design team members</li><li>Manage multiple projects and meet deadlines in a fast-paced environment<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor's degree in Fashion Design or related field</li><li>Minimum of 5 years of experience in design, with a focus on Cut & Sew Knits</li><li>Strong portfolio showcasing creativity and design skills</li><li>Proficiency in design software such as Adobe Creative Suite, Illustrator, PLM</li><li>Strong knowledge of garment construction, fabrics, and trims</li><li>Excellent communication and collaboration skills</li><li>Ability to work independently and as part of a team</li><li>Attention to detail and ability to meet deadlines</li><li>Knowledge of current fashion trends and market dynamics in the Cut & Sew Knits segment</li><li>Familiarity with Walmart's product development processes and requirements is a plus<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Competitive compensation packages </li><li>Medical, Dental, Vision, FSA</li><li>Retirement Savings Plan Match</li><li>Summer Fridays </li><li>Discounts and More!</li><li>Annual Salary $120,000</li><li>The offered salary for this position will vary based on role requirements determined by NYC Alliance, skill set and years of experience</li></ul>", "postedDate": "1 month ago", "skills": ["Adobe Creative Suite", "Illustrator", "PLM", "Garment Construction", "Fabrics", "Trims", "Communication", "Collaboration", "Attention to Detail", "Deadlines", "Fashion Trends", "Market Dynamics", "Walmart Product Development"], "url": "https://www.linkedin.com/jobs/view/4006889702"}