{"jobTitle": "Entry Level Business Manager", "company": {"name": "Sunset AcquisitionsInc", "location": "Whittier, CA"}, "location": "Whittier, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Our company is looking for a self-driven individual to join our management team to continue facilitating the success we’ve seen within our teams and the consulting services we provide. For our organization to continue witnessing the advancement of our clients, we need the ideal candidate to be developed into an Entry Level Business Manager role. Our Entry Level Business Managers oversee our team members' consulting and sales services. Our Entry Level Business Managers start by learning hands-on the best tactics and strategies to improve revenue and sales procedures. We need a true powerhouse in the Entry Level Business Manager Role that can simultaneously manage multiple projects and employees to drive sales and exceed expectations for our office and beyond!<br/><br/>As an Entry Level Business Manager, working on the team's ongoing training and leadership development is pivotal to continuing the growth and success we’ve seen with companies we represent and consult. Having an internal drive and positive attitude is imperative to learning the systems we use and the overall responsibilities of the Entry Level Business Manager. The need to be able to lead from the front, using numerous sales systems, structures, and pedagogies to help train and develop the representatives of our sales team alongside upper management. You would be trained to lead by example within the organization and replicate that success in the rest of the team.<br/><br/>Entry Level Business Manager Responsibilities:<br/><br/><ul><li>Increase sales success and assurance by exemplifying internal systems and practices and training entry-level representatives on sales and marketing strategies to use with consumers directly</li><li>Develop numerous representatives within our sales and consulting departments to drive consumer engagement through active listening, negotiation tactics, sales strategies, and relationship building</li><li>Attend meetings with fellow Entry Level Business Managers regarding sales targets, team performance, and expansion opportunities</li><li>Maintain individual sales and communication responsibilities, including weekly performance metrics with individual and the larger team’s weekly sales</li><li>Interact directly with consumers to assist and educate them on the products and services we provide, leading to sales success<br/><br/></li></ul>Required experience and qualities for a Entry Level Business Manager include the following:<br/><br/><ul><li>Experience in a management or leadership role</li><li>A strong growth mindset to enhance current skills and execute constructive criticism</li><li>Confidence in leading a diverse team and encouraging advancement in performance</li><li>A self-starting attitude and an undeniable drive to lead by example</li><li>Exceptional Interpersonal skills in interacting with consumers<br/><br/></li></ul>Perks:<br/><br/><ul><li>Competitive pay</li><li>Travel opportunities for top performers within the company</li><li>Positive work atmosphere where teamwork is supported</li><li>All major Holidays off</li><li>Potential for Bonuses weekly<br/><br/></li></ul>Powered by JazzHR<br/><br/>ykWM4dkGgW", "responsibilities": "Increase sales success and assurance by exemplifying internal systems and practices and training entry-level representatives on sales and marketing strategies to use with consumers directlyDevelop numerous representatives within our sales and consulting departments to drive consumer engagement through active listening, negotiation tactics, sales strategies, and relationship buildingAttend meetings with fellow Entry Level Business Managers regarding sales targets, team performance, and expansion opportunitiesMaintain individual sales and communication responsibilities, including weekly performance metrics with individual and the larger team’s weekly salesInteract directly with consumers to assist and educate them on the products and services we provide, leading to sales success", "qualifications": {"required": "Experience in a management or leadership roleA strong growth mindset to enhance current skills and execute constructive criticismConfidence in leading a diverse team and encouraging advancement in performanceA self-starting attitude and an undeniable drive to lead by exampleExceptional Interpersonal skills in interacting with consumers"}, "skills": [], "postedDate": "3 days ago", "benefits": "Competitive payTravel opportunities for top performers within the companyPositive work atmosphere where teamwork is supportedAll major Holidays offPotential for Bonuses weekly", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4006307716"}