{"jobTitle": "Account Executive", "company": {"name": "Transvirtual ", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Sales", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "<strong>The role:<br/><br/></strong>The role of the Account Executive is to maintain a customer pipeline of new acquisition sales in line with budget and forecasts and work closely with the BDR channel in view to grow the Transvirtual customer base.<br/><br/>Established over 18 years ago, TransVirtual is a fully integrated platform connecting agents, carriers, and logistic businesses all over the globe. Its strength is in its simplicity and scalability, as well its ability to integrate multiple carriers for a full 360-degree view of your logistics business.<br/><br/>Building a pipeline of opportunities, converting leads and demonstrating all Transvirtual products is a major focus for the AE role. Sales targets are rolled up monthly but align to quarterly commissionable targets. As a business development expert, it is expected you will be relentless on the phone, building a pipeline of opportunity to meet and exceed your quota. Most meetings will be held virtually but some face-to-face interactions at events will be necessary.<br/><br/>Having knowledge of the logistics industry will be a huge benefit, but more importantly your ability to concisely present our product suite will be paramount. In support of your role, we have a dedicated Business Development Representative (BDR) function to help you tap into the North American market. This role is crucial to our expansion where we have already successfully onboarded customers In the US and Canada.<br/><br/>Your key stakeholders will be our Head of Sales and General Manager.<br/><br/><strong>Why you will love this role: <br/><br/></strong><ul><li> Make your mark: We are growing rapidly with future product enhancements in the pipeline. This is a unique opportunity to work as a key figure in this booming market. </li><li> Join a dedicated and experienced team: you'll work alongside a dedicated and experienced team who have carved out a solid reputation for operational experience. </li><li> Drive your initiatives to success: a large part of this role will you bringing your own ideas and experiences to meet the needs of our acquisition targets. As a business we thrive on everyone's initiative to grow the business. </li><li> The team is built on accountability and trust: we have built our foundations on a ‘Charter of Culture' to support the team to meet milestones, drive to better performance and have open and honest communication.... always </li><li> Friendly, with a global presence: we are a fun team, largely based in Australia, but also Philippines, India, USA, and Pakistan. You'll get the chance to collaborate with multiple teams who are all inclusive and open. <br/><br/><br/></li></ul><strong>Essential Skills / qualifications: <br/><br/></strong><ul><li>4+ years' experience in a business development role. </li><li>Adept at sourcing and following up opportunities to meet sales targets. </li><li>Excellent communication and negotiation skills </li><li>Experience in managing a contact pipeline - CRM updates (we use HubSpot) </li><li>Proven sales presentation skills (remotely) as much as face to face. </li><li>Can work independently and be a central figure in developing the North American market </li><li>Ability to think and act fast as directions change to meet sales quota <br/><br/><br/></li></ul><strong>Desired Skills: <br/><br/></strong><ul><li>Marketing university degree or equivalent - maturity in your thinking is what we are after </li><li>Understanding/experience of the logistics sector / SaaS businesses </li><li>Excellent communication and negotiation skills - find and close deals. </li><li>Ability to connect with a range of customers and find key buying habits of prospects. </li><li>Great team player who understands the importance of working together to meet a common goal. <br/><br/><br/></li></ul><strong>About TransVirtual:<br/><br/></strong>TransVirtual is a modern SaaS business, delivering industry-leading logistics solutions.<br/><br/>Inspired by his family's involvement in the transport industry, our founder set out to build a truly configurable Transport Management System (TMS) that could adapt to the diverse needs of this sector. We've built on our unique selling point of configurability by developing a deep network which allows transport businesses to process more data, more effectively, through extensive integrations.<br/><br/>Today we have evolved our product set beyond TMS and offer a complete logistics solution, expanding beyond Australia into New Zealand, USA and Canada.<br/><br/>Our culture is constantly evolving, and we ensure strategic alignment through clear goals set using OKRs. We thrive on positive, consistent, and collaborative communication, necessary for a remote first business. We support that through fortnightly all hands meetings and Quarterly Workshops including Retros.<br/><br/>We're always looking for outstanding candidates to join us as Technology, Logistics and Growth experts. So, if you're excited by this opportunity, we'd love to hear from you!", "postedDate": "2 days ago", "skills": ["Business Development", "Sales", "CRM", "HubSpot", "Logistics", "SaaS", "Negotiation", "Communication", "Teamwork"], "url": "https://www.linkedin.com/jobs/view/4006523568"}