{"jobTitle": "Senior People Operations Partner", "company": {"name": "Jerry", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Software Development", "description": "This role will come with a 90-day probationary period. <br/><br/>\n\n<strong>You could work anywhere. Why us?<br/><br/></strong><ul><li>Join a pre-IPO startup with capital, traction and runway ($240M funded | 40X revenue growth in 4 years | $2T market size)</li><li>Work closely with brilliant leaders and team mates who have scaled companies like Nvidia, Better, Nerdwallet, Wayfair, Sofi, etc. </li><li>Disrupt a massive market and take us to a $5B business in the next few years</li><li>Be immersed in a talent-dense environment and greatly accelerate your career growth<br/><br/></li></ul><strong>About the opportunity:<br/><br/></strong>We are looking for a <strong>Senior People Operations Partner</strong> to join our small and mighty People Operations team! As Jerry rapidly expands its employee base, it is now crucial more than ever that we revitalize our HR processes to better support the growth and success of Jerrians. Reporting directly to the VP of People Operations, you will oversee key touch points of the employee journey, including onboarding and offboarding, performance management, initiative planning and execution, and more. Your success in inspiring employees to pursue meaningful and impactful careers is pivotal to steering Jerry to a $5B business by 2030.<br/><br/>Jerry is building the first AllCar™ super app to help people optimize all aspects of owning a car – insurance, buy/sell, registration, loans, safety, repairs, parking, etc – a $2T market in the U.S. We started with insurance in 2019, and since then we’ve launched loan refinancing, real-time driving insights, a repair marketplace, car diagnostics, and a GenAI-powered chatbot and voicebot. We have amassed over 5M customers, raised $240M in funding, scaled our revenue 40X and our team to 250 across 7 countries.<br/><br/><strong>How you will make an impact:<br/><br/></strong><ul><li>Work alongside the VP, People Operations to develop and execute on various People initiatives throughout the employee lifecycle</li><li>Champion Jerry’s culture through multiple touch points such as recognition and support programs, conducting regular surveys and feedback sessions and organizing company meetings to enhance the employee engagement and satisfaction </li><li>Oversee the performance appraisal process, provide guidance to managers on setting goals and expectations, and ensure Jerry’s talent bar is held to a high standard</li><li>Collaborate with executive leadership to improve work relations, build morale, and increase employee retention and engagement</li><li>Address employee concerns and grievances with empathy, integrity, and confidentiality, fostering a positive and inclusive workplace culture</li><li>Ensure compliance with labor laws, company policies, and industry regulations while maintaining accurate employee records and managing HR documentation</li><li>Oversee and manage all aspects of immigration process, including visa applications, renewals and compliance<br/><br/></li></ul><strong>Preferred experience:<br/><br/></strong><ul><li>Bachelor’s degree in Human Resources, Business Administration, or a related field</li><li>Master’s Degree in HR, IO psychology, or a related field preferred</li><li>Minimum of 5 years of experience in HR or people operations, with a focus on talent management and employee relations</li><li>Strong knowledge of HR laws and regulations</li><li>Excellent communication and interpersonal skills. </li><li>Proven ability to manage multiple tasks and projects simultaneously</li><li>Strong problem-solving and conflict-resolution skills</li><li>HR certification (e.g., SHRM-CP, PHR) is a plus</li><li>Experience in a fast-paced, high-growth company<br/><br/></li></ul><strong>Who you are:<br/><br/></strong><ul><li>Has exceptional verbal and written communication and interpersonal skills</li><li>Comfortable communicating with C-Suite, leadership, and frontline workers</li><li>Can multitask and prioritize easily without compromising attention to detail</li><li>Applies solid judgment and ensures integrity, compliance, and confidentiality while handling highly sensitive information<br/><br/></li></ul><em>Jerry is proud to be an Equal Employment Opportunity employer. We prohibit discrimination based on race, religion, color, national origin, sex, pregnancy, reproductive health decisions or related medical conditions, sexual orientation, gender identity, gender expression, age, veteran status, disability, genetic information, or other characteristics protected by applicable local, state or federal laws. <br/><br/></em><em>Jerry is committed to providing reasonable accommodations for individuals with disabilities in our job application process. If you need assistance or an accommodation due to a disability, please contact us at </em><em>recruiting@getjerry.com<br/><br/></em><strong>About Jerry:<br/><br/></strong>Jerry is America’s first and only AllCar™ app. We are redefining and radically improving how people manage owning a car, one of their most expensive and time-consuming assets.<br/><br/>Backed by artificial intelligence and machine learning, Jerry simplifies and automates owning and maintaining a car while providing personalized services for all car owners' needs. We spend every day innovating and improving our AI-powered app to provide the best possible experience for our customers. From car insurance and financing to maintenance and safety, Jerry does it all.<br/><br/>We are the #1 rated and most downloaded app in our category with a 4.7 star rating in the App Store. We have more than 6 million customers — and we’re just getting started.<br/><br/>Jerry was founded in 2017 by serial entrepreneurs and has raised more than $242 million in financing.<br/><br/>Join our team and work with passionate, curious and egoless people who love solving real-world problems. Help us build a revolutionary product that’s disrupting a massive market.<br/><br/>", "responsibilities": "Work alongside the VP, People Operations to develop and execute on various People initiatives throughout the employee lifecycle\nChampion Jerry’s culture through multiple touch points such as recognition and support programs, conducting regular surveys and feedback sessions and organizing company meetings to enhance the employee engagement and satisfaction \nOversee the performance appraisal process, provide guidance to managers on setting goals and expectations, and ensure Jerry’s talent bar is held to a high standard\nCollaborate with executive leadership to improve work relations, build morale, and increase employee retention and engagement\nAddress employee concerns and grievances with empathy, integrity, and confidentiality, fostering a positive and inclusive workplace culture\nEnsure compliance with labor laws, company policies, and industry regulations while maintaining accurate employee records and managing HR documentation\nOversee and manage all aspects of immigration process, including visa applications, renewals and compliance", "qualifications": {"preferred": "Bachelor’s degree in Human Resources, Business Administration, or a related field\nMaster’s Degree in HR, IO psychology, or a related field preferred\nMinimum of 5 years of experience in HR or people operations, with a focus on talent management and employee relations\nStrong knowledge of HR laws and regulations\nExcellent communication and interpersonal skills. \nProven ability to manage multiple tasks and projects simultaneously\nStrong problem-solving and conflict-resolution skills\nHR certification (e.g., SHRM-CP, PHR) is a plus\nExperience in a fast-paced, high-growth company", "required": "Has exceptional verbal and written communication and interpersonal skills\nComfortable communicating with C-Suite, leadership, and frontline workers\nCan multitask and prioritize easily without compromising attention to detail\nApplies solid judgment and ensures integrity, compliance, and confidentiality while handling highly sensitive information"}, "skills": [], "postedDate": "1 day ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4006111720"}