{"jobTitle": "Manufacturing Supervisor", "company": {"name": "JobsInLogistics.com", "location": "Santa Fe Springs, CA"}, "location": "Santa Fe Springs, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Company: **The Timken Company<br/><br/><br/>**<strong>Job Description<br/><br/><br/></strong><strong>What Timken makes possible begins with you.<br/><br/></strong>Those who came before us helped land a man on the moon, create the world's infrastructure, and introduce renewable energy alternatives. Now you can join the Timken team to write your own unique story and help drive what's next.<br/><br/>A career at Timken means you can have an immediate impact doing Work That Matters to the world improving the efficiency of today's industrial equipment and preparing for the future of motion on our planet and beyond. New employees can start contributing right away, and there are many opportunities to advance your career at your own pace. Join our global team of 19,000 people in 45 countries, and start helping our customers push the limits of what's possible in their world of motion.<br/><br/>Philadelphia Gear part of the Timken Power Systems group in Santa Fe Springs, CA has a current opening for a **Manufacturing Supervisor** position. The position supervises teams of qualified Mechanical Assemblers and Welders, has the responsibility of providing direction and leadership for assigned manufacturing operations in achieving goals related to safety, quality, cost, and on time delivery of products while developing and maintaining effective working relationships with employees at all levels of the organization.<br/><br/>The position reports to the Operations Manager and is also responsible for manufacturing follow through.<br/><br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Supervise, coordinate, and maintain schedule on the manufacturing, assembly and rebuilding of gearboxes and related products in accordance with the priorities established by the Operations Manager.</li><li>Plan and monitor employee skill utilization, labor hours required, materials and workflow to insure timely delivery of products.</li><li>Organize and assign work and provide instruction to employees towards the attainment of manufacturing objectives. Establish efficient work hours and schedule overtime to meet manufacturing requirements as necessary.</li><li>Identify and report manufacturing issues and implement corrective actions. Assist in developing and implementing Continuous Improvement activities utilizing LEAN principles.</li><li>Coordinate manufacturing activities with functional area managers and supervisors (Quality, Engineering, Customer Service, Accounting, etc.) to meet or exceed delivery schedules and customer requirements.</li><li>Provide required training to all assigned manufacturing personnel in accordance with skill requirements for each position. Track and monitor training compliance across all assigned teams.</li><li>Ensure work force maintains compliance with all manufacturing, quality and safety rules and provide feedback on job performance.</li><li>Ensure the proper use of safety equipment. Continuously monitor all assigned work areas for hazardous conditions and unsafe practices.</li><li>Monitor all assigned work areas for good housekeeping practices, cleanliness and organization.</li><li>When requested, participate in the specification and justification for new equipment. Assist in cost analysis and benefits, as needed, to justify equipment purchase.<br/><br/><br/></li></ul><strong>Required Skills And Experience<br/><br/></strong><ul><li>High School education equivalent with minimum of 3 years of industrial manufacturing experience preferably related to mechanical power transmissions or rotating equipment </li><li>Must have the ability to read and interpret mechanical and electrical drawings </li><li>Must have strong analytical and organizational skills </li><li>Key attributes include the ability to multi-task, set priorities, and meet deadlines with a high degree of accuracy. Must have the ability to lead and work as part of a team </li><li>Excellent computer skills (proficient in Microsoft Office software), strong written and verbal communication skills are required. LEAN experience is preferred </li><li>Working knowledge of ISO9001:2015 standards required            <br/><br/></li></ul>Pay Range: $87K - $101K<br/><br/>All qualified applicants shall be treated equally according to their individual qualifications, abilities, experiences and other employment standards. There will be no discrimination due to gender or gender identity, race, religion, color, national origin, ancestry, age, disability, sexual orientation, veteran/military status or any other basis protected by applicable law.", "responsibilities": "<ul><li>Supervise, coordinate, and maintain schedule on the manufacturing, assembly and rebuilding of gearboxes and related products in accordance with the priorities established by the Operations Manager.</li><li>Plan and monitor employee skill utilization, labor hours required, materials and workflow to insure timely delivery of products.</li><li>Organize and assign work and provide instruction to employees towards the attainment of manufacturing objectives. Establish efficient work hours and schedule overtime to meet manufacturing requirements as necessary.</li><li>Identify and report manufacturing issues and implement corrective actions. Assist in developing and implementing Continuous Improvement activities utilizing LEAN principles.</li><li>Coordinate manufacturing activities with functional area managers and supervisors (Quality, Engineering, Customer Service, Accounting, etc.) to meet or exceed delivery schedules and customer requirements.</li><li>Provide required training to all assigned manufacturing personnel in accordance with skill requirements for each position. Track and monitor training compliance across all assigned teams.</li><li>Ensure work force maintains compliance with all manufacturing, quality and safety rules and provide feedback on job performance.</li><li>Ensure the proper use of safety equipment. Continuously monitor all assigned work areas for hazardous conditions and unsafe practices.</li><li>Monitor all assigned work areas for good housekeeping practices, cleanliness and organization.</li><li>When requested, participate in the specification and justification for new equipment. Assist in cost analysis and benefits, as needed, to justify equipment purchase.<br/><br/><br/></li></ul>", "qualifications": {"required": "High School education equivalent with minimum of 3 years of industrial manufacturing experience preferably related to mechanical power transmissions or rotating equipment , Must have the ability to read and interpret mechanical and electrical drawings , Must have strong analytical and organizational skills , Key attributes include the ability to multi-task, set priorities, and meet deadlines with a high degree of accuracy. Must have the ability to lead and work as part of a team , Excellent computer skills (proficient in Microsoft Office software), strong written and verbal communication skills are required. LEAN experience is preferred , Working knowledge of ISO9001:2015 standards required            <br/><br/>", "preferred": "LEAN experience"}, "skills": ["LEAN", "ISO9001:2015", "Microsoft Office", "Communication", "Teamwork", "Analytical Skills", "Organizational Skills", "Multitasking", "Prioritization", "Meeting Deadlines", "Mechanical Drawings", "Electrical Drawings", "Industrial Manufacturing"], "postedDate": "1 day ago", "salary": {"amount": "87,000.00 - 101,000.00", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4006374885"}