{"jobTitle": "Quality Assurance Supervisor", "company": {"name": "Michael Page", "industry": "Food Manufacturing", "size": "Not specified", "location": "Gardena, CA"}, "location": "Gardena, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "70,000 - 100,000", "currency": "USD"}, "jobFunction": "Quality Assurance", "industry": "Personal Care Product Manufacturing, Retail Groceries, and Food and Beverage Manufacturing", "description": "The responsibilities of the QA Supervisor are to partner with the management to ensure food safety processes and best practices are implemented and maintained, anticipate and respond to any regulatory agency requirements and reports related to food safety, work directly with the management team to maintain, modify and improve the Quality System, oversee third-party audits, and be responsible for developing Hazard Analyses, HACCP plans, Preventive Controls and compliance with HACCP FSMA and all regulatory requirements. A successful candidate must have 4+ years of experience in a QA supervisory role, 5+ years of USDA food manufacturing experience, and experience managing in a food manufacturing environment.", "responsibilities": "Partner with the management to ensure food safety processes and best practices are implemented and maintained. Anticipate and respond to any regulatory agency requirements and reports related to food safety. Work directly with the management team to maintain, modify and improve the Quality System. Oversee third-party audits. Responsible for developing Hazard Analyses, HACCP plans, Preventive Controls and compliance with HACCP FSMA and all regulatory requirements. Provide hands-on leadership to QA techs.", "qualifications": {"required": "4+ years of experience in a QA supervisory role, 5+ years of USDA food manufacturing experience, experience managing in a food manufacturing environment, commitment to teamwork, a positive attitude, and hardworking, good understanding of all continuous improvement production techniques, trained in OSHA requirements or expectations, HACCP, First Aid/CPR, and Food Hygiene, certified in USDA, able to be onsite daily in Gardena, California.", "preferred": "Knowledge of large-scale food business start-up."}, "skills": ["Food Safety", "Quality Assurance", "HACCP", "USDA Regulations", "Team Leadership"], "postedDate": "3 days ago", "applicationDeadline": "Not specified", "benefits": "Great benefits, 401k match, Health, Dental, and Life insurance, opportunity to grow within the fast-moving company, opportunity to help grow a food safety team, opportunity to learn within a big Consumer Goods business (CPG).", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4006538740"}