{"jobTitle": "U.S. Operations Associate", "company": {"name": "Retail For The People", "location": "Chino, CA"}, "location": "Chino, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Financial Services", "description": "Position: US Operations Associate Reporting to: Outbound &amp; Returns Manager We are seeking a dedicated US Operations Associate to uphold our Client's values through exceptional service to their customers, primarily by supporting in outbound and returns tasks. Reporting to the Outbound Returns Manager, this role will play a crucial part in ensuring that all fulfillment Service Level Agreements (SLAs) are met. The role would be 5 days/week onsite (standard hours) Responsibilities: Provide outstanding service to customers by efficiently managing outbound and returns tasks. Collaborate closely with the Outbound Returns Manager to meet all fulfillment SLAs. Prioritizing assistance in manual return processing SOP. Communicate any issues or updates promptly to internal teams and third-party logistics (3PL) partners. Work diligently in the warehouse daily, actively engaged in returns manual processes to ensure adherence to SLAs. Maintain a keen eye for identifying issues in the returns process and escalate them promptly to the manager. Support with reporting for both Outbound and Returns whenever needed. Ensure timely processing of returns and provide necessary information to other departments as required. Follow on Outbound Status Update from 3PL. Assist with any Outbound/Returns tasks as needed. Assist with Outbound and Returns Reports when needed. Role-Based Competencies: Efficiency. Able to produce significant output with minimum wasted effort. Organization/Planning<br/><br/><ul><li>Plans, organizes, and schedules in an efficient manner. Focuses on key priorities. Efficiency. Able to produce significant output with minimum wasted effort. Proactive</li><li>Acts without being told what to do. Brings new ideas to the company. Follow-through commitments</li><li>Lives up to verbal and written agreements. Intelligence. Learns quickly. Demonstrates the ability to quickly and proficiently understand and absorb new information. Persistence. Demonstrates tenacity and willingness to go the distance to get something done. Ability to troubleshoot and be solution-oriented</li><li>Is flexible and adaptable to all changes in the business while emulating company values. Culture Competencies: Work ethic. Possesses a strong willingness to work hard and sometimes long hours to get the job done. Has a track record of working hard. Enthusiasm. Exhibits passion and excitement over work. Has a can-do attitude. Flexibility/Adaptability</li><li>Adjusts quickly to changing priorities and conditions. Copes effectively with complexity and change. Listening skills. Lets others speak and seeks to understand their viewpoints. Openness to criticism and ideas</li><li>Often solicits feedback and reacts calmly to criticism or negative feedback. Process &amp; Procedures: Follows our procedures to manually process any rejected returns. Assist with reporting the information to all stakeholders involved. Supports both the Returns and Outbound Associates. Ensures that we met our SLAs for both Outbound and Returns. Able to assist with any ad-hoc project, as needed. Collaboration: In the absence of team lead, serves as a point of escalation for OPS, CX, PR, &amp; 3PL. Is reliable performing projects, persistent and can be trusted to get the job done. Support Returns and Outbound Team when needed Needs Review, escalated returns, and any other tasks related. Supports Operations Teams where needed. Qualifications: Experience: 1 year of Customer service experience with a track record of providing excellent customer service. Previous experience in outbound and returns management is preferred. Strong attention to detail and ability to work efficiently in a fast-paced environment. Excellent communication skills to liaise effectively with internal teams and 3PL partners. Proactive approach to problem-solving, with the ability to identify and address issues promptly. Flexibility to work in a warehouse setting and contribute to manual processes as needed. Basic Excel &amp; Google Sheets experience, Ecom Experience Education: 2 years of college or related work experience preferred.</li></ul>", "postedDate": "1 day ago", "skills": ["Customer Service", "Outbound", "Returns Management", "Communication", "Problem Solving", "Excel", "Google Sheets", "Ecom Experience"], "url": "https://www.linkedin.com/jobs/view/4006824382"}