{"jobTitle": "Senior Accountant, Payroll", "company": {"name": "EvenUp", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Accounting/Auditing and Finance", "industry": "Technology, Information and Internet", "description": "EvenUp is on a mission to support injury law firms across America in providing a consistent and high standard of representation, ensuring that every injury victim who seeks their legal assistance can expect a fair resolution. We’ve helped thousands of victims get fair compensation by empowering their representation with best-in-class insights, automation, and document creation.<br/><br/>In the past two years, we scaled our customer base 20x with an Accounting team of 4. We’re now at a point where we are looking for teammates who can help position the company for its next stage of growth. This Senior Accountant role will help us build a strong infrastructure to support growth and scale. We are looking for someone who thrives in a start-up environment. Your friends and co-workers describe you as someone who gets it done and is good-natured, analytical, detail-oriented, and insatiably curious.<br/><br/>You’ll be responsible for day-to-day payroll operations and oversee all aspects of payroll administration (US and Canada), including processing, compliance, reporting, and problem resolution. Additionally, you will be responsible for managing the financial accounting of the largest expense lines on our income statement and reconciling the related payroll balance sheet accounts on a monthly basis. This role requires experience in both Canada and US payroll compliance and process with Canada being more important, due to a gap in knowledge on the current team. As a Senior Accountant, you will work closely with the Controller to produce timely and accurate payroll delivery while adhering to regulatory requirements in both countries.<br/><br/><strong>What you'll do:<br/><br/></strong><ul><li>Manage end-to-end payroll processing for all employees, in both US and Canada, ensuring timely and accurate payroll runs</li><li>Ensure compliance with all federal, state, and provincial regulations governing payroll, taxes, and benefits in both countries and Canada provincial requirements. (Canada examples: proper coding of pay types for the CRA; proper allotment of taxable benefits; adherence to ROE rules)</li><li>Handle employee payroll inquiries and resolve any payroll discrepancies in a timely manner</li><li>Coordinate with HR to ensure the accuracy of employee data, including new hires, terminations, and changes to pay rates</li><li>Prepare and submit payroll tax filings and ensure compliance with all payroll-related regulatory requirements</li><li>Process garnishments, benefits, and other deductions</li><li>Perform regular audits of payroll procedures and records to ensure accuracy and compliance</li><li>Assist in the preparation and facilitation of payroll-related audits</li><li>Continuously improve payroll processes and systems to increase efficiency and accuracy</li><li>Act as point of contact for the company for government Revenue agencies (eg. CRA in Canada, various state agencies in the US) </li><li>Responsible for handling all payroll related account reconciliations for month end close<br/><br/></li></ul><strong>What we look for:<br/><br/></strong><ul><li>Experience processing Canada payroll and has strong familiarity with Canadian payroll laws and regulations</li><li>Bachelor’s degree in accounting, finance, or a related field</li><li>3-5 years of professional work experience in payroll processing</li><li>Strong knowledge of payroll practices, laws, and regulations in both US and Canada</li><li>Experience with payroll software and systems: ADP, Ceridian, or Rippling preferred</li><li>Highly proficient in Google Sheets/Excel</li><li>Exceptional attention to detail, with outstanding organizational and time-management skills</li><li>Self-motivated and driven to achieve goals, with a proactive approach to tasks</li><li>Strong analytical and problem-solving skills</li><li>Excellent communication and interpersonal skills<br/><br/></li></ul><strong>Benefits &amp; Perks:<br/><br/></strong>Our goal is to empower every team member to contribute to our mission of fostering a more just world, regardless of their role, location, or level of experience. To that end, we offer:<br/><br/><ul><li>Choice of medical, dental, and vision insurance plans for you and your family</li><li>Flexible paid time off and 10+ holidays per year</li><li>A stipend to upgrade your home office for fully-remote roles</li><li>401k for US-based employees<br/><br/></li></ul><em>EvenUp is an equal opportunity employer. We are committed to diversity and inclusion in our company. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br/><br/></em><strong>About EvenUp:<br/><br/></strong>EvenUp is a venture-backed generative AI startup that ensures injury victims are awarded the full value of their claims, expanding the $100B+ in awards granted to injury victims each year. Every year, the legal system has made it difficult for millions of ordinary people to seek justice, especially for folks without means or who come from underrepresented backgrounds. Our vision is to help these injury victims get the justice they deserve, irrespective of their income, demographics, or the quality of their legal representation.<br/><br/>EvenUp operates across a variety of personal injury cases, including motor vehicle accidents and negligence claims. Our AI-driven software empowers attorneys to accurately assess the value of these cases by doing a core part of their workflow (legal drafting), enabling them to secure larger settlements in record time. As EvenUp evaluates more cases, our proprietary data grows, enhancing the precision of our predictions and delivering more value to both attorneys and victims alike.<br/><br/>We are one of the fastest growing startups ($0 to $25M in ARR in &lt; 3 years) and are funded by some of the best investors in the world, including Signalfire, Bain, and Bessemer, who led our recent $50M Series B. Learn more about www.evenuplaw.com.<br/><br/>", "responsibilities": "You’ll be responsible for day-to-day payroll operations and oversee all aspects of payroll administration (US and Canada), including processing, compliance, reporting, and problem resolution. Additionally, you will be responsible for managing the financial accounting of the largest expense lines on our income statement and reconciling the related payroll balance sheet accounts on a monthly basis. This role requires experience in both Canada and US payroll compliance and process with Canada being more important, due to a gap in knowledge on the current team. As a Senior Accountant, you will work closely with the Controller to produce timely and accurate payroll delivery while adhering to regulatory requirements in both countries.", "qualifications": {"required": "Experience processing Canada payroll and has strong familiarity with Canadian payroll laws and regulations, Bachelor’s degree in accounting, finance, or a related field, 3-5 years of professional work experience in payroll processing, Strong knowledge of payroll practices, laws, and regulations in both US and Canada, Experience with payroll software and systems: ADP, Ceridian, or Rippling preferred, Highly proficient in Google Sheets/Excel, Exceptional attention to detail, with outstanding organizational and time-management skills, Self-motivated and driven to achieve goals, with a proactive approach to tasks, Strong analytical and problem-solving skills, Excellent communication and interpersonal skills", "preferred": ""}, "skills": ["Payroll", "Canadian Payroll", "US Payroll", "Payroll Compliance", "Payroll Tax", "Payroll Processing", "Payroll Systems", "ADP", "Ceridian", "Rippling", "Google Sheets", "Excel", "Accounting", "Finance", "Time Management", "Problem Solving", "Communication", "Interpersonal Skills"], "postedDate": "3 days ago", "benefits": "Choice of medical, dental, and vision insurance plans for you and your family, Flexible paid time off and 10+ holidays per year, A stipend to upgrade your home office for fully-remote roles, 401k for US-based employees", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4006573910"}