{"jobTitle": "Compliance Manager", "company": {"name": "Augment Jobs", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Legal", "industry": "Financial Services", "description": "As a Compliance Manager, you will be responsible for overseeing and ensuring adherence to regulatory requirements, internal policies, and industry standards within our organization. You will play a critical role in developing, implementing, and maintaining effective compliance programs to mitigate risks and promote ethical business practices. Your leadership and expertise will be instrumental in fostering a culture of compliance and integrity across all levels of the organization.<br/><br/>Roles And Responsibilities<br/><br/><ul><li>Develop, implement, and enforce compliance policies and procedures in accordance with applicable laws, regulations, and industry standards.</li><li>Conduct regular compliance assessments and audits to identify gaps, assess risks, and recommend corrective actions.</li><li>Monitor changes in regulatory requirements and update policies and procedures accordingly to ensure ongoing compliance.</li><li>Provide guidance and training to employees on compliance matters, ethical conduct, and best practices.</li><li>Collaborate with internal stakeholders, including legal, finance, and operations teams, to address compliance issues and implement solutions.</li><li>Manage relationships with regulatory agencies, external auditors, and third-party compliance consultants.</li><li>Investigate compliance violations, incidents, or breaches, and develop corrective action plans as necessary.</li><li>Prepare and present compliance reports and updates to senior management and the board of directors.<br/><br/></li></ul>Skills Required<br/><br/><ul><li>Bachelor’s degree in Law, Business Administration, Finance, or a related field. Advanced degree (e.g., JD, MBA) and relevant certifications (e.g., CRCM, CCEP) are preferred.</li><li>Proven experience in compliance management within a regulated industry, preferably in finance, banking, or a related field.</li><li>Strong understanding of regulatory requirements, laws, and standards relevant to the organization (e.g., GDPR, SEC, FINRA, etc.).</li><li>Excellent knowledge of compliance frameworks, risk assessment methodologies, and internal control systems.</li><li>Analytical skills with the ability to interpret complex regulations and apply them to business operations.</li><li>Effective communication and interpersonal skills, with the ability to influence and educate stakeholders at all levels.</li><li>Leadership qualities with the ability to lead and motivate teams, drive initiatives, and manage projects effectively.</li><li>Attention to detail and a commitment to accuracy in compliance monitoring, reporting, and documentation.<br/><br/></li></ul>Compensation: The compensation package for this position includes a competitive salary commensurate with experience, performance-based bonuses, comprehensive benefits (healthcare, retirement, etc.), and opportunities for professional development and career advancement within our organization.", "postedDate": "3 days ago", "skills": ["Compliance Management", "Regulatory Requirements", "Compliance Frameworks", "Risk Assessment", "Internal Control Systems", "Analytical Skills", "Communication", "Interpersonal Skills", "Leadership", "Project Management", "Attention to Detail", "Accuracy"], "url": "https://www.linkedin.com/jobs/view/4006866056"}