{"jobTitle": "Full-Time Sales Associate", "company": {"name": "LoveShackFancy", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": "LoveShackFancy began in 2013 with a beach-to-ballroom hand-dyed halter dress that founder and creative director Rebecca Hessel Cohen made for her bridal party. Over time, that one article of clothing, created to celebrate love, has turned into a world filled with all things romantic, dreamy and drenched in optimism — from clothing to tabletop, bedding, swim, ski, travel accessories, shoes and more.<br/><br/><strong>Key Responsibilities<br/><br/></strong>Selling &amp; Client Service<br/><br/><ul><li> Greet and acknowledge all customers. Provide courteous and knowledgeable customer service. </li><li> Work with clients to style them in LoveShackFancy – suggest styles that will best suit their needs and size. Service the transaction by pulling needed sizes from the stockroom, cleaning up the fitting room, suggestive selling, and ordering items for the client online when unavailable in the store. </li><li> Remove unwanted merchandise from fitting rooms and ensure all merchandise is placed back onto the floor after completing a transaction. </li><li> Send follow-up communication to clients thanking them for their purchase, reaching out when a new product arrives, etc. <br/><br/></li></ul><strong>Visual Merchandising<br/><br/></strong><ul><li> Monitor and maintain visual merchandising standards on a daily basis. Fold, straighten, fill in and ensure correct placement of merchandise throughout the day. </li><li> Ensure representation of all merchandise, styles &amp; sizes are on the floor. </li><li> Assist with stock duties when needed including shipments, markdowns, and transfers. <br/><br/></li></ul><strong>Operations<br/><br/></strong><ul><li> Follow all procedures in the POS system for ringing up sales. This includes 100% client capture. </li><li> Keep cash wrap area neat, organized, and maintained with all daily supplies. </li><li> Answer the phone and service the client’s needs. </li><li> Help with events both in-store and off-site. To include setup, breakdown, and overall organization. <br/><br/></li></ul><em>This job description may not be inclusive of all assigned duties, responsibilities, or aspects of the job described and may be amended at any time at the sole discretion of the Employer.</em>", "postedDate": "3 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4006321768"}