{"jobTitle": "Account Manager Trainee", "company": {"name": "Sunset AcquisitionsInc", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Our company is thriving as a business consulting and sales firm! Our forward-thinking business strategies and innovative sales tactics are what attract our reputable clients to us. Now that our clients are expanding, we are looking for entry level candidates to join our team as an Account Manager Trainee! Our primary goal is to assist our clients in building strong relationships with their prospects, acquiring new accounts, increasing their annual sales revenue, and expanding their market reach. As an Account Manager Trainee, you will have the opportunity to work closely with our successful Senior Account Managers and dominating Sales Team. The Account Manager Trainee position is designed for strong-minded candidates that seek a definite career in account management and sales.<br/><br/>Responsibilities of an Account Manager Trainee:<br/><br/><ul><li>Meet directly with leading business prospects to deliver presentations and build a long-lasting customer relationship</li><li>Educate potential buyers on our client’s current products, ongoing promotions, and updated services</li><li>Assist our clients in acquiring new accounts and overseeing expanding markets</li><li>Train directly with our Senior Account Managers to develop full knowledge of our client’s marketing campaigns, sales strategies, and sales team goals</li><li>Review sale contracts with clients, identify their concerns, and negotiate accounts through upselling products and services as needed that will benefit both parties</li><li>Attend all conference calls and participate in all on site training workshops to stay current on our client’s sales progress</li><li>Collaborate with fellow Account Manager Trainees, Sales Associates, and other team Representatives to ensure our client’s needs are met<br/><br/></li></ul>The Ideal Candidate as an Account Manager Trainee:<br/><br/><ul><li>In Progress or Bachelor’s Degree in Management, Marketing, Business, or other related field preferred</li><li>Experience working as an Account Manager, Sales Representative, or other related leadership role preferred</li><li>Positive attitude and eager to develop leadership qualities</li><li>Thrives in fast-paced environments</li><li>Both comfortable working independently and adaptable collaborating in a team setting</li><li>Self-determined and takes initiative in creating solutions</li><li>Exceptional communication and negotiation skills</li><li>Reliable transportation to onsite location<br/><br/></li></ul>Powered by JazzHR<br/><br/>Nr1kwpMr3d<br/><br/>", "postedDate": "2 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4006311371"}