{"jobTitle": "Marketing Manager", "company": {"name": "Wrench Group", "industry": "Consumer Services", "size": "Not specified", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$130,000.00 - $150,000.00", "currency": "USD"}, "jobFunction": "Marketing", "industry": "Consumer Services", "description": "Wrench Group partner brand NexGen AirConditioning, Heating and Plumbing is currently seeking a Marketing Manager to join their team comprised of creative and energetic employees, who are dedicated to delivering the best customer service experience every day. The Marketing Manager plays a crucial role in driving the company's growth and success through effective leadership, strategic planning, and strong customer relationships. If you are a dynamic and results-oriented individual with a passion for marketing, we encourage you to apply for this exciting opportunity.", "responsibilities": "The Marketing Manager will be responsible for developing and implementing marketing strategies to promote our products or services and drive customer engagement and retention. They will coordinate marketing campaigns, and analyze market trends to identify new opportunities. The Marketing Manager will also collaborate with other departments to ensure alignment with overall business objectives and brand consistency.", "qualifications": {"required": "Bachelor’s degree in Marketing, Business Administration, or a related field. 7-10 years of experience in a marketing role with a proven track record of successful marketing strategy development and execution. Strong understanding of various marketing channels and strategies, including digital and traditional media. Experience handling a multi-million dollar marketing budget. Experience building and driving a brand and marketing directly to the end user/customer (B2C). Excellent analytical skills and the ability to make data-driven decisions. Outstanding communication and interpersonal skills, with an ability to influence and engage diverse stakeholders. Demonstrated ability to manage budgets and understand financial statements. Leadership experience with a collaborative approach to driving business results. Ability to work in a fast-paced environment and manage multiple projects simultaneously.", "preferred": ""}, "skills": [], "postedDate": "3 days ago", "applicationDeadline": "Not specified", "benefits": "Market Value Compensation ($130,000.00 - $150,000.00) plus bonus eligibility. Robust PTO Plan. Health, Vision and Dental plans for you and your family to choose from. 401K Retirement Plan with company match up to 30%. Life Insurance, Short-Term and Long-Term Disability. Special Program Options: FSA, EPA, Legal Services, and Identity Theft. Continuous Training for your Professional Development. Working in a dynamic, collaborative, and fun environment. Coached and supported career growth.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4006828611"}