{"jobTitle": "Sales Director - Construction Materials - CA  - 27738357", "company": {"name": "Backner Designs", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "200,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "", "description": "<strong>Sales Director - Construction Materials - CA - 27738357</strong><br/><br/>Our client has over 67 years of service in Southern California, and is a leading manufacturer of Concrete Masonry Units, Specialty Mortars, Paving Stones, Mortarless Wall Systems and LID/LEED solutions. With facilities located throughout the Western Region, this company has earned a reputation for high quality, outstanding customer service, and leadership in environmentally responsive solutions. The company is looking for a Sales Director who has strong experience selling to contractors, engineers, architects, municipalities, dealers and big box retailers within the construction related industry.<br/><br/>This company is selling Masonry products to Contractors, Architects, Developers and Big Box retailers.<br/><br/>This is a family owned company, so the successful candidate will be politically nimble, honest and have a strong work ethic.<br/><br/><br/><strong>What You Have:</strong><br/><ul><li>College Degree (4 years).</li><li>(5-10+) years of successful selling experience to contractors, engineers, architects, municipalities, dealers and big box retailers</li><li>(5+) years of successful experience managing sales teams (Will have 10 direct reports, including 3 managers and 2 special projects managers)</li><li>Consistent Record of Exceeding Quotas.</li><li>Must have a stable work history, be a strategic thinker, have high integrity, a strong work ethic, track record and have a very high social EQ, (natural ability to read the room, then lead the room).</li><li>Proven ability to successfully interact with C-level Executives &amp; Owners, Negotiate, and Close business.</li><li>Able to write Cogent, Quality, Business Value Proposals.</li><li>Excellent Presentation Skills.</li><li>Personable, Fun to be Around &amp; Don't Take Yourself Too Seriously!</li></ul><br/><br/><br/><strong>What They Offer:</strong><br/><ul><li>Very Competitive Compensation Plan w/ No Cap that includes Bonuses + Profit Sharing!</li><li>Flexible Time Off Policy to Balance your Work and Personal life.</li><li>Great Family, Fun Corporate Culture.</li><li>Excellent Medical, Dental, and Vision Coverage for You and Yours, includes Life Insurance, Parental Leave Plans, etc..</li><li>Collaborative, Transparent, Management Team!</li><li>You'll Meet Your Career Goals in an Upwardly Mobile Work Environment!</li></ul><br/><br/><strong>Base Salary: </strong>$200,000.00 (DOE)<br/><br/><strong>Total Compensation: </strong>$240,000.00 - $250,000.00 + (No Cap) + vehicle + profit sharing + Great Benefits Package + Full Expenses<br/><br/><strong>Location: </strong>Los Angeles or Orange County, CA<br/><br/><strong>Relocation</strong>: No<br/><br/><strong>Openings: </strong>(1)<br/><br/><strong>Travel: </strong>20%<br/><br/><br/>If you wish to be part of this successful and vibrant organization, please email a MS Word version of your resume to recruiting3163@cubemanagement.com. This company is an Equal Opportunity / Affirmative Action Employer.<br/><br/>Cube Management is a leading recruiting and consulting partner to emerging growth, mid-market and global companies in the technology, manufacturing, healthcare, consumer package goods and business service sectors. We work across the spectrum of Operations, Sales, Marketing, Safety, Engineering, Accounting and Business Development, providing holistic solutions that drive revenue and profit success. Cube Management combines Strategy, Process and People, to produce great results.<br/><br/>For a complete listing of our current job listings please visit http://cubemanagement.com/candidates/job-listings/", "responsibilities": "", "qualifications": {"required": "College Degree (4 years), (5-10+) years of successful selling experience to contractors, engineers, architects, municipalities, dealers and big box retailers, (5+) years of successful experience managing sales teams (Will have 10 direct reports, including 3 managers and 2 special projects managers), Consistent Record of Exceeding Quotas., Must have a stable work history, be a strategic thinker, have high integrity, a strong work ethic, track record and have a very high social EQ, (natural ability to read the room, then lead the room)., Proven ability to successfully interact with C-level Executives &amp; Owners, Negotiate, and Close business., Able to write Cogent, Quality, Business Value Proposals., Excellent Presentation Skills., Personable, Fun to be Around &amp; Don't Take Yourself Too Seriously!", "preferred": ""}, "skills": [], "postedDate": "3 days ago", "applicationDeadline": "", "benefits": "Very Competitive Compensation Plan w/ No Cap that includes Bonuses + Profit Sharing!, Flexible Time Off Policy to Balance your Work and Personal life., Great Family, Fun Corporate Culture., Excellent Medical, Dental, and Vision Coverage for You and Yours, includes Life Insurance, Parental Leave Plans, etc.., Collaborative, Transparent, Management Team!, You'll Meet Your Career Goals in an Upwardly Mobile Work Environment!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4006142839"}