{"jobTitle": "Talent Experience Operations Partner", "company": {"name": "Netflix", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "80,000.00 - 280,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Netflix is the world's leading streaming entertainment service with 260 million paid memberships in over 190 countries enjoying TV series, documentaries, feature films and gaming across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/>We are at a very exciting stage of evolution at Netflix. With the growth in employee population, lines of business, geo-diversity, and heterogeneity of the workforce, it is imperative that the Talent function evolves accordingly, to shape and support this progress. One of the most critical parts of this evolution is the foundation upon which we can scale personalized and inclusive experiences for the workforce.<br/><br/><strong>About Talent Experience Operations<br/><br/></strong>The Talent Experience Operations (TEO) team is primarily responsible for developing the Talent ecosystem. The broad composition of the team includes Lifecycle operations (all workflows across the candidate, employee and contingent talent journey), Data and Analytics, Technology strategy, and Global Programs like Benefits, Mobility, Employee Health, Accessibility, etc.<br/><br/><strong>About Experience Integration<br/><br/></strong>The Experience Integration team supports and advocates for our acquisitions and new lines of business, and partners with the broader TEO team across all regions to integrate them into a single, scalable talent ecosystem for all Netflix employees. Our acquisitions and new lines of business include animation studios, visual effects studios, games studios, and retail locations.<br/><br/>The Talent Experience Operations Partner will be instrumental in providing support and guidance to talent leaders within our acquisitions and new lines of business. Acting as the frontline consultant for talent operation. This role will support and enable talent operations practices within the team.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Serve as the primary consultant for talent leaders, assisting them in executing effective talent operations practices.</li><li>Focus on increasing business operations capabilities, empowering leaders in acquisitions and new lines of business to be self-sufficient while ensuring alignment with core Netflix practices.</li><li>Work closely with partners across the Talent Experience Operations (TEO) team, including operations, technology, programs, and analytics, to ensure comprehensive design and delivery support for each acquisition and new line of business.</li><li>Service as the liaison between project teams for talent operations integration and enabling Talent Operations Manager through coordination of business deliverables in execution of projects leading to talent operations integrations. </li><li>Collaborate with regional and global operations delivery teams to ensure our acquisitions and new lines of business are well-supported.</li><li>Guide business leaders and team members to focus on impactful work by collaborating with key partners, including the Experience Integration Project Manager, the Experience Integration Employee Services Generalists, Business Unit HR Operations Coordinators.<br/><br/></li></ul><strong>Profile/Experience<br/><br/></strong><ul><li>Bachelor’s degree or higher, in Human Resources or related field.</li><li>Min. 5 years of relevant Human Resources Operations experience partnering with managers on the full employment lifecycle.</li><li>Strong business and HR acumen, including strong problem solving skills, high judgment, critical thinking and analysis.</li><li>Strong systems capabilities; understanding of project management on a technical level and ability to collaborate closely with solutions engineers and architects.</li><li>Strong communication skills; excellent spoken and written English.</li><li>Ability to drive recommendations and prioritization.</li><li>Experience working in a highly matrixed organization.</li><li>Project management and execution skills..</li><li>Possesses intellectual curiosity and brings insight into the team &amp; business.<br/><br/></li></ul>Generally, our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $80,000 - $280,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "The Talent Experience Operations Partner will be instrumental in providing support and guidance to talent leaders within our acquisitions and new lines of business. Acting as the frontline consultant for talent operation. This role will support and enable talent operations practices within the team.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Serve as the primary consultant for talent leaders, assisting them in executing effective talent operations practices.</li><li>Focus on increasing business operations capabilities, empowering leaders in acquisitions and new lines of business to be self-sufficient while ensuring alignment with core Netflix practices.</li><li>Work closely with partners across the Talent Experience Operations (TEO) team, including operations, technology, programs, and analytics, to ensure comprehensive design and delivery support for each acquisition and new line of business.</li><li>Service as the liaison between project teams for talent operations integration and enabling Talent Operations Manager through coordination of business deliverables in execution of projects leading to talent operations integrations. </li><li>Collaborate with regional and global operations delivery teams to ensure our acquisitions and new lines of business are well-supported.</li><li>Guide business leaders and team members to focus on impactful work by collaborating with key partners, including the Experience Integration Project Manager, the Experience Integration Employee Services Generalists, Business Unit HR Operations Coordinators.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s degree or higher, in Human Resources or related field.<br/>Min. 5 years of relevant Human Resources Operations experience partnering with managers on the full employment lifecycle.<br/>Strong business and HR acumen, including strong problem solving skills, high judgment, critical thinking and analysis.<br/>Strong systems capabilities; understanding of project management on a technical level and ability to collaborate closely with solutions engineers and architects.<br/>Strong communication skills; excellent spoken and written English.<br/>Ability to drive recommendations and prioritization.<br/>Experience working in a highly matrixed organization.<br/>Project management and execution skills..<br/>Possesses intellectual curiosity and brings insight into the team &amp; business.<br/><br/>", "preferred": ""}, "skills": ["Human Resources", "Project Management", "Business Acumen", "Communication", "Problem Solving"], "postedDate": "1 day ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4006531906"}