{"jobTitle": "Project Coordinator", "company": {"name": "Aston Carter", "location": "Thousand Oaks, CA"}, "location": "Thousand Oaks, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry Level", "description": "Basic Function We are seeking a highly motivated and organized Project Coordinator to join our team. The Project Coordinator will play a key role in supporting the successful execution of projects from initiation to completion. The ideal candidate will possess strong organizational skills, excellent communication abilities, and a proactive approach to problem-solving. If you are a detail-oriented individual with a passion for project management, we invite you to apply and contribute to the achievement of our organizational goals. Primary Responsibilities include but not limited to: - Maintain and organize project documentation, including contracts, permits, drawings, and other important records. - Assist project managers in procurement activities by communicating with the supply chain team. - Tasking supply chain team members to give up-to-date information on completion dates internally and deliveries from vendors. - Prepare and distribute project-related communications, such as memos, emails, and reports. - Coordination with logistics team that all items requested to ship are fulfilled on time. - Follow up communication, emails, and tasking to help identify potential incomplete or missing components for upcoming projects. - Input project-related data into databases and project management software. - Facilitate the billing and invoice process with the project managers using the HLS internal tools. - Provide customers with billing and invoice documentation. - Provide general administration to project management team.<br/><br/>Skills<br/><br/>Construction, Project coordination, Data entry, invoices, Oracle, Excel, Administration, Microsoft office, Administrative support, invoice entry, bachelors degree<br/><br/>Top Skills Details<br/><br/>Construction,Project coordination,Data entry,invoices,Oracle,Excel<br/><br/>Additional Skills &amp; Qualifications<br/><br/>Bachelors degree Oracle Excel<br/><br/>Experience Level<br/><br/>Entry Level<br/><br/>About Aston Carter<br/><br/>Aston Carter provides world-class corporate talent solutions to thousands of clients across the globe. Specialized in accounting, finance, human resources, talent acquisition, procurement, supply chain and select administrative professions, we extend the capabilities of industry-leading companies. We draw on our deep recruiting expertise and expansive network to meet the evolving needs of our clients and talent community with agility and excellence. With offices across the U.S., Canada, Asia Pacific and Europe, Aston Carter serves many of the Fortune 500. We are proud to be a ClearlyRated Best of Staffing® double diamond winner for both client and talent service.<br/><br/>Diversity, Equity &amp; Inclusion<br/><br/>At Aston Carter, Diversity And Inclusion Are a Bridge Towards The Equity And Success Of Our People. DE&amp;I Are Embedded Into Our Culture Through<br/><br/><ul><li>Hiring diverse talent</li><li>Maintaining an inclusive environment through persistent self-reflection</li><li>Building a culture of care, engagement, and recognition with clear outcomes</li><li>Ensuring growth opportunities for our people<br/><br/></li></ul>The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.<br/><br/>If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email astoncarteraccommodation@astoncarter.com for other accommodation options.", "jobFunction": "Other", "industry": "Staffing and Recruiting", "skills": ["Construction", "Project coordination", "Data entry", "invoices", "Oracle", "Excel", "Administration", "Microsoft office", "Administrative support", "invoice entry", "bachelors degree"], "postedDate": "2 days ago", "url": "https://www.linkedin.com/jobs/view/4006593516"}