{"jobTitle": "Executive Assistant, Amazon AGI", "company": {"name": "Amazon", "location": "San Francisco, CA"}, "location": "San Francisco, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Administrative", "industry": "Software Development", "description": "The Amazon Artificial General Intelligence (AGI) organization is looking for an exceptionally bright and self-motivated Executive Assistant to support a VP in our fast-paced, exciting, and growing organization in San Francisco, CA.<br/><br/>This Executive Assistant will work in a team environment to build effective working relationships inside and outside of the group, driving forward business objectives, policies, and procedures while maintaining professionalism in dealing with senior executives. Key to success in this role is the ability to properly handle confidential information and manage multiple tasks in parallel, which you will deliver to tight deadlines with minimal guidance or supervision. As such, you must be skilled at anticipating problems, dealing with ambiguity, creating contingency plans, managing multiple priorities, setting expectations, problem solving, and organizing logistics. A successful candidate will help build a positive team environment and establish working relationships inside and outside of the group.<br/><br/>Key job responsibilities<br/><br/><ul><li> Management of complex calendar and scheduling</li><li> Coordinating travel to domestic and international locations</li><li> Track and help drive completion of key deliverables and follow up on outstanding items</li><li> Manage expense report coordination and submission</li><li> Organize, execute, and assist with team activities (meeting agendas, all-hands meetings, off-sites, and team social events)</li><li> Work closely with the leadership team, and other Executive Assistants to provide support to the organization</li><li> Management of team space, including office moves and reconfigurations</li><li> Management of highly confidential information<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> Experience with Microsoft Office products and applications</li><li> 5+ years of executive assistant experience</li><li> Experience with executive level calendar management</li><li> Experience with domestic or international travel coordination<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Experience leading process improvements</li><li> Experience in a fast-paced, high-tech company</li><li> Experience designing processes to maximize efficiency</li><li> Bachelor's degree</li><li> Experience with space management</li><li> Excellent written and verbal communication skills</li><li> Proven ability to handle administrative details independently, while exercising good judgment in keeping team members informed</li><li> Proven ability to work in a highly ambiguous environment<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $66,800/year in our lowest geographic market up to $142,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2683577", "postedDate": "1 day ago", "skills": ["Microsoft Office", "Calendar Management", "Travel Coordination", "Process Improvement", "Communication", "Problem Solving"], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4006855823"}