{"jobTitle": "Planner, Inventory Management", "company": {"name": "Parachute Home", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00 - $100,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "The Planner will be responsible for creating the pre-season and in-season sales forecasts and inventory management of specific product categories. In this role you will drive the success of your product categories by delivering/exceeding financial and inventory productivity goals. You will provide accurate and timely information to cross-functional teams, as necessary. Our ideal candidate will be a self-starting, sharply analytical problem-solver with proven planning acumen and the ability to adapt to the Parachute business model.<br/><br/><strong>Reports to: </strong>Director, Inventory Planning<br/><br/><strong>Location: </strong>Remote or Hybrid in Los Angeles<br/><br/><strong>What You'll Do:<br/><br/></strong><ul><li>Create pre-season plans and maintain in-season sales and receipt forecasts for specific high-growth product categories.</li><li>Recap and analyze actual sales results to plan and forecast in-season sales and inventories on a weekly, monthly and quarterly basis.</li><li>Forecast receipt flow to ensure optimal inventory levels that balance liability and opportunity.</li><li>Assess and evaluate inventory risks and opportunities in a high-growth environment.</li><li>Perform ad-hoc analysis based on historical performance, product attributes and customer attributes.<br/><br/></li></ul><strong>Who You Are:<br/><br/></strong><ul><li>Business degree</li><li>3-5 years of experience in Planning and Inventory Management</li><li>Retail Experience preferred</li><li>Home and/or Apparel experience</li><li>High level of proficiency with Microsoft Excel and strong aptitude to learn technical applications quickly.</li><li>Strong planning and organizational skills.</li><li>Comfortable and confident making decisions and recommendations grounded in data.</li><li>Able to thrive in a fast-paced environment that embraces change.</li><li>Possesses a bias towards action, is results-focused and detail oriented.</li><li>Able to work collaboratively with cross-functional teams.<br/><br/></li></ul><strong>What You'll Get:<br/><br/></strong><ul><li>Free bedding for a great night's sleep, an awesome discount and $300 worth of free product a year!</li><li>Health, dental and vision benefits with 100% employee coverage offering</li><li>Flexible vacation packages</li><li>401k </li><li>Competitive salary and stock options<br/><br/></li></ul>Parachute takes a market-based approach to pay, and pay may vary depending on your location. Your actual base salary will depend on factors such as your skills, qualifications, experience, and work location. The estimated pay range for this role is $80,000 - $100,000.<br/><br/><strong>About Us<br/><br/></strong>Our belief is that when we take care of our home, it takes care of us. Home is an extension of the self. It offers a sense of belonging and welcomes all with ease and warmth. It's where we recharge, wash off the day and rest up for tomorrow. Home is the most comforting word there is. That's why they say there's no place like it. The unmistakable feeling of home is what inspired us to create Parachute. To responsibly make essential, lasting items that transform a house into so much more.<br/><br/>Parachute was certified as a great place to work! Check us out here<br/><br/><strong>Our Commitment to You<br/><br/></strong>We believe in the power of a diverse workplace. Which is why we are committed to actively recruiting and hiring people of all races, religions, colors, national origins, genders, gender identities or expressions, sexual orientations, ages, marital statuses, veteran statuses and disability statuses. As an equal opportunity employer, we celebrate diversity and foster an inclusive environment by committing to diverse hiring practices, encouraging education and communication and building a DE&amp;I enrichment and training program.<br/><br/><em>Ensure your Parachute Home job offer is legitimate and don't fall victim to fraud. Parachute never seeks payment from job applicants. Parachute recruiters will only reach out to applicants from an @parachutehome.com email address. For added security, where possible, apply through our company website at</em> <em>www.parachutehome.com/careers</em><em>.</em>", "responsibilities": "The Planner will be responsible for creating the pre-season and in-season sales forecasts and inventory management of specific product categories. In this role you will drive the success of your product categories by delivering/exceeding financial and inventory productivity goals. You will provide accurate and timely information to cross-functional teams, as necessary. Our ideal candidate will be a self-starting, sharply analytical problem-solver with proven planning acumen and the ability to adapt to the Parachute business model.", "qualifications": {"required": "Business degree, 3-5 years of experience in Planning and Inventory Management, Retail Experience preferred, Home and/or Apparel experience, High level of proficiency with Microsoft Excel and strong aptitude to learn technical applications quickly., Strong planning and organizational skills., Comfortable and confident making decisions and recommendations grounded in data., Able to thrive in a fast-paced environment that embraces change., Possesses a bias towards action, is results-focused and detail oriented., Able to work collaboratively with cross-functional teams.", "preferred": ""}, "skills": ["Inventory Management", "Sales Forecasting", "Microsoft Excel", "Planning", "Retail", "Home", "Apparel", "Data Analysis", "Decision Making", "Collaboration"], "postedDate": "1 day ago", "benefits": "Free bedding for a great night's sleep, an awesome discount and $300 worth of free product a year!, Health, dental and vision benefits with 100% employee coverage offering, Flexible vacation packages, 401k, Competitive salary and stock options", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4006128172"}