{"jobTitle": "Entry Level Events Assistant", "company": {"name": "Diaz Consulting", "industry": "Business Consulting and Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$1,100.00 - $1,350.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Business Consulting and Services", "description": "We are seeking an enthusiastic and detail-oriented individual to join our team as an Entry Level Events Assistant. In this role, you will be responsible for supporting the planning and execution of various events, ensuring they run smoothly and successfully. This is an excellent opportunity for someone interested in the event management industry to gain hands-on experience and develop their skill set.", "responsibilities": "Assist with event logistics, including venue selection and setup, catering arrangements, transportation, and audiovisual requirements. Collaborate with cross-functional teams to coordinate event agendas, timelines, and schedules. Manage event invitations and RSVPs, ensuring accurate attendee lists and timely communication. Assist with event marketing activities, such as creating event collateral and coordinating social media promotion. Provide on-site support during events, including registration, guest greeting, and troubleshooting. Help maintain event budgets and track expenses. Conduct post-event evaluations and compile event feedback for future improvement.", "qualifications": {"required": "Bachelor's degree in event management, hospitality, marketing, or a related field. Strong organizational and multitasking skills, with the ability to prioritize tasks in a fast-paced environment. Excellent attention to detail and problem-solving abilities. Proficiency in Microsoft Office Suite and event management software. Outstanding communication and interpersonal skills. Ability to work both independently and as part of a team. Flexibility to work evenings and weekends, as required. Knowledge of event industry trends and best practices is a plus.", "preferred": ""}, "skills": ["Event logistics", "Communication", "Organizational skills", "Problem-solving", "Microsoft Office Suite", "Event management software"], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "Competitive entry-level salary. Health, dental, and vision insurance. 401(k) retirement plan with company match. Paid time off and holidays. Opportunities for professional development and career advancement. Dynamic and collaborative work environment", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4006308910"}