{"jobTitle": "Executive Assistant, Amazon Shipping", "company": {"name": "Amazon", "location": "Bellevue, WA"}, "location": "Bellevue, WA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "50,000.00/year - 107,100.00/year", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Software Development", "description": "<strong>Description<br/><br/></strong>Are you always looking around corners and anticipating needs? Do you believe that details matter and want to support a highly engaged team? We are looking for an exceptionally bright, well organized and self-motivated Executive Assistant to become part of our Amazon Shipping team supporting multiple leaders.<br/><br/>We are seeking a driven, bright, and motivated individual with a history of high performance to support our organization. This exciting role requires superior attention to detail, great organization and prioritization skills, the ability to plan ahead and to meet tight deadlines, all while juggling multiple critical requests.<br/><br/>A high level of integrity and discretion in handling confidential information, and professionalism in dealing with leaders (at and outside Amazon) is important, as is the ability to be flexible and change direction seamlessly. The successful candidate will possess the ability to complete complex tasks and projects quickly with little guidance, react with appropriate urgency to situations that require a quick turnaround, and want to take on varied and exciting new projects and learn new skills. You’ll need to take effective action without having to know the total picture, and efficiently and proactively solve difficult or complex problems that affect people within the department or other related groups.<br/><br/>Key job responsibilities<br/><br/><ul><li> Manage complex calendars and scheduling to support teams in multiple locations</li><li> Plan and Manage executive domestic and international travel</li><li> Manage timely expense report coordination and submission</li><li> Organize, execute, and assist with team activities (staff meeting agendas, all-hands meetings, off-sites, and team social events)</li><li> Ensure the timely completion of critical tasks and follow up on outstanding matters.</li><li> Act as a liaison for direct reports</li><li> Work closely with the leadership team, program managers, recruiting, and other Executive Assistants to provide support to the organization</li><li> Help to develop &amp; maintain new mechanisms within the team</li><li> High judgment and decision making in an ambiguous environment</li><li> Excellent communication (written and verbal) and interpersonal skills<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> 2+ years of senior level leadership support, or 1+ years of Amazon experience</li><li> High school or equivalent diploma</li><li> Experience with Microsoft Office products and applications<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Experience in a fast-paced, high-tech company</li><li> Experience managing multiple calendars</li><li> Bachelor's degree<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $50,000/year in our lowest geographic market up to $107,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2738901", "responsibilities": "<ul><li> Manage complex calendars and scheduling to support teams in multiple locations</li><li> Plan and Manage executive domestic and international travel</li><li> Manage timely expense report coordination and submission</li><li> Organize, execute, and assist with team activities (staff meeting agendas, all-hands meetings, off-sites, and team social events)</li><li> Ensure the timely completion of critical tasks and follow up on outstanding matters.</li><li> Act as a liaison for direct reports</li><li> Work closely with the leadership team, program managers, recruiting, and other Executive Assistants to provide support to the organization</li><li> Help to develop &amp; maintain new mechanisms within the team</li><li> High judgment and decision making in an ambiguous environment</li><li> Excellent communication (written and verbal) and interpersonal skills<br/><br/></li></ul>", "qualifications": {"required": "2+ years of senior level leadership support, or 1+ years of Amazon experience\nHigh school or equivalent diploma\nExperience with Microsoft Office products and applications", "preferred": "Experience in a fast-paced, high-tech company\nExperience managing multiple calendars\nBachelor's degree"}, "skills": ["Microsoft Office"], "postedDate": "2 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4006161172"}