{"jobTitle": "Company Coordinator", "company": {"name": "NEON", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "67,000.00 - 70,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "We Are:\n\nNEON is an independent film distribution and production company that champions bold cinema, taking creative risks and pushing boundaries. Our passion lies in auteur-driven content and amplifying diverse voices. From Oscar-nominated documentaries to Palme d'Or winners at Cannes, NEON continues to push the boundaries of storytelling in cinema.\n\nThe Role:\n\nWe are looking for a Company Coordinator to join our team! As the Company Coordinator, you will be responsible for providing day-to-day administrative support to our Founder/CEO and working closely with various departments to ensure the smooth and efficient operation of the company. This position reports directly to the Founder/CEO and is based in our Los Angeles office.\n\nHere's What You Will Do:\n\n<ul><li>Executive Support:</li><ul><li>Provide comprehensive administrative support to the CEO/Founder, including managing calendars, and scheduling meetings</li><li>Conduct research and prepare presentations as needed</li><li>Coordinate travel arrangements and itineraries</li><li>Manage confidential information with discretion</li><li>Serve as a central point of contact for internal and external communications, ensuring timely and effective information flow</li></ul><li>Interdepartmental Coordination:</li><ul><li>Serve as a liaison between the CEO/Founder and various departments (development, theatrical, finance, marketing, etc.)</li><li>Facilitate communication and collaboration among team members</li><li>Coordinate cross-departmental projects and initiatives as assigned by the CEO/Founder</li></ul><li>Development Support:</li><ul><li>Assist the acquisitions & development team by providing script and screener coverage, as well as film festival coordination</li><li>Conduct research on potential projects and talent</li><li>Prepare development materials and presentations<br/><br/></li></ul></ul>Compensation:\n\nCalifornia State Annual Pay Transparency Range: $67,000 - $70,000. For full-time positions, this pay range is for base per year; however, base pay offered may vary depending on factors such as location, candidate's job-related knowledge, education, skills, and experience, the level of specialization needed for the role, budget constraints, and local market conditions.\n\nThe NEON Hybrid Work Model:\n\nOur hybrid work model is beautifully straightforward: We spend three days a week working from the office. These intentional in-person days in curated workspaces allow us to fully embrace the benefits of collaboration. The remaining days of the week are yours to decide where to work, allowing for a seamless blend of work and personal life.\n\nWe would love to hear from you if you are an organized and detail-oriented individual with a passion for independent cinema. Join our team and contribute to NEON's success as we continue to redefine the film industry.\n\nRequirements\n\nWhat We're Looking For:\n\n<ul><li> Experience: Minimum of 2 years of experience in an administrative or coordination role, preferably in the entertainment industry</li><li> Organization Skills: Strong organization skills and ability to multitask and prioritize in a fast-paced environment</li><li> Attention to Detail: Excellent attention to detail and accuracy in all work</li><li> Communication: Strong written and verbal communication skills</li><li> Problem-Solving: Proactive problem-solving skills and ability to adapt to changing priorities</li><li> Team Player: Ability to work effectively in a team environment and collaborate with colleagues across different departments<br/><br/><br/></li></ul>Benefits\n\n<ul><li>Get peace of mind with our Comprehensive Health Care Plan, covering medical, dental, and vision expenses</li><li>Secure your future with our Retirement Savings Plan, offering options like 401k and IRA</li><li>Stay protected with our Life Insurance Coverage, including both Basic and Voluntary plans, as well as AD&amp;D</li><li>Enjoy a healthy work-life balance with our Generous Paid Time Off policy, which encompasses vacation, sick days, and public holidays</li><li>Take care of your loved ones with our Family Leave Options, including Parental and Caregiver Leaves</li><li>Flexible Work Arrangements</li><li>Invest in your wellbeing through our Wellness Programs and Resources<br/><br/></li></ul><em>NEON is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision</em> <em> meaning that all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, national origin, mental or physical disability, status as a protected veteran, or any other legally protected characteristic</em>.\n\n<em>We are committed to fostering and promoting an inclusive environment that allows us to recruit and retain highly talented staff with diverse backgrounds and differing abilities. The job description is to be used merely as a guide of expectations rather than an exhaustive list of all duties and competencies. All requirements and skills are subject to change as business needs evolve.<br/><br/></em><em> Applicants in the United States of America have rights under Federal Employment Laws: </em><em>Family &amp; Medical Leave Act</em><em>,</em><em>Equal Opportunity Employment</em><em>,</em><em>Employee Polygraph Protection Act<br/><br/></em><em>As part of this commitment, NEON will ensure that persons with disabilities are provided with reasonable accommodations. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please let your NEON contact/recruiter know.</em>", "responsibilities": "As the Company Coordinator, you will be responsible for providing day-to-day administrative support to our Founder/CEO and working closely with various departments to ensure the smooth and efficient operation of the company. This position reports directly to the Founder/CEO and is based in our Los Angeles office.", "qualifications": {"required": "Experience: Minimum of 2 years of experience in an administrative or coordination role, preferably in the entertainment industry\nOrganization Skills: Strong organization skills and ability to multitask and prioritize in a fast-paced environment\nAttention to Detail: Excellent attention to detail and accuracy in all work\nCommunication: Strong written and verbal communication skills\nProblem-Solving: Proactive problem-solving skills and ability to adapt to changing priorities\nTeam Player: Ability to work effectively in a team environment and collaborate with colleagues across different departments", "preferred": ""}, "skills": [], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "Get peace of mind with our Comprehensive Health Care Plan, covering medical, dental, and vision expenses\nSecure your future with our Retirement Savings Plan, offering options like 401k and IRA\nStay protected with our Life Insurance Coverage, including both Basic and Voluntary plans, as well as AD&amp;D\nEnjoy a healthy work-life balance with our Generous Paid Time Off policy, which encompasses vacation, sick days, and public holidays\nTake care of your loved ones with our Family Leave Options, including Parental and Caregiver Leaves\nFlexible Work Arrangements\nInvest in your wellbeing through our Wellness Programs and Resources", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4006145762"}