{"jobTitle": "Team Manager - Rodeo Drive", "company": {"name": "Louis Vuitton", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "USD$110,000 - $120,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Retail Apparel and Fashion, Retail Luxury Goods and Jewelry, and Retail", "description": "Louis Vuitton is seeking a highly motivated Team Manager to join our team!<br/><br/>A Team Manager at Louis Vuitton is an ambassador of the Brand. You will take ownership to lead and mentor your team, build Client relationships, proactively further the achievement of sales goals and ensure that the highest level of Client experience is delivered. Our Team Managers proudly represent the Brand values and demonstrate the Louis Vuitton attitudes toward Clients and team members.<br/><br/>Profile<br/><br/>In collaboration with the Store Manager you will have ownership of the business and team performance, driving each to success. To be successful in this role you must be commercially minded with an understanding of the luxury and local market, ideally gained within the retail sector. With extensive people leadership skills and a passion for exceptional customer service, you will continuously strive to exceed our clients’ expectations. Given the fast paced nature of our business you must have an agile approach to your role and thrive working in a dynamic and evolving environment.<br/><br/>As a Team Manager you will ensure your team delivers an outstanding experience to each client. You will provide consistent coaching and identify tailored development and training needs for individual and team goals. Team Managers create and deliver action plans to boost business and enhance product performance by using visual merchandising, clienteling, training and team animation.<br/><br/>As a Team Manager, you will be responsible for:<br/><br/><ul><li>Team Management and Development</li><li>Client and Business Development</li><li>Selling and Floor Management</li><li>Operations<br/><br/></li></ul><em>The appointed candidate will be offered a salary within the range of USD$110,000 - $120,000 annually, plus the opportunity for a bonus, a comprehensive benefits package including medical, dental, vision, short and long-term disability, various paid time off programs, employee discount/perks and two retirement plans both with employer contributions <br/><br/></em>Additional information<br/><br/>Louis Vuitton is a company that respects the uniqueness of each employee and offers everyone the means to find their place and prosper. We promote initiatives aimed at supporting professional equality for everyone. We strive to go above and beyond purely symbolic measures by building a culture passionate about meaningful strategies aimed at crafting an inclusive workforce.<br/><br/>In addition to a generous benefits package, unparalleled career development opportunities, both locally &amp; globally, as an employee at Louis Vuitton, you can expect to be provided with industry leading training which will offer you an in-depth insight into the luxury and retail environment.<br/><br/>Please see our Privacy Policy for information on the personal information we collect from job applicants, how we use it, and your rights with respect to this information.<br/><br/><em>We will consider for employment all qualified Applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.<br/><br/></em>Reference LVM23954", "responsibilities": "In collaboration with the Store Manager you will have ownership of the business and team performance, driving each to success. To be successful in this role you must be commercially minded with an understanding of the luxury and local market, ideally gained within the retail sector. With extensive people leadership skills and a passion for exceptional customer service, you will continuously strive to exceed our clients’ expectations. Given the fast paced nature of our business you must have an agile approach to your role and thrive working in a dynamic and evolving environment.<br/><br/>As a Team Manager you will ensure your team delivers an outstanding experience to each client. You will provide consistent coaching and identify tailored development and training needs for individual and team goals. Team Managers create and deliver action plans to boost business and enhance product performance by using visual merchandising, clienteling, training and team animation.<br/><br/>As a Team Manager, you will be responsible for:<br/><br/><ul><li>Team Management and Development</li><li>Client and Business Development</li><li>Selling and Floor Management</li><li>Operations<br/><br/></li></ul>", "qualifications": {"required": "To be successful in this role you must be commercially minded with an understanding of the luxury and local market, ideally gained within the retail sector. With extensive people leadership skills and a passion for exceptional customer service, you will continuously strive to exceed our clients’ expectations. Given the fast paced nature of our business you must have an agile approach to your role and thrive working in a dynamic and evolving environment."}, "skills": [], "postedDate": "1 day ago", "benefits": "The appointed candidate will be offered a salary within the range of USD$110,000 - $120,000 annually, plus the opportunity for a bonus, a comprehensive benefits package including medical, dental, vision, short and long-term disability, various paid time off programs, employee discount/perks and two retirement plans both with employer contributions ", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007027350"}