{"jobTitle": "Remote Sales Consultant: Drive Success, Reap Rewards", "company": {"name": "Kenneth Brown Agency", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Join Our Award-Winning Team and Propel Your Career to New Heights!<br/><br/>Our company has been recognized as a Top Company Culture for consecutive years by Entrepreneur Magazine, with outstanding employee ratings on Glassdoor and Indeed. Recently featured in Forbes and honored on the Inc. 5000 list for six consecutive years, we lead in rapid growth and excellence.<br/><br/>Why Choose Us?<br/><br/><ul><li>Flexible Work Schedule: Enjoy a condensed 3-4 day work week for optimal work-life balance</li><li>Comprehensive Training: Access our cutting-edge online training and support system at no cost</li><li>Exclusive Leads: Say goodbye to cold calls with our in-house lead generation system</li><li>Daily Commission Payouts: Earn commissions swiftly with no waiting periods in this commission-only role</li><li>State-of-the-Art Technology: Utilize industry-leading tools to automate and enhance your sales process</li><li>Guided Mentorship: Benefit from ongoing guidance and mentorship from successful industry professionals</li><li>Global Incentives: Earn opportunities for multiple all-expense-paid incentive trips worldwide<br/><br/></li></ul>Responsibilities:<br/><br/>Working closely with mentors and as part of a collaborative team, our sales representatives play a pivotal role.<br/><br/>Our company receives inbound inquiries nationwide from individuals seeking information about various insurance products. Sales agents engage with these prospects over the phone, gathering qualifying details and scheduling virtual meetings (via Zoom or phone). Using our proprietary tools, agents provide tailored quotes and present solutions during these virtual sessions.<br/><br/>The typical sales cycle—from initial contact to commission payment—is completed within 72 hours.<br/><br/>Must-Have Qualities:<br/><br/><ul><li>Integrity: Uphold strong moral character, embodying our value of doing the right thing even when unsupervised</li><li>Dedication: Demonstrate a strong work ethic and a commitment to continuous improvement</li><li>Coachability: Approach learning with humility and openness to feedback<br/><br/></li></ul>If you're an ambitious professional seeking a rewarding challenge, we offer an opportunity that exceeds expectations.<br/><br/>Apply Now!<br/><br/>Submit your resume along with why you believe you're a great fit. We look forward to reviewing your application and scheduling an interview.<br/><br/>Disclaimer:<br/><br/>This position operates under a 1099 independent contractor commission-based structure.<br/><br/>Powered by JazzHR<br/><br/>fEBwT42BxO", "postedDate": "4 days ago", "remoteWork": "Yes", "skills": [], "url": "https://www.linkedin.com/jobs/view/4007514991"}