{"jobTitle": "Senior Product Designer", "company": {"name": "Klarity", "location": "San Francisco, CA"}, "location": "San Francisco, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "150,000.00/yr - $200,000.00/yr", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Software Development", "description": "Experience: 5-10 years<br/><br/>Location: San-Francisco/Bay-Area (relocation bonus available), Hybrid<br/><br/>Job Type: Full-time<br/><br/><strong>About Klarity<br/><br/></strong>Klarity (YC S18) automates Unstructured-Document workflows using GenAI. Our vision is a future of Exponential Organizations - companies that can hyper-scale without vast operational teams of humans reading documents.<br/><br/>Our customers include companies like Cloudflare, CrowdStrike, DoorDash, and Zoom. They use Klarity to 1) save time and money, 2) reduce compliance risk, and 3) speed up manual contract review. But talk is cheap, so try our demo!<br/><br/>We found strong Product Market Fit in 2020 and raised an $18m Series A in Dec 2021. In June this year, we celebrated another significant milestone with a successful $70 million Series B funding round, led by NFDG! We are looking to add a brilliant, entrepreneurial Sr. Product Designer to the team!<br/><br/><strong>Our Gen AI Journey<br/><br/></strong>Founded in 2017, we shipped multiple NLP/ML product iterations pre-chatGPT. In 2023 we rebuilt our core AI platform using GenAI.<br/><br/>We’re not your average Gen AI startup, gradually layering LLMs on. We’re all in. We have more than 15 unique LLM use-cases in production with 10+ LLMs under the hood. We have shipped multiple first-of-its-kind customer experiences including video workflow analysis, natural language analytics, complex table parsing, and table-matching. To date, we have processed 600,000+ documents through our GenAI platform.<br/><br/><strong>You Will Enjoy This Role If<br/><br/></strong><li>You tinker: you embracing AI mindset and constantly seek AI technologies to solve different problems</li><li>You are obsessed with AI and frequently spend your free-time thinking about how AI will change the world.</li><li>Growth mindset: You will seek out uncomfortable experiences in service of your own growth. </li>You’re seeking a culture of breakneck iteration and constant change. We shipped this demo &lt; 12 hours after the GPT-4 launch :)<li>You thrive in finding creative solutions to ambiguous problem statements, rather than wanting to “stay in your lane”.</li><li>You’re not indexing on work-life balance; You prefer an environment of like minded, ultra-committed, live-and-breath AI people. </li><li>You enjoy close collaboration, care about people and want to build strong bonding with your teammates.<br/><br/></li><strong>In This Role, You Will<br/><br/></strong><ul><li>Craft user-centric experiences by aligning visual and interaction design to solve user problems.</li><li>Incorporate AI technology to enhance user interactions and improve workflow efficiencies.</li><li>Balance business goals, user requirements, and engineering feasibility to maximize design outcomes.</li><li>Engage in user research and usability testing to gather insights and feedback and continuously refine design solutions with data.</li><li>Collaborate with engineers, product managers, designers, and stakeholders to create customer-focused product experiences.</li><li>Help shape Klarity's design culture and design lifecycle, including research, ideation, design, validation, iteration, and development.</li><li>Contribute to the user experience vision and UI standards, including our design system. Evolve the product towards a cohesive design vision that drives business value.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Demonstrates initiative and ability to independently own multiple, moderately complex design projects with minimal supervision. </li><li>Portfolio required: Must provide a portfolio showcasing a range of design projects, highlighting problem-solving skills, design process, and final outcomes.</li><li>Strong skills in using Figma and/or other prototyping tools to create interactive, high-fidelity prototypes that convey design concepts and user flows.</li><li>Proven track record in designing user-friendly interfaces for complex, data-heavy applications used in enterprise environments.</li><li>A deep passion for AI and its potential to transform industries, with a continuous desire to learn and innovate.</li><li>Bonus: Experience with HTML, CSS, and JavaScript is a plus.<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Equity in addition to cash compensation</li><li>Medical, Dental, and Vision insurance</li><li>401k</li><li>$100 Monthly Wellness budget</li><li>Annual Learning budget</li><li>SF/Bay-Area Relocation bonus (where applicable)<br/><br/></li></ul>Join Klarity and be part of a team that is pushing the boundaries of AI and transforming how companies handle unstructured documents.<br/><br/><em>Klarity is an equal opportunity employer. Klarity provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, national origin, sexual orientation, gender identity or expression, age, disability, genetic information, marital status or veteran status.</em>", "responsibilities": "Craft user-centric experiences by aligning visual and interaction design to solve user problems.\nIncorporate AI technology to enhance user interactions and improve workflow efficiencies.\nBalance business goals, user requirements, and engineering feasibility to maximize design outcomes.\nEngage in user research and usability testing to gather insights and feedback and continuously refine design solutions with data.\nCollaborate with engineers, product managers, designers, and stakeholders to create customer-focused product experiences.\nHelp shape Klarity's design culture and design lifecycle, including research, ideation, design, validation, iteration, and development.\nContribute to the user experience vision and UI standards, including our design system. Evolve the product towards a cohesive design vision that drives business value.", "qualifications": {"preferred": "Demonstrates initiative and ability to independently own multiple, moderately complex design projects with minimal supervision. \nPortfolio required: Must provide a portfolio showcasing a range of design projects, highlighting problem-solving skills, design process, and final outcomes.\nStrong skills in using Figma and/or other prototyping tools to create interactive, high-fidelity prototypes that convey design concepts and user flows.\nProven track record in designing user-friendly interfaces for complex, data-heavy applications used in enterprise environments.\nA deep passion for AI and its potential to transform industries, with a continuous desire to learn and innovate.\nBonus: Experience with HTML, CSS, and JavaScript is a plus.", "required": ""}, "skills": ["GenAI", "AI", "NLP", "ML", "Figma", "Prototyping", "User Research", "Usability Testing", "HTML", "CSS", "JavaScript"], "postedDate": "2 days ago", "benefits": "Equity in addition to cash compensation\nMedical, Dental, and Vision insurance\n401k\n$100 Monthly Wellness budget\nAnnual Learning budget\nSF/Bay-Area Relocation bonus (where applicable)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007047466"}