{"jobTitle": "Senior Public Relations Coordinator", "company": {"name": "Lobeline Communications Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "50K to 60K", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": null, "description": "<strong>Lobeline Communications</strong>\n\n<strong>Senior Public Relations Coordinator</strong>\n\n<span> </span>\n\nLobeline Communications<span> is a full-service public relations agency specializing in strategic communications and publicity, media planning and digital marketing. Established in 1985, Lobeline Communications is a public relations leader in entertainment, lifestyle, hospitality, celebrity talent and sports business sectors. Headquartered in Los Angeles, other offices are in New York, Chicago, Houston and Toronto.</span>\n\n<span> </span>\n\n<span>The Senior Public Relations Coordinator will be based in Los Angeles and provide client support to a publicity team that manages a broad range of accounts in areas of media relations and special events. The position reports the VP of Public Relations.</span>\n\n<span> </span>\n\n<span>The ideal candidate will be organized, proactive, efficiently prioritize assignments and demonstrate good judgment.  The candidate must possess strong verbal, written communication skills and understand the media landscape.</span>\n\n<span> </span>\n\n<span>JOB RESPONSIBILITIES:</span>\n\n<ul>\n<li><span>Provides national and local market press support on select accounts.</span></li>\n<li><span>Assists with compiling client media reports and other pertinent press communications materials.</span></li>\n<li><span>Strategically curates and maintains local, regional and national media lists.</span></li>\n<li><span>Research and monitor editorial calendars, podcast opportunities and other emerging events in top media markets.</span></li>\n<li><span>Conducts media follow-up calls, coordinates press interviews and drafts client correspondence.</span></li>\n<li><span>Conducts press pitches, as assigned.</span></li>\n<li><span>Identify, pitch and secure speaking opportunities on panels, summits and other external platforms.</span></li>\n<li><span>Monitors press, track news coverage and distribute press breaks to clients.</span></li>\n<li><span>Distributes press releases, media alerts and blasts to media outlets.</span></li>\n<li><span>Manage the PR department’s events calendar.</span></li>\n<li><span>Assists with award submissions and entries.</span></li>\n<li><span>Drafts client agendas, follow up memos and other related note taking.  </span></li>\n<li><span>Provide logistical support of events, including talent wangling at premieres and/or press day activities.</span></li>\n<li><span>Executes PR tactics including talent appearances and red-carpet as assigned.</span></li>\n<li><span>Research and update department press lists and editorial calendars. </span></li>\n</ul>\n\n<span> </span>\n\n<span>QUALIFICATIONS:</span>\n\n<ul>\n<li><span>Minimum of two years in PR agency, entertainment or journalism.</span></li>\n<li><span>Must be able to manage multiple projects, as well as have a solid understanding of editorial and publicity. </span></li>\n<li><span>Ability to navigate effectively in a fast-paced work environment.</span></li>\n<li><span>Must be well-organized and possess the ability to handle a multitude of projects simultaneously.</span></li>\n<li><span>Detail-oriented, flexibility to work on multiple projects at once.</span><span> </span></li>\n<li><span>Proficiency in Muck Rack and have a working k</span><span>nowledge of Google Docs, Word, Excel, Outlook, PowerPoint.</span></li>\n<li><span>BA in Communications, Public Relations or related field.</span></li>\n</ul>\n\n<span> </span>\n\n<span>Salary Range- 50K to 60K. Lobeline Communications offers a competitive salary package, including healthcare benefits, PTO, life insurance, HSA/FSA and profit sharing.</span>\n\n<br/>\n\n<span> Equal Opportunity Employer: Lobeline Communications provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</span>", "responsibilities": "Provides national and local market press support on select accounts. Assists with compiling client media reports and other pertinent press communications materials. Strategically curates and maintains local, regional and national media lists. Research and monitor editorial calendars, podcast opportunities and other emerging events in top media markets. Conducts media follow-up calls, coordinates press interviews and drafts client correspondence. Conducts press pitches, as assigned. Identify, pitch and secure speaking opportunities on panels, summits and other external platforms. Monitors press, track news coverage and distribute press breaks to clients. Distributes press releases, media alerts and blasts to media outlets. Manage the PR department’s events calendar. Assists with award submissions and entries. Drafts client agendas, follow up memos and other related note taking.   Provide logistical support of events, including talent wangling at premieres and/or press day activities. Executes PR tactics including talent appearances and red-carpet as assigned. Research and update department press lists and editorial calendars. ", "qualifications": {"required": "Minimum of two years in PR agency, entertainment or journalism. Must be able to manage multiple projects, as well as have a solid understanding of editorial and publicity.  Ability to navigate effectively in a fast-paced work environment. Must be well-organized and possess the ability to handle a multitude of projects simultaneously. Detail-oriented, flexibility to work on multiple projects at once.  Proficiency in Muck Rack and have a working k nowledge of Google Docs, Word, Excel, Outlook, PowerPoint.", "preferred": "BA in Communications, Public Relations or related field."}, "skills": ["Public Relations", "Media Relations", "Press Releases", "Media Monitoring", "Event Planning", "Muck Rack", "Google Docs", "Word", "Excel", "Outlook", "PowerPoint"], "postedDate": "2 days ago", "applicationDeadline": null, "benefits": "Lobeline Communications offers a competitive salary package, including healthcare benefits, PTO, life insurance, HSA/FSA and profit sharing.", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4007087822"}