{"jobTitle": "Warehouse Clerk - 1st Shift", "company": {"name": "Aerotek", "location": "South El Monte, CA"}, "location": "South El Monte, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Automotive manufacturing facility in South El Monte, CA is looking for experienced Warehouse Clerk to join their team!<br/><br/><strong>The starting pay rate is $18.50/hr<br/><br/></strong><strong>These Are Long Term Position With Benefits<br/><br/></strong><strong>Open Shift:<br/><br/></strong><ul><li>1st shift: Monday - Friday 6:00 am - 2:30 pm + Overtime<br/><br/></li></ul><strong>Requirements:<br/><br/></strong><ul><li>Shipping and receiving</li><li>Forklift experience is required</li><li>Inventory control</li><li>Computer literate - data entry experience</li><li>Comfortable in a manufacturing environment</li><li>SAP experience is a plus, but not required</li><li>Warehouse/distribution duties</li><li>Valid Drivers License - comfortable driving company vehicle<br/><br/></li></ul><strong>Please reply directly with your resume or call Robert Pilon at the Aerotek City of Industry, CA location.<br/><br/></strong>Thank you<br/><br/>About Aerotek:<br/><br/>We know that a company's success starts with its employees. We also know that an individual's success starts with the right career opportunity. As a Best of Staffing® Client and Talent leader, Aerotek's people-focused approach yields competitive advantage for our clients and rewarding careers for our contract employees. Since 1983, Aerotek has grown to become a leader in recruiting and staffing services. With more than 250 non-franchised offices, Aerotek's 8,000 internal employees serve more than 300,000 contract employees and 18,000 clients every year. Aerotek is an Allegis Group company, the global leader in talent solutions. Learn more at Aerotek.com.<br/><br/>The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "responsibilities": null, "qualifications": {"required": "Shipping and receiving, Forklift experience is required, Inventory control, Computer literate - data entry experience, Comfortable in a manufacturing environment, SAP experience is a plus, but not required, Warehouse/distribution duties, Valid Drivers License - comfortable driving company vehicle", "preferred": null}, "skills": ["Shipping and receiving", "Forklift", "Inventory control", "Data entry", "Manufacturing", "SAP", "Warehouse", "Distribution", "Drivers License"], "postedDate": "2 days ago", "applicationDeadline": null, "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4007382981"}