{"jobTitle": "Project Manager - Patient Experience, Ambulatory Operational Excellence", "company": {"name": "UCLA Health", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Project Management and Information Technology", "industry": "Hospitals and Health Care", "description": "<strong>Qualifications<br/><br/></strong><ul><li>Bachelor’s degree in related area and/ or equivalent experience/ training.</li><li>Excellent oral communication skills to obtain and convey correct and complete information and concepts to individuals and groups in formal and informal situations.</li><li>Excellent written communication skills using correct grammar to obtain and convey correct and complete information and concepts. Ability to make presentations to senior management.</li><li>Excellent interpersonal skills to maximize functional interaction with a wide variety of individuals and groups including staff, faculty, physicians, researchers, administrators, students, patients, and general public within the Department, on campus, within the University and with outside public and private agencies.</li><li>Excellent resolution skills to plan activities among individuals and groups in a wide variety of working relationships.</li><li>Excellent negotiation skills to plan activities among individuals and groups in a wide variety of working relationships.</li><li>Working knowledge of University Policies and Procedures.</li><li>Excellent problem solving skills to identify objectives and use innovation and creativity in resolving problems to satisfy the majority of needs to the greatest extent possible with the resources available.</li><li>Ability to handle a heavy workload under constantly changing demands, priorities, and focuses</li><li>Skills in negotiating, exchanging ideas, information, and opinions with others to formulate policies and programs and/or arrive jointly at decisions, conclusions or solutions.</li><li>Ability to exercise a high degree of independent judgment.</li><li>Working knowledge of clinical program planning, cash and accrual accounting, financial management control systems, financial analysis and management reporting, and the operation aspects of clinical programs in ambulatory teaching settings.</li><li>Must possess necessary poise and interpersonal skills to relate effectively with internal and external parties.</li><li>Ability to be a team player, flexible and capable of working in an environment, which is fast paced, progressive and requires entrepreneurial thinking and action.</li><li>Ability to travel between all Health System practice location as assigned</li></ul>", "postedDate": "1 day ago", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4007179174"}