{"jobTitle": "Director Of Operations", "company": {"name": "Actalent", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Management and Manufacturing", "industry": "Business Consulting and Services", "description": "<strong>Job Title: Director of Operations<br/><br/></strong><strong>Job Description<br/><br/></strong>Collaborate with the Management team to define, develop, and implement the strategic direction of the business. Oversee and lead production operations, including manufacturing engineering, quality assurance, repairs, procurement, assembly, testing, kitting, and stockroom functions, from engineering release to customer delivery. Manage end-to-end operations activities, encompassing planning, procurement, engineering, production, and logistics. Generate MRP demands based on backlog and forecasts, manage inventory and stock targets, and oversee S&amp;OP processes. Drive supplier performance through effective supply chain management, leverage global sourcing and purchasing, achieve cost reductions, and enhance vendor selection. Build and maintain a reliable and efficient supplier chain to ensure on-time, quality deliveries. Collaborate on BOM finalization, implement redline changes, improve testing processes, and establish sourcing methodologies and configuration control. Oversee production in a clean room environment, develop work plans, create performance metrics, and enhance the utilization of equipment and testers. Manage import/export activities both domestically and internationally. Develop, implement, and improve systems to enhance manufacturing flow, reduce costs, shorten lead times, and minimize process and handling errors. Possess hands-on knowledge of MRP and the implementation of automated systems in a manufacturing setting. Ensure the effectiveness of production processes, quality assurance methods, and hardware, software, and systems testing and verification. Coordinate with the sales order administrator to ensure accurate information in sales orders, including part numbers, shipping addresses, and shipping account numbers. Implement best practices in automated test equipment design and manufacturing. Oversee the audit process, including preparing for and passing audits, developing audit teams, and addressing CARS and PARS promptly. Develop and monitor budgets to maintain control over operational costs. Report to management on the status of work in progress, material availability, and potential production issues to ensure that personnel, equipment, materials, and services are available as needed. Coordinate interdepartmental activities with Quality Assurance, Manufacturing, Purchasing, Engineering, Inventory Control, Program Management, and Contract Administration. Develop operational metrics to monitor and improve performance, including on-time delivery, repairs, production, and supplier efficiency.<br/><br/>Hard Skills<br/><br/><ul><li>Strategic Planning and Execution</li><li>Operations Management</li><li>Production</li><li>MRP Systems</li><li>Supply Chain Management</li><li>Manufacturing Engineering</li><li>Quality Assurance</li><li>Logistics Management</li><li>Automated Test Equipment Design<br/><br/></li></ul>Soft Skills<br/><br/><ul><li>Collaborative Leadership</li><li>Effective Communication</li><li>Problem-Solving</li><li>Budget Management</li><li>Interdepartmental Coordination</li><li>Performance Monitoring<br/><br/></li></ul>Job Type<br/><br/>This is a permanent position.<br/><br/>Work Site<br/><br/>This is a fully on-site position in Chatsworth, California.<br/><br/>Work Environment<br/><br/>Clean room environment, collaborative with interdepartmental activities, and focused on continuous improvement and operational efficiency.<br/><br/><strong>About Actalent<br/><br/></strong>Actalent is a global leader in engineering and sciences services and talent solutions. We help visionary companies advance their engineering and science initiatives through access to specialized experts who drive scale, innovation and speed to market. With a network of almost 30,000 consultants and more than 4,500 clients across the U.S., Canada, Asia and Europe, Actalent serves many of the Fortune 500.<br/><br/>Diversity, Equity &amp; Inclusion<br/><br/>At Actalent, diversity and inclusion are a bridge towards the equity and success of our people. DE&amp;I are embedded into our culture through:<br/><br/><ul><li>Hiring diverse talent</li><li>Maintaining an inclusive environment through persistent self-reflection</li><li>Building a culture of care, engagement, and recognition with clear outcomes</li><li>Ensuring growth opportunities for our people<br/><br/></li></ul>The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.<br/><br/>If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email actalentaccommodation@actalentservices.com for other accommodation options.", "postedDate": "23 hours ago", "skills": ["Strategic Planning and Execution", "Operations Management", "Production", "MRP Systems", "Supply Chain Management", "Manufacturing Engineering", "Quality Assurance", "Logistics Management", "Automated Test Equipment Design", "Collaborative Leadership", "Effective Communication", "Problem-Solving", "Budget Management", "Interdepartmental Coordination", "Performance Monitoring"], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007392684"}