{"jobTitle": "Financial Strategy Manager", "company": {"name": "Augment Jobs", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Financial Services", "description": "<strong>Position Overview<br/><br/></strong>We are seeking an experienced and strategic Financial Strategy Manager to join our dynamic finance team. This role is pivotal in guiding the company's financial strategy, analyzing financial data, and ensuring alignment with overall business objectives. The ideal candidate will have a deep understanding of financial planning, performance management, and strategic analysis.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Strategic Planning: Develop and implement long-term financial strategies aligned with the company’s business goals. Provide strategic insights and recommendations to senior management. </li><li>Financial Analysis: Conduct comprehensive financial analysis, including budgeting, forecasting, and variance analysis. Evaluate financial performance and identify areas for improvement. </li><li>Reporting: Prepare and present detailed financial reports and analyses to senior management and stakeholders. Ensure accuracy and timeliness in financial reporting. </li><li>Performance Management: Monitor financial performance against budgets and forecasts. Develop performance metrics and key performance indicators (KPIs) to track and drive business performance. </li><li>Risk Management: Identify financial risks and develop mitigation strategies. Ensure compliance with financial regulations and internal policies. </li><li>Collaboration: Work closely with various departments, including accounting, operations, and business units, to support cross-functional initiatives and ensure alignment with financial goals. </li><li>Strategy Development: Assist in the development of business strategies by providing financial insights and projections. Support strategic initiatives and business case development. </li><li>Process Improvement: Identify opportunities for process improvements in financial planning and analysis. Implement best practices to enhance efficiency and effectiveness. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Education: Bachelor’s degree in Finance, Accounting, Business Administration, or a related field. MBA or Master’s degree in Finance is a plus. </li><li>Experience: Minimum of 5 years of experience in financial planning, analysis, or strategy roles. Experience in a managerial or senior analyst position is preferred. </li><li>Skills: Strong analytical and problem-solving skills. Proficiency in financial modeling, forecasting, and budgeting. Advanced knowledge of financial software and tools (e.g., Excel, ERP systems). </li><li>Communication: Excellent verbal and written communication skills. Ability to present complex financial information in a clear and concise manner to non-financial stakeholders. </li><li>Leadership: Proven ability to lead projects and collaborate with cross-functional teams. Strong organizational skills and attention to detail. </li><li>Certifications: CFA, CPA, or other relevant financial certifications are desirable but not required.</li></ul>", "postedDate": "4 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4007542391"}