{"jobTitle": "Assistant General Manager, Clark's Malibu", "company": {"name": "MML Hospitality", "location": "Malibu, CA"}, "location": "Malibu, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "85,000.00/yr - 105,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Hospitality", "description": "About Clark's Oyster Bar:\nWe are thrilled to announce that Clark's Oyster Bar, a proud member of MML Hospitality, will debut in Malibu, California, in 2025. As we gear up to introduce our unparalleled culinary experience to this picturesque locale, we begin the search for exceptional individuals to fill key leadership positions.\n\nWe are looking for experienced, savvy, and creative individuals to join our team and help us create vibrant dining experiences for our guests. If you love food and wine and are committed to excellence, we would love to work with you. Submit your resume to express interest today!\n\nWhat Clark's Oyster Bar Offers:\n* Salary Range: $85,000-$105,000\n* Bonus Potential\n* Paid Time Off\n* MML Property Discounts (Hotel, Restaurant, Retail)\n* Beverage Education Reimbursement\n* Advancement and Promotion Opportunities\n* Community Service Opportunities\n* Relocation Assistance\n* Medical, Dental, Vision, Disability, Life, and Pet Insurance\n* Retirement Benefits\n* Parental Leave\n\nWhat You'll Bring:\n* Passion for Hospitality: A genuine enthusiasm for the hospitality industry and a dedication to providing exceptional service.\n* Communication Skills: Strong ability to communicate effectively with team members, guests, and senior management.\n* Leadership: Demonstrated success in leading and inspiring teams while fostering a positive and productive work environment.\n* Operational Effectiveness: Oversee and manage the kitchen's day-to-day operations, ensuring smooth and efficient workflow.\n* Language Proficiency: Proficiency in speaking, reading, and writing English is required; fluency in Spanish is preferred.\n* Experience: At least two years of progressive management experience in the California restaurant industry, with a preference for boutique or upscale dining establishments.\n* Education: A Bachelor's degree in Hospitality Management, Culinary Arts, Business Administration, or a related field is preferred.\n\nRequirements:\nSchedule and Hours:\n* Full Time\n* Flexibility to work all shifts, including evenings, weekends, and holidays\n\nPhysical Requirements: \n* Essential Functions: Must meet the physical demands to perform essential job functions. Reasonable accommodations are available for individuals with disabilities.\n* Communication: Regularly required to talk or hear.\n* Manual Dexterity: Use hands or fingers to handle or feel objects, tools, or controls.\n* Mobility: Frequently required to stand, walk, sit, reach with hands and arms, climb or balance, and stoop, kneel, crouch, or crawl.\n* Lifting: Occasionally lift and move up to 25 pounds.\n* Vision: Requires close vision, distance vision, color vision, peripheral vision, and the ability to adjust focus.\n* Work Environment: Noise level is usually moderate.\n\nIf an offer is accepted for this position, you must undergo a comprehensive background check. This process may include verification of employment history, education credentials, criminal records, and other relevant information. By applying for this position, you acknowledge and agree to the background check process as a condition of employment. \n\nMML Hospitality is an equal-opportunity employer. We do not discriminate based on race, color, religion, national origin, gender, age, marital status, sexual orientation, disability, veteran status, or any other prohibited basis. We intend for all qualified applicants to be given equal opportunity and for selection decisions based on job-related factors\n\nCompensation details: 85000-105000 Yearly Salary", "responsibilities": null, "qualifications": {"required": null, "preferred": null}, "skills": [], "postedDate": "2 days ago", "applicationDeadline": null, "benefits": "Salary Range: $85,000-$105,000\nBonus Potential\nPaid Time Off\nMML Property Discounts (Hotel, Restaurant, Retail)\nBeverage Education Reimbursement\nAdvancement and Promotion Opportunities\nCommunity Service Opportunities\nRelocation Assistance\nMedical, Dental, Vision, Disability, Life, and Pet Insurance\nRetirement Benefits\nParental Leave", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4007094797"}