{"jobTitle": "Data Analyst (Grievance and Appeals Resolution Services (GARS))", "company": {"name": "CalOptima", "industry": "Hospitals and Health Care", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$68,015.00 - $108,824.00", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Hospitals and Health Care", "description": "CalOptima Health is seeking a highly motivated an experienced Data Analyst (Grievance and Appeals Resolution Services (GARS)) to join our team. The Data Analyst for Grievance and Appeals Resolution Services (GARS) supports the data management reporting requirements of the GARS department. The incumbent will be responsible for developing and designing GARS reports and maintaining internal systems to support the business requirements of the department. The incumbent will continually develop database reports including the design process, table building, maintaining data integrity and conditioning of data applications. The incumbent will assist with exception reports to ensure routine, timely and accurate case completion. The incumbent will provide input and data analysis to capture trends in GARS.", "responsibilities": "95% - Program Support: Participates in a mission-driven culture of high-quality performance, with a member focus on customer service, consistency, dignity and accountability. Assists the team in carrying out department responsibilities and collaborates with others to support short- and long-term goals/priorities for the department. Designs reports from the GARS processing environment or the data warehouse. Provides expertise in data analysis, including member and provider GARS data. Maintains a thorough knowledge of CalOptima Health’s GARS data reporting requirements, Department of Health Care Services data reporting requirements and Centers for Medicare & Medicaid Services data reporting requirements. Monitors and reports on any changes that affect CalOptima Health and/or health networks. Provides assistance and input to the Data Analyst/s in the GARS department to improve the process in evaluating data and meeting department specifications and business needs. Devises or modifies procedures to solve complex problems considering computer equipment capacity and limitations, operating time and form of desired results. Participates in progressively more complex projects. Assists in the design of provider dispute resolution claims reports from Facets, as needed. Provides feedback to management to resolve data integrity issues and provides support for new reporting requirements. Responsible for internal and external routine and ad-hoc reports or GARS related projects. Develops Structured Query Language (SQL) queries to analyze and report on GARS ad hoc requests. 5% - Completes other projects and duties as assigned.", "qualifications": {"required": "Bachelor’s degree in a related field PLUS 3 years as a data analyst or in a similar role that would provide the knowledge and abilities listed required; an equivalent combination of education and experience sufficient to successfully perform the essential duties of the position such as those listed above may also be qualifying. 3 years of experience with the following Microsoft Office tools: SQL Server, Word, Excel (MS Project and Visio a plus) required. 3 years using Microsoft Access and/or Excel to produce charts, spreadsheets, pivot tables and/or other information applicable to position assignment required.", "preferred": "1 year of experience with Grievance and Appeals strongly preferred. Health maintenance organization (HMO), Medi-Cal, Medicare and health services experience. 3 years of system testing, reporting requirements and documentation skills."}, "skills": ["SQL", "Microsoft Office", "Data Analysis", "Report Design", "Data Management"], "postedDate": "3 days ago", "applicationDeadline": "September 4, 2024 at 9:00 PM (PST)", "benefits": "Comprehensive benefits package, including participation in the California Public Employees Retirement System (CalPERS), low-cost medical/vision/dental insurance options, and paid time off. Flexible scheduling during core business hours, telework options for some positions, work schedules that allow every other Monday or Friday off (9/80 schedule), and a wellness program featuring diverse activities. CalOptima Health contributes 4% of pensionable earnings to a 401(a) retirement program with no required employee contribution. Access to 457(b) retirement plans with pre/post-tax contribution options.", "remoteWork": "Partial Telework", "url": "https://www.linkedin.com/jobs/view/4007173001"}