{"jobTitle": "Senior Accountant", "company": {"name": "Managed Staffing, Inc.", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Accounting/Auditing and Finance", "industry": "Accounting and Financial Services", "description": "Job Title: Sr. Accountant<br/><br/><strong>Location:</strong> Irvine, CA (Hybrid – Day onsite TBD)<br/><br/><strong>Assignment Length:</strong> 6 months (with potential for extension)<br/><br/><strong>Hours Per Week:</strong> 40<br/><br/><strong>Work Hours:</strong> Flexible – must be able to work within core business hours (e.g., 8am - 5pm or 9am - 6pm)<br/><br/><strong>Summary<br/><br/></strong>The Accountant will support the finance team by performing various complex accounting tasks, coordinating with IT for financial reporting automation, and ensuring accurate financial data management within a large company environment. This role demands strong analytical skills, attention to detail, and proficiency in Microsoft Excel.<br/><br/><strong>Major Responsibilities<br/><br/></strong><ul><li>Provide solutions for financial data extraction from Oracle.</li><li>Coordinate with IT for implementing financial reporting automation.</li><li>Perform complex account analysis and maintain proper accounting.</li><li>Prepare complex account reconciliations and routine monthly journal entries.</li><li>Process and maintain ad hoc or recurring journal entries accurately and timely.</li><li>Prepare schedules and graphs to highlight significant trends for management.</li><li>Ensure control over assets aligns with PAC policies and GAAP.</li><li>Assist with maintaining and applying internal controls.</li><li>Support external audit firm for timely audits or compliance reporting.<br/><br/></li></ul><strong>Education/Experience Requirements<br/><br/></strong><ul><li>8 years of accounting experience, with a focus on general accounting.</li><li>Experience in large companies with over 1,000 employees is preferred.<br/><br/></li></ul><strong>Knowledge/Skill Requirements<br/><br/></strong><ul><li>Analytical mindset with the ability to proactively resolve issues.</li><li>Strong proficiency in Microsoft Excel (including pivot tables), Word, and database software; Oracle experience is preferred.</li><li>Ability to work efficiently in a dynamic, fast-paced environment with changing priorities.</li><li>Strong team player with excellent problem-solving skills and attention to detail.</li><li>Positive attitude with the ability to interact effectively at all levels.</li><li>Ability to apply professional concepts and company policies to resolve diverse issues.</li><li>Experience in evaluating data and exercising judgment within defined procedures.</li></ul>", "postedDate": "1 day ago", "skills": ["Oracle", "Microsoft Excel", "Microsoft Word", "Analytical Skills", "Problem Solving", "Teamwork", "Attention to Detail", "Communication", "Data Analysis", "Financial Reporting", "Accounting", "GAAP", "Internal Controls", "Auditing"], "url": "https://www.linkedin.com/jobs/view/4007092521"}