{"jobTitle": "Director, Clinical Quality Oversight", "company": {"name": "Health eCareers", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "jobFunction": "Quality Assurance", "industry": "Staffing and Recruiting", "description": "<strong>Job Summary<br/><br/></strong>In addition to the responsibilities listed above, this position is also responsible for consulting with the Board of Directors and providing strategic direction on the oversight of systems designed to monitor and ensure the quality care and services are provided at a comparable level to all members and patients across the continuum of care; alleviating or resolving issues in quality improvement systems; aligning and directing others on resolving issues related to the organization meeting the standards established by regulatory agencies and accreditation organizations and meeting public expectations; communicating and championing best practices for maintaining the integrity of systems related to the selection, credentialing and competence of physicians and other health care practitioners; driving the implementation of systems for granting or terminating clinical privileges, professional staff or medical staff or clinical staff membership, proctoring and continuing education; championing the use of standardized and established processes for reviewing and approving medical staff or provider staff Bylaws, Rules and Regulations and amendments; and serving as a liaison for the oversight of systems of all contracted entities including but not limited to the Permanente Medical Groups. This role is also responsible for championing the peer review process, committees, and forums to evaluate and ensure hospital or health system performance; developing strategic insights and guidance based on preliminary and comprehensive feedback; and defining and driving a strategic development plan to address needs and solve problems.<br/><br/><strong>Essential Responsibilities<br/><br/></strong><ul><ul><li>Prepares individuals for growth opportunities and advancement; builds internal collaborative networks for self and others. Solicits and acts on performance feedback; drives collaboration to set goals and provide open feedback and coaching to foster performance improvement. Demonstrates continuous learning; oversees the recruitment, selection, and development of talent; ensures performance management guidelines and expectations to achieve business needs. Stays up to date with organizational best practices, processes, benchmarks, and industry trends; shares best practices within and across teams. Motivates and empowers teams; maintains a highly skilled and engaged workforce by aligning resource plans with business objectives. Provides guidance when difficult decisions need to be made; creates opportunities for expanded scope of decision making and impact.</li><li>Oversees the operation of multiple units within a department by identifying member and operational needs; ensures the management of work assignment completion; translates business strategy into actionable business requirements; ensures products and/or services meet member requirements and expectations while aligning with organizational strategies. Gains cross-functional support for business plans and priorities; assumes responsibility for decision making; sets standards, measures progress, and fosters resolution of escalated issues. Communicates goals and objectives; analyzes resources, costs, and forecasts and incorporates them into business plans; prioritizes and distributes resources. Removes obstacles that impact performance; guides performance and develops contingency plans accordingly; ensures teams accomplish business objectives.</li><li>Serves as the subject matter expert for clinical quality improvement processes and regulations for regions, internal and external committees, and key stakeholders by: providing consultation on the interpretation, interaction, and implementation of current policies, regulations, and legislation and advising on the current climate and potential changes which may have long term effects on business operations; proactively engaging in internal and external committees, projects, and relevant initiatives to implement change and to move QA initiatives forward, as well as to communicate to senior leadership on the various changes and rationale for change; fostering collaborative, results-oriented partnerships with practitioners, staff, management, and/or departments across clinical and administrative roles to ensure current and future compliance, and advising on changes to KP policy; defining the standards for educational programs to raise awareness for current and changing regulation requirements, internal concerns, and system/database usage; and identifying barriers to process improvement issues, weighing practical, technical, and KP capability considerations in addressing issues, and advising on policy changes.</li><li>Directs the quality of care complaints and review process by: directing and representing KP at grievance meetings, cases, reviews, referrals, and other mechanisms; responding to and directing the preparations of all documentation, records, and information requested for specific and highly sensitive patient case reviews; reporting trends in the process flow of investigations and claims for red flags, appeal reasons, and overturns, reporting results, and advising on strategic direction; and defining the standards for the surveillance of quality improvement metrics, cases, quality care incidents, and near misses according to established protocols to ensure equal/consistent application of KP policies.</li><li>Directs risk management efforts by: defining the standards for corrective action plan for improvement identified through utilization review, clinical records audit, claim denials, patient satisfaction surveys, and auditing surveys across the organization; defining the standards for root cause analysis, failure mode and effect analysis, and other assessments in response to significant events, near misses, and good catches; defining the standards for escalating high-risk issues and trends to appropriate entity for resolutions; and defining the standards for health outcome analysis to continuously monitor oversight effectiveness.</li><li>Oversees development of new clinical quality improvement programs by: maintaining relationships with key stakeholders, senior management, peers of other markets, and external stakeholders to set the standards for new program guidelines, metrics, and operational definitions of quality improvement, and ensuring the sustainability of the program; serving as a subject matter expert on a variety of health concepts, regulatory requirements, and change management principles to foster the development of programs that optimize clinical quality, safety, or health outcomes; and providing insight into KPs capability of realizing strategic opportunities to develop as a learning organization by advocating for the program and consulting with senior management, technology stakeholders, and external vendors.</li><li>Oversees the systems, procedures, and</li></ul></ul>", "experienceLevel": "Director", "postedDate": "1 day ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4007068614"}