{"jobTitle": "Production Manager", "company": {"name": "V R Della Infotech INC- V R Della group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "IT Services and IT Consulting", "description": "Job title: Production Manager Responsible to: Senior Production Manager Department: Virgin Music Group Operations Location of work: 4PS, Kings Cross, London Virgin Music Group is the Industry Leading Independent Services division of Universal Music Group, providing a full range of artist & label services on a global basis, including Production, Distribution, Marketing, Promotion, Commercial Marketing, Brand/Synch & Licensing, Lifestyle Marketing, and more. How we LEAD: The Virgin Music Production department manages product planning and production across an array of formats, strategies, and deal types for a variety of artist & label clients by way of VMG & UMG supply chains. Working in collaboration with the wider Virgin Music teams, this role will drive the team culture and \"white glove\" ethos of how we work with artists, managers and teams through the start and end of a campaign. This role will execute across all production aspects relating to VMG's \"For Artist\", Affiliate and Store Front repertoire & release schedules, managing product setup and milestone tracking from the onset of campaigns, planning, scheduling, and catalog management. How you'll CREATE: Receive and review raw metadata and assets delivered by clients prior to submission into supply chain systems. Directly create and submit releases into VMG and UMG digital supply chain systems, ensuring VMG and UMG metadata and asset standards are met. Master the VMG and UMG style guides and their relation to delivery systems and DSP requirements. Ensure submission lead time requirements are met given a project's timeline. Anticipate technical and operational issues around projects and work with clients, operational teams and other stakeholders to mitigate risk. Communicate within the production team, with clients and across relevant internal teams and stakeholders regarding project status, key operational activities, and issue resolution. Work with production teammates and leaders to develop processes that improve results, efficiency, client experience and relations, and coordination with other VMG teams. Help manage client and interdepartmental expectations on feasibility of requests, system capabilities and standard operating procedures. Understand and advise when and where special exceptions can be reasonably deployed for greatest impact and minimal risk. Work in coordination with the supply chain and operations teams to address technical and DSP issues on critical projects. Manage physical planning, production and timelines in coordination with clients and relevant internal teams. Oversee delivery of physical release elements to manufacturing vendors. Act as an invested, expert stakeholder in ongoing system development and process improvement efforts. Work closely with the catalog migration team on incoming artist catalogs that you will ultimately handle. Provide backup coverage for other team members and contribute to special projects and wider business initiatives.", "postedDate": "1 day ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4007007970"}