{"jobTitle": "Store Manager - Topanga", "company": {"name": "Louis Vuitton", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "USD$130,000 - $150,000", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion, Retail Luxury Goods and Jewelry, and Retail", "description": "Louis Vuitton is seeking a highly motivated Store Manager to lead the team and business to success!<br/><br/>Our Louis Vuitton <strong>Store Managers</strong> are ambassadors of the Brand responsible for leading and developing the store team through innovative and motivating hands-on management and coaching. Our leaders inspire their teams to build sustainable Client relationships, ensuring that every Client is treated according to the Louis Vuitton promise.<br/><br/>Profile<br/><br/>Reporting to the Regional Vice President, you will need to demonstrate superb sales leadership skills with respect to building client portfolios, driving client repurchase rates, and cross-selling. You will ensure all business opportunities are enhanced through efficient sales floor management while ensuring the Client experience remains the top priority at all times.<br/><br/>As a Store Manager, you will strive to identify business opportunities and implement the related actions to achieve your store’s goals. You will be directly accountable for developing the business and supervising store operations and budget. With a passion for people development and leadership, you will recruit and build highly motivated, trained, and engaged teams. You will provide regular feedback on their personal growth and ensure they have detailed development plans to further their careers. Ideally, you will have previously worked in a sophisticated, client-centric retail environment. Successful candidates will be passionate about being present on the sales floor, thriving on first-hand contact with the team and our clients.<br/><br/>Responsibilities include:<br/><br/><ul><li>Team Management and Development</li><li>Client and Business Development</li><li>Role Model in Selling and Floor Management</li><li>Operations<br/><br/></li></ul><em>The appointed candidate will be offered a salary within the range of USD$130,000 - $150,000 annually, plus the opportunity for a bonus, a comprehensive benefits package including medical, dental, vision, short and long-term disability, various paid time off programs, employee discount/perks and two retirement plans both with employer contributions <br/><br/></em>Additional information<br/><br/>Louis Vuitton is a company that respects the uniqueness of each employee and offers everyone the means to find their place and prosper. We promote initiatives aimed at supporting professional equality for everyone. We strive to go above and beyond purely symbolic measures by building a culture passionate about meaningful strategies aimed at crafting an inclusive workforce.<br/><br/>In addition to a generous benefits package, unparalleled career development opportunities, both locally &amp; globally, as an employee at Louis Vuitton, you can expect to be provided with industry leading training which will offer you an in-depth insight into the luxury and retail environment.<br/><br/>Please see our Privacy Policy for information on the personal information we collect from job applicants, how we use it, and your rights with respect to this information.<br/><br/><em>We will consider for employment all qualified Applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.<br/><br/></em>Reference LVM23634", "responsibilities": "Team Management and Development\nClient and Business Development\nRole Model in Selling and Floor Management\nOperations", "postedDate": "1 day ago", "benefits": "The appointed candidate will be offered a salary within the range of USD$130,000 - $150,000 annually, plus the opportunity for a bonus, a comprehensive benefits package including medical, dental, vision, short and long-term disability, various paid time off programs, employee discount/perks and two retirement plans both with employer contributions", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007029439"}