{"jobTitle": "Account Manager", "company": {"name": "CLD PR", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$60,000.00/yr - $90,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative, Customer Service, and Public Relations", "industry": "Public Relations and Communications Services", "description": "*This position works primarily with editors, journalists, and writers at top-tier outlets. \nIf your experience is in Celebrity, Influencer Management and/or Influencer program management, please send your resume to Alex@CLDStyleHouse.com to be considered for our another team. \n<br/>\nMid-Senior Account Manager (Celebrity Team).\n<br/>\n**We would love someone with the following qualifications:**\n<ol><li>Based in LA, NYC, or other</li><li>Ability to craft overall PR strategy, and in-depth media strategy for a portfolio of accounts.</li><li>Collaborate with CLD PR's Celebrity and Influencer Teams for certain parts of strategy</li><li>Build strong client relationships</li><li>Meet clients' needs in terms of results (short lead media, long lead media, KPI's for big launches or initiatives)</li><li>Oversee and develop Account Managers and/or Coordinators beneath you</li><li>Identify opportunities to grow current accounts, or to onboard new accounts</li><li>Works well in a team setting, and is open minded to pushing results for all types of brands.</li><li>Great at generating new ideas for new initiatives. Creative, yet also very business-minded.</li><li>Extremely results-driven.</li><li>Able to lead an account and guide others </li><li>Great at generating on-brand targets lists.</li><li>Experience with events.</li><li>Great track record / body of work of placements which you have secured.</li></ol><p><br/></p><p>**We're looking to mobilize ASAP, so don't delay in submitting! Please specify which role you are applying for when you send your cover letter and resume.**</p><p><br/></p><p>CLD PR (www.CLDPR.com and @CLDstyle on Instagram) is a top-tier full-service public relations agency, focusing most heavily on celebrity &amp; media placement, digital influencers, brand development, events and a small amount of social media management.</p><p>We’re looking for a SUPERSTAR who thrives in a fast-based environment and adapts quickly and fearlessly to changing needs. There is immense growth potential in this job, and we have a vested interest in making this hiring decision very long-term. Overall, we are on a non-stop, ambitious and strategically-paced quest to continue growing this company into even more of a force.</p><p><br/></p><p>CLD PR is to leading PR Agency (full-service, and one of the larger firms), specializing primarily in fashion, with some lifestyle clients as well. Our HQ is in Los Angeles, and we also have team members in NYC.</p><p><br/></p><p>**ABOUT YOU ----**</p><p>**PR Agency experience is a must! Ideal candidate has rock-solid and extensive professional relationships.**</p><p>**Ideal candidate is also familiar with or seasoned in on-roster client strategy, planning, execution, reporting and relations.**</p><p><br/></p><p>You are not only extremely RESULTS-DRIVEN in garnering placements and results, but also able to create strategic campaign programs, including outlining on-brand targets and creative ways to reach and convert them. You are organized to the point where you manage many moving parts simultaneously and effectively. Your media and editor connections are 100% thorough, seasoned and reliable.</p><p><br/></p><p>Job Type: Full-time</p>", "responsibilities": "Ability to craft overall PR strategy, and in-depth media strategy for a portfolio of accounts. Collaborate with CLD PR's Celebrity and Influencer Teams for certain parts of strategy Build strong client relationships Meet clients' needs in terms of results (short lead media, long lead media, KPI's for big launches or initiatives) Oversee and develop Account Managers and/or Coordinators beneath you Identify opportunities to grow current accounts, or to onboard new accounts Works well in a team setting, and is open minded to pushing results for all types of brands. Great at generating new ideas for new initiatives. Creative, yet also very business-minded. Extremely results-driven. Able to lead an account and guide others Great at generating on-brand targets lists. Experience with events. Great track record / body of work of placements which you have secured.", "qualifications": {"required": "PR Agency experience is a must! Ideal candidate has rock-solid and extensive professional relationships. Ideal candidate is also familiar with or seasoned in on-roster client strategy, planning, execution, reporting and relations. You are not only extremely RESULTS-DRIVEN in garnering placements and results, but also able to create strategic campaign programs, including outlining on-brand targets and creative ways to reach and convert them. You are organized to the point where you manage many moving parts simultaneously and effectively. Your media and editor connections are 100% thorough, seasoned and reliable."}, "skills": ["PR", "Media Strategy", "Client Relations", "Campaign Management", "Media Relations"], "postedDate": "1 day ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007146688"}