{"jobTitle": "Operations Support Coordinator & Receptionist", "company": {"name": "JMAC Lending", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "About JMAC Lending:<br/><br/>JMAC Lending, with over 25 years of industry experience, strives to serve its clients exceptionally. We take pride in our innovative products, outstanding customer service, and unwavering commitment to helping our partners succeed. Our mission is to surpass existing market options and become the preferred lender for our clients. Our team of associates boasts impressive credentials and actively engages in continuous education, ensuring a harmonious blend of knowledge and experience. We have built our company on upholding the highest ethical standards, while also efficiently and meticulously delivering competitive product pricing for wholesale and correspondent lending.<br/><br/>The Opportunity:<br/><br/>As a valuable team member, you will play a vital role in delivering exceptional clerical support to clients, staff, and daily operations. This exciting position, positions you as the organization's ambassador to all visitors and callers, ensuring their experience is nothing short of positive and welcoming. Your pivotal role will not only create a favorable impression of the organization but also enhance seamless communication throughout the company.<br/><br/>Key Responsibilities:<br/><br/><ul><li>Support Underwriting department with clerical tasks</li><ul><li>Performing verbal verifications of employment</li><li>Order supporting documentation request: soft pulls, SSA and 4506</li><li>Conducting adverse action request</li><li>Support daily operations by providing efficient administrative assistance in the office</li><li>Create a welcoming environment by greeting and assisting clients and visitors at the Reception desk</li><li>Maintain security by ensuring that only authorized personnel have access to the JMAC offices</li><li>Manage incoming calls by answering multiple phone lines and directing callers to the appropriate department or employee</li><li>Handle incoming mail by retrieving, sorting, and delivering it</li><li>Distribute courier packages, such as closing documents, to the relevant departments</li><li>Enter mail and package information into the system when necessary, such as quality control documents</li><li>Process and send outgoing mail, including first payment letters, transfer letters, and hazard insurance letters, before the scheduled pickup times</li><li>Keep track of visitors by maintaining a visitor log book<br/><br/></li></ul></ul>Requirements<br/><br/><ul><li>A High School Diploma or equivalent is required</li><li>We highly value 1-2 years of work experience, if you possess it</li><li>Exceptional written and verbal communication skills are expected. </li><li>You must be capable of working collaboratively and professionally in a fast-paced production environment</li><li>Paying meticulous attention to detail, being organized, and having strong communication skills are essential. </li><li>Meeting deadlines is of utmost importance. You should be able to perform well under time constraints</li><li>In our team-oriented work environment, multitasking, prioritization, and flexibility are key. </li><li>Our dynamic work environment necessitates adaptability to changes in assignments and job responsibilities</li><li>Prior experience with Microsoft Office Word and Excel, as well as strong PC skills, is required</li><li>Customer service is our primary focus. Our aim is to deliver high-quality service<br/><br/><br/></li></ul>Benefits<br/><br/><ul><li>Comprehensive Health Care Plan covering medical, dental, and vision</li><li>Life Insurance options including basic coverage, voluntary plans, and AD&amp;D</li><li>Generous Paid Time Off for vacations and holidays</li><li>Retirement Plan with 401k options</li><li>Short Term &amp; Long Term Disability coverage</li><li>Family Leave benefits for that much-needed time off</li><li>Access to Wellness Resources to support your overall well-being<br/><br/></li></ul><em>JMAC Lending, Inc. is an Equal Employment Employer. We are committed to workforce diversity. Qualified applicants will receive consideration without regards to age, race, religion, sex, sexual orientation, gender identity or national origin.<br/><br/></em><em>DISCLAIMER: JMAC Lending is an evolving company. As such this job description is not necessarily an exhaustive list of all responsibilities, duties, skills, efforts, requirements or working conditions associated with the job. While this is intended to be an accurate reflection of the current job, management reserves the right to revise the job or to require that other or different tasks be performed as assigned.</em>", "responsibilities": "Support Underwriting department with clerical tasks\nPerforming verbal verifications of employment\nOrder supporting documentation request: soft pulls, SSA and 4506\nConducting adverse action request\nSupport daily operations by providing efficient administrative assistance in the office\nCreate a welcoming environment by greeting and assisting clients and visitors at the Reception desk\nMaintain security by ensuring that only authorized personnel have access to the JMAC offices\nManage incoming calls by answering multiple phone lines and directing callers to the appropriate department or employee\nHandle incoming mail by retrieving, sorting, and delivering it\nDistribute courier packages, such as closing documents, to the relevant departments\nEnter mail and package information into the system when necessary, such as quality control documents\nProcess and send outgoing mail, including first payment letters, transfer letters, and hazard insurance letters, before the scheduled pickup times\nKeep track of visitors by maintaining a visitor log book", "qualifications": {"required": "A High School Diploma or equivalent is required\nWe highly value 1-2 years of work experience, if you possess it\nExceptional written and verbal communication skills are expected. \nYou must be capable of working collaboratively and professionally in a fast-paced production environment\nPaying meticulous attention to detail, being organized, and having strong communication skills are essential. \nMeeting deadlines is of utmost importance. You should be able to perform well under time constraints\nIn our team-oriented work environment, multitasking, prioritization, and flexibility are key. \nOur dynamic work environment necessitates adaptability to changes in assignments and job responsibilities\nPrior experience with Microsoft Office Word and Excel, as well as strong PC skills, is required\nCustomer service is our primary focus. Our aim is to deliver high-quality service", "preferred": ""}, "skills": ["Microsoft Office", "Customer Service", "Communication", "Organization", "Detail-Oriented"], "postedDate": "1 day ago", "benefits": "Comprehensive Health Care Plan covering medical, dental, and vision\nLife Insurance options including basic coverage, voluntary plans, and AD&amp;D\nGenerous Paid Time Off for vacations and holidays\nRetirement Plan with 401k options\nShort Term &amp; Long Term Disability coverage\nFamily Leave benefits for that much-needed time off\nAccess to Wellness Resources to support your overall well-being", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007094864"}