{"jobTitle": "Customer Programs Project Manager [HYBRID]", "company": {"name": "Southern California Edison (SCE)", "industry": "Oil and Gas and Utilities", "location": "Duarte, CA"}, "location": "Duarte, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "117,200.00/yr - 175,800.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Oil and Gas and Utilities", "description": "<strong>Job Description<br/><br/></strong><strong>Join the Clean Energy Revolution<br/><br/></strong>Become a part of the Clean Energy Revolution by becoming a <strong>Customer Programs Project Manager </strong>at Southern California Edison (SCE). Our Program Design and Development team is expanding, and we're in search of dynamic individuals with experience in clean energy, finance, and utility program development to strengthen our program deployment and continuous improvement efforts. As a valued member of our team, you'll collaborate with a group of subject matter experts and project managers to assess current customer programs, and progress our strategic portfolio from concept to implementation to help realize our corporate clean energy aspirations (Countdown to 2045 | Edison International). Your role will be instrumental in driving SCE's electrification, energy management, and energy efficiency endeavors, overseeing pivotal aspects such as creating regulatory filings, ensuring best program practices, and creating customer value through effective program design. This is a chance to play a vital role in making California a leader in clean energy and helping SCE’s customers become more sustainable. Join us and be part of an exciting and dynamic team driving positive change in the energy industry.<br/><br/>As a Project Manager, your work will help power our planet, reduce carbon emissions and create cleaner air for everyone. Are you ready to take on the challenge to help us build the future?<br/><br/><strong>A day in the life - Get ready to think big, work smart and shine bright!<br/><br/></strong><ul><li>Support program design by engaging with our Portfolio Planning team to progress Customer Strategies from concepts to approved regulatory filings</li><li>Manage program development by working with our Clean Energy and Demand Response, and Advanced Energy Solutions teams to launch new, and improve existing, programs to ensure they are delivering the highest value to our customers. </li><li>Partner with our legal, regulatory, and business teams to figure out the best strategies, write compelling filings and fix issues to set us up for future success.</li><li>Collaborate with other utilities, SCE groups and communities to make our programs the best they can be.<br/><br/></li></ul><strong>The Essentials<br/><br/></strong><ul><li>Seven or more years of Project Management experience including ownership of scope, cost, and schedule. </li><li>Experience in strategic planning, program development or related functions, particularly in areas related to electrification of transportation/buildings, energy efficiency, demand response, or income-qualified utility programs.<br/><br/></li></ul><strong>The Preferred<br/><br/></strong><ul><li>Bachelor’s degree or higher in business, finance, engineering, management, or related field.</li><li>PMP Certification.</li><li>Experience with regulatory policies, regulatory agencies (i.e., CPUC, California Air Resources Board, California Energy Commission, etc.), and/or electric utilities.</li><li>Experience with quantitative risk analysis and financial modeling.</li><li>Prior role in management consulting or a related field with a focus on process improvement.</li><li>Excellent in both oral and written communication skills, including top-notch presentation abilities for leadership interactions.</li><li>Strong communications skills and a demonstrated ability to develop and maintain stakeholder relationships.<br/><br/></li></ul><strong>You should know<br/><br/></strong><ul><li>This position’s work mode is hybrid. The employee will report to an SCE facility for a set number of days with the option to work remotely on the remaining days.  Unless otherwise noted, employees are required to reside in the state of California.  Further details of this work mode will be discussed at the interview stage. The work mode can be changed based on business needs.</li><li>Visit our Candidate Resource page to get meaningful information related to benefits, perks, resources, testing information, hiring process, and more!</li><li>The primary work location for this position is Irwindale, CA. Relocation may apply to this position.</li><li>Relocation does not apply to this position. <br/><br/></li></ul><strong>About Southern California Edison<br/><br/></strong>The people at SCE don't just keep the lights on. Our mission is so much bigger. We’re fueling the kind of innovation that’s changing an entire industry, and quite possibly the planet. Join us and create a future with cleaner energy, while providing our customers with the safety and reliability they demand. At SCE, you’ll have a chance to grow personally and professionally, making a real impact in Southern California and around the world.<br/><br/>At SCE, we celebrate our differences. We are a proud Equal Opportunity Employer and will not discriminate based on race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status or any other protected status.<br/><br/>We are committed to ensuring that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodations at (833) 343-0727.", "responsibilities": "<ul><li>Support program design by engaging with our Portfolio Planning team to progress Customer Strategies from concepts to approved regulatory filings</li><li>Manage program development by working with our Clean Energy and Demand Response, and Advanced Energy Solutions teams to launch new, and improve existing, programs to ensure they are delivering the highest value to our customers. </li><li>Partner with our legal, regulatory, and business teams to figure out the best strategies, write compelling filings and fix issues to set us up for future success.</li><li>Collaborate with other utilities, SCE groups and communities to make our programs the best they can be.<br/><br/></li></ul>", "qualifications": {"required": "Seven or more years of Project Management experience including ownership of scope, cost, and schedule. \nExperience in strategic planning, program development or related functions, particularly in areas related to electrification of transportation/buildings, energy efficiency, demand response, or income-qualified utility programs.", "preferred": "Bachelor’s degree or higher in business, finance, engineering, management, or related field.\nPMP Certification.\nExperience with regulatory policies, regulatory agencies (i.e., CPUC, California Air Resources Board, California Energy Commission, etc.), and/or electric utilities.\nExperience with quantitative risk analysis and financial modeling.\nPrior role in management consulting or a related field with a focus on process improvement.\nExcellent in both oral and written communication skills, including top-notch presentation abilities for leadership interactions.\nStrong communications skills and a demonstrated ability to develop and maintain stakeholder relationships."}, "skills": ["Project Management", "Strategic Planning", "Program Development", "Electrification", "Energy Efficiency", "Demand Response", "Regulatory Policies", "Regulatory Agencies", "Quantitative Risk Analysis", "Financial Modeling", "Management Consulting", "Process Improvement", "Communication", "Presentation Skills", "Stakeholder Relationship Management"], "postedDate": "4 days ago", "benefits": null, "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/4007021698"}