{"jobTitle": "Hardware Program Manager", "company": {"name": "Skylight", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management and Information Technology", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Skylight is a technology startup based out of Los Angeles and San Francisco. Our mission is to make technology that brings families together. Our founders are former venture capitalists and serial entrepreneurs, who have scaled this business to $100M+ in annual revenue while being completely bootstrapped. We think often about the thousands of smiles we are able to put on our customers' faces each day, and it fills our hearts with purpose. That's why we have been working hard to expand our team and invent, so that we can continue to bring the magic of Skylight to millions of loved ones throughout the world.<br/><br/>Our ideal candidate is an entrepreneur at heart and has a deep experience of consumer hardware NPI process with Asian manufacturers, understands the technical complexities involved and is willing to roll up their sleeves when needed.<br/><br/>You will be the first Program Management hire and will report to our Chief Product Officer working closely with our hardware Product Manager, engineering leads, marketing, operations and finance to ensure we deliver great products on time.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>NPIs: Lead and manage the end-to-end execution of launching new hardware products, ensuring timely delivery and quality standards are met</li><li>2nd sourcing: Lead and manage initiatives to manufacture our products at new partners or secondary sources</li><li>Major product revisions: Oversee and coordinate production revisions, ensuring that changes are implemented seamlessly and efficiently</li><li>Manage prototype hardware builds (Prototypes, EVT, DVT) with our manufacturers</li><li>Represent the Hardware function of the project in reviews, core team, and build meetings</li><li>Travel domestically and internationally as needed<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>You have 2-4+ years of experience managing hardware programs, preferably in consumer electronics or related industry</li><li>You possess strong project management skills, including the ability to manage budgets, timelines, and stakeholders</li><li>You have built a track record of managing hardware projects successfully end-to-end and understand the complexities in consumer electronics development &amp; production</li><li>You understand how product or packaging choices affect sales, operations, and customer service and are skilled at facilitating tradeoff discussions between multiple stakeholders</li><li>You hold a bachelor's degree in Electrical Engineering, Mechanical Engineering, Computer Science or another technical field</li><li>You are noted for strong verbal and written communication skills, with the ability to effectively convey complex technical concepts to non-technical stakeholders</li><li>You have a passion for technology &amp; innovation and are excited by our mission to connect loved ones and raise good human beings<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><strong>Our competitive compensation package includes:<br/><br/></strong><ul><li>Competitive Salary + Equity Package</li><li>401K matching</li><li>Wellness, learning, and home-office budgets</li><li>Health, Dental &amp; Vision Medical Plans</li><li>Tremendous autonomy to set the direction of your work</li><li>Unlimited PTO</li><li>Company holidays on the first Friday of every month (Except November &amp; December)<br/><br/></li></ul><strong>Equal opportunity employer<br/><br/></strong>Skylight is committed to building a diverse and inclusive team. All qualified applicants will be considered without regard to race, color, religion, sex, sexual orientation, gender identity or expression, age, national origin, disability, protected veteran status, or any other factor protected by applicable federal, state, or local laws. If you're the best person for the job, we want you on board!<br/><br/>For Colorado-based candidates, the range being offered for this role is $140K-180K based on experience and for California-based candidates, the range being offered for this role is $140K-180K based on experience. Pursuant to the San Francisco Fair Chance Ordinance, we will consider employment for qualified applicants with criminal histories in a manner consistent with the requirements of this law.<br/><br/>This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.", "responsibilities": "NPIs: Lead and manage the end-to-end execution of launching new hardware products, ensuring timely delivery and quality standards are met\n2nd sourcing: Lead and manage initiatives to manufacture our products at new partners or secondary sources\nMajor product revisions: Oversee and coordinate production revisions, ensuring that changes are implemented seamlessly and efficiently\nManage prototype hardware builds (Prototypes, EVT, DVT) with our manufacturers\nRepresent the Hardware function of the project in reviews, core team, and build meetings\nTravel domestically and internationally as needed", "qualifications": {"required": "You have 2-4+ years of experience managing hardware programs, preferably in consumer electronics or related industry\nYou possess strong project management skills, including the ability to manage budgets, timelines, and stakeholders\nYou have built a track record of managing hardware projects successfully end-to-end and understand the complexities in consumer electronics development &amp; production\nYou understand how product or packaging choices affect sales, operations, and customer service and are skilled at facilitating tradeoff discussions between multiple stakeholders\nYou hold a bachelor's degree in Electrical Engineering, Mechanical Engineering, Computer Science or another technical field\nYou are noted for strong verbal and written communication skills, with the ability to effectively convey complex technical concepts to non-technical stakeholders\nYou have a passion for technology &amp; innovation and are excited by our mission to connect loved ones and raise good human beings"}, "skills": ["Hardware", "Project Management", "Consumer Electronics", "Product Development", "NPI", "Sourcing", "Budget Management", "Timeline Management", "Stakeholder Management", "Technical Communication", "Innovation"], "postedDate": "1 day ago", "benefits": "Competitive Salary + Equity Package\n401K matching\nWellness, learning, and home-office budgets\nHealth, Dental &amp; Vision Medical Plans\nTremendous autonomy to set the direction of your work\nUnlimited PTO\nCompany holidays on the first Friday of every month (Except November &amp; December)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007044400"}