{"jobTitle": "Real Estate Analyst", "company": {"name": "Augment Jobs", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Sales and Management", "industry": "Financial Services", "description": "Job Description: Real Estate Analyst<br/><br/><strong>Position Overview:</strong> We are seeking a meticulous and analytical Real Estate Analyst to join our dynamic real estate investment team. The Real Estate Analyst will play a critical role in conducting market research, financial analysis, and investment modeling to support strategic real estate investment decisions. This position requires strong quantitative skills, real estate market knowledge, and the ability to provide insights to optimize investment performance.<br/><br/><strong>Roles And Responsibilities<br/><br/></strong><ul><li>Market Research: Conduct comprehensive research and analysis of real estate markets, including property trends, demographics, supply and demand dynamics, and economic indicators.</li><li>Financial Analysis: Perform financial analysis, including investment underwriting, cash flow modeling, pro forma analysis, and sensitivity analysis for potential real estate investments.</li><li>Investment Due Diligence: Evaluate potential real estate investment opportunities by analyzing property financials, lease agreements, tenant profiles, and property management reports.</li><li>Valuation: Conduct property valuations using comparative market analysis (CMA), discounted cash flow (DCF) analysis, and other valuation methods to determine investment feasibility and value-add opportunities.</li><li>Investment Modeling: Develop and maintain financial models to assess investment returns, perform scenario analysis, and support decision-making on acquisition, disposition, and asset management strategies.</li><li>Market Trends: Monitor real estate market trends, regulatory changes, and economic factors impacting real estate investments to provide insights and recommendations.</li><li>Reporting and Presentations: Prepare investment memos, presentations, and reports summarizing investment opportunities, financial analysis, and recommendations for senior management and investment committees.</li><li>Risk Assessment: Evaluate investment risks, including market risk, financing risk, operational risk, and liquidity risk, and propose risk mitigation strategies.</li><li>Asset Management Support: Support asset management activities, including performance monitoring, variance analysis, and strategic planning to optimize property performance and investor returns.</li><li>Collaboration: Collaborate with internal teams, including acquisition specialists, asset managers, and finance professionals, to execute investment strategies and achieve investment objectives.<br/><br/></li></ul><strong>Skills Required<br/><br/></strong><ul><li>Bachelor’s degree in Finance, Real Estate, Economics, Business Administration, or related field (Master’s degree, CFA, or relevant certifications preferred).</li><li>Proven experience as a Real Estate Analyst, Investment Analyst, or in a similar role within real estate investment, asset management, or real estate finance.</li><li>Strong understanding of real estate investment principles, financial analysis, and valuation methodologies.</li><li>Proficiency in financial modeling, including Excel, Argus Enterprise, or other real estate financial analysis software.</li><li>Excellent analytical and quantitative skills, with the ability to interpret complex financial data and market trends.</li><li>Strong communication and presentation skills, with the ability to convey investment analysis and recommendations clearly and effectively.</li><li>Detail-oriented with strong organizational skills and the ability to manage multiple projects and deadlines.</li><li>Ability to work independently and collaboratively within a team, demonstrating initiative and problem-solving capabilities.</li><li>Ethical standards and integrity in handling confidential financial information and sensitive data.<br/><br/></li></ul><strong>Compensation<br/><br/></strong><ul><li>Competitive salary based on experience and qualifications.</li><li>Performance-based bonuses and incentives tied to investment performance and achievement of financial targets.</li><li>Comprehensive benefits package including health insurance, retirement plans, and professional development opportunities.</li></ul>", "postedDate": "1 day ago", "skills": ["Financial Modeling", "Real Estate Analysis", "Market Research", "Investment Underwriting", "Valuation", "Financial Reporting", "Risk Assessment", "Asset Management", "Communication", "Presentation Skills", "Excel", "Argus Enterprise"], "url": "https://www.linkedin.com/jobs/view/4007554847"}