{"jobTitle": "Executive Assistant", "company": {"name": "TMZ", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "20.00-23.00 per hour for California", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Media Production", "description": "<strong>Overview Of The Company<br/><br/></strong>FOX Entertainment<br/><br/>With a legacy spanning more than 35 years, FOX Entertainment is one of the world’s most recognizable media brands and a prolific content producer across its iconic broadcast network and both owned and third-party streaming platforms. Known for its independent, innovative spirit and provocative, groundbreaking storytelling, the company was reinvented in 2019 with the formation of FOX Entertainment. While maintaining its leadership in broadcast television (9-1-1: Lone Star, The Simpsons, The Cleaning Lady, Hell’s Kitchen, LEGO Masters), the company is actively building a portfolio of businesses and library of owned original content. To date, FOX Entertainment’s long-term growth strategy has included the acquisitions of award-winning animation studio Bento Box Entertainment (Bob’s Burgers, The Great North, Krapopolis, Grimsburg), entertainment platform TMZ, and global production studio MarVista Entertainment (The Way Home, Rescuing Christmas), as well as the formation of the culinary and lifestyle content venture Studio Ramsay Global (Next Level Chef, Gordon Ramsay’s Food Stars) in partnership with Gordon Ramsay. The company also established its in-house unscripted studio FOX Alternative Entertainment (The Masked Singer, Snake Oil, I Can See Your Voice, Name That Tune), FOX Entertainment Studios (Animal Control) to develop scripted content, and worldwide content sales unit FOX Entertainment Global.<br/><br/><strong>Job Description<br/><br/></strong>TMZ is looking for an Executive Assistant to provide daily administrative and project assistance. The ideal candidate will be detail-oriented and organized, with a keen ability to multi-task and effectively meet deadlines. This role will support the executive with full coordination of activities related to the senior management team at a fast-paced media company. This position is based out of Los Angeles, CA.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Organize and manage the daily calendar, arrange meetings, schedule appointments and conference calls independently or as directed </li><li>Answer, screen, and roll calls, manage call logs and messages, and prepare office correspondence </li><li>Coordinate travel and prepare itineraries </li><li>Generate and submit expense reports </li><li>Coordinate communication between executives, with internal and external teams and departments as needed </li><li>Provide administrative support during breaking news</li><li>Other job-related duties and projects, as assigned <br/><br/></li></ul><strong>Requirements:<br/><br/></strong><ul><li>College degree preferred </li><li>Advanced Excel skills are preferred, with the ability to create research formulas and graphs </li><li>Ability to communicate effectively &amp; tactfully with managers, executive staff, news desk department, &amp; other levels of personnel</li><li>Ability to prepare clear &amp; concise reports etc. for presentation to senior management </li><li>Must pay close attention to detail, maintain confidentiality, and problem solve (within scope of responsibility) </li><li>Ability to work well under time constraints and handle multiple tasks in fast-paced environment</li><li>Ability to work independently as well as part of a team </li><li>Must have initiative and be a self-starter </li><li>Proficiency in MS Word, Outlook and PowerPoint required </li><li>Excellent verbal and written communications skills required </li><li>Must have knowledge of file set-up, maintenance, filing procedures, basic math, spelling, grammar, punctuation, English usage, and report &amp; business letter formats <br/><br/></li></ul><strong>TMZ is a workplace that requires the COVID-19 vaccination as a condition of employment. </strong>Requested accommodations/exceptions will be evaluated on a case-by-case basis in accordance with law.<br/><br/>TMZ is an Equal Opportunity Employer.<br/><br/><em>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, gender identity, disability, protected veteran status, or any other characteristic protected by law. We will consider for employment qualified applicants with criminal histories consistent with applicable law.<br/><br/></em><em> At FOX, we foster a culture and environment where everyone feels welcome and can thrive. We are deeply committed to diversity, equity, and inclusion, including attracting, retaining, and promoting diverse talent across our company. We live in a diverse world, with different ideas and different perspectives that come together to spark new ideas and make great things happen. That means reflecting the diversity of the world around us is critical to our company’s success. We ensure that our viewers, communities and employees feel heard, represented, and celebrated both on screen and off. <br/><br/></em>Pursuant to state and local pay disclosure requirements, the pay range for this role, with final offer amount dependent on education, skills, experience, and location is: $20.00-23.00 per hour for California. This role is also eligible for various benefits, including medical/dental/vision, insurance, a 401(k) plan, paid time off, and other benefits in accordance with applicable plan documents. Benefits for Union represented employees will be in accordance with the applicable collective bargaining agreement.", "responsibilities": "<ul><li>Organize and manage the daily calendar, arrange meetings, schedule appointments and conference calls independently or as directed </li><li>Answer, screen, and roll calls, manage call logs and messages, and prepare office correspondence </li><li>Coordinate travel and prepare itineraries </li><li>Generate and submit expense reports </li><li>Coordinate communication between executives, with internal and external teams and departments as needed </li><li>Provide administrative support during breaking news</li><li>Other job-related duties and projects, as assigned <br/><br/></li></ul>", "qualifications": {"required": "<ul><li>College degree preferred </li><li>Advanced Excel skills are preferred, with the ability to create research formulas and graphs </li><li>Ability to communicate effectively &amp; tactfully with managers, executive staff, news desk department, &amp; other levels of personnel</li><li>Ability to prepare clear &amp; concise reports etc. for presentation to senior management </li><li>Must pay close attention to detail, maintain confidentiality, and problem solve (within scope of responsibility) </li><li>Ability to work well under time constraints and handle multiple tasks in fast-paced environment</li><li>Ability to work independently as well as part of a team </li><li>Must have initiative and be a self-starter </li><li>Proficiency in MS Word, Outlook and PowerPoint required </li><li>Excellent verbal and written communications skills required </li><li>Must have knowledge of file set-up, maintenance, filing procedures, basic math, spelling, grammar, punctuation, English usage, and report &amp; business letter formats <br/><br/></li></ul>", "preferred": null}, "skills": ["Excel", "Communication", "Report Writing", "Problem Solving", "Microsoft Word", "Outlook", "PowerPoint"], "postedDate": "21 hours ago", "applicationDeadline": null, "benefits": "This role is also eligible for various benefits, including medical/dental/vision, insurance, a 401(k) plan, paid time off, and other benefits in accordance with applicable plan documents. Benefits for Union represented employees will be in accordance with the applicable collective bargaining agreement.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007308759"}