{"jobTitle": "Operations Manager", "company": {"name": "Need Pastel", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Management", "industry": "Advertising Services and Marketing Services", "description": "The ideal candidate will have an ability to create and maintain an efficient system of operation to support the business needs. The candidate should be comfortable multitasking and working cross-functionally with different business units. The ideal candidate will have previous experience in related fields.  Key Responsibilities: Project Management: Oversee the execution of social media campaigns, creative projects, and marketing stunts; manage timelines, budgets, and resources. Team Coordination: Lead cross-functional teams, facilitate regular meetings, and mentor team members to ensure alignment and productivity. Process Improvement: Analyze and optimize workflows; implement and document standard operating procedures (SOPs). Client Relations: Serve as a point of contact for key clients; collaborate with the Creative Director and Brand Manager on proposals and client communications. Budget Management: Develop and manage the agency’s budget; monitor financial performance and report on variances. Vendor and Partner Management: Negotiate contracts and manage relationships with external vendors and partners. Reporting and Analytics: Develop reporting systems to track project performance, team productivity, and financial metrics; provide insights to senior management. Qualifications 3+ years of experience in a similar role Proficiency with Microsoft Office Strong organizational and communication skills Strong ability to multitask Comfort working with multiple groups within business", "responsibilities": "Oversee the execution of social media campaigns, creative projects, and marketing stunts; manage timelines, budgets, and resources. Lead cross-functional teams, facilitate regular meetings, and mentor team members to ensure alignment and productivity. Analyze and optimize workflows; implement and document standard operating procedures (SOPs). Serve as a point of contact for key clients; collaborate with the Creative Director and Brand Manager on proposals and client communications. Develop and manage the agency’s budget; monitor financial performance and report on variances. Negotiate contracts and manage relationships with external vendors and partners. Develop reporting systems to track project performance, team productivity, and financial metrics; provide insights to senior management.", "qualifications": {"required": "3+ years of experience in a similar role, Proficiency with Microsoft Office, Strong organizational and communication skills, Strong ability to multitask, Comfort working with multiple groups within business"}, "skills": ["Project Management", "Team Coordination", "Process Improvement", "Client Relations", "Budget Management", "Vendor Management", "Reporting and Analytics", "Microsoft Office"], "postedDate": "1 day ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007076623"}