{"jobTitle": "Warehouse Manager", "company": {"name": "Aerotek", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "18.00/hr - 35.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "If you need work ASAP and have Warehouse or Warehouse Manager experience then this is the position for you!<br/><br/>A popular aerospace company in Chatsworth is looking for a Warehouse Clerks and a Warehouse Manager to join the team!<br/><br/>Aerotek will provide a rapid interview process so you start work as soon as possible!<br/><br/>Skills:<br/><br/>Warehouse Clerk / Warehouse Manager or Warehouse Supervisor / Aerospace is a plus<br/><br/>Experience Level:<br/><br/>Entry - Expert Level<br/><br/>Location:<br/><br/>Chatsworth<br/><br/>Pay / Shift :<br/><br/>$18 - 35hr / Up to $70k depending on experience<br/><br/>Mon-Fri<br/><br/>1st shift: 7:30am - 4:30pm<br/><br/>Apply right now and expect a call/text from Ryan with Aerotek😊. Positions with this company will be filled quickly!<br/><br/>About Aerotek:<br/><br/>We know that a company's success starts with its employees. We also know that an individual's success starts with the right career opportunity. As a Best of Staffing® Client and Talent leader, Aerotek's people-focused approach yields competitive advantage for our clients and rewarding careers for our contract employees. Since 1983, Aerotek has grown to become a leader in recruiting and staffing services. With more than 250 non-franchised offices, Aerotek's 8,000 internal employees serve more than 300,000 contract employees and 18,000 clients every year. Aerotek is an Allegis Group company, the global leader in talent solutions. Learn more at Aerotek.com.<br/><br/>The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "responsibilities": null, "qualifications": {"required": null, "preferred": null}, "skills": ["Warehouse", "Warehouse Manager", "Warehouse Clerk", "Warehouse Supervisor", "Aerospace"], "postedDate": "2 days ago", "applicationDeadline": null, "benefits": null, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007390459"}