{"jobTitle": "3rd Shift Sanitation Lead - Shine Foods", "company": {"name": "Jessie Lord Bakery", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$18.00 - $19.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Food and Beverage Services", "description": "<strong>Location:</strong> Shine Foods, Inc. (Sister company of Jessie Lord Bakery)<br/><br/><strong>Job Summary: </strong>Responsible for the cleaning and sanitizing of production processing equipment and lines. Works in a Lead capacity overseeing work of sanitation team.<br/><br/><strong>Essential Job Functions<br/><br/></strong><ul><li>Provide leadership and direction to assigned crew.</li><li>Assist in the training of new employees as well as the retraining of existing employees.</li><li>Accept responsibility for the work performed under your direction.</li><li>Ensure that assigned work is completed in a timely manner.</li><li>Ensure plant cleanliness is within acceptable levels of quality, costs, and efficiency.</li><li>Motivate employees to complete tasks while ensuring that productivity and sanitation standards are met.</li><li>Inspects premises for unsanitary practices and conditions.</li><li>Prepares and handles sanitation chemicals and equipment.</li><li>Maintain Master Sanitation Schedule (MSCS).</li><li>Trains and coaches Sanitation employees to follow sanitation cleaning procedures (SSOPs)</li><li>Conduct daily post-sanitation performance inspections to ensure the quality of work being performed.</li><li>Assist with retraining of existing employees.</li><li>Ensure correct mixing of chemicals or cleaning solutions needed to clean and sanitize equipment and the facility; reassemble equipment as necessary.</li><li>Interact daily with Quality Assurance and Production on sanitation activities and performance.</li><li>Keep and maintain a clean and orderly workspace.</li><li>Make sure all Equipment and Brushes, and squeegees used are put back in their place at the end of the shift.<br/><br/></li></ul><strong>Food Safety Responsibilities<br/><br/></strong><ul><li>All employees are required to immediately report and assist in the elimination or control of any food safety issues they observe to their supervisor.</li><li>Monitors and enforces GMPs within the Sanitation department.</li><li>Follow all Good Manufacturing Practices and Pre-requisite Programs. <br/><br/></li></ul><strong>Education And Certification Requirements<br/><br/></strong><ul><li>High school diploma, equivalent or higher. </li><li>Minimum of 2 years’ experience in food plant operations, food safety, sanitation and or pest control.</li><li>Minimum 1 year Leadership / auditing / regulatory experience in a food manufacturing environment.</li><li>Certifications in Food Safety, HACCP and Good Manufacturing Practices (GMP) strongly preferred.<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li>Exposure to temperature change.</li><li>Push/pull 10-100 pounds approximately 10-50 feet.</li><li>Frequent lifting between 10 to 50 pounds of supplies and trash with the aid of co-workers.<br/><br/></li></ul><strong>Preferred Skills<br/><br/></strong><ul><li>Strong knowledge of food safety systems and best practices.</li><li>Excellent team building, oral, written, and interpersonal communication skills.</li><li>Ability to work within a food plant environment.</li><li>Experience in directly leading others in a sanitation role.</li><li>Bi-Lingual (English/Spanish).</li><li>Strong communication skills.<br/><br/></li></ul><strong>Supervisor: </strong>Sanitation Manager<br/><br/><strong>Pay Range: </strong>$18.00 - $19.00 per hour.<br/><br/><strong>Schedule: </strong>3rd shift<br/><br/><strong>COVID-19:</strong> Employees are required to present Covid-19 vaccination or request accommodation in accordance to the law.<br/><br/><strong>FLSA Status: </strong>Non-Exempt<br/><br/><strong>Job Type: </strong>Full-time", "responsibilities": "Responsible for the cleaning and sanitizing of production processing equipment and lines. Works in a Lead capacity overseeing work of sanitation team.", "qualifications": {"required": "High school diploma, equivalent or higher. Minimum of 2 years’ experience in food plant operations, food safety, sanitation and or pest control. Minimum 1 year Leadership / auditing / regulatory experience in a food manufacturing environment.", "preferred": "Certifications in Food Safety, HACCP and Good Manufacturing Practices (GMP)"}, "skills": ["Food Safety", "HACCP", "GMP", "Team Building", "Communication", "Leadership"], "postedDate": "5 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007005069"}