{"jobTitle": "Care Manager RN", "company": {"name": "Providence", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "Case Management is a collaborative practice including patients, caregivers, nurses, social workers, physicians, payers, support staff, other practitioners and the community. The Case Management process facilitates communication and care coordination along a continuum through effective transitional care management. Recognizing the patient's right to self-determination, the significance of the social determinants of health and the complexities of care.<br/><br/>Providence caregivers are not simply valued – they’re invaluable. Join our team at St Joseph Medical Center and thrive in our culture of patient-focused, whole-person care built on understanding, commitment, and mutual respect. Your voice matters here, because we know that to inspire and retain the best people, we must empower them.<br/><br/><strong>Required Qualifications<br/><br/></strong><ul><li>Bachelor's Degree, or equivalent education/experience.</li><li>All Registered Nurses without a minimum of a Bachelor’s degree in Nursing must obtain a Bachelor’s degree in Nursing or higher within 3 years of hire.</li><li>Any previously agreed upon effective date for obtaining a Bachelor’s degree in nursing between individual and facility will remain in effect.</li><li>Any collective bargaining contract with specific time frames for obtaining a Bachelor’s degree in nursing will supersede the above point and will remain in effect.</li><li>Exceptions will be considered on a case-by-case basis at each ministry by the Director of Care Management in consultation with the Human Resources.</li><li>RNs employed prior to 8/2021 are encouraged to obtain a Bachelor’s degree or higher degree in Nursing, but obtaining the degree will not be a condition of employment.</li><li>California Registered Nurse License upon hire.</li><li>2 years experience in Healthcare related field (Acute, Ambulatory, Post-Acute, etc.).</li><li>2 years experience in Case Management (Care Coordination or Utilization Management) or successful completion of the Transitions in Practice (TIP) program for Care Manager. TIP candidates must have experience in same type of nursing unit in which the CM position is available.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Bachelor's Degree in Nursing.</li><li>Master's Degree in Healthcare related field.</li><li>Certification in Case Management (ACM or CCM) upon hire.<br/><br/></li></ul><strong>Why Join Providence?<br/><br/></strong>Our best-in-class benefits are uniquely designed to support you and your family in staying well, growing professionally and achieving financial security. We take care of you, so you can focus on delivering our Mission of caring for everyone, especially the most vulnerable in our communities.<br/><br/><strong>About Providence<br/><br/></strong>At Providence, our strength lies in Our Promise of “Know me, care for me, ease my way.” Working at our family of organizations means that regardless of your role, we’ll walk alongside you in your career, supporting you so you can support others. We provide best-in-class benefits and we foster an inclusive workplace where diversity is valued, and everyone is essential, heard and respected. Together, our 120,000 caregivers (all employees) serve in over 50 hospitals, over 1,000 clinics and a full range of health and social services across Alaska, California, Montana, New Mexico, Oregon, Texas and Washington. As a comprehensive health care organization, we are serving more people, advancing best practices and continuing our more than 100-year tradition of serving the poor and vulnerable.<br/><br/>The amounts listed are the base pay range; additional compensation may be available for this role, such as shift differentials, standby/on-call, overtime, premiums, extra shift incentives, or bonus opportunities.<br/><br/>Check out our benefits page for more information about our Benefits and Rewards.<br/><br/><strong>About The Team<br/><br/></strong>The Sisters of Providence and Sisters of St. Joseph of Orange have deep roots in California, bringing health care and education to communities from the redwood forests to the beach shores of Orange county - and everywhere in between. In Southern California, Providence provides care throughout Los Angeles County, Orange County, High Desert and beyond.<br/><br/>Our award-winning and comprehensive medical centers are known for outstanding programs in cancer, cardiology, neurosciences, orthopedics, women's services, emergency and trauma care, pediatrics and neonatal intensive care. Our not-for-profit network provides a full spectrum of care with leading-edge diagnostics and treatment, outpatient health centers, physician groups and clinics, numerous outreach programs, and hospice and home care, and even our own Providence High School.<br/><br/>Providence is proud to be an Equal Opportunity Employer. We are committed to the principle that every workforce member has the right to work in surroundings that are free from all forms of unlawful discrimination and harassment on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law. We believe diversity makes us stronger, so we are dedicated to shaping an inclusive workforce, learning from each other, and creating equal opportunities for advancement.<br/><br/><strong>Requsition ID:</strong> 307841<br/><br/><strong>Company:</strong> Providence Jobs<br/><br/><strong>Job Category:</strong> Care Management<br/><br/><strong>Job Function:</strong> Clinical Care<br/><br/><strong>Job Schedule:</strong> Part time<br/><br/><strong>Job Shift<br/><br/></strong><strong>Career Track:</strong> Nursing<br/><br/><strong>Department:</strong> 7001 PSJMC CASE MGMT<br/><br/><strong>Address:</strong> CA Burbank 501 S Buena Vista St<br/><br/><strong>Work Location:</strong> Providence Saint Joseph Medical Ctr-Burbank<br/><br/><strong>Pay Range:</strong> $73.50 - $78.50<br/><br/>The amounts listed are the base pay range; additional compensation may be available for this role, such as shift differentials, standby/on-call, overtime, premiums, extra shift incentives, or bonus opportunities.<br/><br/>Check out our benefits page for more information about our Benefits and Rewards.<br/><br/>Providence offers a comprehensive benefits package including a retirement 401(k) Savings Plan with employer matching, health care benefits (medical, dental, vision), life insurance, disability insurance, time off benefits (paid parental leave, vacations, holidays, health issues), voluntary benefits, well-being resources and much more. Learn more at providence.jobs/benefits", "responsibilities": null, "qualifications": {"required": "Bachelor's Degree, or equivalent education/experience.\nAll Registered Nurses without a minimum of a Bachelor’s degree in Nursing must obtain a Bachelor’s degree in Nursing or higher within 3 years of hire.\nAny previously agreed upon effective date for obtaining a Bachelor’s degree in nursing between individual and facility will remain in effect.\nAny collective bargaining contract with specific time frames for obtaining a Bachelor’s degree in nursing will supersede the above point and will remain in effect.\nExceptions will be considered on a case-by-case basis at each ministry by the Director of Care Management in consultation with the Human Resources.\nRNs employed prior to 8/2021 are encouraged to obtain a Bachelor’s degree or higher degree in Nursing, but obtaining the degree will not be a condition of employment.\nCalifornia Registered Nurse License upon hire.\n2 years experience in Healthcare related field (Acute, Ambulatory, Post-Acute, etc.).\n2 years experience in Case Management (Care Coordination or Utilization Management) or successful completion of the Transitions in Practice (TIP) program for Care Manager. TIP candidates must have experience in same type of nursing unit in which the CM position is available.", "preferred": "Bachelor's Degree in Nursing.\nMaster's Degree in Healthcare related field.\nCertification in Case Management (ACM or CCM) upon hire."}, "skills": [], "postedDate": "2 days ago", "applicationDeadline": null, "benefits": "Our best-in-class benefits are uniquely designed to support you and your family in staying well, growing professionally and achieving financial security. We take care of you, so you can focus on delivering our Mission of caring for everyone, especially the most vulnerable in our communities.<br/><br/>Providence offers a comprehensive benefits package including a retirement 401(k) Savings Plan with employer matching, health care benefits (medical, dental, vision), life insurance, disability insurance, time off benefits (paid parental leave, vacations, holidays, health issues), voluntary benefits, well-being resources and much more. Learn more at providence.jobs/benefits", "remoteWork": null, "salary": {"amount": "73.50 - 78.50", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4007302639"}