{"jobTitle": "Visual Merchandising Manager - Rodeo Drive", "company": {"name": "Louis Vuitton", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Retail Apparel and Fashion", "description": "Job responsibilities<br/><br/>Our Louis Vuitton Rodeo Drive is seeking an agile and detail-oriented <strong>Visual Merchandising Manager</strong> who will lead the in-store visual merchandising strategy, continuously elevating the environment and maintaining luxury retail standards in order to enhance both the business and the Client experience.<br/><br/>Profile<br/><br/>The Visual Merchandising Manager will act as a proactive force leveraging visual merchandising as a way to drive sales. You will be responsible for driving consistency, quality and sophistication of the visual merchandising implementation on all product categories within the store. The role will include managing all aspects of store zoning and rotations in collaboration with the store team, ensuring key products are selected and well displayed to maximize business opportunities, leading window product changes and installations including coordination with corporate and local suppliers, collaborating with store team on business events (sales trends, new launches, new collections, special events) and training the team on visual merchandising topics.<br/><br/>Strong communication and interpersonal skills are important as regular qualitative feedback to Regional and Corporate partners will be required.<br/><br/>Additionally, the successful candidate will have previously held a senior level or multi-unit Visual Merchandising Management role and has experience leading visual execution in a fast paced, retail (preferably luxury) environment. It is essential that you have an expert knowledge implementing visual merchandising strategies and standards, window installations, and experience across different product categories.<br/><br/><em>The appointed candidate will be offered a salary within the range of USD $95,000 - $115,000 annually, plus the opportunity for a bonus, a comprehensive benefits package including medical, dental, vision, short and long-term disability, various paid time off programs, employee discount/perks and two retirement plans both with employer contributions.<br/><br/></em>Additional information<br/><br/>Louis Vuitton is a company that respects the uniqueness of each employee and offers everyone the means to find their place and thrive. We promote initiatives aimed at supporting professional equality for everyone. We strive to go above and beyond purely symbolic measures by building a culture focused on meaningful strategies aimed at creating an inclusive workforce.<br/><br/>In addition to a generous benefits package, unparalleled career development opportunities, both locally &amp; globally, as an employee at Louis Vuitton, you can expect to be provided with industry leading training which will offer you an in-depth insight into the luxury and retail environment.<br/><br/>Please see our Privacy Policy for information on the personal information we collect from job applicants, how we use it, and your rights with respect to this information.<br/><br/>Reference LVM24526", "responsibilities": "Our Louis Vuitton Rodeo Drive is seeking an agile and detail-oriented Visual Merchandising Manager who will lead the in-store visual merchandising strategy, continuously elevating the environment and maintaining luxury retail standards in order to enhance both the business and the Client experience.", "qualifications": {"required": "The Visual Merchandising Manager will act as a proactive force leveraging visual merchandising as a way to drive sales. You will be responsible for driving consistency, quality and sophistication of the visual merchandising implementation on all product categories within the store. The role will include managing all aspects of store zoning and rotations in collaboration with the store team, ensuring key products are selected and well displayed to maximize business opportunities, leading window product changes and installations including coordination with corporate and local suppliers, collaborating with store team on business events (sales trends, new launches, new collections, special events) and training the team on visual merchandising topics.<br/><br/>Strong communication and interpersonal skills are important as regular qualitative feedback to Regional and Corporate partners will be required.", "preferred": "The successful candidate will have previously held a senior level or multi-unit Visual Merchandising Management role and has experience leading visual execution in a fast paced, retail (preferably luxury) environment. It is essential that you have an expert knowledge implementing visual merchandising strategies and standards, window installations, and experience across different product categories."}, "skills": [], "postedDate": "1 day ago", "benefits": "The appointed candidate will be offered a salary within the range of USD $95,000 - $115,000 annually, plus the opportunity for a bonus, a comprehensive benefits package including medical, dental, vision, short and long-term disability, various paid time off programs, employee discount/perks and two retirement plans both with employer contributions.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007028522"}