{"jobTitle": "Production Supervisor", "company": {"name": "Aerotek", "location": "Artesia, CA"}, "location": "Artesia, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Job Title: Production Supervisor<br/><br/><strong>Job Description<br/><br/></strong>Direct the activities of employees engaged in manufacturing activities, including but not limited to training and supervising, maintaining a positive work environment, and ensuring compliance with safety standards and established policies and procedures.<br/><br/>Hard Skills<br/><br/><ul><li>3-5 years of progressive production experience, preferably in a food manufacturing environment</li><li>Supervision of operators/production staff<br/><br/></li></ul>Soft Skills<br/><br/><ul><li>Training and motivating employees</li><li>Maintaining a positive work environment</li><li>Coordinating with Quality Control</li><li>Resolving personnel issues</li><li>Implementing safety programs<br/><br/></li></ul>Job Type<br/><br/>This is a permanent position.<br/><br/>Work Site<br/><br/>This is a fully on-site position in Cerritos, California.<br/><br/>Work Environment<br/><br/>Supervise all production activities performed by employees and maintain a high degree of visibility and access to employees throughout the shift. Establish and maintain department standards for productivity, reliability, and accuracy. Monitor and report daily production results, material usage, waste, and downtime. Report equipment problems to the appropriate department and production manager. Coordinate with Quality Control to maintain quality standards and take corrective measures to resolve deficiencies. Train, motivate, coach, reward, and discipline employees being supervised. Resolve personnel issues. Coordinate with the production manager to manage personnel issues including vacation approvals, time card approval, daily and weekly overtime, hiring, and training. Perform required administrative tasks and prepare required reports and correspondence. Assist the production manager with the development and implementation of policies and procedures, ensuring all established policies and procedures are followed by employees. Inspect for proper sanitation of equipment and facilities and take corrective action to resolve deficiencies. Resolve production-related issues with representatives from other departments throughout the company. Maintain a working knowledge of all operating systems pertaining to the work area. Partner with the Safety Manager on the implementation of safety programs and all required safety training for employees. Perform other related duties as assigned by management. Work 2pm-11pm shift, Monday through Friday.<br/><br/>About Aerotek:<br/><br/>We know that a company's success starts with its employees. We also know that an individual's success starts with the right career opportunity. As a Best of Staffing® Client and Talent leader, Aerotek's people-focused approach yields competitive advantage for our clients and rewarding careers for our contract employees. Since 1983, Aerotek has grown to become a leader in recruiting and staffing services. With more than 250 non-franchised offices, Aerotek's 8,000 internal employees serve more than 300,000 contract employees and 18,000 clients every year. Aerotek is an Allegis Group company, the global leader in talent solutions. Learn more at Aerotek.com.<br/><br/>The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "responsibilities": "Direct the activities of employees engaged in manufacturing activities, including but not limited to training and supervising, maintaining a positive work environment, and ensuring compliance with safety standards and established policies and procedures.", "qualifications": {"required": "3-5 years of progressive production experience, preferably in a food manufacturing environment", "preferred": "Supervision of operators/production staff"}, "skills": ["Training", "Motivating", "Quality Control", "Resolving", "Implementing"], "postedDate": "1 day ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007389735"}