{"jobTitle": "Marketing Manager - Entry Level", "company": {"name": "Prime Tech Enterprise", "industry": "Internet Publishing", "size": "Not specified", "location": "Buena Park, CA"}, "location": "Buena Park, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Marketing and Sales", "industry": "Internet Publishing", "description": "Company Overview:\nPrime Tech Enterprises is a growing sales firm dedicated to delivering top-notch outreach and enrollment solutions to our valued clients. We pride ourselves on our commitment to excellence, innovation, and creating meaningful relationships with potential customers on behalf of our clients. As we continue to expand, we are seeking a motivated and enthusiastic Entry-Level Marketing Manager to join our team and play a pivotal role in driving customer enrollment and engagement.\nAs an Entry-Level Marketing Manager specializing in sales and customer enrollment, you will be an integral part of our sales and marketing team, responsible for attracting, engaging, and onboarding new customers. You will work closely with the marketing and sales departments to develop and execute strategies that enhance customer acquisition, retention, and overall satisfaction. This role offers an excellent opportunity for individuals with a passion for marketing, strong communication skills, and a desire to grow in a collaborative and fast-paced environment.", "responsibilities": "Collaborate with the sales and marketing team to develop and implement customer enrollment strategies. Create and optimize engaging marketing campaigns targeting potential customers through residential outreach initiatives. Assist in the creation of compelling presentations to drive sales on behalf of our clients. Monitor and analyze the performance of marketing campaigns, generating reports and insights to assess effectiveness and suggest improvements. Collaborate with cross-functional teams, including sales and customer support, to ensure a seamless customer journey from enrollment to post-purchase support. Stay up-to-date with industry trends, best practices, and emerging technologies to continuously improve enrollment strategies.", "qualifications": {"required": "Bachelor's degree in Marketing, Business, Communications, or related field (preferred but not required). Strong passion for marketing and customer engagement, with a desire to learn and grow in a fast-paced environment. Excellent written and verbal communication skills. Basic understanding of marketing principles and concepts. Analytical mindset with the ability to interpret data and make informed decisions. Highly organized, detail-oriented, and able to manage multiple tasks simultaneously. Collaborative team player with the ability to work cross-functionally. Adaptability and willingness to learn from constructive feedback. Prior internship or coursework in marketing is advantageous but not required.", "preferred": "Not specified"}, "skills": [], "postedDate": "3 days ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4007128220"}