{"jobTitle": "Strategic Account Manager", "company": {"name": "Tarkett", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Wholesale Building Materials, Manufacturing, and Textile Manufacturing", "description": "The Strategic Account Manager develops new prospects and interacts with existing multifamily, single-family housing, NFA, and top 50 customers to increase sales of the organization's products and/or services. The SAM will become familiar with a variety of the field's concepts, practices, and procedures and will rely on experience and judgment to plan and accomplish goals. The SAM will perform a variety of complicated tasks and may direct and lead the work of others. A successful SAM will have a wide degree of creativity and latitude. The SAM will coordinate with the VP of Home Centers for the OEM partners to drive product knowledge and be a key support system for their sales teams.<br/><br/><strong>ESSENTIAL DUTIES AND RESPONSIBILITIES: <br/><br/></strong><ul><li>Work closely with RVP, RBM, and TSR to increase sales of both hard and soft surface Tarkett products through specific agreed upon strategic accounts including Floor Expo, NFA, top 50 retailers, and direct partners in their region. </li><li>Effectively evaluate customer base to determine best service model.</li><li>Appropriately forecast specified projects and large volume opportunities.</li><li>Responsible for driving specifications, calling directly on the customers and attending local networking events and trade shows.</li><li>Conduct product knowledge presentations for end users, dealers and architects/designers.</li><li>Create and maintain an effective business plan for corporate level strategic partners, end user opportunities, and floor expo members.</li><li>Collect competitive information and share with colleagues and internal departments.</li><li>Research and become “expert” in MFH market and single family market.</li><li>Effectively plan to drive sales through your targeted accounts.</li><li>Present and train sales staff on core products related to their business units</li><li>Influence OEM teams through product knowledge trainings to increase overall business.<br/><br/></li></ul><strong>REQUIREMENTS (including educational requirements):<br/><br/></strong><ul><li>Bachelor's degree in Business, Marketing or other related field and 4+ years experience or equivalent combination of education and experience</li><li>3+ years of sales experience</li><li>Entrepreneurial attitude</li><li>Competitive spirit with a desire to exceed expectations</li><li>Ability to identify sales trends and develop business insights</li><li>Excellent communication skills</li><li>Collaborative</li><li>Convincing and persuasive</li><li>Assertive</li><li>Attention to detail</li><li>Commitment to planning and organization</li><li>Experience in launching products at key accounts</li><li>Proficient in Excel, PowerPoint and MS Word computer programs</li><li>Overnight Travel is required (50%-75%) <br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li>A commitment that Safety is #1</li><li>Competitive benefits, pay, and retirement plan options!</li><li>Career growth, stability, and flexible work arrangements.<br/><br/></li></ul><strong>Responsible Manufacturing – Protecting Our Planet for the Future<br/><br/></strong><ul><li>We utilize renewable energy and a closed loop recycled water process.</li><li>We are committed to reducing greenhouse emissions and water consumption.</li><li>We are the only flooring company recognized by the Asthma and Allergy foundation.<br/><br/></li></ul><strong>Who we are:<br/><br/></strong>With a history of 140 years, Tarkett is a worldwide leader in innovative flooring and sport surface solutions with 12,000 employees and 34 industrial sites. Offering a wide range of products including vinyl, linoleum, rubber, carpet, wood, laminate, artificial turf, and athletic tracks. The Group serves customers in more than 100 countries across the globe.<br/><br/>Committed to change the game with circular economy and to reducing its carbon footprint, the Group has implemented an eco-innovation strategy based on Cradle to Cradle® principles, fully aligned with its Tarkett Human-Conscious Design® approach.<br/><br/>Tarkett is listed on Euronext (Compartment B, ISIN FR0004188670, ticker: TKTT). www.tarkett-group.com<br/><br/><em>Tarkett is an equal opportunity employer. We value diversity in backgrounds and in experiences and promote an inclusive workplace where all employees can perform at their best.</em>", "postedDate": "1 day ago", "skills": ["Sales", "Business Development", "Marketing", "Product Knowledge", "Customer Relationship Management", "Sales Forecasting", "Presentation Skills", "Networking", "Trade Shows", "Business Planning", "Competitive Analysis", "Market Research", "Training", "Excel", "PowerPoint", "MS Word", "Overnight Travel"], "benefits": "A commitment that Safety is #1, Competitive benefits, pay, and retirement plan options!, Career growth, stability, and flexible work arrangements.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007586888"}