{"jobTitle": "Probate & Estate Litigation Paralegal - Arizona", "company": {"name": "Zirtual", "location": "Phoenix, AZ"}, "location": "Phoenix, AZ", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Legal", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Zirtual is a work-life balanced company that offers law firms practice area specific, experienced virtual paralegals. Our US-based paralegals strive to meet and exceed attorney-client needs and expectations. Zirtual offers paralegals in every practice area and state, both transactional and litigation.<br/><br/>Our paralegals are vital members of Zirtual. The paralegal is the main point of contact with their assigned client(s) and will work independently with the law firms. The paralegal will receive support from their assigned Account Supervisor, who will assist the paralegal & law firm relationship with plan modifications, questions, feedback on quality, delegation and collaboration best practices, and more.<br/><br/>The paralegal will provide a high-level professional service by working on tasks and projects as assigned by the client, and ensuring they are executed on time and to the highest level of quality. The paralegal is responsible for being the main point of contact for their assigned client(s), and being familiar with each clients' needs and preferences.<br/><br/>The paralegal must have consistent and proactive communication with clients and the Account Supervisors. Paralegals are expected to be available for clients during business hours as agreed upon with each client, but around-the-clock availability is not expected. Paralegals ensure time is entered on a daily basis using a provided tool, respond to all communication within a mutually established response time expectation tailored to each client's needs, maintain detailed and up-to-date client profiles, and follow Zirtual's best practices for success.<br/><br/>We are seeking a 1099 Arizona Probate & Estate Litigation Virtual Paralegal to add to the Zirtual paralegal team for our Arizona law firm client. The paralegal should specifically have Arizona experience in this practice area. We will not consider other state and/or practice experience for this role.<br/><br/><strong>Requirements<br/><br/></strong><em>Probate<br/><br/></em><ul><li>Review estate planning docs, prepare summaries and analysis. </li><li>Review and organize records maintained by fiduciaries, decedents/ conservatees, guardians. </li><li>Prepare inventories, real estate transfer deeds, exclusion claims, and other real estate transfer documents. </li><li>Prepare distribution plans and consents. </li><li>Work with third parties and courts, custom to jurisdictional procedures. </li><li>Draft petitions, supporting docs, identify beneficiaries for intestate probates, draft accountings, prepare and publish notices, </li><li>attorney feed declarations, supplements, gift tax and federal estate tax returns, etc. <br/><br/></li></ul><em>Estate Litigation<br/><br/></em><ul><li>Legal research, drafting legal documents & pleadings, client liaison, compiling & summarizing legal documents, exhibit prep, statutory docketing, case/matter management,compiling & summarizing legal documents & evidence, etc</li><li>Legal pleadings, demands, orders, motions, memorandums & briefs, discovery, summons, complaints, answers, disclosures, correspondence, & notices</li><li>Organize and maintain case files, track deadlines, statutory docketing, case calendaring, milestone prep, case reviews & status summaries, implementation or improvement of case management systems</li><li>Draft interrogatories, requests for production and admissions, liaison with client to respond & gather documents, draft discovery demands, update ongoing discovery requirements, organization & bates stamping, coordinate depositions, create deposition binders & summaries</li><li>Organize trial binders, exhibits, & evidence, prepare briefs, pre-trial motions and jury instructions, coordinate with court personnel, client & witness coordination, assist in preparing witness lists, exhibit lists, and trial subpoenas<br/><br/></li></ul>LEGAL ASSISTANT SUPPORT<br/><br/><ul><li>File & document management</li><li>Organizational support</li><li>Boilerplate document drafting such as notice of deposition, notice of representation, cover letters, etc</li><li>eFile with state courts and local entities</li><li>Coordinating with third parties, obtaining hearing or meeting dates, etc</li><li>Basic client relationship management</li><li>Request and gather forms, documents and basic information</li><li>Email & calendar management</li><li>Creating new matters in case management softwares</li><li>Creating exhibit charts and other organizational charts</li><li>Coordinating signings, depositions, etc. </li><li>Attend meetings/take notes<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong>Virtual paralegals are expected to conduct themselves in a professional manner at all times, cognizant of the nature of the business relationship and customer service expectations.<br/><br/>Virtual paralegals should be:<br/><br/><ul><li>Exceptional communicators, allowing their clients to feel comfortable that deadlines are being met, clients are taken care of, and that they can trust your commitment to their firm</li><li>Organized and self-sufficient, able to self-manage their workload, prioritize tasks and meet or exceed deadlines</li><li>Technologically Proficient, willing and able to navigate new case management systems and softwares depending on the firm. </li><li>Detail oriented, ensuring all work product turned into the client is generally free from errors, especially minor \"oversight\" errors</li><li>Solution based, knowing when they need to leverage their resources to find the answers, while also knowing when it makes more sense to ask the client for guidance or more instruction<br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Minimum 3+ years of experience handling ARIZONA PROBATE AND ESTATE LITIGATION paralegal work as outlined above</li><li>Experience working remotely preferred</li><li>Home office set up, reliable computer, WiFi, phone</li><li>Extensive experience within case/transaction management and drafting softwares (practice area dependent)</li><li>Experience with standard office softwares, Microsoft 365 products, Google, etc. </li><li>Available during business hours Monday-Friday, unless otherwise arranged based on specific client needs and tasks. </li><li>Preferred working independently at least part-time<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>You will be compensated as a 1099 independent contractor. </li><li>$30 per hour</li></ul>", "responsibilities": "The paralegal is the main point of contact with their assigned client(s) and will work independently with the law firms. The paralegal will receive support from their assigned Account Supervisor, who will assist the paralegal & law firm relationship with plan modifications, questions, feedback on quality, delegation and collaboration best practices, and more.<br/><br/>The paralegal will provide a high-level professional service by working on tasks and projects as assigned by the client, and ensuring they are executed on time and to the highest level of quality. The paralegal is responsible for being the main point of contact for their assigned client(s), and being familiar with each clients' needs and preferences.<br/><br/>The paralegal must have consistent and proactive communication with clients and the Account Supervisors. Paralegals are expected to be available for clients during business hours as agreed upon with each client, but around-the-clock availability is not expected. Paralegals ensure time is entered on a daily basis using a provided tool, respond to all communication within a mutually established response time expectation tailored to each client's needs, maintain detailed and up-to-date client profiles, and follow Zirtual's best practices for success.", "qualifications": {"required": "Minimum 3+ years of experience handling ARIZONA PROBATE AND ESTATE LITIGATION paralegal work as outlined above, Experience working remotely preferred, Home office set up, reliable computer, WiFi, phone, Extensive experience within case/transaction management and drafting softwares (practice area dependent), Experience with standard office softwares, Microsoft 365 products, Google, etc., Available during business hours Monday-Friday, unless otherwise arranged based on specific client needs and tasks., Preferred working independently at least part-time", "preferred": ""}, "skills": ["Probate", "Estate Litigation", "Legal Research", "Document Drafting", "Client Liaison", "Case Management", "Discovery", "Trial Preparation", "File Management", "Organizational Support", "eFiling", "Client Relationship Management", "Email Management", "Calendar Management", "Meeting Coordination", "Remote Work"], "postedDate": "2 weeks ago", "benefits": "You will be compensated as a 1099 independent contractor., $30 per hour", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4007150789"}