{"jobTitle": "Regional Merchandising Manager - West Coast", "company": {"name": "Louis Vuitton", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "USD $115,000 - $130,000", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Retail Apparel and Fashion, Retail Luxury Goods and Jewelry, and Retail", "description": "As a Louis Vuitton Regional Merchandising Manager - West Coast you will drive Merchandising support for the West Coast region.<br/><br/>In this position you will lead and support the West Coast, in partnership with the Regional Merchandising Director - West Coast to build growth in sell through for our exceptional categories, known as Les Extraordinaire. Serving as a key business partner, reporting directly to the Regional Merchandising Director will devise and execute the merchandising strategy, identify opportunities to maximize sales and achieve financial targets in addition to leading key projects and business priorities while also contributing to the overall Louis Vuitton Americas Merchandising strategy.<br/><br/>Key responsibilities will support, motivate and challenge our sales teams. This is accomplished through a close partnership between regional, store and corporate teams, implementation of impactful store actions, and training and support throughout the year. In addition, the role will support and animate special projects within the Region, ensuring sales performance is achieved.<br/><br/>Profile<br/><br/>As a Louis Vuitton Regional Merchandising Manager, you will be an ambassador of the Brand. The Regional Merchandiser is responsible for executing IVA's product priorities and merchandising strategy for each category, tailoring to the stores in their region. Primary functions include leading product initiatives and launches, ensuring all stakeholders deliver on expectations; setting targets, analyzing sales at region and store level and proposing results-oriented actions to achieve objectives liaising with corporate merch and stores, sharing regular product feedback and market opportunities while streamlining information to ensure impact.<br/><br/>Business Driver<br/><br/><ul><li>Collaborates with Regional Merchandising Director to discern strategic action plans, aiming to optimize opportunities, prioritize sell-through, and mitigate risks.</li><li>Monitors progress to business goals by category, highlighting major misses, building TY vs LY through thoughtful calendar management.</li><li>Improves regional business acumen by identifying and training on impactful drivers of business performance, ultimately fostering top-line growth.</li><li>Fosters the growth of Expert Client Advisor community and assists in strengthening their impact in driving their category.<br/><br/></li></ul>Corporate Merchandising Support<br/><br/><ul><li>Supports successful product launches and plans/executes focused events throughout the year.</li><li>Oversees and channels product and business feedback to the Merchandising, encompassing insights on new launches, product assortment, and store feedback throughout the region.</li><li>Actively participates on all scheduled meetings both with Merchandising and Supply Chain providing valuable input to topics raised and recapping and sharing action plans.</li><li>Leads action on key corporate directives within the region and oversees the effective responses to corporate teams. (i.e conversion of order broker/products under reservation).<br/><br/></li></ul>In-store Animation<br/><br/><ul><li>Leads and executes Merchandising support of Les Extraordinaire In-Store animations: negotiates product support in partnership with Merchandising team, creation of look books, management of sales tracker, communication on inventory status with teams)</li><li>Coordinates metro kick-offs/special projects focused on key topics (ex: Exotics Boost, Watches and Jewelry showcase)</li><li>Ensures regular in-store visits to consistently communicate and update on all ongoing product launches and initiatives across all store locations.</li><li>Collaborates closely with Merchandising and Retail Learning team to provide essential support for product knowledge training as needed.<br/><br/></li></ul>Regional Merchandising Support<br/><br/><ul><li>Act as liaison between stores, Merchandising, Supply Chain and other key functional regional partners ensuring a close collaborative relationship with all stakeholders. (including VM, Operations, Client Relations/Event and Client Development).</li><li>Supports daily store requests through partnerships with relevant teams. (i.e product related questions: availability, sourcing, order broker)</li><li>Aggregates and elevates Supply Chain opportunities related to stock levels, pull backs (both ongoing and during holidays), event support, and peak selling periods during high-traffic moments.<br/><br/></li></ul><em>The appointed candidate will be offered an annual rate within the range of USD $115,000 - $130,000 plus the opportunity for commission, various paid time off programs*, two retirement plans both with employer contributions*, and employee discount/perks. *pending hours worked.<br/><br/></em>Additional information<br/><br/>Louis Vuitton is a company that respects the uniqueness of each employee and offers everyone the means to find their place and prosper. We promote initiatives aimed at supporting professional equality for everyone. We strive to go above and beyond purely symbolic measures by building a culture passionate about meaningful strategies aimed at crafting an inclusive workforce.<br/><br/>In addition to a generous benefits package, and unparalleled career development opportunities, both locally &amp; globally, as an employee at Louis Vuitton, you can expect to be provided with industry-leading training which will offer you an in-depth insight into the luxury and retail environment.<br/><br/>Please see our Privacy Policy for information on the personal information we collect from job applicants, how we use it, and your rights with respect to this information.<br/><br/>We will consider for employment all qualified Applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.<br/><br/>Reference LVM24556", "postedDate": "1 day ago", "benefits": "The appointed candidate will be offered an annual rate within the range of USD $115,000 - $130,000 plus the opportunity for commission, various paid time off programs*, two retirement plans both with employer contributions*, and employee discount/perks. *pending hours worked.", "skills": ["Merchandising", "Sales", "Business Development", "Retail", "Luxury Goods", "Fashion", "Product Management", "Inventory Management", "Supply Chain Management", "Training", "Communication", "Leadership", "Teamwork", "Analysis", "Strategy"], "url": "https://www.linkedin.com/jobs/view/4007023944"}