{"jobTitle": "Interior Designer *REMOTE", "company": {"name": "Aston Carter", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Staffing and Recruiting", "description": "We are actively hiring multiple REMOTE Interior Design Specialists with a background in photoshop/photo editing/ or video editing for one of the largest eCommerce companies headquartered in Seattle, WA. Role will be 100% remote!<br/><br/><strong>About the role:<br/><br/></strong><strong>Location: </strong>100% remote but candidates must reside within the U.S.<br/><br/><strong>Schedule: </strong>Monday-Friday, full 40 hour work week, 8:30am-5pm in your time zone (PST, MST, CST, EST)<br/><br/><strong>Training Schedule: </strong>First 4 weeks candidates must be able to work Monday-Friday 8:30am-5pm PST<br/><br/><strong>Post Training Schedule: </strong>Monday-Friday, full 40 hour work week, 8:30am-5pm in your time zone (PST, MST, CST, EST)<br/><br/><strong>Start date: </strong>September 23rd 2024<br/><br/><strong>Duration: </strong>10 month contract position with potential for extension or conversion based off of performance.<br/><br/><strong>Compensation:</strong> Pay: $25/hr<br/><br/>We are guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. We like audacious goals and look for team members who are passionate about reaching and exceeding them by continuously raising the bar for what it means to offer our customers the best shopping experience in the world. The Home Design Team is seeking an action-oriented and analytical Catalog Specialist with experience in interior design and/or photo and video editing to help us build next-generation shopping experiences powered by Generative AI technology. This forward-looking initiative is an opportunity to leverage design expertise while working closely with product and technology teams to create and audit visual assets at scale. The Catalog Specialist on the Home Design Team has hands-on experience in a design-related field and knows how to apply a high visual quality bar without sacrificing customer experience, trust or operational efficiencies. You are highly analytical, able to work effectively in a matrix organization, and are adept at using a variety of design, project management, and communication technologies.<br/><br/><strong>SERVICES TO BE PERFORMED<br/><br/></strong><ul><li>Be the voice of high-quality interior design, photography, and videography within the Home Design Team, and other collaborating teams.</li><li>Assist with Home Innovation Team’s style and design annotation and auditing efforts.</li><li>Support Data Scientists with style algorithm development. </li><li>Perform a high volume of critical tasks while staying consistent with quality output.</li><li>Stay self-organized and report progress in a timely manner. </li><li>Learn from internal customer feedback and trends to ensure we are appropriately evolving style definitions and classification processes over time. </li><li>Work with Product and Tech teams to develop new customer experiences. </li><li>Communicate effectively with high level project stakeholders.</li><li>Assist with auditing photos and videos for certain types of errors/imperfections, and writing captions for images.<br/><br/></li></ul><strong>Required Skills<br/><br/></strong><ul><li>2+ years of recent experience within interior design, retail furniture design, visual merchandising, etc.</li><li>Knowledgeable of interior design</li><li>MUST have experience with photography/videography/video editing/ or photo editing</li><li>MUST have experience with Photoshop</li><li>MUST have a Bachelor's degree</li><li>Proven track record of developing high quality interior design rooms and renders (portfolio)</li><li>MUST have a portfolio to be considered for this role</li><li>Ability to learn new technical skills to design and visualize interior spaces.</li><li>Strong analytical skills and the ability to deep dive on complex problems</li><li>Ability to manage multiple simultaneous projects requiring frequent communication, organization/time management and problem-solving skills<br/><br/></li></ul><strong>Preferred Skills<br/><br/></strong><ul><li>2+ years of experience annotating furniture pieces</li><li>Track record of cross-functional team leadership and ability to influence</li><li>Experience working with customers for residential design projects</li><li>Actively follow trends, news, social media and influencers in, and affecting, interior design </li><li>Knowledge of project management methodology, including the ability to identify and resolve issues, manage risk and allocate resources</li><li>Ability to deal with ambiguous problems and build solutions with proper project management</li><li>Aptitude for being organized with flexibility and for delivering results in a fast-paced environment<br/><br/></li></ul><em>We reserve the right to pay above or below the posted wage based on factors unrelated to sex, race, or any other protected classification.<br/><br/></em><em>Eligibility requirements apply to some benefits and may depend on your job classification and length of employment. Benefits are subject to change and may be subject to specific elections, plan, or program terms. This temporary role may be eligible for the following: <br/><br/></em><ul><li> Medical, dental &amp; vision </li><li> 401(k)/Roth</li><li> Insurance (Basic/Supplemental Life &amp; AD&amp;D) </li><li> Short and long-term disability </li><li> Health &amp; Dependent Care Spending Accounts (HSA &amp; DCFSA) </li><li> Transportation benefits </li><li> Employee Assistance Program </li><li> Time Off/Leave (PTO, Vacation or Sick Leave<br/><br/></li></ul>About Aston Carter:<br/><br/>Aston Carter provides world-class corporate talent solutions to thousands of clients across the globe. Specialized in accounting, finance, human resources, talent acquisition, procurement, supply chain and select administrative professions, we extend the capabilities of industry-leading companies. We draw on our deep recruiting expertise and expansive network to meet the evolving needs of our clients and talent community with agility and excellence. With offices across the U.S., Canada, Asia Pacific and Europe, Aston Carter serves many of the Fortune 500. We are proud to be a ClearlyRated Best of Staffing® double diamond winner for both client and talent service.<br/><br/>Diversity, Equity &amp; Inclusion<br/><br/>At Aston Carter, diversity and inclusion are a bridge towards the equity and success of our people. DE&amp;I are embedded into our culture through:<br/><br/><ul><li>Hiring diverse talent</li><li>Maintaining an inclusive environment through persistent self-reflection</li><li>Building a culture of care, engagement, and recognition with clear outcomes</li><li>Ensuring growth opportunities for our people<br/><br/></li></ul>The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.<br/><br/>If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email astoncarteraccommodation@astoncarter.com for other accommodation options.", "responsibilities": "Be the voice of high-quality interior design, photography, and videography within the Home Design Team, and other collaborating teams. Assist with Home Innovation Team’s style and design annotation and auditing efforts. Support Data Scientists with style algorithm development. Perform a high volume of critical tasks while staying consistent with quality output. Stay self-organized and report progress in a timely manner. Learn from internal customer feedback and trends to ensure we are appropriately evolving style definitions and classification processes over time. Work with Product and Tech teams to develop new customer experiences. Communicate effectively with high level project stakeholders. Assist with auditing photos and videos for certain types of errors/imperfections, and writing captions for images.", "qualifications": {"required": "2+ years of recent experience within interior design, retail furniture design, visual merchandising, etc. Knowledgeable of interior design MUST have experience with photography/videography/video editing/ or photo editing MUST have experience with Photoshop MUST have a Bachelor's degree Proven track record of developing high quality interior design rooms and renders (portfolio) MUST have a portfolio to be considered for this role Ability to learn new technical skills to design and visualize interior spaces. Strong analytical skills and the ability to deep dive on complex problems Ability to manage multiple simultaneous projects requiring frequent communication, organization/time management and problem-solving skills", "preferred": "2+ years of experience annotating furniture pieces Track record of cross-functional team leadership and ability to influence Experience working with customers for residential design projects Actively follow trends, news, social media and influencers in, and affecting, interior design Knowledge of project management methodology, including the ability to identify and resolve issues, manage risk and allocate resources Ability to deal with ambiguous problems and build solutions with proper project management Aptitude for being organized with flexibility and for delivering results in a fast-paced environment"}, "skills": ["Interior Design", "Photoshop", "Photo Editing", "Video Editing", "Photography", "Visual Merchandising", "Retail Furniture Design", "Project Management", "Communication", "Problem Solving", "Analytical Skills"], "postedDate": "1 day ago", "benefits": "Medical, dental & vision 401(k)/Roth Insurance (Basic/Supplemental Life & AD&D) Short and long-term disability Health & Dependent Care Spending Accounts (HSA & DCFSA) Transportation benefits Employee Assistance Program Time Off/Leave (PTO, Vacation or Sick Leave", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4007392325"}