{"jobTitle": "B2B Sales Executive - Southwest Los Angeles", "company": {"name": "City Wide Facility Solutions", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales", "industry": "Facilities Services", "description": "City Wide Facility Solutions Southwest Los Angeles is seeking a tenacious closer to join our Sales Team! If you aggressively prospect for business, sell with confidence and integrity, and have a deep understanding of your clients' needs, we'd love to have you join our team.<br/>\n<br/>\nAs a Sales Executive, you will be responsible for new business development in a highly productive, sales-driven environment. You will be responsible for the full sales cycle, from lead generation to close.  Working closely with account managers and your sales team, you will establish and nurture mutually profitable business relationships with clients.<br/>\n<br/>\nIn this position you will:<br/>\n<ul> <li>Identify and qualify potential clients by making proactive cold calls (phone, email, and foot canvassing) to generate appointments.</li> <li>Manage the sales process by scheduling appointments, understand account requirements, and creating customized sales proposals based on specific client needs.</li> <li>Closes sales by building rapport with potential clients / decision makers, selling our unique value proposition and overcoming objections.</li> <li>Conduct a minimum of 25 hours prospecting each week.</li> <li>Utilize and manage our customer relationship management system (CRM) to maintain all customer information, including call activity and notes, client information, and appointment information.</li> <li>Establish relationships with property managers and key industry association members to develop a large pipeline.</li> <li>Maintain a positive work atmosphere by behaving and communicating in a manner so that you get along with Clients, co-workers, and supervisors.</li> </ul><br/>\n<br/>\nCompensation package includes base salary, quarterly bonus, and uncapped commission structure.  If you are on the right track, on target earnings should exceed $120K.<br/>\n<br/>\n<br/>\n<strong>Requirements<br/>\n<br/>\n</strong><ul> <li>3+ years outside B2B sales experience, prefer most recent job experience in outside sales</li> <li>Demonstrated track record of success (e.g. two calendar years of meeting sales quotas)</li> <li>Strong skill set for prospecting and developing a territory</li> <li>Proficiency in CRM systems, including strong organization of key sales data</li> <li>Prior sales training certificate, e.g., Sandler, President's Club, Dale Carnegie, etc., preferred</li> <li>Experience closing short-cycle B2B sales</li> <li>Outgoing, dynamic personality, self-motivated with result-driven approach</li> <li>Can-do attitude that loves to be challenged</li> <li>Organized within a defined sales process with an ability to move clients from prospect to close</li> <li>An excellent communicator with the ability to facilitate a presentation or a one-to-one meeting</li> <li>Demonstrated ability to coordinate team activities and work effectively with operations and marketing teams</li> <li>Strong communication and presentation skills</li> <li>Strong MS Office (Word, Powerpoint, Excel)</li> <br/>\n<br/>\n</ul><strong>Benefits<br/>\n<br/>\n</strong><ul> <li>Base salary + quarterly bonus + uncapped commissions</li> <li>Paid Training</li> <li>Car Allowance</li> <li>Phone Allowance</li> <li>Short &amp; Long Term Disability</li> <li>Dental &amp; Vision options</li> <li>Life Insurance</li> <li>Health Insurance</li> <li>Paid Vacation Accrual</li></ul>", "responsibilities": "As a Sales Executive, you will be responsible for new business development in a highly productive, sales-driven environment. You will be responsible for the full sales cycle, from lead generation to close.  Working closely with account managers and your sales team, you will establish and nurture mutually profitable business relationships with clients.", "qualifications": {"required": "3+ years outside B2B sales experience, prefer most recent job experience in outside sales, Demonstrated track record of success (e.g. two calendar years of meeting sales quotas), Strong skill set for prospecting and developing a territory, Proficiency in CRM systems, including strong organization of key sales data, Prior sales training certificate, e.g., Sandler, President's Club, Dale Carnegie, etc., preferred, Experience closing short-cycle B2B sales, Outgoing, dynamic personality, self-motivated with result-driven approach, Can-do attitude that loves to be challenged, Organized within a defined sales process with an ability to move clients from prospect to close, An excellent communicator with the ability to facilitate a presentation or a one-to-one meeting, Demonstrated ability to coordinate team activities and work effectively with operations and marketing teams, Strong communication and presentation skills, Strong MS Office (Word, Powerpoint, Excel)", "preferred": "Prior sales training certificate, e.g., Sandler, President's Club, Dale Carnegie, etc."}, "skills": ["CRM", "Sales", "Prospecting", "Business Development", "Sales Management", "Customer Relationship Management", "Cold Calling", "Sales Process", "Presentation Skills", "Communication Skills", "Microsoft Office", "Microsoft Excel", "Microsoft Word", "Microsoft PowerPoint"], "postedDate": "4 days ago", "benefits": "Base salary + quarterly bonus + uncapped commissions, Paid Training, Car Allowance, Phone Allowance, Short & Long Term Disability, Dental & Vision options, Life Insurance, Health Insurance, Paid Vacation Accrual", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007152944"}