{"jobTitle": "Sales Assistant - LA", "company": {"name": "Steve Madden", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "24/hr- 26/hr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "This Position is based in LA*<br/><br/><strong>Title:</strong> Sales Assistant<br/><br/><strong>General Summary</strong><strong>:</strong> Steve Madden Apparel Division is looking for a highly motivated Sales Assistant to join our Los Angeles sales team! The Sales Assistant supports the execution of strategies set by their manager by performing general sales activities in order to maximize sales and margins, support and promote the brand and maintain optimal relationships with customers as well as internal partners. This role also requires superior organizational skills and excellent communication skills. Must be team oriented and outgoing. We are looking for someone who is eager to learn has the ability to multi-task, meet deadlines, is highly detail oriented and meticulous. Excel expert preferred!<br/><br/><strong>Major Responsibilities<br/><br/></strong><ul><li>Assist the sales team in managing accounts and relationships with accounts.</li><li>Coordinate sales activities and maintain sales calendars and schedules.</li><li>Prepare and process sales orders and contracts accurately and promptly.</li><li>Generate and distribute sales reports, presentations, and proposals as needed.</li><li>Communicate effectively with customers regarding inquiries, orders, and shipment statuses.</li><li>Collaborate with internal departments such as logistics, finance, and marketing to ensure seamless execution of sales initiatives.</li><li>Assist in the organization and coordination of sales meetings, markets and tradeshows.</li><li>Monitor industry trends and competitor activities to identify potential business opportunities.</li><li>Responsible for keeping showroom organized and samples accounted for.<br/><br/></li></ul><strong>Skills<br/><br/></strong><ul><li>Strong organizational skills with the ability to multitask and prioritize effectively.</li><li>Excellent communication skills, both verbal and written.</li><li>Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook) and CRM software.</li><li>Detail-oriented with a high level of accuracy in data entry and record-keeping.</li><li>Ability to work collaboratively in a team environment and independently when necessary.</li><li>Proactive problem-solving skills and a positive, can-do attitude.</li><li>Knowledge of the apparel or fashion industry is a plus.<br/><br/></li></ul><strong>Education, Licenses, Certificates, Registrations And/or Experience<br/><br/></strong><ul><li>Bachelor’s degree in Business Administration, Marketing, or a related field preferred.</li><li>Previous experience in a sales support role or similar capacity preferred.<br/><br/></li></ul><em>Salary Range: The pay range of this position is $24/hr- 26/hr. Actual salary will be determined based off candidate’s skill sets, years of experience, and other job-related factors. This range does not include benefits such as health insurance, paid time off, 401K, and additional company benefits</em>", "responsibilities": "Assist the sales team in managing accounts and relationships with accounts. Coordinate sales activities and maintain sales calendars and schedules. Prepare and process sales orders and contracts accurately and promptly. Generate and distribute sales reports, presentations, and proposals as needed. Communicate effectively with customers regarding inquiries, orders, and shipment statuses. Collaborate with internal departments such as logistics, finance, and marketing to ensure seamless execution of sales initiatives. Assist in the organization and coordination of sales meetings, markets and tradeshows. Monitor industry trends and competitor activities to identify potential business opportunities. Responsible for keeping showroom organized and samples accounted for.", "qualifications": {"preferred": "Bachelor’s degree in Business Administration, Marketing, or a related field preferred. Previous experience in a sales support role or similar capacity preferred.", "required": "Strong organizational skills with the ability to multitask and prioritize effectively. Excellent communication skills, both verbal and written. Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook) and CRM software. Detail-oriented with a high level of accuracy in data entry and record-keeping. Ability to work collaboratively in a team environment and independently when necessary. Proactive problem-solving skills and a positive, can-do attitude. Knowledge of the apparel or fashion industry is a plus."}, "skills": ["Microsoft Office", "CRM", "Sales", "Communication", "Organization", "Customer Service", "Teamwork", "Problem Solving", "Detail Oriented", "Fashion", "Apparel"], "postedDate": "1 day ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007107200"}