{"jobTitle": "Merchant - Active/Swim", "company": {"name": "Forever 21", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": "Forever 21 has been a leader in the global fast fashion market since its humble beginnings in Downtown LA. Today we operate 350+ stores across the USA and a robust e-commerce platform. Forever 21 is a powerhouse. Our mission is to inspire individual self-expression through amazing fashion and our DNA is rooted in Inclusivity, Customer-Centricity, and Accessibility.<br/><br/>With a renewed focus on the customer experience, we offer high-style designs and fashion basics with compelling values and a dynamic store environment. Whether we’re collaborating with your favorite brands, and influencers or setting trends - we are always striving to make Forever 21 your go-to fashion destination to shop, work, and play!<br/><br/>Join us – <strong>tomorrow is yours to define… Forever!<br/><br/></strong>Under the general direction of the Sr. Buyer, Buying Manager or DMM the Buyer will use discretion and independent judgement in developing and/or procuring merchandise assortments for main assigned portion(s) of the business. The Buyer will work to create the appropriate merchandise mix based on emerging market trends, along with meeting the assortment strategies established by management.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Create and execute a merchandise assortment plan that supports the financial and merchandising objectives set by senior management </li><li> Participate in weekly open-to-buy meetings with Planning &amp; Allocation and provide technical feedback and analysis to ensure the department achieves financial targets for turn and sell-through goals </li><li> Participate in fittings to evaluate the hanger appeal of a garment, making sure that it is salable </li><li> Negotiate product quality, purchase quantity, landed cost, and delivery with vendors </li><li> Conduct the initial garment selection, recommending to management the colors, trims, and fabric that work best with the garment </li><li> Coordinate with cross-functional partners such as Production, Design, and Trend &amp;Print in order to make sure designs are adoptable, costs are measured, and concepts are clearly defined </li><li> Review weekly sales performance to identify potential re-order opportunities and recommend styles that require markdowns </li><li> Perform continuous competitor and market analysis by researching various mediums for emerging trends in color, materials, and categories, in addition to price points and promotional campaigns from competitors </li><li> Analyze selling and inventory reports on a weekly basis in order to maintain a solid understanding of the business <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Must have a BFA or related degree </li><li> Must have 3-5 years of buying experience in a specialty retail environment </li><li> Proven track record of success as an Apparel or Non-Apparel buyer (depending on category opening) </li><li> Must possess the ability to understand and act upon financial retail indicators such as sales, gross margin, inventory productivity, sell-through and turn </li><li> Must be able to effectively communicate with Management and subordinates <br/><br/></li></ul><strong> Why we think you’ll love it here… <br/><br/></strong>At Forever 21, we foster an inclusive culture where everyone feels they belong. In addition to our comprehensive benefits package which you can find at https://sparcbenefits.com/Candidate-Benefits-Highlights , you will unlock competitive Paid Time Off for personal, sick, and vacation time each year, enjoy most national holidays (paid), enjoy a flexible work schedule with our current hybrid policy for most corporate roles, free onsite parking and gym access in DTLA as well as eligibility to participate in our annual bonus incentive program to name a few.<br/><br/><strong>We Actively Encourage Our Current And Future Employees To<br/><br/></strong><strong> Unleash your style - </strong> w here your self-expression and creativity inspire others. Employees can take advantage of our relaxed corporate dress code showing up in a way that makes them feel comfortable, stylish, and unique!<br/><br/><strong> Embrace your individuality – </strong> we v alue the diverse perspectives, talents, and backgrounds that make each person one-of-a-kind. We celebrate what makes you exceptional!<br/><br/><strong> Own your Journey- </strong> Where p ersonal &amp; professional growth goes hand in hand. Embrace your journey, learn, adapt, and make a lasting impact. At Forever 21, you will have the opportunity to grow your retail career from stores to corporate and across our portfolio of brands under our parent, Sparc Group LLC!<br/><br/><strong>Additional Data<br/><br/></strong>The salary range for this position is $80,000 - $95,000 annually. Pay is based on several factors including but not limited to position offered and work experience. In addition to your salary, Forever 21, and its affiliated brands, offers a benefits package, including 401(k) plan, overtime pay, flexible work schedule and a generous employee discount program (all benefits are based on eligibility). Additional information regarding the benefits for this position can be found at https://sparcbenefits.com/Candidate-Benefits-Highlights.<br/><br/>SPARC Group LLC is an equal-opportunity employer. We value a culture of inclusion and diversity within our workforce, and are committed to maintaining a workplace free from prohibited employment conduct, including discrimination or harassment on the basis of race, color, national origin, sex, age, religion, disability, genetic information, sexual orientation, gender identity or expression, marital status, domestic partner status, civil partnership, status as a covered veteran, status in the Uniformed Services of the United States, citizenship and any other characteristic protected by law. We are also committed to the full inclusion of qualified individuals in the job application and interview process.<br/><br/>Employees are expected to perform the essential functions of the position satisfactorily. In accordance with the Americans with Disabilities Act (ADA), the Americans with Disabilities Act Amendments Act (ADAAA), and applicable state disability laws, it is the policy of SPARC to provide a reasonable accommodation when requested by a qualified applicant or employee with a disability unless such accommodation would cause an undue hardship. If a reasonable accommodation is required to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please contact our Human Resources department.", "responsibilities": "Under the general direction of the Sr. Buyer, Buying Manager or DMM the Buyer will use discretion and independent judgement in developing and/or procuring merchandise assortments for main assigned portion(s) of the business. The Buyer will work to create the appropriate merchandise mix based on emerging market trends, along with meeting the assortment strategies established by management.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Create and execute a merchandise assortment plan that supports the financial and merchandising objectives set by senior management </li><li> Participate in weekly open-to-buy meetings with Planning &amp; Allocation and provide technical feedback and analysis to ensure the department achieves financial targets for turn and sell-through goals </li><li> Participate in fittings to evaluate the hanger appeal of a garment, making sure that it is salable </li><li> Negotiate product quality, purchase quantity, landed cost, and delivery with vendors </li><li> Conduct the initial garment selection, recommending to management the colors, trims, and fabric that work best with the garment </li><li> Coordinate with cross-functional partners such as Production, Design, and Trend &amp;Print in order to make sure designs are adoptable, costs are measured, and concepts are clearly defined </li><li> Review weekly sales performance to identify potential re-order opportunities and recommend styles that require markdowns </li><li> Perform continuous competitor and market analysis by researching various mediums for emerging trends in color, materials, and categories, in addition to price points and promotional campaigns from competitors </li><li> Analyze selling and inventory reports on a weekly basis in order to maintain a solid understanding of the business <br/><br/></li></ul>", "qualifications": {"required": "Must have a BFA or related degree\nMust have 3-5 years of buying experience in a specialty retail environment\nProven track record of success as an Apparel or Non-Apparel buyer (depending on category opening)\nMust possess the ability to understand and act upon financial retail indicators such as sales, gross margin, inventory productivity, sell-through and turn\nMust be able to effectively communicate with Management and subordinates <br/><br/>", "preferred": ""}, "skills": [], "postedDate": "1 day ago", "benefits": "At Forever 21, we foster an inclusive culture where everyone feels they belong. In addition to our comprehensive benefits package which you can find at https://sparcbenefits.com/Candidate-Benefits-Highlights , you will unlock competitive Paid Time Off for personal, sick, and vacation time each year, enjoy most national holidays (paid), enjoy a flexible work schedule with our current hybrid policy for most corporate roles, free onsite parking and gym access in DTLA as well as eligibility to participate in our annual bonus incentive program to name a few.<br/><br/><strong>We Actively Encourage Our Current And Future Employees To<br/><br/></strong><strong> Unleash your style - </strong> w here your self-expression and creativity inspire others. Employees can take advantage of our relaxed corporate dress code showing up in a way that makes them feel comfortable, stylish, and unique!<br/><br/><strong> Embrace your individuality – </strong> we v alue the diverse perspectives, talents, and backgrounds that make each person one-of-a-kind. We celebrate what makes you exceptional!<br/><br/><strong> Own your Journey- </strong> Where p ersonal &amp; professional growth goes hand in hand. Embrace your journey, learn, adapt, and make a lasting impact. At Forever 21, you will have the opportunity to grow your retail career from stores to corporate and across our portfolio of brands under our parent, Sparc Group LLC!<br/><br/><strong>Additional Data<br/><br/></strong>The salary range for this position is $80,000 - $95,000 annually. Pay is based on several factors including but not limited to position offered and work experience. In addition to your salary, Forever 21, and its affiliated brands, offers a benefits package, including 401(k) plan, overtime pay, flexible work schedule and a generous employee discount program (all benefits are based on eligibility). Additional information regarding the benefits for this position can be found at https://sparcbenefits.com/Candidate-Benefits-Highlights.", "remoteWork": "No", "salary": {"amount": "$80,000 - $95,000", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4007111312"}