{"jobTitle": "Digital Sales Consultant", "company": {"name": "Sureguard Financial", "industry": "Internet Publishing", "size": "Not specified", "location": "Lakewood, CA"}, "location": "Lakewood, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Chart Your Success Path with Our Elite Sales Team! Recognized for our exceptional workplace culture by Entrepreneur Magazine and highly rated on Glassdoor and Indeed, we've also been spotlighted in Forbes and consistently ranked among the Inc. 5000 fastest-growing companies. Why Choose Our Team? Flexible Workweek: Enjoy a condensed 3-4 day schedule designed for work-life harmony Robust Training: Access our interactive online training platform and ongoing support, provided at no cost Exclusive Lead Generation: Focus solely on warm leads with no cold calling involved Daily Commission Payouts: Experience quick commission payments in this commission-only role Advanced Technology: Utilize cutting-edge tools to streamline the sales process Continuous Mentorship: Receive ongoing guidance from experienced business partners Global Rewards: Qualify for annual all-expenses-paid incentive trips to exciting global destinations Responsibilities: Under mentorship and as part of our collaborative team: Respond to inbound inquiries nationwide regarding various insurance products. Conduct qualifying calls, schedule virtual meetings, and deliver tailored solutions using our proprietary tools. We seek individuals who embody: Integrity: Uphold ethical standards in all interactions Commitment: Demonstrate a strong work ethic and dedication to personal growth Coachability: Embrace feedback and opportunities for professional development If you're a motivated professional seeking growth and recognition, apply with your resume today. Disclaimer: This position is a 1099 independent contractor commission-based role.", "responsibilities": "Respond to inbound inquiries nationwide regarding various insurance products. Conduct qualifying calls, schedule virtual meetings, and deliver tailored solutions using our proprietary tools.", "qualifications": {"required": "Not specified", "preferred": "Not specified"}, "skills": [], "postedDate": "2 days ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/4007512917"}