{"jobTitle": "Recruiting Coordinator", "company": {"name": "Genies", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Human Resources", "industry": "Technology, Information and Internet", "description": "Genies is culture's avatar technology company empowering developers, brands, and artists to create their own interoperable gamified consumer experiences. The company has raised $250 million from investors including Silver Lake, BOND, NEA, and Bob Iger. Initially, Genies were adopted by thousands of Hollywood icons including Justin Bieber and Rihanna through partnerships with Universal Music Group and Warner Music Group. Today, the company is also delivering avatars to the masses through experiences built with its Developer Kit and artist crowdsourced platform, The Workshop. These experiences all integrate together to form one avatar social network, Genies Party.<br/><br/><strong>Genies is hiring a <strong>Talent Coordinator (Contractor)</strong> to support our recruiting efforts. Seated in our Los Angeles headquarters and reporting to the VP of Talent, this key addition's primary responsibility will be to manage the candidate coordination and experience process across all Genies opportunities.<br/><br/>Our ideal candidate is a master of process and organization. A fast paced and collaborative culture is one that you thrive in, and you have an affinity for creating structure and personal experiences. In addition to your coordination and candidate experience efforts, this Talent Coordinator role will also support Recruiting &amp; People/HR Operations from time to time.<br/><br/>If you are looking for a fun and challenging adventure, that will influence the future success of others, then Genies is your next home.<br/><br/><strong>What You'll Be Doing:</strong> <br/><br/><ul><li>Coordinate and streamline the recruiting process, including scheduling interviews, managing candidate communications, hosting onsite interviews, and maintaining the applicant tracking system - Greenhouse</li><li>Serve as the primary point of contact for all candidates engaged in the Genies interview process</li><li>Partner with Recruiting Team and Hiring Managers to create a customized candidate experience for each opportunity</li><li>Organize and manage recruiting resources and tools</li><ul><li>Experience with the following is a plus:</li><ul><li>LinkedIn Recruiter</li><li>Greenhouse</li><li>Docusign</li><li>Notion</li><li>Teamable</li><li>Slack</li></ul></ul><li>Support various administrative tasks as needed to help the San Mateo office run efficiently<br/></li></ul><strong>What You Should Have:<br/><br/></strong><ul><li>Bachelor's degree or equivalent experience in recruiting coordination, office management, or related fields</li><li>2+ years of experience in a similar role, ideally in a fast-paced, startup environment</li><li>Strong organizational skills with the ability to manage multiple tasks and priorities simultaneously</li><li>Excellent communication and interpersonal skills, with a passion for creating a welcoming experience</li><li>Proficiency in using recruiting tools and office management software</li><li>A proactive, ambitious, and creative approach to what you do<br/><br/></li></ul><strong>How Genies will support you<br/><br/></strong>Genies is a well-funded, growing start-up that cares deeply about each of our employees' growth and success. Our roles and their responsibilities are created with a breadth of scope that introduces each employee to exciting new challenges and opportunities that a growing start-up encounters. The actual base pay is dependent upon a number of factors, including: professional background, training, transferable skills, work experience, education, location, business and product needs, and market demand. The base pay range is subject to change and may be modified in the future. Full-time employees may also be eligible for equity compensation, in addition to a robust health, wellness, and benefits package.<br/><br/>Starting Salary Range: $40/hr - Minimum 40 hours a week<br/><br/><strong>Here's why you'll love working at Genies:<br/><br/></strong><ul><li>You'll work with a team that you'll be able to learn from and grow with, including support for your own professional development</li><li>You'll be at the helm of your own career, shaping it with your own innovative contributions to a nascent team and product with flexible hours and a work from home policy</li><li>You'll enjoy the culture and perks of a startup, with the stability of being well funded</li><li>Comprehensive health insurance for you and your family (Anthem + Kaiser Options Available), Dental and Vision Insurance</li><li>Competitive salaries for all full time employees</li><li>Unlimited paid time off, sick time, and paid company holidays, in addition to paid parental leave, bereavement leave, and jury duty leave for full-time employees</li><li>Health &amp; wellness support through programs such as monthly wellness reimbursement</li><li>Working in a brand new, bright, open-environment and fun office space - there's even a slide!<br/><br/></li></ul><strong>Genies is an equal opportunity employer committed to promoting an inclusive work environment free of discrimination and harassment. We value diversity, inclusion, and aim to provide a sense of belonging for everyone.</strong>", "responsibilities": "Coordinate and streamline the recruiting process, including scheduling interviews, managing candidate communications, hosting onsite interviews, and maintaining the applicant tracking system - Greenhouse\nServe as the primary point of contact for all candidates engaged in the Genies interview process\nPartner with Recruiting Team and Hiring Managers to create a customized candidate experience for each opportunity\nOrganize and manage recruiting resources and tools\nExperience with the following is a plus:\nLinkedIn Recruiter\nGreenhouse\nDocusign\nNotion\nTeamable\nSlack\nSupport various administrative tasks as needed to help the San Mateo office run efficiently", "qualifications": {"required": "Bachelor's degree or equivalent experience in recruiting coordination, office management, or related fields\n2+ years of experience in a similar role, ideally in a fast-paced, startup environment\nStrong organizational skills with the ability to manage multiple tasks and priorities simultaneously\nExcellent communication and interpersonal skills, with a passion for creating a welcoming experience\nProficiency in using recruiting tools and office management software\nA proactive, ambitious, and creative approach to what you do"}, "skills": ["Greenhouse", "LinkedIn Recruiter", "Docusign", "Notion", "Teamable", "Slack"], "postedDate": "1 day ago", "benefits": "Comprehensive health insurance for you and your family (Anthem + Kaiser Options Available), Dental and Vision Insurance\nCompetitive salaries for all full time employees\nUnlimited paid time off, sick time, and paid company holidays, in addition to paid parental leave, bereavement leave, and jury duty leave for full-time employees\nHealth & wellness support through programs such as monthly wellness reimbursement\nWorking in a brand new, bright, open-environment and fun office space - there's even a slide!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4007309781"}