{"jobTitle": "Associate, Creator Partnerships", "company": {"name": "Influential", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "50,000 - 60,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Technology, Information and Internet", "description": "Influential is a key leader in the Influencer Marketing space (and the LARGEST influencer marketing company in the world, by revenue). Trusted by over 60% of the Fortune 500, we connect our clients with a network of over 3 Million social media influencers.<br/><br/>We are looking for team members who are thrilled by the idea of playing an active role in shaping how companies engage with customers through TikTok, Instagram, Facebook, &amp; more. Our team is built of people from across the country who have already moved the needle in social media, influencer marketing, and various sectors of technology. Ready to join us?!<br/><br/><strong>What we offer:<br/><br/></strong><ul><li>Remote company - work from home!</li><li>Competitive compensation</li><li>Flexible time off with inclusive holiday benefits</li><li>Comprehensive medical, dental &amp; vision insurance for employees</li><li>Fully vested 401(k) matching</li><li>An awesome collaborative work culture, a diverse team, and more!<br/><br/></li></ul>Influential, is looking for an experienced and well-connected Associate, Creator Partnerships to join our Influencer Partnerships growing team. With a passion for all things social, this individual is responsible for sourcing and pitching influencers across our presale and post-sale campaign initiatives. The ideal candidate is a pop-culture aficionado who can turn the day's events and trends into actionable insights for clients. If you thrive in a fast-paced environment, have a passion for influencers, and love presenting, this is the role for you!<br/><br/>Influential is a key leader in the Influencer Marketing space (and the LARGEST influencer marketing company in the world, by revenue), and an exclusive Influencer Technology Partner of IBM Watson. Trusted by over 60% of the Fortune 500, we connect our clients with a network of over 3 Million social media influencers.<br/><br/>We are looking for team members who are thrilled by the idea of playing an active role in shaping how companies engage with customers through TikTok, Instagram, Facebook, &amp; more. Our team is built of people from across the country who have already moved the needle in social media, influencer marketing, and various sectors of technology. Ready to join us?!<br/><br/><strong>In general, on a typical day you will:<br/><br/></strong><ul><li>Own the influencer sourcing process and become our resident expert on Influential's proprietary and third-party sourcing technology tools</li><li>Strategically identify talent and influencers for campaigns in a way that maximizes ROI and hits brand/client KPIs</li><li>Leverage data and insights to successfully position recommended talent to clients</li><li>Continue to build relationships with talent and talent managers/agents in the industry; attend industry events and meetings to keep up with current trends of the influencer landscape</li><li>Expand our current pipeline of content creators, identifying the potential in new talent as well as handling established talent</li><li>Lead influencer discussion across relevant teams; effectively communicate influencer needs and recommendations between Account Management, Campaign Management, Creative, Media Strategy, and Sales<br/><br/></li></ul><strong>Being a Creator Partnerships Associate requires:<br/><br/></strong><ul><li>1+ years of experience sourcing and casting influencers in a fast-paced environment</li><li>Extensive knowledge of national and international markets (beyond NYC and/or LA)</li><li>Sourcing experience that extends beyond social; you're comfortable sourcing specialty talent including musicians, actors, business/tech, foodies, gamers, chefs, etc</li><li>Strong writing skills with the ability to compose client-facing collateral</li><li>You can navigate the nuances of a diverse portfolio of clients across Automotive, Beauty, CPG, Fashion, Gaming, Lifestyle, Tech, and TV/film</li><li>Deep knowledge of all major social platforms (Facebook, Instagram, Pinterest, TikTok, Snap, Twitter, YouTube) with relevant contacts from each platform</li><li>Ninja-like skills when it comes to time management, organization, and prioritization while working against tight client deadlines</li><li>An entrepreneurial spirit who also thinks outside their job responsibilities and can function effectively in a team environment or independently<br/><br/></li></ul><strong>Bonus points if:<br/><br/></strong><ul><li>You have experience at a startup</li><li>You get excited about new tech<br/><br/></li></ul><strong>Salary range:<br/><br/></strong>$50,000 - $60,000<br/><br/><strong>About Influential<br/><br/></strong>Influential is an AI-powered technology and is the largest influencer marketing company in the world, by revenue. Leveraging a network of over 3 Million social media influencers, Influential's platform powers seamless talent discovery, comprehensive brand safety, content creation, media, and measurement. Through strategic partnerships with first and third-party data providers, Influential enables exclusive targeting and measurement solutions, including both online and offline attribution, such as sales lift, TV tune-in lift, foot traffic, and eComm sales. Influential works with Fortune 500 brands, including McDonald's, NBA, General Mills, Ford, and every major studio. With offices in Los Angeles, NYC, and Las Vegas, Influential is a developer partner of IBM Watson, a strategic partner of WME and Oracle, and a Facebook and Instagram Marketing Partner. (www.influential.co)<br/><br/>Influential is an equal opportunity employer.<br/><br/>Privacy Notice for California Job Applicants", "responsibilities": "In general, on a typical day you will:<br/><br/>\n<ul><li>Own the influencer sourcing process and become our resident expert on Influential's proprietary and third-party sourcing technology tools</li><li>Strategically identify talent and influencers for campaigns in a way that maximizes ROI and hits brand/client KPIs</li><li>Leverage data and insights to successfully position recommended talent to clients</li><li>Continue to build relationships with talent and talent managers/agents in the industry; attend industry events and meetings to keep up with current trends of the influencer landscape</li><li>Expand our current pipeline of content creators, identifying the potential in new talent as well as handling established talent</li><li>Lead influencer discussion across relevant teams; effectively communicate influencer needs and recommendations between Account Management, Campaign Management, Creative, Media Strategy, and Sales<br/><br/></li></ul>", "qualifications": {"required": "1+ years of experience sourcing and casting influencers in a fast-paced environment, Extensive knowledge of national and international markets (beyond NYC and/or LA), Sourcing experience that extends beyond social; you're comfortable sourcing specialty talent including musicians, actors, business/tech, foodies, gamers, chefs, etc, Strong writing skills with the ability to compose client-facing collateral, You can navigate the nuances of a diverse portfolio of clients across Automotive, Beauty, CPG, Fashion, Gaming, Lifestyle, Tech, and TV/film, Deep knowledge of all major social platforms (Facebook, Instagram, Pinterest, TikTok, Snap, Twitter, YouTube) with relevant contacts from each platform, Ninja-like skills when it comes to time management, organization, and prioritization while working against tight client deadlines, An entrepreneurial spirit who also thinks outside their job responsibilities and can function effectively in a team environment or independently", "preferred": "You have experience at a startup, You get excited about new tech"}, "skills": ["Influencer Marketing", "Social Media", "TikTok", "Instagram", "Facebook", "Data Analysis", "ROI", "KPI", "Relationship Building", "Time Management", "Organization", "Prioritization", "Entrepreneurial Spirit", "Teamwork", "Startup Experience", "New Technology"], "postedDate": "2 days ago", "benefits": "Remote company - work from home!, Competitive compensation, Flexible time off with inclusive holiday benefits, Comprehensive medical, dental &amp; vision insurance for employees, Fully vested 401(k) matching, An awesome collaborative work culture, a diverse team, and more!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4007113089"}