{"jobTitle": "Planning & Scheduling Manager", "company": {"name": "Actalent", "location": "Fontana, CA"}, "location": "Fontana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Business Consulting and Services", "description": "Job Title: Planning & Scheduling Manager<br/><br/><strong>Job Description<br/><br/></strong><ul><li> Oversee the development, preparation, and maintenance of the company’s master project schedule and production. - Lead and develop a team of 3+ Production Planners/Schedulers. - Establish, measure, monitor, and adjust capacity levels to execute all manufacturing and engineering design schedules. - Determine job readiness in all areas, including engineering, material status, and production capacity, prior to starting a project in production. - Utilize ERP systems, planning and scheduling software, or other database tools to develop and maintain master schedules and production. - Interpret and follow written directions, blueprints, and engineering diagrams. - Establish KPIs and report on performance relative to the production plan. - Engage in capacity management during sales and operations planning, master scheduling, materials requirements planning, and production activity control.<br/><br/></li></ul>Hard Skills<br/><br/><ul><li>Bachelor's Degree in Engineering Discipline or Supply Chain</li><li>5 years experience in manufacturing environment</li><li>2 years experience in operations management, project management, or engineering<br/><br/></li></ul>Job Type<br/><br/>This is a permanent position.<br/><br/>Work Site<br/><br/>This is a fully on-site position in Fontana, California.<br/><br/>Work Environment<br/><br/>Manufacturing Sheet Metal fabrication shop<br/><br/><strong>About Actalent<br/><br/></strong>Actalent is a global leader in engineering and sciences services and talent solutions. We help visionary companies advance their engineering and science initiatives through access to specialized experts who drive scale, innovation and speed to market. With a network of almost 30,000 consultants and more than 4,500 clients across the U.S., Canada, Asia and Europe, Actalent serves many of the Fortune 500.<br/><br/>Diversity, Equity & Inclusion<br/><br/>At Actalent, diversity and inclusion are a bridge towards the equity and success of our people. DE&amp;I are embedded into our culture through:<br/><br/><ul><li>Hiring diverse talent</li><li>Maintaining an inclusive environment through persistent self-reflection</li><li>Building a culture of care, engagement, and recognition with clear outcomes</li><li>Ensuring growth opportunities for our people<br/><br/></li></ul>The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.<br/><br/>If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email actalentaccommodation@actalentservices.com for other accommodation options.", "postedDate": "1 day ago", "skills": ["ERP", "Master Scheduling", "Production Planning", "Capacity Management", "Materials Requirements Planning", "Production Activity Control", "Engineering", "Supply Chain", "Operations Management", "Project Management"], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007387777"}