{"jobTitle": "Receptionist - Faculty Practice Group", "company": {"name": "UCLA Health", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Hospitals and Health Care", "description": "<strong>Qualifications<br/><br/></strong>We’re seeking a collaborative individual with:<br/><br/><ul><li>Expertise in efficiently organizing and coordinating diverse information, materials, and personnel to maximize productivity and minimize duplication of efforts. </li><li>Proven ability to prioritize tasks effectively, especially under heavy workloads, tight deadlines, and competing demands, ensuring timely completion of all assignments. </li><li>Strong verbal communication skills, with the ability to speak clearly and professionally to groups or individuals, using appropriate vocabulary and grammar to convey information effectively. </li><li>Ability to maintain efficiency and focus even in environments with frequent interruptions. </li><li>Capacity to remain calm and composed in situations requiring conflict resolution. Required</li><li>Proficient in writing clear, grammatically correct business correspondence, such as memos and emails. </li><li>Establish and maintain organized filing systems. </li><li>Skill in using word processing software to prepare professional correspondence and documents. </li><li>Ability to establish and maintain cooperative working relationships with colleagues and work effectively as part of a team. </li><li>Ability to type correspondence, reports, and other written materials quickly and accurately. </li><li>Proficient in accurately entering data into Excel spreadsheets with speed and precision</li><li>Competence in using a 10-key calculator efficiently</li><li>Ability to modify and adapt office procedures to meet changing operational needs.</li></ul>", "postedDate": "2 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4007178236"}