{"jobTitle": "Merchandise Coordinator", "company": {"name": "Software Resources", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "23.00/hr - 31.00/hr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Staffing and Recruiting", "description": "Software Resources has an immediate job opportunity for a Merchandise Coordinator with a major corporation in Glendale, CA. This assignment is hybrid in the Glendale/Burbank area – current schedule: Mon-Thu is Onsite in Glendale, CA and Fridays are Remote.<br/><br/><strong>Duration</strong> : 6 month(s)<br/><br/><strong>Pay Rate: </strong> $23 – $31/hr DOE<br/><br/><strong>Must Haves:</strong> Ability to work independently and ask questions as needed with the ability to work in a fast paced environment.<br/><br/><strong>Description<br/><br/></strong>Consumer Products and Interactive Media is the business segment of The Company that brings our Company's stories and characters to life through innovative and engaging physical products and digital experiences across more than 100 categories, from toys and t-shirts, to apps, books and console games. This segment is home to world class teams of app and game developers, licensing and retail experts, a leading retail business, artists and storytellers, and technologists who inspire imaginations around the world.<br/><br/>As the Merchandise Coordinator, you will be responsible for providing operational support for the department, item set-up, purchase order creation and maintenance and delivery tracking of all orders. Manage incoming samples, including archiving and storage. Create assortment line sheets for both licensed and vertical product.<br/><br/><ul><li> Provide operational support for the department (placement grids, management and execution of the assortment and vendor base).</li><li> Responsible for maintaining the assigned department's range plan including item setup, updates and stage sets.</li><li> Purchase order creation, maintenance and delivery tracking of all orders in the company database system.</li><li> Responsible for daily promotional price change entries and departmental promotion activity.</li><li> Licensed vendor setup, PRRs, gather testing reports &amp; general vendor communication.</li><li> Maintain product flow documents to reflect stage set changes and process launch date changes.</li><li> Manage incoming samples, archiving and storage.</li><li> Create assortment line sheets.</li><li> Obtain images and copy points needed for website.</li><li> Coordinate and provide rework direction to Distribution Center for non-compliant or assorted sku orders (NCI).</li><li> Coordinate with the DC and inventory control to RTV (Return to Vendor) product as needed.</li><li> Troubleshoot to ensure assortment is buyable and published (guest services, production, site merch, copy, photo).</li><li> Maintain and update inventory chase log-weekly.</li><li> Track inventory levels on dropship skus to ensure merchandise is in stock with licensee.<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> Although this is an entry level role, they would like 3 plus years exp in a Coord role</li><li> Self-starter, motivated, proactive, dependable, flexible, detail oriented</li><li> Confident, but able to ask for assistance when uncertain</li><li> Display ability to multi-task, managing a variety of initiatives / issues simultaneously</li><li> Ability to project manage and capable of meeting deadlines and dealing with time constraints</li><li> Excellent organizational skills</li><li> Excellent interpersonal, solid written and verbal communication and presentation skills</li><li> Ability to build relationships, be flexible/adaptable, able to collaborate, influence and persuade</li><li> Possess strong analytical skills</li><li> Resourceful, innovative and responsive to change</li><li> Strong computer skills (Excel, Power Point, Word, Keynote)<br/><br/></li></ul><strong>Required Education<br/><br/></strong>Bachelor's Degree in a related field.<br/><br/><strong>Don't delay. Join the Software Resources team today!<br/><br/></strong>Software Resources specializes in connecting talented IT professionals with challenging job opportunities that transform jobs into careers.<br/><br/>To meet our clients' hiring needs, we continuously source talented IT Professionals with all levels of expertise and in all disciplines. We offer world class major medical, dental and vision benefits, 401(k) with match, short term disability, Life Insurance and AD&amp;D. You, our future employees, can make a tremendous difference to our company and our clients. Please apply to this job and experience the Software Resources difference. You can view all of our jobs at https://www.softwareresources.com/careers/<br/><br/><strong><em>ALERT</em></strong><em>: Spoofing Scam Advisory<br/><br/></em><em>Software Resources has been targeted by spoofing attacks. Scammers impersonating our employees may contact you with fake job offers, asking for personal information. Unfortunately, we cannot completely prevent these fraudulent activities.<br/><br/></em><strong><em>Stay Protected</em></strong><em>: Verify any communication claiming to be from Software Resources. For your safety, directly confirm the legitimacy of any job offer or inquiry by calling us at 407-515-6020. Do not respond to unsolicited requests without verification. <br/><br/></em><em>We value our integrity and urge you not to fall victim to these scams. Always verify by calling us directly at 407-515-6020.</em>", "responsibilities": "As the Merchandise Coordinator, you will be responsible for providing operational support for the department, item set-up, purchase order creation and maintenance and delivery tracking of all orders. Manage incoming samples, including archiving and storage. Create assortment line sheets for both licensed and vertical product.<br/><br/><ul><li> Provide operational support for the department (placement grids, management and execution of the assortment and vendor base).</li><li> Responsible for maintaining the assigned department's range plan including item setup, updates and stage sets.</li><li> Purchase order creation, maintenance and delivery tracking of all orders in the company database system.</li><li> Responsible for daily promotional price change entries and departmental promotion activity.</li><li> Licensed vendor setup, PRRs, gather testing reports &amp; general vendor communication.</li><li> Maintain product flow documents to reflect stage set changes and process launch date changes.</li><li> Manage incoming samples, archiving and storage.</li><li> Create assortment line sheets.</li><li> Obtain images and copy points needed for website.</li><li> Coordinate and provide rework direction to Distribution Center for non-compliant or assorted sku orders (NCI).</li><li> Coordinate with the DC and inventory control to RTV (Return to Vendor) product as needed.</li><li> Troubleshoot to ensure assortment is buyable and published (guest services, production, site merch, copy, photo).</li><li> Maintain and update inventory chase log-weekly.</li><li> Track inventory levels on dropship skus to ensure merchandise is in stock with licensee.<br/><br/></li></ul>", "qualifications": {"required": "Although this is an entry level role, they would like 3 plus years exp in a Coord role, Self-starter, motivated, proactive, dependable, flexible, detail oriented, Confident, but able to ask for assistance when uncertain, Display ability to multi-task, managing a variety of initiatives / issues simultaneously, Ability to project manage and capable of meeting deadlines and dealing with time constraints, Excellent organizational skills, Excellent interpersonal, solid written and verbal communication and presentation skills, Ability to build relationships, be flexible/adaptable, able to collaborate, influence and persuade, Possess strong analytical skills, Resourceful, innovative and responsive to change, Strong computer skills (Excel, Power Point, Word, Keynote)<br/><br/>", "preferred": "Bachelor's Degree in a related field."}, "skills": ["Excel", "PowerPoint", "Word", "Keynote"], "postedDate": "3 days ago", "benefits": "We offer world class major medical, dental and vision benefits, 401(k) with match, short term disability, Life Insurance and AD&amp;D.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4007126915"}