{"jobTitle": "HOA General Manager (CA)", "company": {"name": "Seabreeze Management Company, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Management and Manufacturing", "industry": "Real Estate", "description": "<strong>Description<br/><br/></strong><em><strong>Introduction:<br/><br/></strong></em>Seabreeze Management Company is a full-service property management firm with a diverse management portfolio of over 90,000 residential and commercial properties. Based in Aliso Viejo, California, Seabreeze has offered an unrivaled client experience to commercial common-interest developments and homeowners’ associations for over 30 years. With offices throughout California and Nevada, Seabreeze has expanded its mission to be a trusted advisor and collaborative partner with developments to build thriving associations through superior service and integrity.<br/><br/>At Seabreeze, people are at the heart of what we do. Our philosophy, “<em>Passion when combined with commitment, makes anyone unstoppable”</em> is carried out by enthusiastic and customer-centric teams who serve the communities where we work and live.<br/><br/><strong>Summary<br/><br/></strong>At Seabreeze Management Company, our motto is “People, Performance, Passion,” and we live that motto every day. By continually improving the service we offer our customers and providing our team with the resources they need, we have the power to create communities wherever we go. Through sound judgement and analytical decision-making, the General Manager acts as a compass of our motto and, under the guidance of the Seabreeze Board of Directors, oversees the entire homeowner association.<br/><br/>With sound industry knowledge, the General Manager is a seasoned leader who looks to implement best practices and achieve new levels of personalized service. From accounting procedures, personnel practices, Association CC&amp;Rs and Bylaws, to inventory and procurement, contract relations, association maintenance and safety practices, the General Manager has the breadth of knowledge that drives successful property management strategies.<br/><br/><strong>Administration<br/><br/></strong><em><strong>Essential Duties and Responsibilities:<br/><br/></strong></em><ul><li>Oversee office staff, vendors, and suppliers to attain Association goals as established by the Board of Directors.</li><li>Draft correspondence in response Board of Directors policies and other correspondence as it pertains to the Homeowner Association.</li><li>Direct and organize all office operations.</li><li>Direct the work efforts and schedules for all office staff.</li><li>Ensure that insurance coverage for the Association is adequate, as stated in the governing documents, and review insurance coverage as necessary.</li><li>Establish relationships and maintain contact with the Association’s general counsel, under the direction and guidelines established by the Board of Directors.</li><li>Review and approve employee timesheets at the end of each pay period and ensure personnel files are maintained for all employees including, but not limited to, vacation and sick leave records.</li><li>Perform all other duties as business needs dictate.<br/><br/></li></ul><strong>Budgeting<br/><br/></strong><ul><li>In conjunction with the Board of Directors, Finance Committee, and Management Company, assist with the creation of the Association’s annual operating and reserve budgets.</li><li>Analyze and research probable operating and reserve increase or decreases for specific expense and income items in the Association’s annual budget.</li><li>Provide the Board of Directors with written justifications of budgetary increases or decreases to the Association’s annual operating and reserve budgets.</li><li>Provide the Board of Directors with data and subsequent budgetary trends and historical comparisons in the Association’s annual budget.</li><li>Review and monitor all Association budget accounts throughout the year to identify and adjust for variances and seasonal changes.<br/><br/></li></ul><strong>Procurement<br/><br/></strong><ul><li>Ensure proper accounting and reconciliation for work and change orders.</li><li>Prepare and maintain a vendor list for the Association, ensuring that there are three vetted and qualified vendors for each of the following areas: carpentry, concrete, electrical, structural and geotechnical engineering, project management, landscaping (annual maintenance contracts), tree maintenance, and plumbing.<br/><br/></li></ul><strong>Contract Relations<br/><br/></strong><ul><li>Under the direction of the Board of Directors and with the assistance of those appointed by the board, draft specifications for Requests for Proposal.</li><li>Review and monitor any open Request for Proposal requirements requiring review and approval by the Board of Directors, as prepared by those appointed by the board.</li><li>As directed by the Board of Directors, provide the Association’s general counsel with draft bid proposals for review and approval before presentation to the Board of Directors.</li><li>Accept contracts per specifications upon approval from the Board of Directors.<br/><br/></li></ul><strong>Accounting<br/><br/></strong><ul><li>Review and ensure that the Financial Manager verifies journal entries via the Association’s monthly unaudited financial statements.</li><li>Review and approve Association checks for payment of Association invoices and ensure that the appropriate budget line item is utilized when the invoice is processed for payment.</li><li>Provide recommendations to the Association’s Board of Directors regarding effective use of financial resources and prioritization expenditures on a monthly, quarterly and annual basis.</li><li>Works with Accounts Receivable to monitor delinquent Association Member accounts and ensure adherence to the assessment collection process as indicated in the Association’s governing documents.</li><li>Monitor the receipt of all monetary payments made to the Association for use and purchase of amenity and access items, such as key fobs.</li><li>Ensure that monthly unaudited financial statements are received in a timely manner from the Association’s financial manager for review by the Association’s Treasurer.<br/><br/></li></ul><strong>Maintenance<br/><br/></strong><ul><li>Review, plan and schedule maintenance for the Association common areas and amenities.</li><li>In conjunction with the Association’s Maintenance Committee, assess the overall condition of Association property and amenities, gather observations and data in written form, and provide recommendations to the Board of Directors on a course of action to address any issues.</li><li>In conjunction with the Association’s Maintenance Committee, confer with vendors and contractors to address and resolve issues related to the completion of contracted projects. Advise the Board of Directors of vendor/contractor issues, provide recommendations and follow the Board’s guidelines for resolution.</li><li>In conjunction with the Association’s Maintenance Committee, inspect and investigate possible unsafe vendor/contractor practices and conditions and resolve as needed, or recommend appropriate course of action to the Board of Directors.<br/><br/></li></ul><strong>Association Office<br/><br/></strong><ul><li>Pre-screen and interview prospective employment candidates for Association office.</li><li>Train and supervise new and existing employees.</li><li>Terminate employees when needed, in accordance with Management Company policies and procedures.</li><li>Conduct position and wage research for office positions in order to ensure wages, hours, and working conditions are comparable with the current employment market and Management Company competitors.</li><li>Provide guidance and job development to employees on work practices, performance and policies/procedures.</li><li>Conduct annual performance appraisals for employees and recommendations on salary actions.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><strong>Knowledge, Skills and Experience:<br/><br/></strong><ul><li>Minimum of 5 years of community association and/or property management experience.</li><li>High-rise experience required</li><li>5 years of supervisory experience; effective in motivating and building strong teams.</li><li>Effectively coordinate multiple projects, use time management skills, and exercise independent judgment.</li><li>Intermediate mathematics as well as written and oral communication skills.</li><li>Strong internal/external customer relation skills to communicate with all levels of management, employees, homeowners, and other stakeholders.</li><li>Work with confidential/sensitive information and use diplomacy and discretion in communicating such information.</li><li>Effective follow-up skills.</li><li>Professional image or business image, per policy, as well as personal etiquette.</li><li>Organizational, planning, project management, time management, and problem-solving skills.</li><li>Effectively and efficiently handle priorities and deadlines.</li><li>Meet scheduling and attendance requirements, per policy.<br/><br/></li></ul><strong>Use Of The Following Computer Applications<br/><br/></strong>Outlook<br/><br/>MS Work<br/><br/>Excel<br/><br/>Internet<br/><br/><strong>Minimum Education<br/><br/></strong>High School Diploma or equivalent required. Bachelor’s degree preferred.<br/><br/>CCAM® designation or CMCA® designations desired.<br/><br/><strong>Availability<br/><br/></strong>Regular business hours and must be available for Board meetings after regular business hours, as necessary.<br/><br/><strong>Work Environment<br/><br/></strong>The work environment is a typical office building. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/>Seabreeze is proud to be an Equal Opportunity Employer that celebrates the diversity of our team. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other legally protected status. For individuals with disabilities who would like to request an accommodation such as an ASL interpreter, please contact Vy Nguyen at (949) 334-8166.", "responsibilities": "<em><strong>Essential Duties and Responsibilities:<br/><br/></strong></em><ul><li>Oversee office staff, vendors, and suppliers to attain Association goals as established by the Board of Directors.</li><li>Draft correspondence in response Board of Directors policies and other correspondence as it pertains to the Homeowner Association.</li><li>Direct and organize all office operations.</li><li>Direct the work efforts and schedules for all office staff.</li><li>Ensure that insurance coverage for the Association is adequate, as stated in the governing documents, and review insurance coverage as necessary.</li><li>Establish relationships and maintain contact with the Association’s general counsel, under the direction and guidelines established by the Board of Directors.</li><li>Review and approve employee timesheets at the end of each pay period and ensure personnel files are maintained for all employees including, but not limited to, vacation and sick leave records.</li><li>Perform all other duties as business needs dictate.<br/><br/></li></ul>", "qualifications": {"required": "Minimum of 5 years of community association and/or property management experience.<br/>High-rise experience required<br/>5 years of supervisory experience; effective in motivating and building strong teams.<br/>Effectively coordinate multiple projects, use time management skills, and exercise independent judgment.<br/>Intermediate mathematics as well as written and oral communication skills.<br/>Strong internal/external customer relation skills to communicate with all levels of management, employees, homeowners, and other stakeholders.<br/>Work with confidential/sensitive information and use diplomacy and discretion in communicating such information.<br/>Effective follow-up skills.<br/>Professional image or business image, per policy, as well as personal etiquette.<br/>Organizational, planning, project management, time management, and problem-solving skills.<br/>Effectively and efficiently handle priorities and deadlines.<br/>Meet scheduling and attendance requirements, per policy.<br/><br/>", "preferred": "High School Diploma or equivalent required. Bachelor’s degree preferred.<br/><br/>CCAM® designation or CMCA® designations desired."}, "skills": ["Property Management", "Supervisory Experience", "Customer Relations", "Communication", "Time Management", "Project Management", "Problem Solving", "Organizational Skills", "Outlook", "MS Work", "Excel", "Internet"], "postedDate": "1 day ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4007171242"}