{"jobTitle": "Candy Store Sales Associate", "company": {"name": "Lolli & Pops", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Part-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$16.00 - $16.00", "currency": "Hourly"}, "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "Job Details<br/><br/>Job Location<br/><br/>Glendale Galleria - Glendale, CA<br/><br/>Position Type<br/><br/>Part Time<br/><br/>Salary Range<br/><br/>$16.00 - $16.00 Hourly<br/><br/>Description<br/><br/>Candy Store Sales Associate <br/><br/>Joining our team will be the sweetest decision you will ever make! <br/><br/>At Lolli & Pops, we believe that candy is so much more than just candy. It has the power to say thank you, I love you, I celebrate you. And at its heart, candy Spreads Joy with Bits of Optimism.<br/><br/>We offer an optimistic culture, a fast-paced work environment, and of course a sweet discount on sweet treats. We consider ourselves a Company of Firsts and are proud to be a first-job employer.<br/><br/>Here are some of the things that you will do each day:<br/><br/><ul><li>Be YOU and spread joy with our team and guests</li><li>Delight our guests with generous gestures of yummy samples</li><li>Share your candy knowledge with each guest, helping them learn about our special items</li><li>Provide meticulous quality with each transaction at the cash register</li><li>Offer eye-popping choices of sweet treats by ensuring the highest levels of cleanliness and organization</li><li>Must be able to lift up to 25 pounds<br/><br/></li></ul>Our Company values are important to us! We are:<br/><br/>Guest-icated our guests are at the heart of everything we do<br/><br/>Collaborative we are a joyful mix of unique individuals working together<br/><br/>Agile we are flexible and open to change in order to be the best we can be<br/><br/>Authentic we honor whats real and authentic and give feedback from the heart<br/><br/>Betterment we have a never ending drive to continuously improve<br/><br/>We cannot wait to meet you!<br/><br/>We are an equal opportunity employer of all qualified individuals. We will consider all people - minorities, women, veterans and individuals with disabilities no matter their sexual orientation or gender identity. We will consider giving opportunities to qualified individuals with criminal histories when it aligns with federal, state and local statutes.", "responsibilities": "Be YOU and spread joy with our team and guests\nDelight our guests with generous gestures of yummy samples\nShare your candy knowledge with each guest, helping them learn about our special items\nProvide meticulous quality with each transaction at the cash register\nOffer eye-popping choices of sweet treats by ensuring the highest levels of cleanliness and organization\nMust be able to lift up to 25 pounds", "postedDate": "2 days ago", "remoteWork": "No", "skills": [], "url": "https://www.linkedin.com/jobs/view/4007095356"}