{"jobTitle": "Plumber - Punch", "company": {"name": "Gibson Plumbing", "location": "Dallas, TX"}, "location": "Dallas, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Construction", "description": "Gibson Plumbing is a full service residential and commercial plumbing company serving San Antonio, Austin, Dallas, Houston and surrounding areas. In business since 1954, our licensed plumbers provide solutions from large multi-family projects to single-family residential.<br/><br/>Gibson Plumbing is in search of a licensed plumber with knowledge in all phases of residential plumbing. He/she will work with the Area Superintendent to manage workload in assigned territory and complete assigned work orders. Candidate will be able to create a material list for items to be performed each day and work with the warehouse to obtain it.<br/><br/>With this position you will complete assigned daily work orders and communicate them to the lead plumber, assist the lead plumber with job site scouting, verify job sites are ready for inspection and assisting the warranty department.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li> Complete assigned work orders daily</li><li> Verify Job site is Inspection Ready</li><li> Communicate with Lead Plumber completed work orders</li><li> Maintain truck stock/ truck cleanliness</li><li> Trouble shooting Plumbing Systems, Sewer Operation, Camera/Locator Operation, Leak Detection</li><li> Assist lead plumber with job site scouting</li><li> Assist warranty department</li><li> Candidate will need to be able to climb a ladder, lift over 15 lbs., squat, kneel, crouch, and stand for periods of time.<br/><br/><br/></li></ul><strong>Requirements:<br/><br/></strong><ul><li> Must have a minimum of a Tradesman Plumbing license</li><li> Must have a Texas driver license with a good driving record</li><li> Experience in residential plumbing<br/><br/><br/></li></ul>Gibson Plumbing offers a great benefit packet:<br/><br/>Medical, dental, vision, life insurance, 401(K), paid holidays, paid time off (PTO)<br/><br/><strong>Hourly Rate Of Pay Depends On Skills And Experience<br/><br/></strong>To apply, please reply to this posting attaching resume in PDF format or apply on Gibson Plumbing’s website at www.gibsonplumbing.com", "responsibilities": "Complete assigned work orders daily, Verify Job site is Inspection Ready, Communicate with Lead Plumber completed work orders, Maintain truck stock/ truck cleanliness, Trouble shooting Plumbing Systems, Sewer Operation, Camera/Locator Operation, Leak Detection, Assist lead plumber with job site scouting, Assist warranty department, Candidate will need to be able to climb a ladder, lift over 15 lbs., squat, kneel, crouch, and stand for periods of time.", "qualifications": {"required": "Must have a minimum of a Tradesman Plumbing license, Must have a Texas driver license with a good driving record, Experience in residential plumbing"}, "skills": [], "postedDate": "3 weeks ago", "benefits": "Medical, dental, vision, life insurance, 401(K), paid holidays, paid time off (PTO)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007176654"}