{"jobTitle": "Membership Manager", "company": {"name": "Gold's Gym SoCal Group", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Wellness and Fitness Services", "description": "Gold’s Gym is growing fast and looking for a Membership Services Manager to help us to provide world class service to our clubs and members by utilizing in-depth knowledge of company products and programs. We’ll challenge your skills, talents and abilities and reward your every success. Here is just some of the benefits you will get by being a Gold’s Gym employee:<br/><br/><ul><li>Work in a fun environment with great people</li><li>Great benefits package that includes 401k, medical, vision and dental, free gym memberships and discounts</li><li>Opportunities to grow within the company<br/><br/></li></ul><strong>What Sets Us Apart From The Rest<br/><br/></strong><ul><li>Dedication to our members’ successes and goals</li><li>Integrity which creates life-long relationships</li><li>Passion for people in the communities we serve</li><li>Pride in what we do and who we are</li><li>Leadership development (ongoing)</li><li>Excellence in execution</li><li>But most of all…. we are more than a gym; we are a family!!<br/><br/></li></ul><strong>We Want Talented Individuals Who<br/><br/></strong><ul><li>Have a positive, upbeat, and outgoing attitude</li><li>Are passionate about hospitality and excellence for our members</li><li>Can work in a dynamic, fast-paced, goal-oriented environment without sacrificing quality of service</li><li>Have fitness industry experience (preferred)</li><li>Love to constantly learn and grow<br/><br/></li></ul><strong>When You Come To Work You’ll<br/><br/></strong><ul><li>Assemble and manage a fully engaged and high performing membership team that aligns with company initiatives and culture.</li><li>Ensure that project/department milestones/goals are met and adhere to approved budgets</li><li>Enforces all club rules, policies and promotes proper execution of all procedures.</li><li>Keep the club fully staffed through review of applications, interviewing making hiring recommendations to the general manager.</li><li>Manage membership sales generation for their facility</li><li>Develop and monitor monthly, quarterly and annual metrics including employee retention and satisfaction</li><li>Train staff to generate leads/new business through member promotions, leads, referrals, and guest passes.</li><li>Manage employee’s performance by coaching, and creating a healthy, positive working environment.</li><li>Conduct weekly meetings with direct reports to review performance and offer direction, inspiration, and guidance toward achieving individual and club goals.<br/><br/></li></ul><strong>There Are Some MUST HAVES<br/><br/></strong><ul><li>Ability to use sound business judgment and have strong analytical skills</li><li>Ability to effectively communicate with constituents</li><li>Effective listening skills</li><li>Effective delegation and follow-up skills</li><li>Effective planning and organization skills</li><li>Demonstrates ability to create a positive environment</li><li>Demonstrates willingness and openness for self-development</li><li>Ability to identify and use resources to improve overall operations</li><li>Strong leadership qualities coupled with excellent motivational, communication and team building skills will make you an ideal candidate for this position.</li><li>College degree preferred</li><li>Current CPR Certification is required.<br/><br/></li></ul><strong>ASK YOURSELF IF YOU HAVE WHAT IT TAKES….. COME BE APART OF THE LEGACY TODAY!<br/><br/></strong><em>Gold’s Gym provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to <br/><br/></em>Gym Sales Manager<br/><br/>A hard day at work never felt so good. As part of the largest co-ed gym chain in the world and the most recognized name in fitness, Gold’s Gym is seeking fitness enthusiasts with a desire to take us to a whole new level. With an aggressive growth plan, Gold’s Gym is evolving from “gym” to “fitness club” through growing programs and new facilities.<br/><br/>The Gym Sales Manager is responsible for managing membership sales generation for their facility. This position is also responsible for recruiting, hiring and training Fitness Consultants.<br/><br/>Strong leadership qualities coupled with excellent motivational, communication and team building skills will make you an ideal candidate for this position. Solid sales experience and a comprehensive knowledge of all facility operations, sales and management systems is required. College degree preferred. Current CPR Certification is required.<br/><br/>We offer a competitive pay, bonus potential and benefits plan including medical and dental, 401K, training programs and a free gym membership.<br/><br/>Gold’s Gym Houston continues to change lives by helping people reach their individual potential. Join the team in getting us where we need to go and you’ll see no limit to your potential.<br/><br/>In 1965, a small gym was founded on the shores of Venice Beach, California. Fast forward 55 years, and that humble establishment has blossomed into a worldwide fitness powerhouse known as Gold's Gym. With a presence on six continents and over 600 locations, Gold's Gym has achieved iconic status in the fitness industry. It's where legendary bodybuilders like Arnold Schwarzenegger, Lou Ferrigno, and Franco Columbu honed their craft, solidifying its reputation as the ultimate gym destination.<br/><br/>Gold's Gym boasts a culture with unparalleled recognition, with an impressive 96% aided brand awareness. Our journey to success is deeply rooted in our unique company culture, a blend of humility, dependability, and an entrepreneurial spirit, combined with boundless enthusiasm, collaboration, and creativity.<br/><br/>If this resonates with you, we eagerly anticipate receiving your application! Join the legacy today!<br/><br/>Discover the benefits of Gold's Gym SoCal Rewards, where your dedication to fitness pays off in more ways than one. With this program, you'll earn valuable perks for simply hitting the gym, referring friends, participating in group exercise training, and more. What's even better? These perks can be swiftly redeemed for instant rewards and impressive savings.<br/><br/>Use your accumulated perks to score branded swag and access select Gold's Gym services. Plus, unlock exclusive member-only discounts on top-notch merchandise, hotels, and other enticing offers. But the rewards don't stop there. By joining Gold's Gym SoCal Rewards, you'll gain instant access to fantastic deals on concert and sporting event tickets, movie tickets, theme parks, and much more.<br/><br/><strong>Earn<br/><br/></strong>Accrue perks effortlessly through activities like gym visits, referring friends, and group-X training<br/><br/><strong>Refer Your Friends<br/><br/></strong>Spread the gift of fitness and reap the rewards! Invite your friends and family to embark on their fitness journey with the Gold's Gym SoCal family, earning yourself something enjoyable in the process.<br/><br/><strong>Reward Yourself<br/><br/></strong>After all your hard work, it's time to indulge in well-deserved rewards!<br/><br/>Visit WWW.GOLDSGYMSOCALREWARDS.COM to start reaping the benefits today.", "responsibilities": "The Gym Sales Manager is responsible for managing membership sales generation for their facility. This position is also responsible for recruiting, hiring and training Fitness Consultants.", "qualifications": {"required": "Strong leadership qualities coupled with excellent motivational, communication and team building skills will make you an ideal candidate for this position. Solid sales experience and a comprehensive knowledge of all facility operations, sales and management systems is required. College degree preferred. Current CPR Certification is required.", "preferred": "College degree preferred. Current CPR Certification is required."}, "skills": [], "postedDate": "1 day ago", "benefits": "We offer a competitive pay, bonus potential and benefits plan including medical and dental, 401K, training programs and a free gym membership.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007344982"}