{"jobTitle": "General Manager", "company": {"name": "TORY BURCH", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "85,000.00 USD - 120,000.00 USD", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail Apparel and Fashion", "description": "<strong>We are</strong> an American luxury lifestyle brand, founded in 2004. Anchored in the casual elegance of American sportswear, Tory’s design philosophy is defined by effortless silhouettes, innovative materials, eclectic juxtapositions of color, and the tension of past and present. The collections include ready-to-wear, handbags, footwear, accessories, jewelry, home and beauty.<br/><br/>Empowering women is the company’s guiding principle, expressed through Tory’s collections and reflected in the company culture as well as the work of the Tory Burch Foundation. Established in 2009, the Foundation provides women entrepreneurs in the United States with capital, education and community.<br/><br/><strong>You are</strong> seeking a work environment where people are encouraged to dream, explore, discover and, as important, laugh together. If you’re prepared to work hard, create impact, and have fun while doing it, we would love to have you join #TeamTory. Apply today!<br/><br/><strong>Life @ToryBurch is Special Because:<br/><br/></strong>When you join us, you’re joining a purpose-led company on an exciting growth journey with the best Retail Team in the industry.<br/><br/><ul><li>Our culture is welcoming and inclusive -- everyone is empowered to make a difference.</li><li>We have the best team in the world and believe in paying competitively and rewarding high performance.</li><li>Your overall well-being is important to us; we offer benefits to help you take care of your mental and physical health, create financial security, and achieve wellness in all areas of your life.</li><li>We love seeing our employees wear our beautiful collections. You’ll receive a generous employee discount and access to exclusive special offers.</li><li>We will help you become great at what you love - Our Retail Excellence Programs in Styling, Coaching, Brand Ambassador (just to name a few) and supportive Retail Leaders are there to support you each step of the way</li><li>We believe in the importance of giving back and you’ll have many opportunities to do just that through the Tory Burch Foundation and paid volunteer days.<br/><br/></li></ul><strong>This Role Is Tailor-Made For You Because<br/><br/></strong>You are the ultimate ambassador of our brand. You’re accountable for creating a highly productive environment in which customers have an extraordinary experience, employees are able to do their best and the business thrives. This requires a constant balancing of priorities, including strategic, operational &amp; leadership excellence with an authentic approach. A sense of humor is a plus!<br/><br/><strong>A Day In The Life<br/><br/></strong>The typical day is… atypical. You might be overseeing the development of clientele relationships and driving business initiatives, setting clear goals and expectations and holding people accountable to high standards of excellence, or building a world class talent team who strives to create an exceptional retail experience. The consistent thread is that you’ll be working with an amazing team of women and men who share your passion for excellence.<br/><br/><strong>To Land This Role<br/><br/></strong><ul><li>B.A. in Business or Other Fashion-Related Discipline</li><li>Five years of experience at the General Manager level</li><li>Proven Track Record of Success<br/><br/></li></ul><strong>Why You’ll Want To Join Our Team<br/><br/></strong>Our Retail Teams are known for making every customer feel welcome and creating the most memorable experiences for them. They help to grow our business every single day. Our store teams are encouraged to think like entrepreneurs and to experiment with innovative ideas that make it easier for them to deliver retail excellence. Come join us!<br/><br/><strong>How We Work Together<br/><br/></strong><ul><li>Adaptable – We change before we have to</li><li>Entrepreneurial – We own it</li><li>Collaborative – There’s no “I” in Tory</li><li>Client &amp; Brand Focused – We put ourselves in Tory’s shoes</li><li>Live the Values – We show up for each other</li><li>Functional Expertise – We’re constantly learning and growing<br/><br/></li></ul><strong>#TeamTory Values<br/><br/></strong>We show up with honesty &amp; kindness, act with integrity &amp; compassion, work with passion &amp; humility and lead with excellence &amp; humor.<br/><br/><strong>Compensation Range<br/><br/></strong>The compensation range for this position is 85,000.00 USD - 120,000.00 USD. Our offer will be based on your relevant experience and work location.<br/><br/><strong>Benefits Information<br/><br/></strong>We offer a generous set of benefits to help you take care of your health, create financial security, and achieve wellness in all areas of your life. Here are highlights of key benefits available to all Tory Burch members that work over 30 hours.<br/><br/><strong>E<strong>qual Employment Opportunity Statement<br/><br/></strong></strong>Tory Burch LLC is an Equal Employment Opportunity employer and provides equal opportunities to all employees and applicants without regard to an individual’s age, race, creed, color, religion, national origin, sex (including pregnancy) or sexual orientation, gender expression, military status, marital status, genetic predisposition or carrier status, disability or membership in any other protected class under applicable law. Likewise, we will consider qualified applicants with criminal histories for employment in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring, Ordinance No. 184652. Pursuant to the San Francisco Fair Chance Ordinance, we will consider qualified applicants with arrest and conviction records for employment.<br/><br/><strong>Disability Accommodation <br/><br/></strong>Tory Burch is committed to providing reasonable accommodations to applicants and employees with disabilities. Please tell us if you require a reasonable accommodation to apply for a job or to perform your job. Examples of reasonable accommodation include making a change to the application process or work procedures, providing documents in an alternate format, using a sign language interpreter, or using specialized equipment. If you require assistance or an accommodation with the hiring process, please contact thetalentteam@toryburch.com.", "responsibilities": "You are the ultimate ambassador of our brand. You’re accountable for creating a highly productive environment in which customers have an extraordinary experience, employees are able to do their best and the business thrives. This requires a constant balancing of priorities, including strategic, operational &amp; leadership excellence with an authentic approach. A sense of humor is a plus!", "qualifications": {"required": "B.A. in Business or Other Fashion-Related Discipline\nFive years of experience at the General Manager level\nProven Track Record of Success"}, "skills": [], "postedDate": "2 days ago", "benefits": "We offer a generous set of benefits to help you take care of your health, create financial security, and achieve wellness in all areas of your life. Here are highlights of key benefits available to all Tory Burch members that work over 30 hours.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007052320"}