{"jobTitle": "Grounds Maintenance Supervisor", "company": {"name": "Ontario Christian School", "location": "Ontario, CA"}, "location": "Ontario, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Primary and Secondary Education", "description": "Ontario Christian School is a nonprofit, independent private school passionate about providing students and families with a biblically-based education of the highest standard. We seek to see every student equipped to be courageous leaders who serve God and others, seek His Truth, and impact culture.<br/><br/>Join our community of skillful and dynamic professionals who demonstrate personal knowledge of God's word in their work to provide the best quality of Christian Education. Ontario Christian staff and facility lays a biblical foundation for our Christ-centered mission of Growing Christian Leaders.<br/><br/>Ontario Christian seeks a Grounds Maintenance Supervisor responsible for supervising a team and care taking of the grounds and basic maintenance repairs at our Euclid campus. This role will be responsible for working with site leadership to identify the needs, determine a solution and deploy staff or contractors to fix the issues. This role will actively supervise 3-5 employees handling all training activities, performance feedback, disciplinary action, etc.<br/><br/>Requirements for this role are as follows.<br/><br/>Experience<br/><br/><ul><li>One (1) + years working in grounds work required, five (5) years preferred. </li><li>One (1) + years in maintenance work required, five (5) years preferred.</li><li>Three (3) + years in a supervisory or management role preferred.<br/><br/></li></ul><em>Education<br/><br/></em><ul><li>High School Diploma/GED or equivalent years of experience.<br/><br/></li></ul><em>Ontario Christian School Association is an equal opportunity employer. Ontario Christian School Association does not discriminate on any basis prohibited by local, state, or federal law.</em>", "postedDate": "2 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007300471"}