{"jobTitle": "Merchandising Coordinator", "company": {"name": "Newport Meat and Seafood", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "25.87/hr - 38.80/hr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Wholesale Food and Beverage", "description": "Assisting in a variety of duties within the merchandising function. Inventory replenishment, pricing products with oversight and administrative support. The purpose of the role is to ensure continuous hands-on inventory management.<br/><br/>Responsibilities<br/><br/><ul><li>Maintain appropriate stock levels of supplies, ingredients or products within the area of oversight.</li><li>Manage POs (purchase order), price inventory (with oversight), effectively communicate with suppliers, minimal price negotiation.</li><li>Work with internal QC and suppliers on any quality mis-ship or inventory return issues.</li><li>Provide Merchandising Administrative support running reports etc.<br/><br/></li></ul>Qualifications<br/><br/>Education<br/><br/><ul><li>High School Diploma or equivalent</li><li>Bachelors preferred<br/><br/></li></ul>Experience<br/><br/><ul><li>1-year experience in Merchandising/Inventory environment<br/><br/></li></ul>Professional Skills<br/><br/><ul><li>Proficient in MS Office, detail-oriented, good verbal and written communication skills.</li><li>Describe the most important decisions made by this position.</li><li>Most important decisions made fully independently:</li><li>Keeping an adequate inventory level for needs while maximizing buy efficiencies.</li><li>Most important decisions made with review and approval of other individuals or supervisors (include the reviews/approvals required):</li><li>Negotiate to price with suppliers and pricing of inventory internally with approval from Purchasing Director or Vice President.<br/><br/></li></ul>Overview<br/><br/>Sysco is the global leader in foodservice distribution. With over 71,000 colleagues and a fleet of over 13,000 vehicles, Sysco operates approximately 333 distribution facilities worldwide and serves more than 700,000 customer locations.<br/><br/>We offer our colleagues the opportunity to grow personally and professionally, to contribute to the success of a dynamic organization, and to serve others in a manner that exceeds their expectations. We’re looking for talented, hard-working individuals to join our team. Come grow with us and let us show you why Sysco is at the heart of food and service.<br/><br/>Affirmative Action Statement<br/><br/>Applicants must be currently authorized to work in the United States.<br/><br/>We are proud to be an Equal Opportunity and Affirmative Action employer, and consider qualified applicants without regard to race, color, creed, religion, ancestry, national origin, sex, sexual orientation, gender identity, age, disability, veteran status or any other protected factor under federal, state or local law.<br/><br/>This opportunity is available through Sysco Corporation, its subsidiaries and affiliates.<br/><br/>", "responsibilities": "Maintain appropriate stock levels of supplies, ingredients or products within the area of oversight. Manage POs (purchase order), price inventory (with oversight), effectively communicate with suppliers, minimal price negotiation. Work with internal QC and suppliers on any quality mis-ship or inventory return issues. Provide Merchandising Administrative support running reports etc.", "qualifications": {"required": "High School Diploma or equivalent", "preferred": "Bachelors preferred"}, "skills": ["MS Office"], "postedDate": "5 hours ago", "benefits": "For information on Sysco’s Benefits, please visit https://SyscoBenefits.com", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4007555879"}