{"title": "Account Manager, Large Customer Sales (English, French)", "level": "Early", "location": "Dublin, Ireland", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. As an Account Manager, you will manage relationships with clients, be focused, able to multitask in a fast-paced environment, and sales-focused to help expand the client relationship. Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in advertising, consultative sales, business development, online media environment, or marketing role. 1 year experience in customer relationship management and project management to oversee multiple, simultaneous solutions executed by support team. Ability to communicate in English and French fluently to support client relationship management in this region.", "preferred_qualifications": "Experience assessing and achieving client success via sales techniques, including effective questioning, objection handling and engaged promotions. Knowledge of online marketing strategy and tactics, and expertise in managing digital advertising campaigns with a focus on performance marketing. Ability to own a portfolio in an advertising or media sales context and consistently overachieve quotas to drive growth. Ability to build compelling narratives and utilize storytelling as a client engagement strategy. Excellent thought leadership and high-executive functioning skills within the digital marketing space.", "responsibilities": "Deliver against ambitious quarterly business and product growth goals. Own a portfolio of large complex businesses by thoroughly understanding growth drivers, identifying opportunities for growth, managing risks and building plans for achievement. Pitch and consult with customers proactively to support digital marketing discussions and budgets. Drive customer growth by delivering outstanding customer sales experience and achieving customer business and marketing objectives. Provide stakeholder management, build relationships with the end customer or agencies.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/100020008553194182"}