{"title": "Channel Account Manager, Security, Google Cloud", "level": "Advanced", "location": "London, UK", "description": "Google Cloud teams work with schools, companies, and government agencies to make them more productive, mobile, and collaborative. On this team, you will drive Google Cloud business relationships by analyzing partner business performance, identifying methods of increasing partner and Google returns, pitching ideas to and identifying opportunities within partners, and coordinating across Google teams to deliver. You will educate our partners on the power of Google Cloud and enable them to be successful in driving innovation to our customers.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 10 years of experience in selling to partners, carrying a sales quota and selling with partners, selling to process: quoting, contracting, executing. Experience in enterprise software or cybersecurity space, driving pipeline generation initiatives with Partners in order to meet or exceed business goals. Experience in the cybersecurity field with a security software, services (MSSP), or hardware provider in a channel role.", "preferred_qualifications": "Experience with Partners, Value Added Resellers, Cloud Partners, Managed Security Service Providers, Managed Detection Response, or Global System Integrators. Experience building strong and continuous relationships, selling to C-level executives across security and IT business units; ensuring customer success and adoption, leading to customer expansion. Knowledge of product and solution market trends in cybersecurity, Infrastructure as a Service (IaaS), and Platform as a Service (PaaS). Ability to prioritize, plan, and organize business activity with attention to detail. Excellent problem-solving, communication, and presentation skills.", "responsibilities": "Support partners in their sales process, from lead generation to finalizing agreements. This will include driving direct customer engagement to outline the value proposition, specific benefits, and use cases that speak to their challenges and pain points; support pipeline development. Develop and execute go-to-market plans with goals and metrics, including enablement and training, marketing programs, and sales alignment with Security sales. Maintain and report an accurate sales forecast in Salesforce. Lead quarterly business reviews. Ensure partners have all technical and sales tools needed to drive success. Recruit and develop relationships with National Partners, Value Added Resellers (VARs), Global System Integrators, and local Managed Security Service Providers.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/100006052593836742"}