{"title": "Revenue Operations Finance Manager", "level": "Advanced", "location": "Bengaluru, Karnataka, India", "description": "The Revenue to Cash Operations (RCO) team manages Google's incoming cash transactions on a global basis and ensures that Google's incoming cash processes are controlled, effective, and efficient. As a member of this team, you will find innovative ways to manage our complex set of transactions. The Revenue Operations team manages a number of different functions: global invoicing for Google’s entire product suite, intake of new product and form of payment launches, expansions, acquisitions, and regulatory change that impact order-to-cash processes, management of tax operations, including onboarding, withholding, and reporting, and billing modifications, refunds and disbursements, payments optimization, and abandoned and unclaimed property.", "salary": "", "key_qualifications": "Bachelor's degree in Business, Finance, Engineering, or Operations, or equivalent practical experience. 10 years of experience in operations or strategy roles, building relationships and leading operational initiatives. 2 years of experience directly leading a team.", "preferred_qualifications": "Experience in stakeholder management. Experience applying statistical methods, SQL, and dashboard design. Experience with SAP or other billing systems. Ability to build relationship, influence, and collaborate at all organizational levels with various cross-functional partners without direct authority. Excellent business acumen, problem-solving, strategic, and investigative skills. Excellent communication and data analysis skills.", "responsibilities": "Lead a team of global process managers to design and implement scalable solutions through system automation and process improvements. Create and influence long-term direction and strategy for the area. Collaborate with product management, engineering, sales, and finance to enable business growth while establishing efficient and controlled processes and policies. Lead operations and oversee key metrics on goals/Service level Agreements (SLAs) to ensure timely, accurate, and clear invoices for Google’s customers. Ensure all transactional processes have adequate controls and reconciliations, and adequate financial and operational reporting is provided. Partner cross-functionally on controllership-level priorities (e.g., AR aging reduction) and with the Revenue to Cash Organization (RCO).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/100009217984733894"}