{"title": "Mainframe Modernization Consultant, Google Cloud", "level": "Mid", "location": "Warsaw, Poland", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.", "key_qualifications": "Bachelor's degree in Computer Science, related technical field, or equivalent practical experience. Experience in Unix/Linux based production-grade applications. Experience in IT and with mainframe technologies (e.g., COBOL, PL/I, RPG, Assembler, JCL, VSAM files, CICS, DB2, IMS, etc.). Experience with mainframe migration and modernization tools like Micro Focus, Astadia, mLogica, etc.", "preferred_qualifications": "Experience with Cloud products such as Google Cloud Platform or other similar technologies. Experience with mainframe development and modernization. Experience with legacy languages and platforms such as COBOL, JCL, Assembler, RPG, and SQL Legacy environments: AS400 Databases (IMS, IDMS, DB2, VSAM). Experience in Java development with Spring Boot framework. Knowledge of data migrations from mainframe to modern databases. Ability to travel up to 25% of the time in-region for meetings, video conferencing, technical reviews, and onsite delivery activities as needed.", "responsibilities": "Create and deliver best practices recommendations, tutorials, blog articles, sample code, and technical presentations adapting to different levels of key business and technical stakeholders. Work with various modernization tools and products to modernize mainframe (e.g., automated refactoring using a tool-based approach). Develop/test the modernized application code for functionality and performance in the Google Cloud Platform Cloud environment. Lead delivery of complex mainframe/AS400 migration projects providing technical governance and leading teams. Build re-usable mainframe modernization artifacts, while providing trainings to customers, partners, and internal teams.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/100055151250678470"}