{"title": "Site Reliability Engineer", "level": "", "location": "Bengaluru, Karnataka, India", "description": "Site Reliability Engineering (SRE) combines software and systems engineering to build and run large-scale, massively distributed, fault-tolerant systems. SRE ensures that Google's services—both our internally critical and our externally-visible systems—have reliability, uptime appropriate to users' needs and a fast rate of improvement. Additionally SRE’s will keep an ever-watchful eye on our systems capacity and performance. Much of our software development focuses on optimizing existing systems, building infrastructure and eliminating work through automation.\n\nOn the SRE team, you’ll have the opportunity to manage the complex challenges of scale which are unique to Google, while using your expertise in coding, algorithms, complexity analysis and large-scale system design.\n\nSRE's culture of diversity, intellectual curiosity, problem solving and openness is key to its success. Our organization brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow. \n\nTo learn more: check out our books on Site Reliability Engineering or read a career profile about why a Software Engineer chose to join SRE.", "key_qualifications": "Bachelor's degree in Computer Science or related technical field, or equivalent practical experience.\n2 years of experience with data structures/algorithms and software development in one or more programming languages.\nExperience with Unix/Linux operating systems internals and administration, or networking and debugging/troubleshooting.", "preferred_qualifications": "Experience architecting and developing software or infrastructure for scalable, high performance, distributed systems.\nExperience in navigating enterprise software, deployment and management of workloads in the cloud.\nExperience in analyzing and troubleshooting large-scale complex enterprise systems.\nAbility to debug, optimize code, and automate routine tasks.", "responsibilities": "Work with other SREs, the Development team, and the Cloud Support organization to ensure that Cloud Spanner's reliability and performance meets our customers' needs, while being efficient and with manageable operational load.\nPlan and execute projects that improve reliability or efficiency.\nWork collaboratively with Software Engineers and other partner teams to continuously evolve and expand Cloud Spanner capabilities.\nWork non-standard, on-call rotation work hours, including weekends.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/100124458064192198"}