{"title": "Senior Technical Program Manager, Data Center Data Security", "level": "Advanced", "location": "Atlanta, GA, USA", "description": "As a Technical Program Manager for the Data Center Data Security (DS) team, you will manage DS programs that impact operations across global Data centers. In this role, you will plan short and long-term requirements with internal customers and partners at different levels, while collaborating with software development, hardware design, planning, supply chain, logistics, other security teams, Data center operations managers, and Data center technicians to lead programs and projects through their entire lifecycle.", "key_qualifications": "Bachelor's degree in a technical field, or equivalent practical experience. 8 years of experience in program management. 8 years of experience managing cross-functional or cross-team projects. Experience in public sector industry and cloud solutions, including networking, infrastructure, and security. Experience in a government environment managing cloud solutions.", "preferred_qualifications": "Advanced degree in Security, Management, Technical or Engineering field. CISSP, CISM, or PMP certifications. Knowledge of compliance regimes and requirements, including FedRAMP, DoD SRG, CJIS, IRS1075, etc. Ability to exercise technical judgment and influence team members in solving software engineering challenges.", "responsibilities": "Lead the technical program management of multi-functional Data Center Data Security programs/projects, covering program planning, delivery assurance, tracking and reporting. Manage program risks, issues, and track them to meet expected outcomes and timelines, building mitigation plans as the program evolves. Take various project requirements and organize them into clear goals and objectives, and break down large programs, projects, and processes into sub-projects and sub-processes that could be executed by other teams or partners. Manage communication of progress/status with customer groups in various locations and time zones; manage relationships between cross-functional teams. Overcome challenges to keep processes running smoothly. Define and develop cross-team roles, expectations, and responsibilities. Drive process development and iterative optimizations.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/100179945820431046"}