{"title": "Financial Analyst, Go-to-Market Finance, Google Cloud Consulting", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Financial Analysts ensure that Google makes sound financial decisions.  As a Financial Analyst, your work, whether it's modeling business scenarios or tracking performance metrics, is used by our leaders to make strategic company decisions. Working on multiple projects at a time, you are focused on the details while finding creative ways to take on big picture challenges.As someone who knows the workings of the core Finance team inside and out, you'll lead individual projects to transform planning, tracking and control processes. You'll provide senior level management with insightful recommendations, planning and reporting support.The name Google came from 'googol,' a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.", "key_qualifications": "Bachelor's degree in Business, Finance, Economics, Statistics, or another quantitative field, or equivalent practical experience. 4 years of experience in financial planning and analysis (FP&A), consulting, or a related function, or an advanced degree.", "preferred_qualifications": "Experience working in a professional services business, including Technology Industry. Experience generating insights/themes working with large and complex datasets and building models and dashboards (e.g., data visualization). Knowledge of services/consulting, partner ecosystem, key metrics (e.g., bookings, backlog, business generation), P&L management, business recognition rules, and agreement structures. Familiarity with the SaaS/Cloud industry. Ability to work in an unstructured, fast-paced environment and navigate ambiguity. Ability to communicate and collaborate in a multicultural work environment, with excellent organizational, problem-solving, and influencing skills.", "responsibilities": "Become the finance partner for JAPAC and EMEA Google Cloud Consulting (GCC) Country Leads. Understand sales and delivery cycles and services delivery processes in order to give impactful recommendations on how to improve business performance. Track, analyze and forecast performance (business and bookings), support GCC Sales and business goal setting. Provide recommendations to improve gain in the Profit and Loss (P&L) based on financial analysis and critical thinking. Track business performance by working with cross-functional partners and communicate key results to leadership. Partner with Google Cloud Sales Finance, Google Cloud Consulting Regional and Central Finance, Strategy and Operations regional and central teams, Controllership, Regional delivery and pursuit teams on planning, business performance analysis, insights, and rhythm of business. Lead monthly, quarterly, and annual financial planning cycles while working with Central cross-functional teams.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/100150068081763014"}