{"title": "Program Manager III, Supply Chain Planning, Google Cloud", "level": "Mid", "location": "Atlanta, GA, USA; Kirkland, WA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nAs a Supply Chain Planning Program Manager, you will be responsible for the data center equipment supply planning for sustaining and new products, interpretation of the data center demand signal and translating it to a supply and inventory plan for equipment and drive optimal planning decisions. You will work closely with Data Center Supply Planning, Purchasing, Engineering, Fulfillment, Commodity Management, and Contract Manufacturing teams to develop and oversee the execution of an accurate supply and inventory plan through the product lifecycle. You will establish and drive metrics, drive process and system improvements to accomplish efficiency and scalability goals and influence our rapidly growing data center infrastructure supply chain.\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nThe US base salary range for this full-time position is $139,000-$207,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.", "salary": "$139,000-$207,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in program or project management. Experience in supply chain planning, capacity planning or demand planning.", "preferred_qualifications": "Master's degree or MBA in Business Process Management, Industrial Engineering, Supply Chain Management, or related planning disciplines. 5 years of experience managing cross-functional or cross-team projects. Experience in using Enterprise Resource Planning (ERP) and Product Lifecycle Management (PLM) systems and tools. Experience in development and implementation of planning systems and processes. Experience in planning materials for new product launches and transitions. Experience in analytics, SQL, or BigQuery.", "responsibilities": "Manage material supply, including inventory, existing and new product demand requirements to meet business objectives, coordinating with demand planning on changes to demand which impacts delivery of key components as demand needs fluctuate. Communicate new product material plans and status to internal customers. Identify and quickly solve supply chain gaps and inefficiencies. Document process solutions and requirements. Define and manage clear business metrics and goals to manage supply chain performance. Leverage market intelligence and statistical inputs driving continued sustained improvements of inventory models and supply chain buffers. Develop short and long-term supply models to minimize total costs and inventories while maintaining service levels, develop and justify inventory buffer strategies that optimize cost and flexibility.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/100285442363925190"}