{"title": "Data Center Operations Manager, Global Server Operations", "level": "Mid", "location": "Berlin, Germany", "description": "Google isn't just a software company. The Hardware Operations team is responsible for monitoring the state-of-the-art physical infrastructure behind Google's powerful search technology. As a Hardware Operations Manager, you will manage a team of Data Center Technicians. You will oversee the quality installation of server hardware and components and take charge of complicated installations/troubleshooting.\n\nYour team will install, configure, test, troubleshoot and maintain hardware (like servers and its components) and server software (like Google's Linux cluster). They will also take on the configuration of more complex components such as networks, routers, hubs, bridges, switches and networking protocols. They may lead small project teams on larger installations and develop project contingency plans.\n\nIn this role, you will lead one or more teams to deliver critical data center initiative (e.g., data security, machine maintenance, networking), identify trends via data analytics at the project level, and drive the changes needed to address them (e.g., improve tools, processes, or procedures). You will be the point of contact for escalation for one or more data center sites, quantifying systemic issues and escalating when appropriate. In addition, you will work with the partners (e.g., Program Managers, Data Center Operations) to provide input into short-term and long-term strategy, process changes, and task orders for the site. You'll manage projects to budget, timeline, and resourcing needs.\n\nThe Data Center team designs and operates some of the most sophisticated electrical and HVAC systems in the world. We are a diverse, upbeat, creative, team-oriented group of engineers committed to building and operating powerful data centers.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, a related technical field, or equivalent practical experience. 8 years of experience in computing infrastructure, networking, operating systems, or hardware. 5 years of experience managing technical teams. Experience working with Enterprise customer service delivery. Ability to communicate in German and English fluently to support client relationship management in this region.", "preferred_qualifications": "Experience initiating and executing strategic initiatives in a global environment. Experience working in data center environments, building and operating large-scale infrastructure, network and compute architecture and lifecycle, and Linux/Unix system administration. Ability to lead and improve Environmental Health and Safety initiatives. Ability to travel up to 30% of the time as needed.", "responsibilities": "Oversee the day-to-day management of teams within data center operations. Communicate priorities and facilitate hand off of operations to following shift leads. Work together to identify and resolve problems and create solutions for our global computing and network architecture. Manage the implementation of projects within the team. Ensure data center-related priorities are consistent with company objectives.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/100287025596244678"}