{"title": "Account Strategist, Google Customer Solutions (English, Ukrainian, Russian)", "level": "", "location": "Dublin, Ireland", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow.  Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in advertising, sales, marketing, consulting, or media. Ability to communicate in English, Ukrainian, and Russian fluently to manage client relationships in the region.", "preferred_qualifications": "Familiarity with Google Ads and online advertising, with Google Digital Workshop certification or equivalent experience. Ability to own a portfolio in an advertising or media sales context in Ukraine or Belarus, and consistently overachieve quotas to drive growth. Ability to build compelling narratives and utilize storytelling as a client engagement strategy. Ability to influence stakeholders internally and externally to deliver impact. Ability to multi-task and manage multiple projects at a time while paying attention to detail.", "responsibilities": "Deliver against ambitious quarterly business growth and product growth targets. Establish relationships via phone calls or e-mail marketing and conduct regular phone consultations and sales pitches with clients to advise them on how to get the best return on their Google Ads investment. Own a portfolio of small businesses by thoroughly understanding growth drivers, identifying opportunities for growth, managing risks, and building quarterly plans for achievement. Drive customer growth by delivering outstanding customer sales experience and achieving customer business and marketing objectives.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/100337487703876294"}