{"title": "Network Implementation Engineer", "level": "Mid", "location": "Eemshaven, Netherlands", "description": "Our computational challenges are so big and unique we can't just buy our hardware, we've got to make it ourselves. Our Platforms Team designs and builds the hardware, software and networking technologies that power all of Google's services. As a Networking Test Engineer you make sure that our massive and growing network is operating at its peak potential. You have hands-on experience with complex networking equipment, a deep understanding of networking protocols, test design and implementation chops and a background in IP network design. It's your job to make sure Google's cutting-edge technology can perform at scale.", "key_qualifications": "Bachelor's degree in Computer Science, a related technical field, or equivalent practical experience. 4 years of experience in optical networking technologies, including negotiations or business development obtaining services from technology providers in the areas of colocation data centers (space and power), dark fiber, network transport, internet transit, and telecom construction services. Experience with fiber types and their application, physical fiber characteristics, and standard testing tools (e.g., OSA, BERT, OTDR). Experience in telecommunications at carrier class scale and with optical network infrastructure, transmission systems, layer 2/3 routers, and data services.", "preferred_qualifications": "Experience in Dense Wave-Division Multiplexing (DWDM) and Routing topology and architecture. Experience working in a data center. Knowledge of OSP, ISP, AC/DC power systems, environmental controls relay rack, cabinet, or cage construction. Knowledge of basic scripting/programming (e.g., Python/Apps Script/SQL). Knowledge of networking and fundamentals of network troubleshooting at both Layer 1 and Layer 3.", "responsibilities": "Build and operate Google's network at scale. Execute deployment, maintenance, and operations of private data networks worldwide. Develop creative approaches and collaborate with cross-functional teams to keep operational costs low. Monitor the network and repair issues while anticipating needs and escalating issues as needed. Own network documentation, and update and maintain network designs and plans.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/100361148343165638"}