{"title": "Technical Program Manager III, Big Data and Analytics, Google Cloud", "level": "Mid", "location": "Sunnyvale, CA, USA; Kirkland, WA, USA; Seattle, WA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nAs a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You're equally at home explaining your team's analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.\n\nUsing your extensive technical and leadership expertise, you manage projects of various size and scope, identifying future opportunities, improving processes and driving the technical directions of your programs.\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$142,000-$211,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in a relevant field, or equivalent practical experience. 5 years of experience in program management. 5 years experience working with data analytics tools and reporting platforms.", "preferred_qualifications": "Master’s degree, PhD, or equivalent experience in Engineering, Computer Science, or other technical related field. 5 years of experience managing cross-functional and/or cross-team projects. Experience with data analysis using various scripting languages, tools, and/or platforms. Experience with data, data architecture, modeling, trends analysis, statistics, and program evaluations.", "responsibilities": "Collaborate with team members and stakeholders to understand or identify defined work problems and program goals, obtain prioritized deliverables, and discuss program impact. Prioritize program goals, understand and translate other stakeholders’ needs into program goals and prioritized deliverables with minimal assistance, and contribute to decisions on prioritizing goals and deliverables. Define the scope of projects and develop, execute, and/or manage project plans for supported program(s). Review key metrics pertaining to a program, monitor potential metric deviations, and define corrective actions for critical deviations. Identify, communicate, and collaborate with relevant stakeholders within one or more teams to drive impact and work toward mutual goals. Build, maintain and enhance business, operational, and management dashboards.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/100494245957116614"}