{"title": "Systems Development Engineer, SaaS Protection", "level": "Mid", "location": "Hyderabad, Telangana, India", "description": "Systems Development Engineering (SDE) at Google is a role where you manage services and systems at scale. SDEs creatively put their engineering discipline to use automating the mundane and reducing toil. We don’t just write code to fix bugs, but emphasize the development of tools and solutions that fix classes of problems. We know it’s hard to control what you can’t measure – so we focus on observability: instrumenting first, then turning data into knowledge, and finally knowledge into action. We know that the operational efficiency of Google systems, services, virtual compute environments and the operating systems that power them impact the environment, not just the bottom line. We know that working together we can do more, and that community matters.\n\nGoogle brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow.\n\nTogether we engineer and build the infrastructure, tools, access and telemetry for systems that enable orchestration of Google-scale services. Come build things that matter.\n\nThe Core team builds the technical foundation behind Google’s flagship products. We are owners and advocates for the underlying design elements, developer platforms, product components, and infrastructure at Google. These are the essential building blocks for excellent, safe, and coherent experiences for our users and drive the pace of innovation for every developer. We look across Google’s products to build central solutions, break down technical barriers and strengthen existing systems. As the Core team, we have a mandate and a unique opportunity to impact important technical decisions across the company.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 3 years of experience in Linux system administration, troubleshooting, scripting, and networking.", "preferred_qualifications": "Experience with automation, systems design, and implementation. Experience with SaaS platform administration. Understanding of complex IT infrastructure, security standards, and ability to troubleshoot issues. Ability to adjust quickly to changing priorities and make progress in areas where a high ambiguity and uncertainty exist with minimal guidance. Strong customer service, documentation, prioritization, multitasking, communication, and leadership skills. Systematic problem-solving approach, coupled with a strong sense of ownership and drive.", "responsibilities": "Deploy and automate third-party security products used to protect Google SaaS footprint. Write code to manage SaaS platforms and automate routine tasks (Python, Bash, Go, etc.). Respond to tickets within team defined Service Level Objectives (SLO).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/100535952773915334"}