{"title": "Program Manager I, Software Engineering, Search", "level": "Early", "location": "Mountain View, CA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nIn Google Search, we're reimagining what it means to search for information – any way and anywhere. To do that, we need to solve complex engineering challenges and expand our infrastructure, while maintaining a universally accessible and useful experience that people around the world rely on. In joining the Search team, you'll have an opportunity to make an impact on billions of people globally.", "salary": "$99,000-$145,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 1 year of experience in program management. Experience working in an engineering environment. Experience partnering with cross-functional teams including UX Design and Product Management.", "preferred_qualifications": "Master's degree or equivalent practical experience. 3 years of experience in program management. Ability to work with engineers and technology. Ability to learn technical material, processes, and applications.", "responsibilities": "Execute against existing team-level projects and processes with defined scope and complexity, in partnership with program managers.\nMonitor and communicate progress, risks, and mitigations for defined programs, utilize and improve program management tools to support the needs of the program.\nPartner with other program managers to drive operational efficiencies across the programs.\nExecute processes and drive projects that have well-defined scope, manage the activities that lead to successful outcomes of immediate team objectives.\nManage project schedules, identify possible issues, and communicate to project stakeholders.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/100558074741170886"}