{"title": "Growth Consultant, AppDev, Google Customer Solutions", "level": "Mid", "location": "New York, NY, USA", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. In this role, you will work with the most sophisticated Apps customers in AMER to help them optimize their user acquisition strategy with Google Ads. Specifically, you will deliver client engagements on data science/measurement consulting projects (e.g., pLTV, event selection, incrementality), lead hypothesis-driven client analysis to surface actionable insights, and develop GoogleSQL/Google Workspace Scripts/Python scripts to enable advanced client reporting and ad tech automation. You’ll also be working directly with the AppDev Sales Leadership team, Global Growth Consultants and key cross-functional teams like Strategy, Product, Marketing, and Technical Leads to help find new business opportunities for our business and customers. You’ll present those to leadership, go get their buy-in and influence their decision making. Once done, you’ll be able to coordinate and execute end-to-end scalable growth projects at both regional and global level. When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the 'human face' of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in business or media analytics, consulting, digital media, marketing, financial analysis, or another quantitative field. Experience using SQL to extract and manipulate data, or with other programming or scripting languages such as R, Python or ad tech automation.", "preferred_qualifications": "Experience consulting businesses to influence strategic changes in their resource and budget allocations. Understanding of statistical modeling and quantitative analysis techniques. Familiarity with machine learning methodologies including data cleansing, normalization, feature engineering, model training/validation and automation. Ability to analyze large datasets with the goal of delivering actionable insights. Ability to speak with external stakeholders and agency clients at all levels in both technical and business discussions. Strong problem-solving, project management, and analytical skills.", "responsibilities": "Partner with internal and external product, research, data, and measurement teams to deliver full measurement solutions to customers. Own the measurement conversation and be comfortable leading client conversations and projects related to measurement. Advise Google clients and agencies on best practices for marketing analytics within the broader context of industry standards and options. Provide ongoing customer consultation on how to implement best practices. Scale measurement impact internally by upskilling AppDev sales growth managers.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/100556836515521222"}