{"title": "Data Engineer I, Professional Services, Google Cloud", "level": "Mid", "location": "Austin, TX, USA; Atlanta, GA, USA; Boulder, CO, USA; Chicago, IL, USA", "description": "The Google Cloud Consulting Professional Services team guides customers through the moments that matter most in their cloud journey to help businesses thrive. We help customers transform and evolve their business through the use of Google’s global network, web-scale data centers, and software infrastructure. As part of an innovative team in this rapidly growing business, you will help shape the future of businesses of all sizes and use technology to connect with customers, employees, and partners. As a Data Engineer, you will guide customers on how to ingest, store, process, analyze, explore, and visualize data on Google Cloud Platform. You will lead data migrations and transformations, partner with clients to architect scalable data processing systems, build efficient data pipelines, and resolve platform challenges. In this role, you will collaborate with Google's strategic cloud customers and our team to successfully implement Google Cloud products. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$118,000-$174,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Mathematics, a related field, or equivalent practical experience. 3 years of experience with data processing software (e.g., Hadoop, Spark, Pig, Hive) and algorithms (e.g., MapReduce, Flume). 3 years of experience in Google Cloud. Experience managing client-facing projects, troubleshooting technical issues, and working with Engineering and Sales Services teams. Experience programming in Python and SQL.", "preferred_qualifications": "Experience in technical consulting. Experience working with data warehouses, including data warehouse technical architectures, infrastructure components, ETL/ELT, and reporting/analytic tools and environments. Experience working with Big Data, information retrieval, data mining, or machine learning. Experience in building multi-tier high availability applications with modern web technologies (e.g., NoSQL, MongoDB, SparkML, TensorFlow). Experience architecting, developing software, or internet scale production-grade Big Data solutions in virtualized environments.", "responsibilities": "Act as a trusted technical advisor to customers and solve complex Big Data challenges. Create and deliver best practice recommendations, tutorials, blog articles, sample code, and technical presentations, tailoring approach and messaging to varied levels of business and technical stakeholders. Analyze on-premises and cloud database environments and consult on the optimal design for performance and deployment on Google Cloud Platform. Travel regularly up to 30% of the time, in-region for meetings, technical reviews, and onsite delivery activities. Communicate effectively via video conferencing for meetings, technical reviews, and onsite delivery activities.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/100884435146023622"}