{"title": "Software Engineer, Google Cluster Management, Borg", "level": "Mid", "location": "Warsaw, Poland", "description": "The Cluster Management (Borg) team is responsible for critical software that configures and runs Google data centers. We are a tightly knitted team of developers that work on various aspects of the stack, starting with node agent, going through control planes, workload optimization engines, and finishing at fleet-wide, single pane of glass UIs spanning the planet-scale distributed computing system. As part of the team, you’ll be responsible for analyzing, designing, and implementing features affecting all services at Google. Our typical projects run the gamut of distributed computing, node operating system development, new features, and platform support. Our place as a core infrastructure team allows our work to have a tremendous impact on the entire company and make Google engineers operational toil much smaller. In this role, you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.", "salary": "", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree. 2 years of experience with data structures or algorithms. Experience in software development with C/C++. Experience in back-end coding.", "preferred_qualifications": "Master's degree or PhD in Computer Science or related technical fields. Experience developing accessible technologies. Experience in concurrency, multithreading, and synchronization. Understanding of the Linux ecosystem.", "responsibilities": "Write product or system development code. Participate in, or lead design reviews with peers and stakeholders to decide amongst available technologies. Review code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency). Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback. Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/101030180767572678"}