{"title": "Test Automation Engineer, Pixel Graphics and Video", "level": "", "location": "Warsaw, Poland", "description": "At Google, our philosophy is build it, break it and then rebuild it better. That thinking is at the core of how we approach testing at Google. Unlike roles with similar names at the other companies, Test Engineers at Google aren't manual testers -- you write scripts to automate testing and create tools so developers can test their own code. As a Test Engineer, you navigate Google's massive codebase, identify weak spots and constantly design better and creative ways to break software and identify potential problems. You'll have a huge impact on the quality of Google's growing suite of products and services.\n\nYou independently plan and execute own work assignments, write and generate comprehensive test plans for large integration, system, or end-to-end testing for nontrivial features or small-sized projects. As a Test Automation Engineer, you will make sure that our software and hardware components which form the foundation of the Android Graphics stack hold up to quality and reliability over the lifespan of Pixel devices. You will work closely with other Test Engineering teams and Technical Program Managers to plan, scope, and guide the test automation specifically for our team. The Google Pixel team focuses on designing and delivering the world's most helpful mobile experience. The team works on shaping the future of Pixel devices and services through some of the most advanced designs, techniques, products, and experiences in consumer electronics. This includes bringing together the best of Google’s artificial intelligence, software, and hardware to build global smartphones and create transformative experiences for users across the world.", "key_qualifications": "Bachelor's degree or equivalent practical experience. \n2 years of experience in coding, developing test methodologies, writing test plans, creating test cases, and debugging. \nExperience in Python, Go, and Shell scripting. \nExperience in Android OS.", "preferred_qualifications": "Master's degree in Computer Science, Electrical Engineering, or a related field. \n2 years of experience in specialized testing such as production testing, system integration testing, etc. \nExperience in test-driven development, debugging, building tools, and testing frameworks. \nExperience in Android test environments (e.g., test, tradefed, and cts-runner).", "responsibilities": "Develop test plans based on product excellence/test strategy. Help execute test plan reviews with peers. \nDevelop, configure, and own automation of a variety of test cases, ranging from customized test executables over Android Compatibility Test Suite (CTS) up to long-time system stability tests. \nWork with executive engineers in the Pixel GPU Software team to identify test coverage shortcomings, and to define steps towards improvements. \nMonitor, evaluate, and report on test status, quality metrics, and test capacity/system load figures. \nIdentify regression points in our projects' build histories.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/101262105042133702"}