{"title": "Staff Software Engineer, Site Reliability Engineering", "level": "Advanced", "location": "Bengaluru, Karnataka, India", "description": "Site Reliability Engineering (SRE) combines software and systems engineering to build and run large-scale, massively distributed, fault-tolerant systems. SRE ensures that Google Cloud's services—both our internally critical and our externally-visible systems—have reliability, uptime appropriate to customer's needs and a fast rate of improvement. Additionally SRE’s will keep an ever-watchful eye on our systems capacity and performance. Much of our software development focuses on optimizing existing systems, building infrastructure and eliminating work through automation. On the SRE team, you’ll have the opportunity to manage the complex challenges of scale which are unique to Google Cloud, while using your expertise in coding, algorithms, complexity analysis and large-scale system design. SRE's culture of diversity, intellectual curiosity, problem solving and openness is key to its success. Our organization brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow.", "key_qualifications": "Bachelor’s degree in Computer Science, a related field, or equivalent practical experience. 8 years of experience in algorithms, data structures, analysis, software design or Unix/Linux systems, IP networking, performance and application issues. 5 years of experience programming in one or more of the following languages: C, C++, Java, Python, Go, Perl, or Ruby. 3 years of experience leading projects and designing, analyzing, and troubleshooting distributed systems.", "preferred_qualifications": "Experience in an engineering or operations role in enterprise applications or other large-scale enterprise space. Experience in navigating enterprise software, deployment, and management of workloads in the cloud. Experience in problem-solving and analyzing complex enterprise systems.", "responsibilities": "Architect, design, and execute on projects to improve the reliability posture of critical applications. Drive technical interactions with business partners to come up with innovative ideas in terms of improving reliability for enterprise applications. Help the team focus and choose impactful projects, and deliver to completion. Leverage Google Site Reliability Engineering (SRE) strategies to span Google Cloud Platform (GCP) and the Google stack. Be a technical lead for a team in Bengaluru.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/101257296826245830"}