{"title": "Technical Account Manager", "level": "", "location": "Gurugram, Haryana, India", "description": "gTech’s Professional Services team takes a creative, collaborative, and customer-centric approach to provide foundational services and forward-looking business solutions to top advertiser and publisher customers. Through technical implementation, optimization, and key solutions, gTech Professional Services helps customers attain their business goals while building long-term capabilities. Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products. To learn more about gTech, check out our video.", "key_qualifications": "Bachelor’s degree or equivalent practical experience. Experience in either system design or in one programming language (Java, C++, Python, etc.). Experience in technical troubleshooting, and managing internal/external partners or customers.", "preferred_qualifications": "Familiarity with the ad serving industry and internet technologies. Familiarity with Android development. Ability to absorb complex technical concepts and convey them to a non-technical audience effectively. Data analysis and good data-driven, decision-making skills.", "responsibilities": "Help partners in their day-to-day challenges by delivering innovative and scalable solutions to their problems, troubleshooting their issues, and performing implementation reviews. Advocate new product features and ensure the prompt and proper resolution of technical challenges. Represent clients’ feedback on features to Product Management and Engineering to improve product offerings. Ensure high-level client satisfaction (both new and ongoing) in terms of technical aspects by providing necessary documentation and technical guidance.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/101271590477406918"}