{"title": "Data Center Facilities Technician, Electrical", "level": "", "location": "London, UK", "description": "The Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facilities Technicians at Google data centers operate, monitor and support physical facilities conditions. Some of these duties will include heating and cooling of air and water, power supply, generators, UPS systems, electrical distribution and control and monitoring systems. You regularly help inspect, maintain and repair various data center systems such as piping and non-critical electrical or mechanical system components). You provide daily assistance to senior technicians as you read blueprints/schematics, conduct tours of systems and assess their working order.\n\nAs an advocate for best practices, you develop creative approaches to reducing operational costs while improving overall data center efficiency. You ensure that environmental and safety standards are consistently met, identifying problems and making repairs quickly. In emergency situations or abnormal conditions, you manage data center performance issues and outages to minimize the recovery time from failures. As a Data Center Facilities Technician, you will operate, monitor, and support physical facilities conditions for our data centers.", "key_qualifications": "Associate's degree, trade school certification, or other certified training in a related technical field, or equivalent practical experience. 2 years of electrical experience (e.g., electrical testing equipment or electrical distribution) in an industrial or commercial environment. Ability to lift and move 50 lbs of equipment under raised floors, and the required use of OSHA standard safety equipment such as limited weight bearing work platforms, ladders, step stools and Personal Protective Equipment (PPE) like safety harnesses. Ability to work non-standard hours and work rotations/shifts.", "preferred_qualifications": "2 years of experience in maintenance of electrical distribution systems or construction/technical environment or a related field. Experience in data centers, hospitals, or power plants. Knowledge of electrical systems used in a data center environment (e.g., Feeders, Transformers, Generators, Switchgear, UPS systems, ATS/STS units, PDU/PMM units). Knowledge of meters, devices, sensors, and troubleshooting utilizing standard hand tools, digital metering, or calibration/diagnostic equipment. Ability to communicate with contractors who perform maintenance or upgrade work on the data center systems.", "responsibilities": "Inspect, maintain, and repair various data center systems. Provide daily assistance to technicians as you read blueprints/schematics/sequence of operations, conduct tours of systems, and assess their working order. Manage the uptime and maintenance of UPS, generators, electrical distribution, and control and monitoring systems. Operate, monitor, maintain, and respond to abnormal conditions in the data center facilities systems and equipment. Support startup, commissioning, and integration of new electrical equipment and systems into facilities infrastructure.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/101369565325206214"}