{"title": "Senior Interaction Designer, Risk and Compliance Engineering", "level": "Mid", "location": "Hyderabad, Telangana, India", "description": "At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" Google’s Interaction Designers take complex tasks and make them intuitive and easy-to-use for billions of people around the globe. Throughout the design process—from creating user flows and wireframes to building user interface mockups and prototypes—you’ll envision how people will experience our products, and bring that vision to life in a way that feels inspired, refined, and even magical.\nGoogle User Experience (UX) is made up of multi-disciplinary teams of UX Designers, Researchers, Writers, Content Strategists, Program Managers, and Engineers: we care deeply about  the people who use our products. The UX team plays an integral part in gathering insights about the attitudes, emotions, and behaviors of people who use our products to inspire and inform design. We collaborate closely with each other and with engineering and product management to create industry-leading products that deliver value for the people who use them, and for Google’s businesses.\nAs an Interaction Designer, you’ll rely on user-centered design methods to craft industry-leading user experiences—from concept to execution. Like all of our UX jobs, you’ll collaborate with your design partners to leverage and evolve the Google design language to build beautiful, innovative, inspired products that people love to use. The Risk and Compliance Engineering (RCE) team builds solutions to protect users' trust and drive impact. As part of the RCE UX team, you will work with designers, researchers, Product Managers, and engineers in a product-oriented environment. The teams collaborate across Global Affairs, Core, and Trust and Safety.\nAt Corp Eng, we build world-leading business solutions that scale a more helpful Google for everyone. As Google’s IT organization, we provide end-to-end solutions for organizations across Google. With an inclusive mindset, we deliver the right tools, platforms, and experiences for all Googlers as they create more helpful products and services for everyone. In the simplest terms, we are Google for Googlers.", "salary": "", "key_qualifications": "Bachelor's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 6 years of experience with interaction design in product design or UX design. Include a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link or access instructions).", "preferred_qualifications": "6 years of experience with UX or Interaction Design. Knowledge of the user-centered design methodologies, with the ability to partner with UX Research. Ability to work within an established system. Excellent analytical, problem-solving, and critical-thinking skills. Excellent core interaction design skills. Excellent communication and teamwork skills.", "responsibilities": "Collaborate cross-functionally and lead the user experience. Manage stakeholder relationships and expectations across a range of work-streams, and contribute to a positive team environment. Build relationships with peers and leaders to drive user experiences that are cohesive, inclusive, and well-informed. Collaborate to reinforce best practices and UX consistency across Risk and Compliance Engineering.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/101477519663735494"}