{"title": "Program Manager, Data Center Environmental, Health and Safety", "level": "Mid", "location": "Phoenix, AZ, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience working in an environmental, health and safety (EHS) role in an industrial setting (e.g., warehouses, plants, manufacturing, fabrication facilities, etc.). 2 years of experience in program or project management.", "preferred_qualifications": "Bachelor's degree in Environmental Science, Occupational Health and Safety, Earth Science, a related discipline, or equivalent work experience. Board certifications such as Certified Safety Professionals (CSP) or Certified Hazardous Materials Manager (CHMM) or other EHS-related certifications. 5 years of experience in risk management with environmental, health and safety issues. Experience within data center operations. Experience communicating with Federal, State and Local Authorities regarding EHS issues.", "responsibilities": "Identify and evaluate operational environmental, health and safety risks for impact to the business, analyzing risk scenarios to determine their potential impact to the business and design programs to mitigate those risks. Ensure compliance with applicable environmental, health and safety regulations including environmental permits/programs. Investigate and analyze incident reports involving work‐related injuries and illnesses and recommend measures to prevent recurrence. Conduct assessments of existing environmental, health and safety programs to ensure alignment with regional Google Data Center strategy, including analyzing environmental, health and safety business risks and identifying, describing and estimating efficiencies to be gained through established programs. Assess environmental, health and safety training needs based on identified operational risks and ensures that workforce training activities are provided to meet business and legislative requirements.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/101582098023752390"}