{"title": "Silicon Engineer, Embedded Systems", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.\nThe Silicon Software team has the long-term charter to develop software for a variety of custom silicon being developed for both internal and external customers. This includes IP for many diverse applications. We’re working generations ahead of the market to enable novel features. In this role, you will develop high performance and low power hardware and software to enable Google’s continuous innovations in mobile image and AI processing. You will also develop the software platform support, firmware, and drivers for the Google Tensor mobile SoC.\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "salary": "", "key_qualifications": "Bachelor's degree in Electrical Engineering, Electronics Engineering, or Computer Engineering, or equivalent practical experience.2 years of experience in embedded coding.Experience with embedded systems, kernel, Linux, RTOS, or Firmware device driver.", "preferred_qualifications": "Experience with interface protocols (e.g., USB, SPI, I2C, UART, UFS, PCIe), software stacks, drivers, and system memory drivers.Experience with ARM or other low-power SoC architectures.Experience in computer science, data structures, algorithms, and software design.Experience working with hardware designers/reading schematics.Knowledge of embedded systems development, RTOS concepts, device drivers and hardware/software integration.Knowledge of ARM or x86 assembly, system BIOS, Linux kernel, device drivers.", "responsibilities": "Work to enable applications for devices.Develop new software, hardware, and system architecture to support future applications.Design, develop, and test embedded software drivers for the next generation smart devices.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/101533755281154758"}