{"title": "Staff Silicon System Architect, Silicon", "level": "Advanced", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "Google's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Engineering, Computer Science, a related field, or equivalent practical experience. 8 years of experience working with mobile or embedded SoCs. 5 years of experience in one or more areas in ARM CPU, memory management, system coherency, or hardware acceleration.", "preferred_qualifications": "Master's degree or PhD in Electrical Engineering, Computer Engineering or Computer Science, with an emphasis on computer architecture. Experience in writing low level system code or device drivers to program hardware. Experience in Gem5 or similar simulation of SoC and hardware architecture analysis. Knowledge of interactions between hardware and software for different types of standard hardware blocks, including ARM CPU, memory management, coherency and accelerators.", "responsibilities": "Collaborate with stakeholders such as product management, architecture, silicon architecture, silicon implementation, silicon software, and product software engineering, to identify user experiences characteristics and how they can be mapped into hardware. Understand interactions between hardware components and work towards the definition of architecture and block’s interactions design, providing options and/or trade-offs, identifying issues and driving them to resolution. Design architecture and software interfaces that enable a software programming model that can delight our application developers, and allow them to use hardware accelerators seamlessly and timely. Design architecture that assures security and privacy of the data for applications that are sensitive to it. Adopt and/or develop the software architecture modeling platform to model features requests, and support their inclusion in the hardware using a data-driven approach about their benefits.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/101545451215299270"}