{"title": "Senior Software Engineering Manager, Core", "level": "Advanced", "location": "Mexico City, CDMX, Mexico", "description": "Like Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers. You not only optimize your own code but make sure Engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way. With technical and leadership expertise, you manage engineers across multiple teams and locations, a large product budget and oversee the deployment of large-scale projects across multiple sites internationally. The Core team builds the technical foundation behind Google’s flagship products. We are owners and advocates for the underlying design elements, developer platforms, product components, and infrastructure at Google. These are the essential building blocks for excellent, safe, and coherent experiences for our users and drive the pace of innovation for every developer. We look across Google’s products to build central solutions, break down technical barriers and strengthen existing systems. As the Core team, we have a mandate and a unique opportunity to impact important technical decisions across the company.", "key_qualifications": "- Bachelor's degree or equivalent practical experience.\n- 8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).\n- 5 years of experience in a technical leadership role; overseeing projects, with 5 years of experience in a people management, supervision/team leadership role.", "preferred_qualifications": "- Master's degree or PhD in Computer Science or related technical field.\n- 5 years of experience working in a complex, matrixed organization.\n- Experience delivering developer tools, languages, AI Agents and ML models.\n- Experience in building and deploying full-stack applications and servers.\n- Experience in developer focused products aimed at improving developer productivity.", "responsibilities": "- Set and communicate team priorities that support the broader organization's goals. Align strategy, processes, and decision-making across teams.\n- Set clear expectations with individuals based on their level and role and aligned to the broader organization's goals. Meet regularly with individuals to discuss performance and development and provide feedback and coaching.\n- Develop the long-term technical goal and roadmap within, and often beyond, the scope of the teams. Evolve the roadmap to meet anticipated future requirements and infrastructure needs.\n- Oversee systems designs within the scope of the broader area, and review product or system development code to solve ambiguous problems.\n- Review code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/101628431392744134"}