{"title": "Customer Solutions Engineer, gTech (English, Portuguese)", "level": "Early", "location": "São Paulo, State of São Paulo, Brazil", "description": "gTech’s Professional Services team takes a creative, collaborative, and customer-centric approach to provide foundational services and forward-looking business solutions to top advertiser and publisher customers. Through technical implementation, optimization, and key solutions, gTech Professional Services helps customers attain their business goals while building long-term capabilities. As a Customer Solutions Engineer, you will develop innovative solutions to the business problems faced by advertisers. You will work as a critical technical partner for our Sales teams to solve complex problems and develop answers to questions. You will identify and prioritize projects and develop solutions. Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, Engineering, or equivalent practical experience. Experience working with web technologies (e.g., HTML, CSS, JavaScript, or HTTP). Experience coding with one or more programming languages (e.g., Java, C/C++, Python). Experience in technical troubleshooting, and managing internal/external partners or customers. Ability to communicate in English and Portuguese fluently to support client relationship management in this region.", "preferred_qualifications": "Experience with big data platforms and large volume data analytics. Ability to multi-task and manage multiple projects simultaneously.", "responsibilities": "Provide technical consulting services and guidance around Google APIs and Cloud platforms to help clients develop cutting-edge applications across products. Work closely with customers to understand underlying business issues. Build relationships with the Sales team and customers. Identify and develop innovative technical solutions that lead to more advertising business. Work across Sales, Support and Product teams to provide innovative solutions to real-world issues. Propose, design, create and present prototypes, demos and proof-of-concepts to a wide variety of audiences, from engineers to marketing professionals. Leverage Google’s Cloud infrastructure and big data analytics systems to achieve goals.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/101730255068111558"}