{"title": "Manager, Government Affairs and Public Policy (English, Spanish)", "level": "Advanced", "location": "Santiago, Chile", "description": "As a member of Google’s Government Affairs and Public Policy team, you'll be part of a diverse global government affairs team, working across regions, product areas, and functions. You’ll combine creativity and intellectual excellence with the organizational skills to manage various campaigns, projects and initiatives. In this role, you’ll advocate for Google to bring external perspectives back into the company to inform our perception and direction. You're passionate about the opportunity to shape the future of how we use and build technology for everyone.", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 10 years of experience with digital policy issues within multilateral organizations, government, think tanks, regulatory agencies, corporate public policy teams, or relevant industry associations. Ability to communicate in English and Spanish fluently to engage with local stakeholders.", "preferred_qualifications": "Experience advising and collaborating with cross-functional stakeholders on policy strategies. Experience working with or in government, NGOs, regulatory agencies, or corporate public policy teams. Experience advocating for digital-related policies: trade, privacy, AI, Cloud, digital/audiovisual content, digital market competition and regulation, digital economy. Knowledge of Internet technologies and the policy environments that surround them. Understanding of the Latin American political landscape including multilateral organizations, trade associations, and think tanks operating in the region. Excellent leadership skills, with the ability to build partnerships and drive forward complex initiatives involving multiple internal or external stakeholders.", "responsibilities": "Develop and lead public policy campaigns across the full range of policy areas that impact Google and the web. Develop and lead high-impact projects and strategic initiatives with multilateral organizations, and other regional stakeholders (including civil society and industry groups) to advance Google’s policy and business priorities. Engage with multilateral organizations, policymakers, industry players, think tanks, civil society, and key opinion formers to shape policy and political dialogue on Google’s policy efforts. Work closely with Legal, Communications, Marketing, and other teams across Google to execute programs on policy priorities. Monitor, research, identify, and analyze current and emerging public policy issues, considering how Google should work with allied organizations and industries.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/102079054529602246"}