{"title": "Staff Software Engineer, Database Efficiency and Performance", "level": "Advanced", "location": "Sunnyvale, CA, USA", "description": "Google Cloud's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google Cloud's needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. You will anticipate our customer needs and be empowered to act like an owner, take action and innovate. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. The team focuses on the evaluation, analysis, design, debugging, and optimization of Google's storage, data analytics, and database platforms, and partners with Spanner, Bigtable, Sawmill Logs, Search Indexing, Napa, BigQuery, and Flume teams to drive performance optimizations and resource efficiency. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$189,000-$284,000 + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). 7 years of experience building and developing infrastructure, distributed systems, networks, compute technologies, storage, or hardware architecture. 5 years of experience testing, and launching software products, and 3 years of experience with software design and architecture.", "preferred_qualifications": "Master's degree or PhD in Computer Engineering, Electrical Engineering, or Computer Science. Experience with software engineering, system architecture, computer architecture, databases, data analytics, or performance optimization. Experience with performance optimization of systems through analysis across the hardware/software stack, application, system architecture, and processor micro-architecture. Experience with research on database systems, operating systems, or computer architecture. Experience with tools for performance profiling/analysis and statistical analysis, benchmark development, computer architecture. Knowledge of database or analytics workloads.", "responsibilities": "Drive cross-functional efforts on performance optimization and analysis for key database applications on current and future hardware and software systems infrastructure. Develop engineering driven methodology to analyze the current state, and inform the system architecture and design of future data processing hardware/software systems deployed in Google data-centers. Drive influence of hardware/software roadmaps, internally and externally to meet requirements and improve performance by defining the custom compute platforms for data-centric applications. Identify RAM/GCU efficiency opportunities, and design innovation solutions to improve efficiency while maintaining reliability and latency requirements. Develop and execute a roadmap and execute implementation in concert with product areas to deliver value.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/102242023305552582"}