{"title": "Technical Program Manager II, Privacy Sandbox, Android", "level": "Mid", "location": "London, UK", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.", "key_qualifications": "Bachelor's degree in Computer Science, a technical field, or equivalent practical experience.\n2 years of experience in program management.\nExperience with the android platform and ecosystem.", "preferred_qualifications": "2 years of experience managing cross-functional or cross-team projects.\nExperience in building Automation infrastructure/Test scripts on iOS/Android and other Mobile platforms.\nExcellent influencing and stakeholder management skills.", "responsibilities": "Manage a portfolio of complex projects and workstreams, and responsible for overall program strategy, governance, operating model, and program operations.\nBe responsible for program scoping, planning, creating, and managing integrated schedules, setting milestones, and program tracking.\nUse leadership, product and technical judgment to drive program delivery, working closely with engineering, product management, UX and other partner teams.\nNavigate multiple, interdependent work streams, functional and technical concepts, and conversations across different areas and stakeholders to drive collaboration and consensus.\nManage program execution and issues as they arise through design, development, test, and deploy.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/102203711123530438"}