{"title": "Principal Engineer, Video Formats, YouTube", "level": "Director+", "location": "San Bruno, CA, USA", "description": "The YouTube Infrastructure team provides reliable, scalable, and performant experiences for YouTube’s billions of users. The team is responsible for overall resource management and video infrastructure, leveraging Google’s immense technical infrastructure in compute, networking, and storage. The goal is to provide a high quality experience to viewers, no matter the device or location, while reducing overall costs. As the Principal Engineer for Video Formats, you will move forward the state of the art for user generated and traditional broadcast video both on the YouTube platform and in the ecosystem of video production and playback. To deliver the best video experience you will bring a deep understanding of video, down to how pixels are encoded, decoded, and rendered. You will work with open source projects, non-linear editing software providers, mobile video editors, and broadcast video vendors to influence and build an exceptional video platform. The emergence of generative AI produced video and audio brings unique opportunities for new storytelling techniques. Since the team delivers critical infrastructure for YouTube’s large suite of products and features, and relies on Google infrastructure, critical to this role is rapidly establishing trust among a diverse set of internal stakeholders within YouTube and Google. At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.", "salary": "$278,000-$399,000 + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree in Computer Science, a related field or equivalent practical experience. 15 years of experience in software engineering. 10 years of experience working with video compression technologies and formats, including video codecs and streaming protocols. Experience building relationships in external ecosystem of video vendors, editors, and open source projects.", "preferred_qualifications": "Experience leading and influencing cross-functional technical teams. Experience with machine learning-based video processing and generative AI. Experience making successful contributions to open source video projects or standards, and strong industry network and relationships with key video technology partners. Experience in product development and bringing video technologies to market. Deep understanding of video quality metrics and optimization techniques.", "responsibilities": "Provide technical vision and strategy for video formats by designing and leading a multi-year technical roadmap. Drive cross-functional partnerships across YouTube teams, Chrome, Android, and other Google teams. Influence industry technical open standards and key partnerships. Develop and lead video encoding strategy across creation client and server processing. Partner closely with senior leadership in Engineering and Product Management to ensure alignment with engineering and product priorities.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/102667588193919686"}