{"title": "Policy Enforcement Manager, Partner Program, YouTube", "level": "", "location": "Hyderabad, Telangana, India", "description": "Fast-paced, dynamic, and proactive, YouTube’s Trust & Safety team is dedicated to making YouTube a safe place for users, viewers, and content creators around the world to belong, create, and express themselves. Whether understanding and solving their online content concerns, navigating within global legal frameworks, or writing and enforcing worldwide policy, the Trust & Safety team is on the frontlines of enhancing the YouTube experience, building internet safety, and protecting free speech in our ever-evolving digital world.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in data analytics, Trust and Safety, policy, cyber-security, or a related field.", "preferred_qualifications": "Experience in driving large, cross-functional projects. Experience in SQL. Ability to create new processes and iterate on existing workflows. Ability to navigate ambiguity. Excellent technical and investigative skills to frame solutions using data. Excellent communication skills to drive consensus across stakeholders.", "responsibilities": "Demonstrate an understanding of how our YouTube Partner Program (YPP) policies impact YouTube users, platform changes and new product launches, daily content review in line with YouTube's YPP policies, including exposure to graphic, controversial and sometimes offensive content. Manage policy enforcement escalations and develop new enforcement guidelines for YPP, delivering training to reviewers and providing expert enforcement advice on grey policy areas. Support YPP workflows including tooling improvements and scaled workflow optimization. Keep the creator in mind and ensure workflows reflect policy guidelines. Work closely with global vendors to enforce sensitive policies and ensure high quality. Work non-standard, on-call rotation weekend and holiday hours.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/102969996304360134"}