{"title": "Distinguished Engineer, Advanced Data Analytics, Google Cloud", "level": "Advanced", "location": "Sunnyvale, CA, USA", "description": "In this role, you will define the long-term technical and innovation strategy for Data Analytics and bring your point of view on technology leadership, research, and industry trends. You will employ a hybrid approach of direct technical guidance, mentorship, high-level consulting, and risk/growth management. You will also collaborate with the Data Analytics leadership team. Google Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor’s degree in Computer Science, Engineering, a similar technical field of study, or equivalent practical experience\n15 years of professional software engineering experience\nExperience in analytics, including generative AI, responsible AI and real time data processing", "preferred_qualifications": "Experience as a thought leader in data analytics and AI/ML, and experience in technology innovation\nExperience in AI/ML quality evaluation and improvement, including managing tuning techniques with cost/benefit tradeoffs\nAbility to promote product excellence and collaboration driving a portfolio of concurrent engineering projects (e.g., short-term critical feature launches to long-term research initiatives)\nPassionate about delighting enterprise customers, with an excellent understanding of enterprise workloads", "responsibilities": "Co-lead the technology and innovation strategy for Data Analytics with a focus on Generative AI, Machine Learning and their connection to big data, realtime data, and Business Intelligence (BI) systems.\nAssess long-term technological investments, and calibrate opportunities against each other and available bandwidth.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/103026635105542854"}