{"title": "Urban Mobility Partner Data Engineer, Geo", "level": "", "location": "Dublin, Ireland", "description": "In this role, you will be responsible for the technical relationship of our largest advertising clients or product partners. You will lead cross-functional teams in Engineering, Sales and Product Management to leverage emerging technologies for our external clients/partners. You will balance business and partner needs with technical constraints, develop innovative, cutting edge solutions and act as a partner and consultant. The Geo team is focused on building the most accurate, comprehensive, and useful maps for our users, through products like Maps, Earth, Street View, Google Maps Platform, and more. Every month, more than a billion people rely on Maps services to explore the world and navigate their daily lives. The Geo team also enables developers to use the power of Google Maps platforms to enhance their apps and websites. As they plot a course for the future of mapping, they are solving complex computer science problems, designing beautiful and intuitive product experiences, and improving our understanding of the real world.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 3 years of experience coding in one or more programming languages. 3 years of experience designing data pipelines, and dimensional data modeling for synch and asynch system integration and implementation using internal (e.g., Flume, etc.) and external stacks (DataFlow, Spark, etc.). Experience working with data models by performing exploratory queries and scripts.", "preferred_qualifications": "Master’s degree in Business, Statistics, Mathematics, Economics, Engineering or Applied Science, or related field. Experience writing and maintaining ETLs which operate on a variety of structured and unstructured sources. Experience in planning and managing several large-scale, interrelated, complex technical projects and coordinating technical project team members to deliver quality results within defined timelines. Familiarity with SQL/MySQL and Unix/Linux operating systems and commands. Ability to communicate in German fluently to support client relationship management. Excellent problem-solving and business negotiation skills, with the ability to collaborate with a diverse range of people and job functions including external clients.", "responsibilities": "Provide technical consulting services and guidance around Google Maps partner integrations to external partners. Design, develop and support data pipelines, warehouses and reporting systems to solve business operations, users and product problems. Create, Extract, Transform, and Load (ETL) and report systems for new data using a variety of traditional as well as large-scale distributed data systems. Collaborate and influence stakeholders and support engineers to ensure our data infrastructure meets constantly evolving requirements. Improve product feature offerings by providing partner feedback to internal cross-functional teams including Product Management and Engineering.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/103244643558138566"}