{"title": "Hardware Reliability Engineer, Product Integrity", "level": "Mid", "location": "Mountain View, CA, USA", "description": "As a Reliability Engineer, you will play a key role in creating new consumer electronic products that meet a high bar for reliability and performance. You will work closely with the product management and design engineering teams to define standards, specify tests, and then supervise test execution and failure analysis. A broad engineering background and command of statistical methods will help to inform design of new products. Your strong interpersonal and communication skills will be key to ensuring adoption of your technical recommendations.", "key_qualifications": "Bachelor's degree in Electrical Engineering, Mechanical Engineering, Materials Science, or equivalent practical experience. 6 years of experience in applying Design for Reliability techniques. Experience with statistical analysis (e.g., Monte Carlo Analysis, DoE, SPC, Gage R&R). Experience with JPM or Weibull++ for reliability modeling (e.g., lifetime distribution, degradation analysis, stress-strain analysis).", "preferred_qualifications": "Master's degree or PhD in Hardware Engineering, Electrical Engineering, Mechanical Engineering, or Materials Science. Experience with failure analysis techniques for electrical, mechanical, or optical components. Experience working with overseas manufacturing partners and manufacturing processes. Experience in a leadership role. Ability to travel up to 20% of the time as needed. Ability to summarize and communicate issues to executives.", "responsibilities": "Develop reliability performance metrics and lead management reviews to review progress against those metrics. Lead reliability test planning, methodology, and execution for all aspects of the product. Lead the failure analysis process with internal and external cross-functional teams for all failures discovered during reliability testing. Work in reliability test labs and collaborate closely with Test Engineers. Perform field data analysis, lead reliability testing to real world usage correlation studies, and drive the continuous improvement and refinement of reliability performance metrics. Translate product management reliability goals into appropriate testable goals and perform statistical data analysis, Accelerated Life Testing (ALT) and modeling, and risk assessments.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/103292258974868166"}