{"title": "Embedded Senior Software Engineer, Chrome OS", "level": "Mid", "location": "Kraków, Poland", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.ChromeOS leads the industry in the education market, and has expanded in recent years beyond schools to become the second-most popular desktop operating system. The Android on ChromeOS, allows developers to easily bring their Android apps and games to Chromebooks. It’s a complex space with a range of opportunities to dive into including the Android framework, ChromeOS user experience, gaming, graphics, performance, developer tools, and more.Chrome OS delivers quality computing at scale to provide universal and unfettered access to information, entertainment, and tools. Our mission is to empower anyone to create and access information freely through fast, secure, simple, and intelligent computing.", "salary": "", "key_qualifications": "Bachelor’s degree or equivalent practical experience. Candidates will typically have 5 years of experience with software development in one or more programming languages, and with data structures/algorithms. Typically 3 years of experience testing, maintaining, or launching software products, and 1 year of experience with software design and architecture. Experience in C/C++ or other script and console tooling environments.", "preferred_qualifications": "Master's degree or PhD in Computer Science or related technical field. Candidates will typically have 1 year of experience in a technical leadership role. Experience contributing to or customizing the Android platform. Experience in Unix/Linux environments and kernel drivers. Experience with internals of graphics rendering APIs.", "responsibilities": "Design and develop solutions to improve the performance of Android apps and games running on ChromeOS. Identify bottlenecks and opportunities for improving performance of graphics workloads in ChromeOS. Work closely with other engineers to integrate new graphics features and capabilities into ChromeOS. Build and maintain automated tests to ensure that Android apps meet performance expectations on ChromeOS.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/103379350711083718"}