{"title": "Senior Business Intelligence Analyst, YouTube", "level": "Mid", "location": "New York, NY, USA", "description": "YouTube Analytics and Decision Support (ADS) powers sound business decisions through scaled data and insights for YouTube's business organization. Support ADS improves the experience for YouTube's partners, creators, and users seeking support on YouTube product surfaces, social media engagement, or 1 to 1 channels by empowering Creator Support, Consumer Support, Scaled/Social Support, Vendor Operations, and Support Go-To-Market Solutions through data.", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 4 years of experience in Business Intelligence or Data Analytics. 4 years of experience in SQL and Data Visualization (e.g., Looker, Tableau, Power BI, Qlik, or similar technologies).", "preferred_qualifications": "Master’s degree in a relevant field or equivalent practical experience. 6 years of experience creating dashboards, manipulating datasets, and performing data analysis using SQL and data visualization tools (e.g., Looker, Tableau, PowerBI, Data Studio, etc.). Experience converting ambiguous business requests into technical requirements for insightful data products. Experience working with support or contact center data. Experience with data warehousing or data modeling concepts. Experience with big data technologies (e.g., Hadoop, Spark, Python, or R).", "responsibilities": "Lead development and deployment of “single source of truth” centralized reports, dashboards, models, and tools to analyze, report, and present partnerships and operations related data that is associated with YouTube Support organization. Work with User Support teams to determine key business questions and pain points in existing processes where ADS data products can improve YouTube support outcomes and convert ambiguous business requests into technical requirements for insightful data products. Deliver and contribute to a prioritized roadmap, working cross-functionally with Data Infrastructure (DI) and Business Technology to release product features which empower stakeholders to improve YouTube support outcomes. Deliver data products to User Support teams which drive better decision-making. Aid in the creation of key performance indicators (KPIs) and key results for a selected business domain. Make strategic and operational recommendations to achieve goals.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/103481398395839174"}