{"title": "Software Engineering Manager, Engineering Productivity Platforms", "level": "Advanced", "location": "Kraków, Poland", "description": "Like Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers. You not only optimize your own code but make sure Engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way. With technical and leadership expertise, you manage engineers across multiple teams and locations, a large product budget and oversee the deployment of large-scale projects across multiple sites internationally.", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 8 years of experience with software development in one or more programming languages (e.g., Python and Go). 3 years of experience in a technical leadership role; overseeing projects, with 2 years of experience in a people management, supervision/team leadership role. Experience building distributed infrastructure.", "preferred_qualifications": "Master's degree or PhD in Computer Science, or a related technical field. 3 years of experience working in a complex, matrixed organization.", "responsibilities": "Set and communicate the team priorities that support the broader organization's goals. Align strategy, processes, and decision-making across teams. Set clear expectations with individuals based on their level and role, and align to the broader organization's goals. Meet regularly with individuals to discuss performance, development, and provide feedback and coaching. Develop the long-term technical direction and roadmap within, and often beyond, the scope of our teams. Evolve the roadmap to meet anticipated future requirements and infrastructure needs. Oversee systems designs within the scope of the broader area, and review product or system development code to solve ambiguous problems. Review code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/103580662270698182"}