{"title": "Lead Program Manager, Greenhouse Gas, Carbon Emissions Measurement and Standards", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "As the GHG Emissions Measurement and Standards Lead, you will lead efforts to measure GHG emissions across the company and reform GHG and Net Zero standards and protocols. In this role, you will be responsible for developing a concrete Google-level view of our operational measurement and standards engagement strategy on carbon emissions and drive opportunities for improved alignment. This includes coordinating and working with all operational, reporting and supply chain teams as well as supporting digital infrastructure efforts. You will lead a team that drives coordination across key internal and external stakeholders to identify areas to develop and / or evolve GHG emissions and climate related frameworks and standards.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 10 years of experience in program management, strategy, analytics, and cross-functional planning (e.g., roadmaps, objectives and key results, stakeholder engagement). Experience with Green House Gas (GHG) accounting and emissions reductions metrics and standards.", "preferred_qualifications": "Experience in building and executing strategies for GHG emissions reductions across hardware and IT sector. Experience working in complex carbon measurement projects. Experience in emissions accounting, reporting, auditing and standards interpretations. Experience in data analytics to deliver insights and decisions.", "responsibilities": "Oversee metrics and measurement of GHG emissions in support of operationalizing the company’s NetZero goals. Articulate methodologies for carbon measurement and reductions for Google’s operational footprint. Lead a team that provides methodology support to internal functional stakeholders such as NetZero planning and digital infrastructure. Work with partner teams on data requirements and processes to operationalize GHG measurement across Google and its value chain.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/103619736608088774"}