{"title": "Software Engineer II, Mobile (iOS)", "level": "", "location": "Paris, France", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.", "key_qualifications": "Bachelor’s degree or equivalent practical experience.\n1 year of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).\n1 year of experience with data structures or algorithms.", "preferred_qualifications": "Master's degree in Computer Science or related technical field.\nExperience developing accessible technologies.\nExperience with iOS Applications, Objective-C and C++.", "responsibilities": "Design new user-facing features in Chrome for iOS, in collaboration with your Product Manager and UX designers.\nWith a few peers, implement, test, and launch these features.\nLand and own these features over the long term, making them evolve with the platform and with the product.\nManage project priorities, deadlines, and deliverables.\nWork in the open-source Chromium repository as well as Google’s proprietary code base.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/103648758440305350"}