{"title": "Software Engineer, Google Wallet", "level": "", "location": "Shanghai, China", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. With your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions. People shop on Google more than a billion times a day - and the Commerce team is responsible for building the experiences that serve these users. The mission for Google Commerce is to be an essential part of the shopping journey for consumers - from inspiration to to a simple and secure checkout experience - and the best place for retailers/merchants to connect with consumers. We support and partner with the commerce ecosystem, from large retailers to small local merchants, to give them the tools, technology and scale to thrive in today’s digital world.", "key_qualifications": "Bachelor’s degree or equivalent practical experience.\n1 year of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).", "preferred_qualifications": "Master's degree in Computer Science or related technical field.\nExperience with Android development.\nExperience with digital payment, secure element, Mifare.", "responsibilities": "Develop Google Wallet Application (including GMSCore and the Wallet App) across phones and devices.\nDevelop server side Wallet services.\nBe able to work with cross-functional teams to drive self projects.\nPerform full cycle feature development and launch.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/103684587057488582"}