{"title": "Program Manager, Finance, CTi Finance Optimization Office", "level": "Mid", "location": "Austin, TX, USA", "description": "The Data Strategy and Enablement team is responsible for driving Cloud transformation through building canonical, granular, certified single sources of truth. We work across the Finance organization to gather requirements for data and insights and test and prototype solutions that we scale with Engineering partners. Our Objectives and Key Results (OKRs) reflect our four key priorities this year: Stratus (Cost/Margin), Doppler, CGARD (secure access for SSOTs) and Skyline (Executive Reporting). We partner closely with the Finance Optimization Office (FOO) BI to deliver reporting and insights to Finance users.", "key_qualifications": "Bachelor's degree in Business, Accounting, Finance, or equivalent practical experience. 7 years of experience in management consulting, or project management from a public accounting firm or multi-national company. Experience leading multiple, cross-functional projects, identifying and implementing process improvements, including designing, implementing, and testing processes and controls for enterprise resource planning (ERP) transformation projects.", "preferred_qualifications": "10 years of experience in change management, consulting, or project management from a public accounting firm or multi-national company or a related role. Experience in process mapping tools (e.g., Visio, Lucidchart, etc.). Experience with Cloud financial processes. Ability to review and create clear, concise process documentation. Excellent communication and people management skills, with the ability to build relationships across technical, finance, and business teams. Excellent problem-solving skills, with the ability to identify root causes and propose effective solutions.", "responsibilities": "Drive strategic transformation projects, managing multiple work streams and multiple stakeholders with competing priorities. Drive and facilitate the seamless transition of legacy Profit and Loss (P&L) pipelines into newly designed reporting architecture through successful UAT design and exit, ensuring critical margin reporting capabilities remain uninterrupted. Listen to, understand, and document the requirements of cloud decision-makers and ensure that solutions deliver tangible value against these requirements. Drive the development of project/program roadmaps and use them to manage stakeholder expectations, as well as for communicating plans and coordinating resources. Drive program outlook and objectives, ensure program objectives are met or exceeded, gain buy-in from executive sponsors and cross-functional stakeholders. Develop rich relationships with internal Finance teams, functional teams, and relevant stakeholders across functions to drive impact and work towards mutual goals.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/103705080292614854"}