{"title": "Data Center Manager, Global Server Operations", "level": "Mid", "location": "Columbus, OH, USA", "description": "Google isn't just a software company. The Hardware Operations team is responsible for monitoring the state-of-the-art physical infrastructure behind Google's powerful search technology. As a Hardware Operations Manager, you will manage a team of Data Center Technicians. You will oversee the quality installation of server hardware and components and take charge of complicated installations/troubleshooting.\n\nYour team will install, configure, test, troubleshoot and maintain hardware (like servers and its components) and server software (like Google's Linux cluster). They will also take on the configuration of more complex components such as networks, routers, hubs, bridges, switches and networking protocols. They may lead small project teams on larger installations and develop project contingency plans.", "key_qualifications": "Bachelor's degree in a technical field or equivalent practical experience.\n5 years of experience in computing infrastructure, networking, operating systems, or hardware.\n2 years of experience managing technical teams, vendor or contract management and delivery.\nAbility to work non-standard hours and differing rotations/shifts.", "preferred_qualifications": "Experience working in data center environments, including building and operating large-scale infrastructure, and network and compute architecture and lifecycle, and Linux/Unix system administration.\nExperience with initiating and executing strategic initiatives in a global environment.\nExperience leading and improving Environmental Health and Safety initiatives.\nAbility to implement and drive the safety culture at the site, while fostering an inclusive, diverse and collaborative team environment.\nExcellent problem-solving skills.", "responsibilities": "Lead a team of individuals, set and communicate individual and team priorities that support organizational goals. Meet regularly with individuals to discuss performance and development, and provide feedback and coaching.\nPartner with teams to meet goals and stakeholders to manage facility activities and set/implement short- and long-term strategies.\nMaintain, monitor, and execute security and operational procedures and track/analyze trends to identify opportunities for improvements ensuring alignment with organizational policies.\nRepair, fix, and perform preventative maintenance on equipment, servers, machines, or infrastructure based on identified issues.\nSupport and contribute to the implementation of Environmental Health and Safety (EHS) and other compliance programs and initiatives in collaboration with other teams to ensure environmental and safety incidents are investigated, resolved, and reported.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/103862064232964806"}