{"title": "Senior Mechanical Product Design Engineer, Platforms", "level": "Mid", "location": "Sunnyvale, CA, USA", "description": "As a member of a fast-paced multi-disciplinary team, you use your creativity and diverse range of engineering experience to explore solutions to a variety of engineering problems. As a mechanical engineer, you participate in the design, analysis, and prototyping of new concepts. You work in a manufacturing and product oriented development environment and collaborate with vendors and outside sources in order to see parts through to manufacture.", "key_qualifications": "Bachelor's degree in Mechanical Engineering, Product Design, or related field, or equivalent practical experience.\n4 years of experience in design and analysis of electro-mechanical systems and products (e.g., sheet metal, injection molding, structural and thermal analysis).\nExperience using computer-aided design tools (e.g., 3D MCAD, NX, Creo, or Solidworks).\nExperience in structural and thermal analysis using Finite element analysis (FEA) such as ANSYS or FloTHERM.", "preferred_qualifications": "Master's degree in Mechanical Engineering, Product Design, or related field, or equivalent practical experience.\n9 years of experience with product development, mechanical design, and analysis.\nExperience in designing electro-mechanical assemblies with knowledge of mechanical tolerances and tolerance analysis.\nExperience with design principles in the areas of design for production, sheet metal, and injection molding, structural and thermal analysis.\nExperience in design for assembly, automation, and serviceability.\nAbility to architect solutions backed by business case analysis.", "responsibilities": "Own product design life-cycle, requirements gathering, concept generation, detailed design with analysis, verification testing, cross-functional reviews, and manufacturing release.\nDevelop and execute designs for systems backed thorough engineering analysis.\nCreate test plans, perform testing, and validate designs to meet engineering requirements, troubleshoot, root cause, and resolve potential technical challenges.\nInfluence products by providing mechanical and product design engineering knowledge into the technology roadmap with data-driven decisions.\nProvide engineering knowledge and mentor team members.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/103805480521867974"}