{"title": "Materials Program Manager, Global Manufacturing Operations (English, Spanish)", "level": "Mid", "location": "Mexico", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company. As a Program Manager, you will work closely with our contract manufacturers to ensure that they are clear to build to enable on-time delivery for complex products in an ambiguous and fast-paced organization. You will work closely with Supply Planning, New product Introduction, Logistics, and Manufacturing Engineering to oversee material execution for multiples Contract-Manufacturers that support Google's infrastructure so you need to communicate effectively. This role requires being present onsite 3 times a week with contract manufacturers in Ciudad Juarez - Chihuahua. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in program or project management. Experience working within the supply chain environment such as warehouse, forecasting, logistics, or data analysis. Ability to communicate in English and Spanish fluently to communicate in Spanish with Contractor Manufactures, and English as default for Google.", "preferred_qualifications": "Bachelor's degree in Engineering/Business, or a related field. 4 years of experience in materials management with contract manufacturers. Experience managing supplier forecasts, sub-component reporting, and split adherence within the global supply chain. Experience manipulating data with spreadsheets (e.g., Google Sheets). Excellent problem-solving skills, with the ability to meet deadlines in a dynamic environment.", "responsibilities": "Review click to buy and unblock material shortages to maximize output. Review global shortages at scale and mitigate future shortages. Develop and monitor supplier performance metrics. Oversee sharing accurate forecast to suppliers and proactively track supplier commitments. Drive material readiness for mass production builds through collaboration with contract manufacturers, planning teams, and commodity managers.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/103958041719644870"}