{"title": "Motion Design Lead, Devices and Services", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" Google’s Motion Designers collaborate with cross-functional partners to create desirable and relevant product experiences that consistently elevate the Google brand. They help people make sense of their world by choreographing experiences that feel fluid, natural, and informative.", "key_qualifications": "Bachelor's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 8 years of experience in product design or UX. Experience in motion design related to physics, patterns, and visual design elements. Include a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link or access instructions).", "preferred_qualifications": "Master's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. Experience working in a complex, cross-functional organization. Experience in conceiving and documenting solutions through personas, user journeys, storyboards, value propositions and sketches. Knowledge of motion design and storytelling through tools like Adobe After Effects, Premiere, Cavalry, etc. Familiarity with motion design production processes, with the ability to oversee the production with an outside vendor. Ability to incorporate 3D into motion work through tools like Cinema 4D, Blender, 3DS Max, or similar.", "responsibilities": "Lead the creation of motion concepts for projects that seek to conceptualize individual products or define the goal for a category. Provide direction and leadership for motion designers in defining product features and overall product experiences alongside visual, interaction and prototype designers. Contribute directly to projects quickly and effectively under tight timelines to produce content from early motion prototypes to final concepts. Influence stakeholders and collaborate with cross-functional partners across functions to gain support for design strategies. Create compelling visual presentations, storyboards and prototypes showing solutions and context for both peers, users and leadership.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/104002842523509446"}