{"title": "Technical Program Manager I, Regional Carrier Certification, Pixel", "level": "Early", "location": "Mountain View, CA, USA; Kirkland, WA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nThe Pixel carrier team is responsible for carrier certification and type approvals for Pixel products, including technical feature planning, supporting product ranging, network certification testing, product performance and feature negotiation, and execution. The team interfaces with multiple cross-functional teams across tiers including engineering, product, business, partnerships, sales, quality, marketing and operations. Whether working with next-generation chipset manufacturers or emerging market telcos, Google's Pixel Technical Carrier Relations team helps solve some of the toughest mobile technology problems. The team works with teams throughout Google to develop solutions for strategic partners around the globe. \n\nThe Google Pixel team focuses on designing and delivering the world's most helpful mobile experience. The team works on shaping the future of Pixel devices and services through some of the most advanced designs, techniques, products, and experiences in consumer electronics. This includes bringing together the best of Google’s artificial intelligence, software, and hardware to build global smartphones and create transformative experiences for users across the world.", "salary": "$102,000-$150,000", "key_qualifications": "Bachelor's degree or equivalent practical experience. 1 year of experience in program management. 1 year of experience with hardware development. 1 year of experience with cellular protocol features (e.g., 2G, 3G, 4G and WLAN technologies). 1 year of experience working with cellular/telecom carriers or device manufacturers.", "preferred_qualifications": "Master’s degree in Electrical Engineering or MBA. Experience in product development (e.g., EPM, TPM, Hardware Engineering, Software Integration, NPI/Manufacturing, or Consumer Electronics), or similar experience in product launch readiness. Knowledge of wireless carriers and technologies (e.g., 4G/5G, NSA, and SA), carrier certification process for smartphones/devices and services, and phone OEM, infrastructure vendor, and chipset vendor landscapes. Ability to be an influential member of an integrated team composed of both technical and non-technical members. Experience with leading/landing product launches.", "responsibilities": "Drive NPI, In-market programs and collaborate with a team working on pixel carrier certifications, technical feature deployments, and IOTs. Interface with RF, hardware, software, certification, regulatory, business, operations and marketing teams to drive carrier certification programs of pixel products. Generate, maintain, evaluate, and drive completion of compliance documents and certification deliverables/reports. Manage regular software updates to enhance product quality, maintain Pixel as the most secure Android phone, and Google's OS updates for pixel products. Define, drive, and deliver Carrier certification milestones.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/104033184319972038"}