{"title": "Research Scientist, Quantum", "level": "Mid", "location": "Goleta, CA, USA", "description": "As an organization, Google maintains a portfolio of research projects driven by fundamental research, new product innovation, product contribution and infrastructure goals, while providing individuals and teams the freedom to emphasize specific types of work. As a Research Scientist, you'll setup large-scale tests and deploy promising ideas quickly and broadly, managing deadlines and deliverables while applying the latest theories to develop new and improved products, processes, or technologies. From creating experiments and prototyping implementations to designing new architectures, our research scientists work on real-world problems that span the breadth of computer science, such as machine (and deep) learning, data mining, natural language processing, hardware and software performance analysis, improving compilers for mobile platforms, as well as core search and much more. As a Research Scientist, you'll also actively contribute to the wider research community by sharing and publishing your findings, with ideas inspired by internal projects as well as from collaborations with research programs at partner universities and technical institutes all over the world. The full potential of quantum computing will be unlocked with a large-scale computer capable of complex, error-corrected computations. Google Quantum AI's mission is to build this computer and unlock solutions to classically intractable problems. Our roadmap is focused on advancing the capabilities of quantum computing and enabling meaningful applications.", "key_qualifications": "PhD degree in Computer Science, a related field, or equivalent practical experience. One or more scientific publication submission(s) for conferences, journals, or public repositories. Coding experience in Python, JavaScript, R, Java, or C++.", "preferred_qualifications": "2 years of coding experience in Python, JavaScript, R, Java, or C++. 1 year of experience owning and initiating research agendas.", "responsibilities": "Author research papers to share and generate impact of research results across the team and in the research community. Help in growing research business across teams by sharing research trends and best practices within the community. Define the data structure, framework, design, and evaluation metrics for research solution development and implementation under minimal guidance. Identify timelines and obtain resources needed. Identify new and upcoming research areas by interacting with potential external and internal collaborators. Help in developing long-term research strategy and plans to expand the impact of Google research with some guidance. Contribute to conducting experiments based on the research question. Develop research prototypes or conduct simulations to further evaluate the impact of research, finalize hypotheses, and refine the research methodology under minimal guidance.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/104134714461168326"}