{"title": "Go-to-Market Specialist IV, Databases, Google Cloud", "level": "Advanced", "location": "Palo Alto, CA, USA; Atlanta, GA, USA; +9 more", "description": "The Go-to-Market Specialist role at Google Cloud is responsible for developing and executing strategies to bring Google Cloud's innovative solutions to market, driving sales enablement, demand generation, and business engagement across diverse industry sectors.  As a Go-to-Market Specialist, Databases, you'll play a crucial role in bringing Google Cloud's leading database solutions to market. You will develop database solutions and initiatives, lead Go-to-Market strategies and business plays focused on database solutions, manage database-centric campaigns, and provide feedback to product and global solutions teams to shape the database product roadmap. You will serve as a trusted advisor to C-level executives, enabling them to select the right database solutions for their needs and maximizing their return on investment.", "salary": "$195,000-$278,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in business, computer science, or a related field or equivalent practical experience. 10 years of experience in a customer-facing role in the enterprise technology space. Experience with database concepts or technology (e.g., relational databases, NoSQL databases, cloud databases), including developing go-to-market strategies for database solutions. Experience managing technology projects within the database and cloud domains. Experience engaging with, and presenting to, technical stakeholders and executive leaders.", "preferred_qualifications": "Experience with database performance optimization and scalability techniques. Experience with Google Cloud database products and services, such as Cloud SQL, Cloud Spanner, and Cloud Bigtable. Ability to collaborate effectively across organizational boundaries and ambiguous, matrixed environments while building relationships to achieve business goals. Experience in business strategy, business development and translating customer needs into solutions. Experience with, or understanding of, Google Cloud's technology portfolio.", "responsibilities": "Collaborate across functions to develop and execute comprehensive go-to-market strategies for Google Cloud products and solutions. Conduct in-depth market research, identify and segment target customer demographics, and craft compelling messaging and content that resonates with those audiences. Partner with Sales, Professional Services, Engineering, and leadership teams to effectively communicate the unique value proposition of Google Cloud solutions to both internal and external stakeholders. Engage directly with executive-level decision-makers to demonstrate the tangible benefits of Google Cloud products and how they can address specific business needs and pain points. Manage multi-channel campaigns to drive solution adoption, and provide feedback to product and solution teams based on market and customer insights to inform product roadmaps and ensure solutions meet evolving customer needs.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/104269527243465414"}