{"title": "Cloud Security Architect, Mandiant, Cloud and Infrastructure", "level": "Advanced", "location": "United Arab Emirates", "description": "As a Security Consultant, you will be responsible for helping clients effectively prepare for, proactively mitigate, and detect and respond to cyber security threats. Security Consultants have an understanding of computer science, operating system functionality and networking, cloud services, corporate network environments and how to apply this knowledge to cyber security threats.  As a Security Consultant, you could work on engagements including assisting clients in navigating technically complex and high-profile incidents, performing forensic analysis, threat hunting, and malware triage. You may also test client networks, applications and devices by emulating the latest techniques to help them defend against threats, and will be the technical advocate for information security requirements and provide an in-depth understanding of the information security domain. You will also articulate and present complex concepts to business stakeholders, executive leadership, and technical contributors and successfully lead complex engagements alongside cross functional teams. As a Security Architect, you will be responsible for developing and overseeing a on-premises and cloud computing strategy for our customers, as well as responding to on-premises and cloud-related breaches. This includes Cloud adoption plans, and Cloud management and monitoring. You will apply your on-premises and cloud security skills, identity and access management, cloud network architecture, security hardening, and logging enforcement skills to assist clients with architecture, containment and remediation work-streams. You will provide customers with industry best practice and insight regarding cloud application architecture and deployment in cloud environments. You will possess strong consulting skills, be adept in leading multiple projects under tight deadlines, and possess experience in security event monitoring, cyber threat intelligence, or computer incident response. Part of Google Cloud, Mandiant is a recognized leader in dynamic cyber defense, threat intelligence and incident response services. By scaling decades of frontline experience, Mandiant helps organizations to be confident in their readiness to defend against and respond to cyber threats.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, Information Systems, Cybersecurity, related technical field, or equivalent practical experience. 6 years of experience assessing and developing cybersecurity solutions and programs across multiple security domains. 6 years of experience delivering cyber outcomes, identifying mission risks, and devising solutions to combat public sector focused threats. Ability to communicate in Arabic and English fluently as this is a customer-facing role that requires interactions in Arabic and English with local stakeholders. Ability to travel up to 50% of the time.", "preferred_qualifications": "Experience with enterprise security controls in on-premises and cloud infrastructures, Zero Trust Architecture, Secure Enterprise Platforms Architecture, Identity providers such as, Google Cloud Platform, Active Directory, Salesforce, B2B/B2C identities and collaboration platforms. Experience with enterprise networking and network segmentation strategies, Agile program and project management, SCRUM methodology, DevSecOps, GRC practices, NIST Cybersecurity Framework. Experience with cloud governance, with the ability to convey governance principles to cloud computing in terms of policies. Knowledge of tools used in pen testing, security event analysis, incident response, computer forensics, network and end-point architecture, or other security operational areas.", "responsibilities": "Identify solution issue trends, collaborate internally to proactively mitigate future risks. Develop improved solution delivery methods and contribute to solution innovation initiatives. Collaborate with stakeholders to define solutions and address escalations effectively. Advise on tech best practices, optimize stakeholder processes, and build strategic relationships.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/104307625012667078"}