{"title": "Quantitative UX Researcher, Google Ads", "level": "Mid", "location": "Mountain View, CA, USA", "description": "At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" Quantitative User Experience Researchers make this possible.", "key_qualifications": "Bachelor's degree in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, related field, or equivalent practical experience. 4 years of experience in an applied research setting, or similar. Experience in programming languages used for data manipulation and computational statistics (Python, R, MATLAB, C++, Java, Go), and with SQL. Include a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link and/or access instructions).", "preferred_qualifications": "Master's or PhD degree in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, or related field. 3 years of experience working with senior leadership (e.g., Director level and above). 2 years of experience conducting UX research on products, managing projects, and working in a large, matrixed organization. Excellent command of research questions within a given domain, and of technical tools for the analysis of data within that field. Proficiency in programming computational and statistical algorithms for large data sets. Demonstrated expertise in descriptive, inferential, and multivariate statistics, including t-test and ANOVA, and experimental design.", "responsibilities": "Define and measure quantitative UX goals and metrics in collaboration with Designers, Qualitative Researchers, Data Scientists, Engineers and Program Managers. Develop code and statistical models to understand user experience. Conduct empirical research using methods from computer science, quantitative social science, statistics, econometrics, and other fields to understand user behavior and extract meaningful patterns from large data sets. Examine existing data and product designs to generate hypotheses and plans for high-impact research. Prioritize and drive research to improve user experience. Communicate findings to stakeholders in the company. Make research findings convincing and actionable for both research experts and non-experts.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/104613586336129734"}