{"title": "Software Engineer III, Infrastructure, Google Kubernetes Engine", "level": "Mid", "location": "Sunnyvale, CA, USA", "description": "Google Cloud's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google Cloud's needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. You will anticipate our customer needs and be empowered to act like an owner, take action and innovate. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. In this role, you will provide the most reliable, scalable, and seamlessly managed Kubernetes platform to empower large-scale workload worldwide. You will ensure smooth Kubernetes upgrades and drive innovation in cluster management.", "salary": "$136,000-$200,000 + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 2 years of experience with software development in one or more programming languages (e.g., Go, Java or C++), and with data structures/algorithms. 2 years of experience with developing large-scale infrastructure, distributed systems or networks, or experience with compute technologies, storage or hardware architecture. 1 year of experience with Kubernetes.", "preferred_qualifications": "Master's degree or PhD in Computer Science, or a related technical field. 3 years of experience in building or managing distributed systems or cloud infrastructure, focusing on Kubernetes. Ability to contribute to Kubernetes or other open-source projects. Excellent communication and people management skills.", "responsibilities": "Design, develop, and maintain the systems responsible for large-scale, automated Kubernetes upgrades across Google Kubernetes Engines (GKEs) vast customer base. Prioritize safeguarding cluster stability during upgrades, develop proactive monitoring, and create robust rollback strategies in the event of unexpected issues. Work closely with the open-source Kubernetes community to track upstream changes, contribute patches, and integrate new features strategically into GKE. Implement testing frameworks to ensure the integrity and compatibility of Kubernetes upgrades at scale. Partner with cross-functional teams to manage upgrade lifecycles, troubleshoot complex issues, and optimize for customer experience.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/104867289517433542"}