{"title": "Product Strategy & Operations Lead, Google Commerce", "level": "Mid", "location": "Mountain View, CA, USA; San Francisco, CA, USA", "description": "Product and Business Strategy Leaders bring together teams across Google’s functions to help products execute optimally. Our team pushes Google to scale at key points that refine our products and infrastructure by executing efficiently, bringing solid business sense and sound judgment, and working effectively across organizational lines. Our roles often include components of strategy (e.g. analyzing and understanding new trends in the industry, building business plans), operations (e.g. running the cadence of organizations, connecting the operating lines between our functions), and communications. Our team partners with senior leadership to run important functions that cross-cut our existing organizations and deliver high impact projects. We help Engineers, PMs, UX, and all of our other functions to build amazing products that delight our users, and then get those products into their hands. The Google Commerce team builds essential experiences that serve users in their shopping journey - from creating simple and secure checkout experiences to being the best place for retailers and merchants to connect with consumers. We support and partner with the commerce ecosystem, from large retailers to local merchants, to give them the tools, technology, and scale to thrive in today’s digital world. The US base salary range for this full-time position is $139,000-$207,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in management consulting, product management and strategy, or analytics in a technology company. Experience working with and analyzing data, and managing multiple projects.", "preferred_qualifications": "Advanced degree or equivalent practical experience. 4 years of experience building, scaling and managing e-commerce products and businesses. Experience with R, SQL, spreadsheets, or similar analytics tools. Experience working with product and engineering teams. Excellent written and verbal communication skills.", "responsibilities": "Identify problems and issues across the organization and define/lead programs and processes to solve them. Influence team members and executive management to act and drive projects to completion. Establish and lead operating processes and tools for effectively managing the organization and achieving goals.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/104824545801577158"}