{"title": "Program Manager, Procurement Operations and Analytics, Google Cloud", "level": "Mid", "location": "Mexico City, CDMX, Mexico", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nIn this role, you will play an instrumental role in ensuring the smooth documentation, reporting, integration, tracking, governance and management of all procurement processes and projects related to data center equipment. You will be responsible for all aspects of managing the procurement workflows, including the purchase order, contract management, cost management and sourcing operations workflows, as well as the creation of reports, metrics, dashboards and any mechanisms to manage and deliver efficiencies from a process and system standpoint. You will work with all upstream and downstream stakeholders and undertake Request for Quotation (RFQ) packages, agreements and purchase orders are complete, correct and on time. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n2 years of experience in program or project management, procurement operations, sourcing operations or purchase orders, or supply chain management.\nExperience with data analytics, SQL, Tableau, dashboard creation or similar.", "preferred_qualifications": "3 years of experience with advanced spread sheet, SQL, Tableau and similar programming tools.\nExperience with purchase orders or order management in supply chain.\nExperience with data center equipment, hardware or similar supply chain.", "responsibilities": "Collaborate with internal category managers, supply chain managers, material managers and other internal stakeholders to ensure on time PO, RFQ and contract management while facilitating project accountability, visibility and control through the appropriate reports, dashboards and tracking mechanisms.\nCreate templates, processes, governance and tracking related to PO, change orders and Request for anything (RFx) and agreement processes by working closely with category managers and data center engineering teams.\nBe accountable for efficiencies delivered in terms of hour of work and cycle times for the PO, RFx and contract management workflows.\nSupport the Sourcing Operations teams by developing the necessary reports, dashboards and tracking mechanisms to proactively identify and mitigate risks related to on time completion of deliverables such as Purchase Order (PO), RFQs, agreement.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/105079838120780486"}