{"title": "Data Center Technician, Global Server Operations", "level": "", "location": "Singapore", "description": "Google isn't just a software company. The Hardware Operations team is responsible for monitoring the state-of-the-art physical infrastructure behind Google's powerful search technology. As an Operations Technician, you'll install, configure, test, troubleshoot and maintain hardware (like servers and its components) and server software (like Google's Linux cluster). You'll also take on the configuration of more complex components such as networks, routers, hubs, bridges, switches and networking protocols. You'll participate in or lead small project teams on larger installations and develop project contingency plans. A typical day involves manual movement and installation of racks, and while it can sometimes be physically demanding, you are excited to work with infrastructure that is at the cutting-edge of computer technology.", "key_qualifications": "Bachelor's degree or equivalent practical experience.\nExperience with Data Centers, Networking, Communication, Hardware, Technical Troubleshooting, and Operating Systems.", "preferred_qualifications": "Experience working with and troubleshooting hardware or network related issues using Linux-based tools.\nExperience working within a data center or networking operation center environment.\nExperience with maintenance and monitoring of server systems.\nKnowledge of advanced Networking, topology, and protocol.\nAbility to communicate in English fluently in order to effectively communicate with representatives.", "responsibilities": "Contribute to efforts/projects in the deployment, maintenance, and support of current and new data center infrastructure.\nAssist in deploying, repairing, and troubleshooting next generation machine learning platforms, providing feedback to local deployment/project teams.\nParticipate in complex troubleshooting and resolve critical technical issues. Test and troubleshoot new server and network hardware components and designs.\nInstall and maintain switches, routers, and other large-scale networking gear.\nConfigure and troubleshoot Linux OS related issues.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/105120546894553798"}