{"title": "Data Analytics Technology Specialist, Google Cloud", "level": "Advanced", "location": "Seoul, South Korea", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. ", "key_qualifications": "Bachelor's degree in Computer Science, related technical field, or equivalent practical experience. 10 years of experience in technical sales or professional consulting in the field of cloud computing, data analytics, and Big Data. Experience with cloud technology and architecture. Ability to communicate in Korean and English fluently in order to communicate in this customer-facing sales role.", "preferred_qualifications": "Experience with developing data warehousing, data lakes, batch/real-time event processing, streaming, data processing (e.g., ETL/ELT), data migrations, data visualization tools, and data governance on cloud native architectures. Ability to collaborate effectively across organizational boundaries, build relationships, and import and export talent and ideas to achieve a broader organizational goal. Ability to quickly learn, understand, and work with new emerging technologies, methodologies, and solutions in the Cloud/IT technology space. Excellent presentation skills, with the ability to deliver a polished and professional business and technical pitch to the C-Suite and Board levels.", "responsibilities": "Help to build, inspire, and lead a cross-functional distributed practice of Data Analytics Customer Engineers across APAC, and travel up to 30% of the time. Partner with the Data Analytics Specialists leaders (Sales and CEs), Product leaders, and executive leadership to ensure solutions alignment with engineering, product priorities, and GTM priorities. Develop Data driven design patterns and demos to speed up the business cycle of Data Analytics workloads. Provide deep expertise on Data Analytics products to the Data Analytics CEs on Data Analytics focus accounts’ opportunities. Advocate for the APAC customers, partners, and field to influence a data-driven vision and direction for technology solutions and use case development at Google Cloud.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/105299665284408006"}