{"title": "Data Center Technician", "level": "", "location": "Changhua City, Xihu Township, Changhua County, Taiwan", "description": "Google isn't just a software company. The Hardware Operations team is responsible for monitoring the state-of-the-art physical infrastructure behind Google's powerful search technology. As an Operations Technician, you'll install, configure, test, troubleshoot and maintain hardware (like servers and its components) and server software (like Google's Linux cluster). You'll also take on the configuration of more complex components such as networks, routers, hubs, bridges, switches and networking protocols. You'll participate in or lead small project teams on larger installations and develop project contingency plans. A typical day involves manual movement and installation of racks, and while it can sometimes be physically demanding, you are excited to work with infrastructure that is at the cutting-edge of computer technology.\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "key_qualifications": "Associate's degree or equivalent practical experience. 2 years of experience working with and troubleshooting server hardware and network-related issues using Linux based tools. Experience with LPIC or working with Linux (e.g., Red Hat, Slackware, Fedora, SUSE, Ubuntu, Debian, Gentoo), Unix (e.g., Solaris, AIX, HP-UX, BSD), or other similar OS.", "preferred_qualifications": "Experience leading project teams on larger installations and developing project contingency plans.  Understanding of intermediate OS, PC hardware and networking concepts, tools, and protocols. Ability to manage manual movement and installation of racks, and work with infrastructure. Ability to lift/move equipment up to 25kg as needed.", "responsibilities": "Contribute to and lead efforts/projects in the deployment, maintenance, and support of current and new data center infrastructure. Lead complex troubleshooting, and resolve critical or escalated technical issues regarding affected equipment. Test and troubleshoot server hardware components and designs. Configure and troubleshoot Linux OS-related issues on our servers.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/105369109463474886"}