{"title": "Data Center Facilities Technician, Mechanical", "level": "", "location": "Fredericia, Denmark", "description": "The Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facilities Technicians at Google data centers operate, monitor and support physical facilities conditions. Some of these duties will include heating and cooling of air and water, power supply, generators, UPS systems, electrical distribution and control and monitoring systems. You regularly help inspect, maintain and repair various data center systems such as piping and non-critical electrical or mechanical system components). You provide daily assistance to senior technicians as you read blueprints/schematics, conduct tours of systems and assess their working order.\n\nAs an advocate for best practices, you develop creative approaches to reducing operational costs while improving overall data center efficiency. You ensure that environmental and safety standards are consistently met, identifying problems and making repairs quickly. In emergency situations or abnormal conditions, you manage data center performance issues and outages to minimize the recovery time from failures.\n\nAs a Facilities Technician, you will operate, monitor, and support physical facilities conditions for our data centers.\nThe Data Center team designs and operates some of the most sophisticated electrical and HVAC systems in the world. We are a diverse, upbeat, creative, team-oriented group of engineers committed to building and operating powerful data centers.", "key_qualifications": "Associate's degree, trade school certification, or other certified training in a related technical field, or equivalent practical experience.\n2 years of Mechanical/HVAC experience in an industrial or commercial environment.\nAbility to lift and move 50 lbs of equipment, and work on platforms, ladders, and under raised floors.\nAbility to work non-standard hours and work rotations/shifts.", "preferred_qualifications": "2 years of experience in maintenance of mechanical/cooling distribution systems, construction/technical environment, or a related field.\nExperience in data centers, hospitals, or power plants.\nKnowledge of mechanical systems used in a data center environment (e.g., Chillers, Air handling units, pumps, and CRAC/CRAH units).\nKnowledge of meters, devices, sensors, and troubleshooting utilizing standard hand tools, digital metering, or calibration/diagnostic equipment.\nAbility to communicate with contractors who perform maintenance or upgrade work on the data center systems.", "responsibilities": "Inspect, maintain, and repair various data center systems such as piping and mechanical system components. \nProvide daily assistance to technicians as you read blueprints/schematics/sequence of operations, conduct tours of systems, and assess their working order. \nManage the uptime and maintenance of water pumps and treatment systems, HVAC, and control and monitoring systems. \nOperate, monitor, maintain, and respond to abnormal conditions in the data center facilities systems and equipment. \nSupport startup, commissioning, and integration of new mechanical equipment and systems into facilities infrastructure.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/105465684024009414"}