{"title": "Risk and Governance Specialist, Global Vendor Operations, YouTube", "level": "Mid", "location": "Hyderabad, Telangana, India", "description": "Fast-paced, dynamic and proactive, YouTube Trust and Safety is dedicated to ensuring that YouTube is a place for users, viewers, and creators around the world to belong, create, and express themselves. Whether understanding and solving their online content concerns, navigating within global legal frameworks, or writing and enforcing worldwide policy, the Trust & Safety team is on the frontlines of enhancing the YouTube experience, building internet safety, and protecting free speech in our ever-evolving digital world. YouTube Global Vendor Operations (GVO) organization oversees scaled vendor support for YouTube Content Moderation, YouTube Creators, and Paid Products. The Risk, Compliance and Governance (RCG) team is the center of excellence responsible for maintaining structure across YouTube Scaled Vendor supplier base. This includes vendor adherence to requirements including Vendor Contract Terms, Tools Access Programs, Wellness programming, and designing and managing vendor governance solutions that enable the GVO teams to measure Vendor Compliance across the Supplier base for scaled outsourced operations. As a Risk and Governance Specialist, you will be part of a dynamic, vendor strategy, governance, and compliance team reinventing the way scaled vendor operations are managed. At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience in analytics, SQL, or building databases/tools. 2 years of experience in audit, compliance, or risk management. Experience managing projects across organizations, and building new programs and processes across an organization.", "preferred_qualifications": "Experience advertising with an understanding of risk and control frameworks. Experience in privacy, security, or compliance, privacy principles, and similar technologies. Experience building product requirement documents to improve user experience. Experience leading implementation of security risk and compliance frameworks for security programs, with knowledge of applicable global privacy laws, regulations, and legal commitments. Excellent problem solving, written and verbal communication skills.", "responsibilities": "Design and build a variety of vendor governance compliance programs with other GVO teams. Partner with Risk and Governance Program Managers, develop partnerships with product and engineering teams, strategy and operations teams, and Risk and Compliance to identify issues, develop systemic solutions, and communicate effectively. Design and build Tools User Access and Data Governance strategy, measurement framework, and continued refinement approach. Partner with the GVO organization to communicate existing vendor compliance policies, source, and synthesize feedback on current dashboards.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/105466276729496262"}