{"title": "Software Engineer III, Content Management System, Google Store", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\n\nAs a Software Engineer, you will design and develop the content management system. You will be part of the Content team, and lead and deliver innovative content authoring features such as conditional content, localization, asset management, and content authoring tooling.\n\nIn this role, you will work closely with other Software Leads, User Experience Engineers (UXE), business leaders, and cross-functional stakeholders to define the goals and architecture for new capabilities and build enterprise grade systems.\n\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree. Experience programming in one or more of the following languages: Java, Angular, Full-Stack Development, Data Structures, Distributed Systems.", "preferred_qualifications": "Experience in full-stack building distributed applications. Experience working in e-commerce platforms or a content management system. Experience in development, designing object-oriented JavaScript.", "responsibilities": "Write and test product or system development code. Lead design reviews with peers and stakeholders to decide amongst available technologies. Review code developed by other developers and provide feedback to ensure best practices. Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, service operations, and quality.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/105502019715769030"}