{"title": "Senior Developer Relations Engineer, Android and Business Communications", "level": "Mid", "location": "Kraków, Poland", "description": "Passionate people are everywhere at Google. In Developer Relations, we get excited to collaborate and connect with the communities that love technology as much as we do. Part community manager and part developer advocate, Developer Programs Engineers collaborate with developers at conferences and online, and advocate for developers interests internally at Google. Not afraid to be hands-on, you write sample code and client libraries as well as participate in developer forums and support queues to troubleshoot and debug coding problems developers encounter. Internally, you work with product engineering teams improve our products by conveying feedback from developers, reviewing API designs and testing new features. Chrome, Android, App Engine, HTML5 as well as our core Google Apps and Ads APIs are just some of the platforms you promote and support.\n\nWith your technical expertise, you drive strategy around fostering a community of developers who work with Google technologies. An ardent advocate for these developers, you represent their voice internally to our Product Managers and serve as their Google support in application development and technology implementation.\n\nCommunication is at the center of users’ lives and is the most engaging way users use their smartphones every day. Google is investing in communication services such as Messaging and Dialler. Rich Communication Services (RCS) and Rich Business Messaging are the new standards revolutionising the experience for users.\nOur mission is to scale a safe, helpful, and business messaging experience to RCS users. Our mission goes beyond just moving SMS traffic to RBM traffic as we will unlock business generating use cases that differentiate the Android messaging ecosystem.\n\nAndroid is Google’s open-source mobile operating system powering more than 3 billion devices worldwide. Android is about bringing computing to everyone in the world. We believe computing is a super power for good, enabling access to information, economic opportunity, productivity, connectivity between friends and family and more. We think everyone in the world should have access to the best computing has to offer. We provide the platform for original equipment manufacturers (OEMs) and developers to build compelling computing devices (smartphones, tablets, TVs, wearables, etc) that run the best apps/services for everyone in the world.", "key_qualifications": "Bachelor's degree in Computer Science, a similar technical field, or equivalent practical experience.\n5 years of experience in software engineering, product management, technical account management, sales engineering, or related fields.\nExperience speaking at tech conferences, writing technical articles, or contributing to a popular open source project.\nExperience in internet technologies such as HTTP, TCP/IP, HTML, JavaScript, or Unix/Linux.\nExperience with a programming language such as Java, C/C++, C#, or Python.\nExperience with integration in the web or mobile advertising ecosystem as well as working with external partners.", "preferred_qualifications": "Ability to take ownership of solutions and exert influence without authority.\nAbility to share technical knowledge and information with others.\nExcellent written and verbal communication skills.", "responsibilities": "Engage cross-functionally across our key partners’ organizations and be the primary technical point of contact to and from our partners.\nAdvocate for the partners internally, and influence Google developer product strategy by working with Product Management, Engineering, PR, Marketing, and Business Development.\nUnlock growth by understanding how partners can leverage Google products and services as well as being there for cross-functional teams.\nIdentify gaps in the current product offering, be able to document the requirements, and demonstrate business impact that would result from supporting new or additional functionality.\nPromote developer products in person and online by presenting at conferences, blogging, writing technical tutorials, etc. Provide technical guidance and expertise to ecosystem partners about best practices, diagnose and help resolve operational issues, and ensure all impediments to success are identified and removed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/105671805410124486"}