{"title": "Cybersecurity Data Scientist", "level": "Mid", "location": "Reston, VA, USA", "description": "The Google Cloud Security Data Science Research team develops innovative, data-driven solutions to today’s most challenging cybersecurity problems. By leveraging data derived from Google’s unparalleled view of the threat landscape, the team provides solutions with significant impact for our customers and the broader cybersecurity industry. The US base salary range for this full-time position is $127,000-$187,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "key_qualifications": "Master's degree in Statistics, Data Science, Mathematics, Physics, Economics, Operations Research, Engineering, a related quantitative field, or equivalent practical experience. 3 years of experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis, or a PhD degree. Experience in cybersecurity or fraud detection. Experience in Machine Learning libraries (e.g., TensorFlow or PyTorch).", "preferred_qualifications": "5 years of experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis, or a PhD degree.", "responsibilities": "Collaborate with stakeholders in cross-projects and team settings to identify and clarify business or product questions to answer. Provide feedback to translate and refine business questions into tractable analysis, evaluation metrics, or mathematical models. Use custom data infrastructure or existing data models as appropriate, using specialized knowledge. Design and evaluate models to mathematically express and solve defined problems with limited precedent. Gather information, business goals, priorities, and organizational context around the questions to answer, as well as the existing and upcoming data infrastructure. Gather, extract, and compile data across sources via relevant tools (e.g., SQL, R, Python). Format, re-structure, and/or validate data to ensure quality, and review the dataset to ensure it is ready for analysis.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/105687298632229574"}