{"title": "Director, Google Compute Engine Node, Google Cloud", "level": "Director", "location": "Hyderabad, Telangana, India", "description": "The Google Compute Engine (GCE) Node team drives the rapid development and deployment of Google Compute Engine's instance (i.e., virtual machine and Bare Metal) portfolio. The team builds the infrastructure to streamline the development of new Compute Instances, support advanced data plane innovation, and enhance reliability and observability for GCE customers. The team will also help build critical fleet management capabilities to reduce and manage disruptions. The team's commitment to performance, automation, cross-team collaboration, and customer-centric improvements will solidify GCE's position as a cloud platform.", "key_qualifications": "Bachelor's degree in Computer Science or related technical field, or equivalent practical experience. 15 years of experience leading teams of software engineers in cloud-based or open source projects. Experience with technical innovation within cross-functional engineering environments. Experience in cloud computing, hardware acceleration, virtualization, computer architecture, and software engineering.", "preferred_qualifications": "Experience leading an engineering team to successfully build and scale a distributed system. Experience partnering closely with Product Management to achieve business goals. Experience collaborating with multiple product and engineering teams. Experience delivering complex technical projects successfully within budget and tight timelines. Experience with site leadership responsibilities to realize global mission with ability to communicate effectively across cross-team globally, explaining complex business and technical concepts. A respectful, partnering, and empathetic approach to forging professional relationships.", "responsibilities": "Attract, hire, and develop an engineering team, fostering collaboration within it and ensuring seamless integration with other GCE and Google infrastructure groups. Lead the development of offload and data plane capabilities under GCE initiatives. Guide the creation and management of infrastructure that accelerates the deployment and qualification of new GCE Node product offerings. Lead in areas like workload testing, automation, and process streamlining. Participate in high-impact initiatives like improving workload performance, customer experience refinement, seamless updates, and resource optimization.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/105699377080607430"}