{"title": "Senior CPU Architect, Google Cloud", "level": "Advanced", "location": "Tel Aviv, Israel; Haifa, Israel", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration. In this role, you will take part in CPU development, leading the CPU architecture and microarchitecture definitions. You will collaborate with software and hardware architects, design, verification, and physical implementation teams. You will influence the building of processor performance analysis infrastructure with modeling, emulation, and silicon measurement and drive power and performance optimizations for our specific customers workloads. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Engineering, Computer Science, or equivalent practical experience. Candidates will typically have 8 years of experience with microprocessor architecture and related technologies and algorithms. Experience with CPU architecture performance analysis, tools, and simulators at different abstraction levels (i.e., cycle accurate, functional, emulation).", "preferred_qualifications": "Advanced degree in Electrical Engineering, Computer Engineering, or Computer Science, with an emphasis on computer architecture. Experience analyzing workloads and definitions of microarchitectural features. Knowledge of ARM architecture.", "responsibilities": "Lead architectural definition of CPU core designs, facilitate and make final decisions. Participate in and influence the building of processor performance analysis infrastructure. Influence the development of architectural models with varying configurations across product categories. Perform Performance, Power, Area (PPA) trade-off analysis for architecture and microarchitecture features, communicate analysis results in both qualitative and quantitative fashion to support decisions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/105660344686256838"}