{"title": "Security Engineer, Trust and Safety", "level": "", "location": "Bengaluru, Karnataka, India", "description": "There's no such thing as a \"safe system\" - only safer systems. Our Security team works to create and maintain the safest operating environment for Google's users and developers. As a Security Engineer, you help protect network boundaries, keep computer systems and network devices hardened against attacks and provide security services to protect highly sensitive data like passwords and customer information. Security Engineers work directly with network equipment and actively monitor our systems for attacks and intrusions. You also work with software engineers to proactively identify and fix security flaws and vulnerabilities. Our Trust and Safety team has the critical responsibility of protecting Google's users by ensuring online safety by fighting fraud and abuse across Google products like Chrome, Play, Gmail and Search. In this role, you are a big-picture thinker and strategic leader. You understand the user's point of view and are passionate about using your combined technical, problem-solving, and strategic acumen to protect our users. You work globally and cross-functionally with Google Engineers and Product Managers to navigate challenging online safety situations and handle abuse and fraud at Google scale.", "key_qualifications": "Bachelor's degree in Computer Science, a related technical field, or equivalent practical experience. 3 years of experience with security in attacks and mitigation methods. 1 year of experience with Java.", "preferred_qualifications": "Master's degree in Computer Science or a related field. 2 years of experience in software reverse engineering, code-level security auditing, or Android system security. Experience with developing or analyzing Android apps. Familiarity with tools such as IDA Pro or OllyDbg.", "responsibilities": "Design solutions that enable automatic identification of harmful or unwanted Android applications. Analyze harmful or unwanted Android applications to understand their behavior and their impact on the Android ecosystem. Conduct investigations to identify new harmful behaviours, enforce product policies, and analyze distribution trends. Collaborate with cross-functional groups such as Engineering, Policy, and Legal to update policies, fix product loopholes, and provide users with a better mobile experience.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/105867928850571974"}