{"title": "Test Engineer, Pixel Engineering Productivity", "level": "Early", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "At Google, our philosophy is build it, break it and then rebuild it better. That thinking is at the core of how we approach testing at Google. Unlike roles with similar names at the other companies, Test Engineers at Google aren't manual testers -- you write scripts to automate testing and create tools so developers can test their own code. As a Test Engineer, you navigate Google's massive codebase, identify weak spots and constantly design better and creative ways to break software and identify potential problems. You'll have a huge impact on the quality of Google's growing suite of products and services.\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, Electrical Engineering, a related technical field, or equivalent practical experience. 2 years of experience in coding, developing test methodologies, writing test plans, creating test cases, and debugging. Experience in programming using Java, Python, C, C++, or similar programming languages.", "preferred_qualifications": "Master's degree in Computer Science, Computer Engineering, Electrical Engineering, or a related technical field. Experience working with embedded consumer electronic devices and driving Software Quality Assurance processes and methodologies. Experience in designing and developing robust and scalable automation frameworks. Experience in mesh networking with Thread and Matter.", "responsibilities": "Develop scalable and reliable automated tests and frameworks for testing embedded hardware devices. Drive to improve software quality assurance (QA) processes and methodologies. Work closely with cross-functional teams and strive to come up with optimal and creative solutions. Design, create, modify, and execute test plans and tests for hardware and software validation at both system and user level. Build custom dashboards to provide signals on quality trends.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/105816608621896390"}