{"title": "Generative AI Specialist, Blackbelt, Google Cloud", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customer developers, small and large businesses, educational institutions and government agencies. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees, and partners.", "key_qualifications": "Bachelor's degree in Computer Science or equivalent practical experience. 9 years of experience serving in the capacity of a technical Solution Architect in a cloud computing environment or a customer-facing role. Experience with Large Language Models (LLMs), Open Source, Big Data, Machine Learning, and numerical programming frameworks. Experience with AI products, technologies, and infrastructure.", "preferred_qualifications": "Master's degree in Computer Science or a related technical field. Experience with building AI and machine learning solutions, Machine Learning Operation frameworks (e.g., Kubeflow), and leveraging specific machine learning architectures (e.g., deep learning, LSTM, etc.). Experience architecting and developing software or infrastructure for scalable, distributed systems and with machine learning technologies. Understanding of AI Models, Large Language Models, and AI specialized infrastructure as it relates to AI trends and issues within businesses. Understanding of responsible AI practice. Ability to learn, understand, and work with new emerging technologies, methodologies, and solutions in the Cloud/IT technology space.", "responsibilities": "Work with the team to identify and qualify business opportunities, understand key customer technical objections, and develop the strategy to resolve technical blockers. Provide AI expertise to support the technical relationship with Google’s customers, manage product and solution briefings, create demos, proof-of-concept work, and partner directly with product management to prioritize solutions impacting customer adoption to Google Cloud. Recommend integration strategies, enterprise architectures, platforms, and application infrastructure required to implement a complete solution on Google Cloud. Support developers, creators, and enterprises to leverage Google’s Generative Language APIs so they can build their own AI products in the future. Travel to customer sites, conferences, and other related events as needed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/105967271242801862"}