{"title": "Software Engineering Manager II, Dataproc UI", "level": "Advanced", "location": "Kirkland, WA, USA; Sunnyvale, CA, USA", "description": "Like Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers. You not only optimize your own code but make sure Engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way.\\n\\nWith technical and leadership expertise, you manage engineers across multiple teams and locations, a large product budget and oversee the deployment of large-scale projects across multiple sites internationally.\\n\\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$189,000-$284,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). 3 years of experience in a technical leadership role; overseeing projects, with 2 years of experience in a people management, supervision/team leadership role. Experience with Typescript and Frontend development.", "preferred_qualifications": "Master's degree or PhD in Computer Science or a related technical field. 3 years of experience working in a complex, matrixed organization. Experience with web applications, front-end development, and angular.", "responsibilities": "Define product differentiating features for all aspects of the Dataproc UI living in the Google Cloud Console. Partner with and directly integrate with various other Google Cloud Platform (GCP) products in the data analytics space. Guide GCP experience of Spark, Flink, Hadoop, Presto, and more running on GCP. Build high-impact customer-facing features which make Cloud Dataproc the best place to run Hadoop and Spark in the cloud. Make Cloud Dataproc the best product for data science and engineering workloads.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/106214990460920518"}