{"title": "Data Center Technician, Machine Learning Support", "level": "", "location": "Clarksville, TN, USA", "description": "Google isn't just a software company. The Hardware Operations team is responsible for monitoring the state-of-the-art physical infrastructure behind Google's powerful search technology. As an Operations Technician, you'll install, configure, test, troubleshoot and maintain hardware (like servers and its components) and server software (like Google's Linux cluster). You'll also take on the configuration of more complex components such as networks, routers, hubs, bridges, switches and networking protocols. You'll participate in or lead small project teams on larger installations and develop project contingency plans. A typical day involves manual movement and installation of racks, and while it can sometimes be physically demanding, you are excited to work with infrastructure that is at the cutting edge of computer technology.", "key_qualifications": "Bachelor's degree or equivalent practical experience. Experience with diagnosing and troubleshooting operating systems, computer hardware, and server hardware. Experience with networking protocols. Experience with performing component-level repairs on IT equipment. Ability to lift/move 50lb (23kg) of equipment as required and ability to exert yourself physically over extended periods of time, including frequent bending, kneeling, climbing, pushing/pulling, and lifting. Ability to work non-standard hours, including working weekends, holidays, and on shift-based schedules as required.", "preferred_qualifications": "1 year of experience diagnosing and troubleshooting one of the following: operating systems and computer/server hardware or networking protocols. Ability to collaborate and partner with teams to overcome challenges. Ability to adapt to changes in a dynamic work environment. Ability to understand, and to effectively execute, frequent verbal and written instructions.", "responsibilities": "Deploy and operate new data center infrastructure across projects or functions. Report issues and follow data center procedures to troubleshoot and diagnose straightforward issues with equipment or infrastructure as they arise, and applying the resources needed to resolve identified issues. Maintain the security and integrity of data, track various forms of media to check for standard data security issues (e.g., data was not properly erased) handled in accordance with Google security standards. Disassemble specific equipment that has reached its end-of-life via part replacement or maintenance, in a team setting. Repair, fix, and perform preventative maintenance on equipment, servers, machines, or infrastructure based on identified issues with defined solutions and limited guidance.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/106290642753069766"}