{"title": "Vice President, Engineering, Advanced Technology Innovation", "level": "Director+", "location": "Sunnyvale, CA, USA", "description": "The Google Data Centers team (GDC) designs, builds, and operates many gigawatts of reliable, efficient, flexible data centers. Our data centers are the foundation of all Google services and infrastructure, from classic servers and networking to bespoke storage and advanced AI hardware. Within the Data Centers team, we focus on designing and delivering data center solutions which enable and complement Google’s differentiated server, network, and software systems. Data center innovations as diverse as AI-managed airflow controls, seawater heat exchange, and software-mediated MV power oversubscription allow Google to rapidly bring hardware and software innovations to our customers and users around the world while maintaining an outstanding reliability, safety, and efficiency track record. Within GDC, our Advanced Technology Innovation (ATI) team is responsible for designing and developing Google’s data center designs and custom equipment ATI works closely with Google’s server and chip teams, supply chain, and construction teams to develop optimal data center designs, and bring them to fruition in record time and unit cost. The team includes architectural design experts, mechanical engineers, electrical engineers, water/air experts, and project controls engineers who plan and design efficient data centers. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "salary": "$550,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in a relevant Engineering field (e.g., hardware, software, industrial/materials, etc.) or equivalent practical experience. 15 years of professional experience in facility and equipment design and development leadership, with multiple iterations of delivering facilities to production. 15 years of professional experience as an engineering leader. Experience within cross-functional engineering environments (e.g., technology, pharma, semiconductor, oil and gas and automotive).", "preferred_qualifications": "Expertise with server design, rack design, and ML accelerators. Expertise in industry trends and standards outside of but related to data centers, particularly in chip design, energy, location/environment. Expertise successfully designing and implementing net zero water and sustainable initiatives.", "responsibilities": "Create an outlook and lead the architecture and design for Google’s global data centers. Challenge the status quo, improving and innovating upon current data center design, building and operating requirements. Leverage Google’s unique strengths by partnering with Construction Delivery, Operations, Platforms, Supply Chain, internal technical teams, and external suppliers to analyze the internal and external capabilities required to support a new data center architecture and design. Deliver creative modeling options that support the organization’s strategic priorities to build or lease facilities at scale. Develop and prepare design, technical, and investment recommendations to Google’s leadership. Lead, inspire, and drive innovative design solutions that increase efficiency, construction speed, and lower costs, while maintaining security and governance requirements and high availability.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/106386390928761542"}