{"title": "Android Strategy Senior Lead", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "Product and Business Strategy Leaders bring together teams across Google’s functions to help products execute optimally. Our team pushes Google to scale at key points that refine our products and infrastructure by executing efficiently, bringing solid business sense and sound judgment, and working effectively across organizational lines. Our roles often include components of strategy (e.g. analyzing and understanding new trends in the industry, building business plans), operations (e.g. running the cadence of organizations, connecting the operating lines between our functions), and communications. Our team partners with senior leadership to run important functions that cross-cut our existing organizations and deliver high impact projects. We help Engineers, PMs, UX, and all of our other functions to build amazing products that delight our users, and then get those products into their hands. The mission of the Android strategy team is to drive a strategic agenda and align priorities to enable the growth of the Android ecosystem for users, partners, and Google. The team is focused on providing strategic thought leadership and insights to enable decision making. Android is Google’s open-source mobile operating system powering more than 3 billion devices worldwide. Android is about bringing computing to everyone in the world. We believe computing is a super power for good, enabling access to information, economic opportunity, productivity, connectivity between friends and family and more. We think everyone in the world should have access to the best computing has to offer. We provide the platform for original equipment manufacturers (OEMs) and developers to build compelling computing devices (smartphones, tablets, TVs, wearables, etc) that run the best apps/services for everyone in the world.", "salary": "$165,000-$248,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 11 years of experience in management consulting, product management and strategy, or analytics in a technology company. Experience working with and analyzing data, and managing multiple cross-functional programs or projects.", "preferred_qualifications": "Advanced degree or equivalent practical experience. Experience with R, SQL, spreadsheets, or similar analytics tools. Experience working with Product and Engineering teams. Excellent written and verbal communication skills.", "responsibilities": "Identify problems and issues across the organization and define/lead programs and processes to solve them. Influence team members and executive management to act and drive projects to completion. Establish and lead operating processes and tools for managing the organization and achieving goals. Ensure the team stays up to date on ecosystem trends, and articulate implications for Android ecosystems. Support executive narratives that communicate strategy.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/106456799468495558"}