{"title": "Practice Specialist, Vision", "level": "Advanced", "location": "Beijing, China", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud.", "key_qualifications": "Bachelor's degree in Computer Science, Mathematics, a related technical field, or equivalent practical experience. 5 years of experience in image and video processing, object detection, segmentation, classification, and related algorithms. Experience with generative models for image and video synthesis, inpainting, style transfer, etc. (e.g., Imagen, Stable Diffusion). Experience with image and video editing techniques, including manipulation, augmentation, and retouching. Experience in Python.", "preferred_qualifications": "Experience working with cloud-based platforms (e.g., Google Cloud Vertex Platform). Experience in building image or video recognition systems (e.g., commercial or open source products). Experience working with models that combine vision and language understanding, such as CLIP, ALIGN, or similar. Experience with image and video processing.", "responsibilities": "Showcase the power and versatility of Google Cloud's Vision by guiding customers on integrating Google Cloud's Vision capabilities into their existing workflows and applications. Assist customers in fine-tuning and customizing pre-trained models to meet their specific use cases (e.g., object detection, image classification, video analysis). Create and deliver technical content (best practices, tutorials, code samples, presentations) to enable customers and internal teams to effectively utilize Google Cloud's Vision offerings. Travel to customer locations and represent Google Cloud at conferences, meetups, and other industry events to share knowledge, network with peers, and stay current on the latest trends in image/video processing.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/106608017012597446"}