{"title": "Business Intelligence Manager, Finance", "level": "Advanced", "location": "Bengaluru, Karnataka, India", "description": "At Google, data drives all of our decision-making. As part of the Finance Business Intelligence team, you will use data to inform business and product decisions across the company. Using your technical skills, business acumen and creativity, you will build tools to automate reporting and generate insight that will allow clients to quickly and accurately see how our key business products and processes are performing. Previous experience managing finance systems projects, with emphasis on providing business intelligence and data driven insight through reporting, will have equipped you well for this role. You’ll be involved in projects from inception to delivery, ensuring that your reporting delivers high-quality and relevant data to intelligently grow our business. You will also have extensive knowledge of key financial systems, such as Oracle and Hyperion, and experience working with a range of other business intelligence tools and platforms. As part of the Finance Data and Analytics team, you will use data to inform business and product decisions across Google. In this role, you will have the opportunity to incubate data solutions at scale at Google’s Finance Center of Excellence by partnering with teams across verticals to drive process efficiency and performance management insights to key stakeholders. The name Google came from 'googol,' a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.", "salary": "", "key_qualifications": "Bachelor's degree in a quantitative discipline (e.g., Statistics, Operations Research, Bioinformatics, Economics, Computational Biology, Computer Science, Mathematics, Physics, Electrical Engineering, or Industrial Engineering), or equivalent practical experience. 10 years of experience in business intelligence, analytics, or quantitative analysis related fields.", "preferred_qualifications": "Experience with financial systems and concepts. Experience with analytics methods/theory (e.g., statistics, machine learning, etc.) with the ability to identify opportunities to apply these. Ability to thrive in environments with multiple cross-functional stakeholders with competing agendas that bring people together to achieve a common goal keeping Google’s overall interests in mind. Excellent stakeholder management, expectation setting, conflict management, and prioritization skills.", "responsibilities": "Lead a team of data professionals working across a variety of areas and BI responsibilities (e.g., Engineering and Analytics). Partner closely with the hubs in other locations to provide the data infrastructure needed for the solutions the wider team develops. Partner closely with the Data Program Managers within the team to develop data solutions for the needs of our end users (Finance teams). Partner with Engineering teams to operationalize/scale data solutions and improve Google’s business intelligence and analytics platforms, such as querying, reporting and analytics tools. Manage a prioritized backlog and run the planning process.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/106783499712635590"}