{"title": "Generative AI Field Solution Architect, Google Cloud", "level": "Mid", "location": "Seoul, South Korea", "description": "As a Generative AI Field Solutions Architect, you will support Google Cloud Sales and Engineering teams to incubate, pilot, and deploy Google Cloud’s AI/ML and Generative AI technology with AI native customers, large enterprises, and early-stage AI startups. You will help customers innovate faster with solutions using Google Cloud’s flexible and open infrastructure including AI Accelerators (TPU/GPU).", "key_qualifications": "Bachelor's degree in Computer Science, Engineering, a related technical field, or equivalent practical experience. 5 years of experience in Artificial Intelligence applications (e.g., deep learning, natural language processing, computer vision, or pattern recognition). Experience delivering technical presentations and leading business value sessions. Experience working with programming language (e.g. Python), applied machine learning techniques, and using OSS frameworks (e.g., TensorFlow, PyTorch). Ability to communicate in English and Korean fluently as this is a customer-facing role that requires interactions in English and Korean with local stakeholders.", "preferred_qualifications": "Master's degree in Computer Science, Engineering, or a related technical field. Experience designing and deploying with one or more of the following ML frameworks: TensorFlow, PyTorch, JAX, Spark ML, etc. Experience training and fine tuning models in large-scale environments (e.g., image, language, recommendation) with accelerators. Experience with distributed training and optimizing performance versus costs. Experience with CI/CD solutions in the context of MLOps and LLMOps, including automation with IaC (e.g. using terraform). Experience in systems design with the ability to architect and explain data pipelines, ML pipelines, and ML training and serving approaches.", "responsibilities": "Be a trusted advisor to our customers by understanding the customer’s business process and goals. Architect AI-drive spanning Data, AI and Infrastructure, and work with peers to include the full cloud stack into overall architecture. Demonstrate how Google Cloud is differentiated by working with customers, demonstrating features, tuning models, optimizing model performance, profiling, and benchmarking. Troubleshoot and find solutions to issues with training/serving models in a large-scale environment. Build repeatable technical assets (e.g., scripts, templates, reference architectures, etc.) to enable other customers and internal teams. Work cross-functionally to influence Google Cloud strategy and product direction at the intersection of infrastructure and AI/ML by advocating for enterprise customer requirements. Coordinate regional field enablement with leadership and work closely with product and partner organizations on external enablement activities.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/106747269717336774"}