{"title": "Data Analytics Apprenticeship, January 2025 Start", "level": "Early", "location": "New York, NY, USA; Chicago, IL, USA", "description": "This apprenticeship is intended for individuals who want to learn and develop entry-level technical and professional skills in data analytics. If you’re currently pursuing or have completed a degree in a Data Analytics related field, we encourage you to browse our University Graduate and Internship opportunities.", "salary": "$41,000-$54,500", "key_qualifications": "High school degree, GED equivalent, or practical experience. Not currently enrolled in or completed a Bachelor’s, Master’s, or PhD degree program in a data analyst-related field. Less than 1 year of relevant data analyst experience.", "preferred_qualifications": "Experience using Google Workspace or a similar suite of productivity tools. Experience thinking critically and excellent problem solving capabilities. Ability to navigate ambiguous tasks, find suitable solutions, and seek help/advice where appropriate. Ability to work independently and within a team framework. Enthusiasm and passion for new technologies, demonstrated through personal projects and commitment to learning new skills. Excellent communication and organizational skills, motivated, positive attitude, and excellent customer service capabilities.", "responsibilities": "Conduct custom analysis to uncover industry insights for Google's customer and internal teams and use data to glean insights, drive business decisions and quantify business impact. Optimize media by measuring/integrating business performance data in Google Ads platforms and measuring media impact across all marketing channels by using Google’s measurement solutions and third-party tools. Design statistically significant experiments/tests to answer research questions. Assess the right tools/languages to be used to solve business problems. Present findings to cross-functional partners to garner feedback and tailor analysis based on business context.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/106787310086824646"}