{"title": "AI Reporting Process Architect, Finance Systems and Transformation", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "The Finance Business Process Re-Engineering (FinBPR) team is responsible for providing thought leadership, best practices, and expertise for business-led transformation initiatives supporting process improvement and automation.", "key_qualifications": "Bachelor's degree in Computer Science, Engineering, Mathematics, Statistics, Accounting, Finance, Business, or equivalent practical experience. 5 years of experience architecting and building Financial data and reporting platforms in SQL, Python, and SAP business intelligence platforms. Experience in developing financial models and reports within the SAP environment leveraging SAC or SAP Business Planning and Consolidation (BPC). Experience planning AI/ML initiatives and with Finance processes and impacts.", "preferred_qualifications": "Master's degree in Finance, Business Analytics, Data Science, or equivalent practical experience. Experience designing and implementing data extractors and pipelines, data models and calculations, intuitive front-end business intelligence reports, and dashboards. Experience influencing executive leadership and driving change/decisions. Ability to shift between business-focused conversations with a financial leader to a technology-focused conversation with a technology/engineering team.", "responsibilities": "Develop relationships with Finance, Engineering, and other cross-functional partners to develop the AI enabled process transformation roadmap. Drive key process, and systems design decisions among both business and functional stakeholders by partnering with business leaders, as well as functional and technology leaders. Identify areas of improvements and automation leveraging various third-party business intelligence, data, reporting, AI/ML, and SAP solutions. Translate, communicate, and work in partnership with Engineering organizations on how to deliver on requirements, in terms of process, data, and technology.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/106727851700429510"}