{"title": "Operations Enablement Analyst", "level": "Mid", "location": "Hyderabad, Telangana, India", "description": "Trust & Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience in data analytics, Trust and Safety, policy, cybersecurity, or related fields.", "preferred_qualifications": "Master's degree in relevant field. Experience working cross-functionally and driving organizational change across various workflows, services, and teams. Knowledge of best practices for vendor management, specifically in streamlining processes and driving efficiency. Operational process expertise in a rapidly changing environment, and driving performance through process excellence. Leadership acumen and experience working with and influencing stakeholders. Excellent written and verbal communication and presentation skills, and the ability to influence cross-functionally at various levels.", "responsibilities": "Conduct strategic analysis, optimize business performance, and operational excellence within Content Moderation, including analyzing data, identifying trends, tracking partner performance, and developing solutions that improve business performance. Manage projects involving multiple stakeholders, tight timelines, important organizational implications, and changing circumstances. Produce actionable insights and key reporting across Content Moderation enablement pillars of finance and workforce management and efficiencies. Make recommendations and implement operational excellence programs and best practice (e.g., Efficiency tracker, analyzing cross functional opportunities). Identify operational, process, or cost management opportunities and advocate for positive change.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/106822083551339206"}