{"title": "Staff Data Scientist Lead, Product, Google Maps", "level": "Advanced", "location": "Tokyo, Japan", "description": "Help serve Google's worldwide user base of more than a billion people. Data Scientists provide quantitative support, market understanding and a strategic perspective to our partners throughout the organization. As a data-loving member of the team, you serve as an analytics expert for your partners, using numbers to help them make better decisions. You will weave stories with meaningful insight from data. You'll make critical recommendations for your fellow Googlers in Engineering and Product Management. You relish tallying up the numbers one minute and communicating your findings to a team leader the next. We are a part of Google Maps, and work with engineering teams on a variety of problems related to understanding the quality of Maps data, the connection between users and data quality, how to grow ecosystems of data contributors and contribution experience to support the company mission and engage users, and the impact of GenAI features on users and contributors.", "salary": "", "key_qualifications": "Master's degree in Statistics, Economics, Engineering, Mathematics, a related quantitative field, or equivalent practical experience. 7 years of experience with statistical data analysis. 5 years of experience with data mining, querying, and managing analytical projects. 3 years of experience developing and managing metrics or evaluating programs/products.", "preferred_qualifications": "5 years of experience in scripting or statistical analysis (e.g., R, Stata, SPSS, SAS) in a complex, matrixed organization. 3 years of experience preparing and delivering technical presentations to executive leadership. 3 years of experience in a technical leadership role. 3 years of people management experience (e.g., supervision, or team lead role).", "responsibilities": "Perform analysis utilizing relevant tools (e.g., SQL, R, Python). Provide analytical thought leadership through proactive and strategic contributions (e.g., suggests new analyses, infrastructure or experiments to drive improvements in the business). Own outcomes for projects by covering problem definition, metrics development, data extraction and manipulation, visualization, creation, and implementation of analytical/statistical models, and presentation to stakeholders. Develop solutions, lead, and manage problems that may be ambiguous and lacking clear precedent by framing problems, generating hypotheses, and making recommendations from a perspective that combines both, analytical and product-specific expertise. Oversee the integration of cross-functional and cross-organizational project/process timelines, develop process improvements and recommendations, and help define operational goals and objectives. Directly or indirectly oversee the contributions of others and develop colleagues’ capabilities in the area of specialization.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/106967644489294534"}