{"title": "ASIC Performance and Power Architect, Silicon", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "salary": "", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Engineering, Computer Science, a related field, or equivalent practical experience.\n3 years of experience in ASIC performance or power modeling, management, optimizations, and post-silicon characterization.\nExperience with SoC architecture and use case datapath with performance and power management concepts.", "preferred_qualifications": "Master's degree or PhD in Electrical Engineering, Computer Engineering or Computer Science, with an emphasis on computer architecture.\nExperience with performance in memory system and multimedia IPs in mobile SoCs (e.g., ISP, codecs, display processor).\nExperience in programming (e.g., Python) and database analysis (e.g., SQL).\nExperience in software power optimizations (e.g., Android, Linux) and post-silicon power productization.\nKnowledge of software and architectural design decisions on system power and thermal behavior.", "responsibilities": "Create use case workload and data flow models for Day of Use (DoU) power evaluation.\nDrive power and performance optimizations through SoC generations.\nPerform post-silicon profiling for power and performance model correlation.\nCollaborate with architecture team on power-performance trade-off analysis for engineering reviews and product roadmap decisions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/107096616988484294"}