{"title": "Engineering Manager, Borg Autopilot", "level": "Advanced", "location": "Kraków, Poland", "description": "Like Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers. You not only optimize your own code but make sure Engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way.\n\nWith technical and leadership expertise, you manage engineers across multiple teams and locations, a large product budget and oversee the deployment of large-scale projects across multiple sites internationally.\n\nThe Cluster Management (Borg) team is responsible for critical software that configures and runs Google data centers. The Borg team runs as a group of smaller teams executing on various aspect of the system. Our place as a core infrastructure team allows our work to have tremendous impact on the entire company and make Google Engineers' operational toil much smaller.\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). 3 years of experience in a technical leadership role; overseeing projects, with 2 years of experience in a people management, supervision/team leadership role.", "preferred_qualifications": "Master's degree or PhD in Computer Science, or a related technical field. Experience working in a complex, matrixed organization.", "responsibilities": "Shape the culture of the team, promoting an inclusive team that values psychological safety. Partner with technical leaders within and outside of the Borg organization to build and align the product strategy. Lead the product roadmap development and own its execution. Build a highly skilled team of Engineers and be part of shaping up the organization.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/107170107435688646"}