{"title": "Business Intelligence Architect, Google Cloud Marketing", "level": "Mid", "location": "Seattle, WA, USA; Sunnyvale, CA, USA", "description": "Strategy & Operations (S&E) professionals in Google’s Marketing organization provide business critical insights and analytics, ensure cross-functional alignment of goals and execution, and help teams drive strategic partnerships and new initiatives forward. Whether you are embedded within a specific marketing team to use insights to enable better marketing decisions or the global S&E function to equip the organization to succeed at scale...", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of analytics experience (i.e., BI, data engineering/science, etc.) using SQL. Experience with data analysis/modeling/architecture, or data quality governance. Experience working with cross-functional stakeholders (e.g., technical and non-technical).", "preferred_qualifications": "Experience with non-SQL development or analytics tools (i.e., object-oriented programming, R, Python, etc.) and Data Visualization. Experience with Enterprise Architecture and ability to translate ambiguity into a business/data taxonomy...", "responsibilities": "Gather business requirements from cross-functional stakeholders. Translate ambiguous business questions into concrete process models, scalable data models, and clear metric definitions/taxonomy. Produce production-data-warehouse quality SQL ETL. Be an excellent collaborator and technical project manager with the ablility to templatize technical architecture, scale BI development efforts through a supporting team of data engineers, and define standard best practices for reporting. Triage a large amount of user feedback and support requests to improve the warehouse, providing subject matter expertise and enablement to warehouse and downstream platform/visualization users, troubleshooting and resolving bugs, prioritizing feature requests, sending clear communications, and administrating change management across a large user base.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/107162500243301062"}