{"title": "Account Strategist, Mid-Market Sales, Google Customer Solutions (English, Norwegian)", "level": "Mid", "location": "Dublin, Ireland", "description": "Consulting with a wide variety of existing advertising companies of all sizes, you are committed to finding the optimal advertising solution for each client. Your interest in sales and the digital economy and your entrepreneurial drive enables brands to expand their businesses with Google's latest advertising products and solutions. Your understanding of online media combined with your commercial know-how shape how new and existing businesses grow. Using your effective communication skills, you are the face of Google to a portfolio of clients whose needs you listen to, and help define the strategy for how their products and services can reach thousands or millions of users. Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow. Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in advertising sales, marketing, consulting, or media.", "preferred_qualifications": "Experience strategically assessing and achieving client success via sales techniques including effective questioning, objection handling, and competitive selling. Knowledge of online marketing strategy and tactics, including expertise in managing digital advertising campaigns with a focus on performance marketing. Ability to build compelling narratives and utilize storytelling as a client engagement strategy. Ability to own a portfolio in an advertising or media sales context and consistently overachieve quotas to drive growth. Ability to communicate in English and Norwegian fluently to support client relationship management in this region. Ability to travel 20% of the time as needed.", "responsibilities": "Deliver against ambitious quarterly business and product growth targets. Own a portfolio of medium and large size businesses by thoroughly understanding growth drivers, identifying opportunities for growth, managing risks, and building multi-quarter plans for achievement. Pitch and consult with customers proactively to support annual digital marketing discussions and budgets. Drive customer growth by delivering outstanding customer sales experience and achieving customer business and marketing objectives. Provide stakeholder management and build relationships with the end customer or agencies.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/107190606979048134"}