{"title": "Data Center Technician", "level": "", "location": "Warsaw, Poland", "description": "The Hardware Operations team is responsible for monitoring the state-of-the-art physical infrastructure behind Google's powerful search technology. As a Data Center Technician, you will be part of a team that installs, configures, tests, troubleshoots, and maintains hardware and networking infrastructure to support the Google production of IT infrastructure. You'll participate in or lead small project teams on larger installations and develop project contingency plans. A typical day involves installation of racks and machines daily, as well as troubleshooting faulty infrastructure components. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "key_qualifications": "Bachelor's degree or equivalent practical experience. Experience with computer hardware and server hardware or troubleshooting/diagnosing. Experience with operating systems and networking infrastructures. Ability to travel up to 20% of the time internationally.", "preferred_qualifications": "Experience in maintenance and monitoring of server systems. Experience with Linux operating systems. Experience in project management and leadership. Ability to collaborate and partner with teams to overcome challenges.", "responsibilities": "Perform resolution of technical issues (e.g., hardware, software, application, operational, process) using different tools until final resolution, communicating with different stakeholders. Lead troubleshooting and resolve critical or escalated technical issues regarding affected equipment. Contribute to and lead efforts/projects in the deployment, maintenance, and support of Google Cloud region (cloud data center) infrastructure. Help test and troubleshoot new server hardware components and designs. Configure and troubleshoot OS-related issues on server.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/107155755265598150"}