{"title": "Senior Security Engineer, Google Cloud Business Platforms", "level": "Mid", "location": "Bengaluru, Karnataka, India; Hyderabad, Telangana, India", "description": "Our Security team works to create and maintain the safest operating environment for Google's users and developers. Security Engineers work with network equipment and actively monitor our systems for attacks and intrusions. In this role, you will also work with software engineers to proactively identify and fix security flaws and vulnerabilities. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree in Computer Science, a related technical field, or equivalent practical experience. 8 years of experience in security analysis and security assessment.", "preferred_qualifications": "Master's degree or PhD in Distributed Systems, Database Systems, or Cybersecurity. Experience leading Software Engineering teams either with direct or indirect/matrix reporting. Knowledge of public and private cloud infrastructure, distributed systems, and scalable, performant data systems. Knowledge of software development practices, including cloud security domain. Ability to design, develop, and operate cloud services and solutions.", "responsibilities": "Drive analysis of the architecture, design, and implementation of systems to ensure they meet security and compliance requirements. Provide security expertise and guidance to a diverse set of Google Engineering and Business teams. Conduct security reviews of core corporate and production systems. Drive enterprise focused security improvements to Google products and services. Build security tools and processes.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/107217640576950982"}