{"title": "Software Engineering Manager II, Google Assistant", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "Like Google's own ambitions, the work of a Software Engineer (SWE) goes way beyond just Search. SWE Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of engineers. You not only optimize your own code but make sure engineers are able to optimize theirs. As a SWE Manager you manage your project goals, contribute to product strategy and help develop your team. SWE teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way.\n\nGoogle is an engineering company at heart. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on users around the world. At Google, engineers not only revolutionize search, they routinely work on scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, social to local, Google engineers are changing the world one technological achievement after another.", "salary": "$189,000-$284,000 + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree, or equivalent practical experience.\n8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).\n3 years of experience in a technical leadership role; overseeing strategic projects, with 2 years of experience in a people management, supervision/team leadership role.", "preferred_qualifications": "Master's degree or PhD in Computer Science or related technical field.\n3 years of experience working in a complex, matrixed organization.", "responsibilities": "Set and communicate team priorities that support the broader organization's goals. Align strategy, processes, and decision-making across teams.\nSet clear expectations with individuals based on their level and role and aligned to the broader organization's goals. Meet regularly with individuals to discuss performance and development and provide feedback and coaching.\nDevelop the mid-term technical vision and roadmap within the scope of your (often multiple) team(s). Evolve the roadmap to meet anticipated future requirements and infrastructure needs.\nDesign, guide and vet systems designs within the scope of the broader area, and write product or system development code to solve ambiguous problems.\nReview code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/107386812158091974"}