{"title": "Product Specialist, Privacy Centric Measurement, Google Customer Solutions", "level": "Mid", "location": "Singapore", "description": "PSA (product and sales activation) is a collaborative group of individuals who work hard to deliver at-scale, customer focused priorities, transfer product knowledge to our GCS promoters, and influence product design for the GCS segment...", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience in product management, marketing, management consulting, or project management in technology. Experience working with Product Management or Engineering teams, executive leadership, and cross-functional stakeholders. Experience developing business strategies or managing cross-functional initiatives.", "preferred_qualifications": "Experience with measurement solutions. Experience influencing stakeholders to devise and scale a winning strategy, with the ability to understand and adapt to the motivations of different stakeholder groups. Familiarity with business models, including Leadgen/eCommerce customers. Excellent organizational and project management skills, with the ability to collaborate across cross-functional boundaries. Excellent communication and presentation development skills with the ability to take complex, ambiguous topics and turn them into stories that spark an audience. Excellent problem-solving skills.", "responsibilities": "Partner with APAC GCS Small Business Solutions Engage Sales teams and Google advertisers to increase adoption of Google's Privacy Centric Measurement solutions. Monitor and report on key drivers/metrics. Facilitate and run internal and external trainings. Work with promoter Solution Pros and Global PSA to ensure effective narratives are developed for APAC region/markets. Leverage those resources to equip promoters with product knowledge and expertise. Collate information regarding common objections, successful strategies, product knowledge gaps, etc. and lead product training. Share customer and product feedback with Global Product Leads in order to ensure the product roadmap reflects the needs of GCS promoters and customers.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/107507996270961350"}