{"title": "Strategy and Operations Associate, Go-To-Market (Fixed-Term Contract)", "level": "Mid", "location": "Sydney NSW, Australia", "description": "The Business Strategy & Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward.  We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives. As a part of the Australia and New Zealand Business Strategy and Operations (Go-To-Market) team, you will work closely with senior Large Customer Sales (LCS) leadership in Australia and New Zealand to enable Sales teams to deliver customer success, while driving higher growth and productivity for the long-term. In this role, you will respond to problem statements raised by the local leadership team via hypothesis generation, analyzing information, assessing potential options, and putting forward recommendations. You will provide clarity in ambiguous situations and use structured problem-solving to move projects and teams forward. You'll develop working relationships across Australia and New Zealand and APAC Strategy and Operations (Go-To-Market), and cross-functional teams both locally and globally. The Go-to-Market Operations (GtM) team ensures Google's complex and ever-evolving Ads business runs smoothly. We are instrumental in setting go-to-market strategy, and ensuring flawless execution and operations against the strategy. We have teams embedded in each of the major Ads business areas as well as global teams that work across the business areas. Team members are analytical and strategic, with a pragmatic sense of how to get things done.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience in management consulting, sales operations, business strategy, investment banking, venture capital, private equity or corporate advisory, or 2 years of experience with an advanced degree.", "preferred_qualifications": "2 years of experience creating complex data sets, data modeling, and reporting. 2 years of experience in advertising, consultative sales, business development, or a digital media environment.", "responsibilities": "Draw interpretable insights from sophisticated business analyses and advanced modeling. Design processes, tools, and operating cadences to achieve organizational outcomes. Develop comprehensive sales, product, or business strategies that solve complex business challenges, and address the needs of customers and stakeholders across various functions to drive incremental growth. Communicate data-driven recommendations to leadership and to the broader organization by preparing polished presentations and identifying key takeaways. Define actionable plans and roadmaps, and align cross-functional stakeholders to drive successful implementation of change initiatives.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/107593378073322182"}