{"title": "Senior Systems Software Engineer, GPU, Platforms", "level": "Mid", "location": "Taipei, Taiwan", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.", "key_qualifications": "Bachelor's degree in Computer Science, Electrical Engineering, or equivalent practical experience. 10 years of experience in system software development (e.g., embedded Linux, device drivers, system development, firmware, etc.). Experience coding in C or C++. Experience with Unix/Linux environments.", "preferred_qualifications": "Master's degree or PhD in Computer Science, Electrical Engineering, or a related technical field. 6 years of experience in designing and developing device drivers for peripherals such as GPUs, Switches, and connectivity buses such as USB, PCIe, etc. Ability to build tools to enable automation of tests to ship high quality systems. Excellent coding skills in C/C++.", "responsibilities": "Design, develop and maintain the system software stack for Graphics Processing Unit (GPU) system software. Provide technical leadership to help formulate and drive software development plans. Help identify dependencies in cross-functional teams and drive New Product Introduction (NPI) execution with a focus on development velocity and quality. Set technical direction and priorities for a small number of adjacent engineers within and across teams and recommend solutions that consider both short and long-term goals. Drive System Software integration to enable next generation GPU Accelerators for Google Data Center.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/107677944368767686"}