{"title": "Senior Firmware Engineer, Pixel Telephony", "level": "Mid", "location": "Mountain View, CA, USA; San Diego, CA, USA", "description": "Our team works on developing and launching mobile communication technologies and collaborating with internal and external partners to ensure a high-performance and reliable voice, messaging and data connectivity experience for Pixel and Android users. We design and develop Android applications, and the Android telephony connectivity framework that improves connectivity for Pixel Phones and Wearables. We also work closely on the 3GPP standards and other standardization bodies related to telecommunications. As a Firmware Engineer, Pixel Telephony, you will be a Technical Lead and executive member of the team, helping to lead and drive these initiatives. In this role, you will be responsible for Telephony Performance for all pixel products, driving improvement and setting up long term plans and architecture. The Google Pixel team focuses on designing and delivering the world's most helpful mobile experience. The team works on shaping the future of Pixel devices and services through some of the most advanced designs, techniques, products, and experiences in consumer electronics. This includes bringing together the best of Google’s artificial intelligence, software, and hardware to build global smartphones and create transformative experiences for users across the world.", "salary": "$142,000-$211,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Electrical Engineering, Computer Engineering, a related technical field, or equivalent practical experience. 7 years of experience with software development in one or more programming languages (e.g., C/C++, Java, Rust). 5 years of experience in Android Telephony and IP Multimedia Subsystem (IMS).", "preferred_qualifications": "Master’s degree or PhD in Engineering, Computer Science, a related technical field, or equivalent practical experience. 7 years of experience in embedded development. Experience in technology leadership, leading project teams and setting technical direction. Experience with Android operating system and connectivity framework, cellular wireless technologies, voice communication technologies such as RTP, Android media framework, and codecs. Knowledge of Linux kernel, Android system, and embedded software system design. Ability to collaborate within and outside the team.", "responsibilities": "Propose, design and develop new Telephony features in Pixel Android applications and/or in the Android framework. Collaborate with other teams in Google and external partners (e.g., mobile chipset vendors, operators and OEMs) to design, develop and launch features and products. Understand mobile wireless requirements and carrier specifications to implement new features defined by standard bodies or mobile operators that enhance user experience. Propose and implement various performance optimizations across the telephony stack (i.e., call/data performance, memory, power and/or bandwidth reduction). Debug and fix bugs reported during integration and field testing, and define mechanisms to mitigate issues. Define metrics that allow the monitoring of the performances of Pixel devices to validate implementations and detect rare issues that impact the user experience or the performance of devices.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/107687701125178054"}