{"title": "Senior UX Research Manager, Google Ads", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "As a User Experience (UX) leader, you help define and drive the future of Google design. You identify and set product strategy, envision complex UX ecosystems and inspire teams to push the boundaries of what’s possible. You possess a clear vision of the future of user experience and have the courage to pursue forward-thinking design.", "key_qualifications": "Bachelor's degree in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, related field, or equivalent practical experience. 10 years of experience in an applied research setting, or similar. 5 years of experience leading design projects and managing people or teams. 3 years of work experience working with executive leaders. Include a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link and/or access instructions).", "preferred_qualifications": "Master's degree or PhD in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, or related field. 15 years of relevant work experience, including experience integrating user research into product designs and design practices. 10 years of experience conducting UX research on products and working with executive leadership (e.g., Director level and above). 8 years of experience managing projects, and working in a large, matrixed organization. Strong understanding of the strengths and shortcomings of different research methods, including when and how to apply them during each product phase. Excellent working knowledge of statistics and the principles of experiment design.", "responsibilities": "Influence stakeholders across organizations to gain support for research-based, user-centric solutions. Own project priorities in alignment with larger product goals, and oversee allocation of resources within the project. Drive ideas to improve products and services through research-driven insights and recommendations. Lead teams to define and evaluate product, service, ecosystem impact. Own vision and strategy discussions through research by analyzing, consolidating, or synthesizing what is known about user, product, service, or business needs.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/107704404252992198"}