{"title": "Strategic Negotiator, Data Center Site Acquisition", "level": "Mid", "location": "Singapore", "description": "Google's infrastructure needs go far beyond server computers. As Google's products and services scale the globe, the Strategic Negotiation team works behind the scenes to secure infrastructure for Google's future -- everything from underwater cables to physical data center space. As a Strategic Negotiator, you combine your deep market knowledge of a given sector with tech industry savvy to negotiate cost-effective solutions to support Google's infrastructure growth. You'll work with specific project teams on negotiating deals, managing vendor and partner relationships and presenting deal recommendations to our Tech leadership. Your successful negotiations have the potential to save Google millions of dollars in operating costs and impact every part of the business.", "key_qualifications": "Bachelor's degree in Business Management, Public Policy, Finance, Real Estate, Technology, Engineering, or equivalent practical experience. 6 years of experience negotiating and structuring agreements or leading business development. Experience in collocation agreements, site selection for industrial-scale projects, real estate evaluation, acquisition, development, construction, utility agreements negotiation, implementing clean energy initiatives, or financial modeling. Experience managing projects and timelines within the Asia Pacific region.", "preferred_qualifications": "Experience in economic development policy, financial modeling, infrastructure development, agreement drafting/redlining, and presentation development. Experience in power transmission and distribution, telecommunications infrastructure, data center technology, industrial class electrical and cooling technology. Experience with real estate markets within India and establishing infrastructure in markets. Ability to provide commercial and technical solutions.", "responsibilities": "Work with internal and external Technical teams to identify, define, and pursue site selection projects and initiatives necessary to meet Google ongoing data center needs. Lead data center site evaluations and selection process, monitor progress against objectives, provide regular status reports, and financial metrics to support portfolio decisions. Lead the acquisition of appropriate data centers and develop strategic agreements with vendors, landowners, and key suppliers for space and utility services. Manage the strategy for ongoing growth at existing sites and develop metrics for the mapping and tracking of portfolio management issues regarding site/infrastructure development. Foster an open and inclusive workplace for colleagues in day-to-day interactions and conversations.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/107801600235315910"}