{"title": "Senior Software Engineer, Mobile (Android), Search", "level": "Mid", "location": "Zürich, Switzerland", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. With your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions. In Google Search, we're reimagining what it means to search for information – any way and anywhere. To do that, we need to solve complex engineering challenges and expand our infrastructure, while maintaining a universally accessible and useful experience that people around the world rely on. In joining the Search team, you'll have an opportunity to make an impact on billions of people globally.", "salary": "", "key_qualifications": "Bachelor’s degree or equivalent practical experience. Candidates will typically have 5 years of experience with software development in one or more programming languages, and with data structures/algorithms. Typically 3 years of experience testing, maintaining, or launching software products, and 1 year of experience with software design and architecture. Typically 3 years of experience with Android application development.", "preferred_qualifications": "Master's degree or PhD in Computer Science or related technical field. Candidates will typically have 1 year of experience in a technical leadership role. Experience developing accessible technologies.", "responsibilities": "Write and test product or system development code. Review code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency). Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback. Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality. Participate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/107966950235087558"}