{"title": "Mobile Firmware Engineer, Pixel", "level": "Mid", "location": "Mountain View, CA, USA; Kirkland, WA, USA", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. With your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.", "key_qualifications": "Bachelor's degree in Computer Science, Electrical Engineering, Computer Engineering, a related field, or equivalent practical experience. 5 years of experience in coding with a general purpose programming language (e.g., C/C++). 5 years of experience with cellular modem features development, analysis, carrier requirement management, and mobile device certifications. Experience working with cellular carriers.", "preferred_qualifications": "Experience with firmware, modems, protocols, 3GPP, and wireless communications. Experience with code and system health, diagnosis and resolution, and software test engineering. Experience with the 5G NR/LTE PHY and protocol layer procedures, with an understanding of L2, RRC, and NAS protocol and expected behaviors from 3GPP point of view. Excellent communication skills, with the ability to take initiatives and manage expectations, drive the features and resolutions delivery, and work with customers and carriers.", "responsibilities": "Work on the feature analysis, evaluations, and compliances for the carriers and participate in engineering tasks for the development of carriers features and certifications efforts. Triage product or system issues and debug by analyzing the sources of issues and the impact on hardware, network, or service operations and quality, track and resolve bugs, and communicate blockers with various stakeholders such as Testing teams, Certification teams, Engineers, and carriers' Technical Account Managers. Work closely with cellular carriers such as the US carriers and other emerging carriers to address their technical requests, the feature requirements, and the prompt issue resolutions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/107981732438778566"}