{"title": "Technical Program Manager II, Vulnerability and Risk Management, Payments", "level": "Mid", "location": "Pittsburgh, PA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nIn this role, you will require a blend of technical expertise in information security, risk management, and business continuity with stakeholder management and procedural enforcement skills. You will play a critical role in supporting and enhancing Payments risk posture by managing a wide range of privacy, security, compliance, and abuse risks across the product area.\n\nUsers come first at Google. Nowhere is this more important than on our Advertising and Commerce team: we believe that ads and commercial information can be highly useful to our users if that information is relevant to what our users wish to find or do. Advertisers worldwide use Google Ads to promote their products; publishers use AdSense to serve relevant ads on their website; and business around the world use our products (like Google Shopping, and Google Wallet) to support their online businesses and bring users into their offline stores. We are constantly innovating to deliver the most effective advertising and commerce opportunities of tomorrow.", "salary": "$122,000-$178,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in a technical field, or equivalent practical experience. 2 years of experience managing projects. Experience with business continuity. Experience with risk management, compliance or security processes.", "preferred_qualifications": "Professional certification in security and risk management (e.g., Sec+, SSCP, GSIF). 2 years of experience managing cross-functional or cross-team projects. Experience with workflow automation. Understanding of fundamental risk management concepts (e.g., inherent risk, residual risk, mitigating controls). Ability to perform repetitive tasks with varying specific details.", "responsibilities": "Verify information about risk items with issue identifiers and risk owners. Seek updates from risk owners non-compliant with mitigation/remediation Service Level Objectives (SLOs). Develop and maintain the organization's business continuity plan. Develop and implement policies and procedures for responding to disruptive events. Update data in the back-end risk management system while ensuring accuracy and consistency.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/107909387808318150"}