{"title": "Associate Technical Account Manager, Pixel Carrier Engineering", "level": "", "location": "Tokyo, Japan", "description": "In this role, you will act as the interface between external teams, partner test labs, and internal test and development teams. You'll be the interface between the carriers and the Hardware team, while also driving product and platform releases. You will coordinate with test partners, ensure all issues are tracked, and report issues back to the development team. Further to this, you will understand, prioritize, and drive resolution regarding issues found during certification testing. In addition, you'll support the product definition process with regards to certification, while helping to shape Google's best practices, tools, and processes for new Google branded hardware products. Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "key_qualifications": "Bachelor's degree in Science, Electrical, Electronics Engineering, a related technical field, or equivalent practical experience. 2 years of experience in a technical project management or a customer-facing role. 2 years of experience in cellular wireless such as LTE, 5G NR.", "preferred_qualifications": "Experience working with smartphone makers/network infra makers/telecom operators. Experience in analyzing, troubleshooting, problem-solving, test automation, and project management. Knowledge of wireless technology and devices. Ability to communicate in English and Japanese fluently, to interact with local stakeholders.", "responsibilities": "Support and drive the carrier and industry approvals of wireless devices in Japanese. Troubleshoot modem protocol stack problems and assist Engineering to make technical decisions. Generate and maintain compliance matrix documents for wireless devices. Analyze new network features and gather operator requirements, providing guidance and feedback to Engineering and Product Managers. Interface with internal and external stakeholders (Japanese stakeholders) for devices in any technical matter.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108048066061181638"}