{"title": "Manufacturing Business Manager", "level": "Mid", "location": "Mountain View, CA, USA", "description": "Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology. The US base salary range for this full-time position is $126,000-$187,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.", "key_qualifications": "Bachelor's degree in Supply Chain and Operations Management, Finance, Business, or equivalent practical experience. 7 years of experience in multi-disciplined procurement, leading strategy development, execution and sourcing, or a related function. 3 years of experience managing category strategies and sourcing teams across multiple categories for both goods and services in the indirect category space.", "preferred_qualifications": "MBA or JD. Experience managing outsourced procurement functions. Experience with manual and online running Request for Information (RFIs) and Request for Proposal (RFPs). Experience leading teams through multi-year organizational transformation within the technology industry. Proficient analysis and presentation skills.", "responsibilities": "Finalize supplier lists, develop and issue (e.g., Request for Information (RFI), Request for Proposal (RFP), Request for Quote (RFQ), Request for Bid (RFB), etc.), participate in eAuction/eBidding, conduct discussions, award suppliers, and close-out projects. Curate, consolidate, and draw insight from data to support supplier management activities, including defining supplier performance criteria and procedure, executing expectations, monitoring performance data and identifying performance issues, conducting business review, managing escalations, and driving continuous improvement. Manage and ensure efficiency in process optimization, emphasizing quality across sourcing and delivery.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108084261898068678"}