{"title": "Senior Motion Designer, Google Workspace", "level": "Mid", "location": "Boulder, CO, USA; Los Angeles, CA, USA; +6 more; +5 more", "description": "At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" Google’s Motion Designers collaborate with cross-functional partners to create desirable and relevant product experiences that consistently elevate the Google brand. They help people make sense of their world by choreographing experiences that feel fluid, natural, and informative.\n\nGoogle User Experience (UX) is made up of multi-disciplinary teams of UX Designers, Researchers, Writers, Content Strategists, Program Managers, and Engineers: we care deeply about  the people who use our products. The UX team plays an integral part in gathering insights about the attitudes, emotions, and behaviors of people who use our products to inspire and inform design. We collaborate closely with each other and with engineering and product management to create industry-leading products that deliver value for the people who use them, and for Google’s businesses.\n\nAs a Motion Designer, you’ll apply your passion for animation to simplify complex interactions and solve challenging design problems. You’ll help define and implement Google’s motion design language and you’ll think critically about how motion reinforces Google’s UX brand, enhances interactivity, and delights our users.\n\nYou will shape the future by designing products that harness the power of Google to delight and inspire people worldwide. You will be proactive, creative, optimistic, progressive, open-minded and resourceful.\n\nThe web is what you make of it and our team is helping the world make more of the web. From open-source pros to user-experience extraordinaires, we develop products that help users connect, communicate and collaborate with others. Our consumer products and cloud platforms are giving millions of users at homes, businesses, universities and nonprofits around the world the tools that shape their web experience -- and changing the way they think about computing.\n\nThe US base salary range for this full-time position is $142,000-$211,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. \n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about <a href=\"https://careers.google.com/benefits/\">benefits at Google</a>.", "key_qualifications": "Bachelor's degree in Design (e.g., Interaction, Film, Graphic, Visual Communications, Product), a related field, or equivalent practical experience.\n6 years of motion design experience in product design or UX/UI animation.  \nExperience working with designers, researchers, engineers, content strategists, and product managers throughout the design process.\nExperience in motion design related to product goal and marketing videos.\nExperience in storyboarding related to visualizations of new technologies and use cases.\nInclude a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link or access instructions).", "preferred_qualifications": "Experience in video/motion tools (e.g., Adobe After Effects, premiere, principle, etc.).\nKnowledge of visual storytelling and motion design.\nFamiliarity with User Interface (UI) motion design principles, practice, and execution.\nFamiliarity with visual design tools (e.g., Figma).\nExcellent Illustration skills for visualizing storyboards and strategy.\nExcellent visual design and communication skills.", "responsibilities": "Work alongside researchers, writers, and visual/interaction designers to communicate product goals and future experiences.\nCommunicate nuanced product interactions and features clearly through motion. Take rough concepts and ideation sketches, and bring them to life through motion and visual hierarchy.\nDevelop and deliver coherent motion assets and systems that contribute to consistent product messages and user stories. \nWork quickly and effectively under tight timelines to produce content from early motion prototypes to polished product concepts.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108100922076209862"}