{"title": "Regulatory and Litigation Counsel", "level": "Advanced", "location": "Sydney NSW, Australia", "description": "As Corporate Counsel at Google, you work on the most exciting legal issues as disruptive technological innovations require creative and proactive legal guidance. You're part of a whip-smart group of in-house lawyers and the projects and cases you take on challenge you to think big and differently. You are collaborative -- ready to partner in initiatives that influence all aspects of the business and work with Googlers from all over the company. As an integrated part of the team, you proactively assess legal risks and advise on products that will not only move information into the 21st century, but move information law forward as well. Regulatory Affairs helps the company innovate responsibly and comply with laws around the world. We partner with teams across Global Affairs, Product Areas, and the rest of the company to ensure constructive engagement with governments and regulators while mitigating risk. 20th century laws don't always solve 21st century problems, and Google Legal crafts innovative approaches for working with some of the toughest legal challenges of the information age. Whether you're a patent attorney, an intellectual property expert or an engineer headed to law school, Google Legal lets you address unanswered legal quandaries and create new precedents. Our innovative services raise challenging questions that demand creative and practical answers. We provide those answers by working at the crossroads of the law and new technology, helping Google build innovative and important products for users around the world.", "salary": "", "key_qualifications": "JD, LL.B., equivalent degree, or equivalent practical experience. Admitted to the bar and in good standing or otherwise authorized to practice law (e.g., have registered in-house status) in the state in which the position is located. 7 years of attorney-level experience in government, in-house, or at a law firm. Experience in litigation/regulatory investigations and enforcement, and internal investigations and incidents. Experience developing, evaluating, and maintaining programs that ensure products comply with laws, regulations, and external commitments.", "preferred_qualifications": "10 years of experience managing legal, regulatory or litigation matters, including managing and defending against regulatory scrutiny and other high-risk legal work. Experience working with public company boards and their counsel, including special committees and audit committees. Experience working with technology companies and ability to understand complex technical issues. Experience managing projects and partnering effectively with cross-functional teams. Experience engaging with government regulators (e.g., global data protection, consumer protection, and other authorities). Excellent attention to detail, with the ability to be action-oriented and seek to meet the highest standards of integrity.", "responsibilities": "Lead responses to regulatory inquiries, investigations, litigation, enforcement actions, and overlapping civil matters. Oversee the collection and production of accurate information in external submissions and disclosures. Provide legal advice on government and regulatory audits and exams.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108254270662288070"}