{"title": "Software Engineer, Android, Google Pixel", "level": "Mid", "location": "Warsaw, Poland", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. The Google Pixel Mobile Experiences team is a highly skilled and passionate group of individuals dedicated to creating the best device experience for Pixel users worldwide. As a member of this team, you will be at the forefront of the innovative Pixel ecosystem and responsible for making Pixel the most loved Android devices in the world. You will be part of a cross-functional team responsible for delivering exceptional user experiences across all aspects of the Pixel ecosystem. You will have the opportunity to work on technologies that have a direct and positive impact on Pixel users worldwide. Android is Google’s open-source mobile operating system powering more than 3 billion devices worldwide. Android is about bringing computing to everyone in the world. We believe computing is a super power for good, enabling access to information, economic opportunity, productivity, connectivity between friends and family and more. We think everyone in the world should have access to the best computing has to offer. We provide the platform for original equipment manufacturers (OEMs) and developers to build compelling computing devices (smartphones, tablets, TVs, wearables, etc) that run the best apps/services for everyone in the world.", "salary": "", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree in an industry setting. 2 years of experience with data structures or algorithms in either an academic or industry setting, and with Android application development. Experience working on Java or Kotlin.", "preferred_qualifications": "Master's degree or PhD in Computer Science or a related technical field. 2 years of experience with performance, large-scale systems data analysis, visualization tools, or debugging. Experience developing accessible technologies. Experience working on Swift/C++. Proficiency in code and system health, diagnosis and resolution, and software test engineering.", "responsibilities": "Design, develop, and maintain software solutions that improve the user's Pixel experience. Define and implement Pixel-specific capabilities that make Pixel stand out amongst all Android devices. Ensure seamless integration of AI capabilities into Pixel's software and hardware components. Work closely with UX designers to advocate user-centric, intuitive design principles and advocate for user delight and accessibility. Collaborate with hardware, product management, and other teams to bring Pixel's unique features and experiences to market. Explore and experiment with new mobile and AI technologies, pushing the boundaries of what’s possible on mobile devices. Write technical designs and participate in technical discussions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108262753021371078"}