{"title": "Systems Development Engineer, Observability, Public Sector", "level": "Mid", "location": "Reston, VA, USA", "description": "As a Systems Development Engineer (SDE) at Google, you will manage services and systems at scale. You will creatively put their engineering discipline to use automating the mundane and reducing toil. We emphasize the development of tools and solutions that fix classes of problems. We focus on observability, instrumenting first, then turning data into knowledge, and finally knowledge into action. Google Public Sector brings the magic of Google to the mission of government and education with solutions purpose-built for enterprises. We focus on helping United States public sector institutions accelerate their digital transformations, and we continue to make significant investments and grow our team to meet the complex needs of local, state and federal government and educational institutions.", "key_qualifications": "Bachelor's degree in Computer Science or IT-related field, or equivalent practical experience. 5 years of experience with systems automation, and with systems design and implementation. Experience in coding or scripting in languages including Go, Python, Java or Bash. Active US Government Top Secret/Sensitive Compartmentalized Information (TS/SCI) security clearance with polygraph.", "preferred_qualifications": "5 years of experience in Kubernetes. Experience with Linux/Linux Kernel. Experience in Monitoring solutions. Knowledge of networking fundamentals (e.g., TCP/IP, Routing, VLANs, Load Balancing, etc.)", "responsibilities": "Work closely with internal teams to keep our production infrastructure running smoothly. Lead the design and implementation of large and complex systems that help the team achieve its goals. Troubleshoot technical issues, evaluate technical data, and develop recommendations for systems and services within the domain. Participate in on-call service rotation. Contribute to maintaining systems, as well as occasionally writing documentation and developing or integrating new components.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108580628047241926"}