{"title": "Senior Program Manager I, Risk Management and Compliance, Global Affairs", "level": "Advanced", "location": "Chicago, IL, USA; Austin, TX, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in program or project management. Experience in compliance, information security, IT audit, or risk management.", "preferred_qualifications": "8 years of experience managing cross-functional or cross-team projects. Experience working with stakeholders and users. Ability to influence others, support, and maintain key relationships over time. Ability to adapt and work in a fast-changing environment, with excellent negotiation skills.", "responsibilities": "Partner with stakeholders to understand key business and user needs, identify strategic solutions, and set and execute the idea and strategy for Global Affairs scaled solutions and tools. Serve as Solutions Enablement’s business liaison to Global Affairs compliance organizations. Identify, assess, and advise stakeholders and customers on compliance risks and controls. Help prioritize competing business needs and articulate them to Product teams to influence the product roadmap to address stakeholder needs and enable business strategy. Collaborate with cross-functional stakeholders and external partners to support the implementation of solutions and tools to ensure a sustainable governance, risk, and compliance program.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108560248762966726"}