{"title": "Executive Business Partner, Google Threat Intelligence", "level": "Mid", "location": "Reston, VA, USA", "description": "As an Administrative Business Partner, you're at the heart of your team's business operations and activities and the soul that keeps your team moving forward. You anticipate the needs of your managers and team members and help them stay focused on their projects by resolving operational and administrative issues before they arise. You move quickly with the changing environment and are up to date with the latest Google products and services. You also use that knowledge to strategically support your team's projects. In addition to being organized and analytical, you possess the strong business judgment and communication skills needed to interact with a variety of people and job functions.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of administrative experience in a high-tech or international environment working on core administrative tasks (e.g., travel management, expense reports, calendar management, facilities coordination, etc.)", "preferred_qualifications": "Experience in using technology and the internet to improve work efficiency. Ability to adhere to an expectation of complete confidentiality on all business matters. Ability to effectively communicate and collaborate with a diverse range of people and job functions. Ability to quickly learn new tools and technologies.", "responsibilities": "Schedule, maintain, and update calendar events. Prepare meetings for the executive or team without assistance. Execute expense management activities separately. Plan and organize internal and external programs and events and manage event logistics in collaboration with internal partners and external vendors. Assess and advocate for office space needs. Complete travel coordination tasks without assistance.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108655293906199238"}