{"title": "Marketing Category Manager", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "In the Google Procurement Organization (GPO), our aim is to unlock value for Google to reinvest in what matters most. We do this by bringing velocity, efficiency, and security to buying at Google, while partnering deeply across Google to deliver solutions fit for purpose. As a centralized organization operating in a high complexity environment, we represent stakeholders and suppliers to ensure the best outcomes. Our organization fosters a culture of collaboration and innovation while providing opportunities for ongoing career growth and development.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 7 years of experience in procurement, leading marketing, advertising category sourcing, or strategy development, or a related function within an advertising agency or marketing.  Experience working with vendor manager or advertising agencies.", "preferred_qualifications": "Advanced degree. Experience in global initiatives that optimize buying strategies, streamline operations, and innovative solutions to improve procurement effectiveness.  Experience influencing and negotiating with cross-functional teams and internal and external stakeholders.  Experience supporting initiatives from strategy to execution and delivering results with strong problem solving skills.  Understanding of creative and social campaign processes, and ability to utilize technology and analytics to optimize strategies, resulting in data-driven decisions that enhance performance and profitability.  Ability to develop and execute strategic procurement plans, leveraging stakeholder engagement, contract management, supplier analysis, and performance optimization, while effectively resolving complex issues.", "responsibilities": "Analyze spent data to identify trends and cost-saving opportunities. Lead Request for Proposal (RFP)/Request for Information (RFI) processes and negotiations with marketing agencies. Cultivate strong agency relationships for optimal service. Partner with Media Lab, Marketing Operations, Product Marketing, and other teams to align procurement with business goals. Monitor compliance, track performance, and stay informed on industry trends and best practices.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108764085226480326"}