{"title": "Test Engineer, Engineering Productivity", "level": "", "location": "Bucharest, Romania", "description": "At Google, our philosophy is build it, break it and then rebuild it better. That thinking is at the core of how we approach testing at Google. Unlike roles with similar names at the other companies, Test Engineers at Google aren't manual testers -- you write scripts to automate testing and create tools so developers can test their own code. As a Test Engineer, you navigate Google's massive codebase, identify weak spots and constantly design better and creative ways to break software and identify potential problems. You'll have a huge impact on the quality of Google's growing suite of products and services. You independently plan and execute own work assignments, write and generate comprehensive test plans for large integration, system, or end-to-end testing for nontrivial features or small-sized projects. Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in coding, developing test methodologies, writing test plans, creating test cases, and debugging. Experience developing test automation solutions and automated internal frameworks, or working on engineering productivity tools and frameworks. Experience building test automation frameworks and tools.", "preferred_qualifications": "Master's degree in Computer Science, Electrical Engineering, or a related field. 2 years of experience in specialized testing such as production testing, system integration testing, etc. Experience in Python or Java. Ability to develop test plans and execute evaluation/debugging/root causing.", "responsibilities": "Develop new automated tests for new features to meet the established quality for release. Maintain the existing suite of tests and add framework enhancements. Act as an Engineering Productivity feature owner with our stakeholders (e.g., Contractor teams for manual regressions, Product Managers, Engineering). Impact the productivity of engineers working in the Device Management App landscape by providing tools, processes and guidance for improving app testability and writing automated test cases. Collaborate with engineering teams and work across a full-stack (e.g., client, server, device) to align on strategies, and develop tooling and automation to improve product quality and release speed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108759128297349830"}