{"title": "Program Manager II, Real World Journeys, Google Search", "level": "Mid", "location": "Cambridge, MA, USA; Reston, VA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company. Real World Journey’s mission as a team is to inspire action by connecting people with experiences that make life better. Doing that well means that we help people save time, money, and connect with each other and the world. In Google Search, we're reimagining what it means to search for information – any way and anywhere. To do that, we need to solve complex engineering challenges and expand our infrastructure, while maintaining a universally accessible and useful experience that people around the world rely on. In joining the Search team, you'll have an opportunity to make an impact on billions of people globally.", "salary": "$117,000-$172,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in program or project management. Experience in horizontal process improvements, change management, roadmap development, and driving OKR development.", "preferred_qualifications": "2 years of experience managing cross-functional or cross-team projects. Ability to learn technical material, processes, and applications as well as develop knowledge in new areas and projects. Ability to manage multiple assignments and work independently with both local and distributed teams. Excellent organizational, project management, and written/verbal communication skills.", "responsibilities": "Learn and build knowledge in new processes and technical applications. Collaborate with Engineering and Product teams to develop strategies, roadmaps, and project impact. Prioritize and manage projects and deliverables, and adapt projects to changing processes and requirements. Monitor progress, communicate with organizational leadership, and manage program risks proactively.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108789323729380038"}