{"title": "Trust and Safety Professional", "level": "Mid", "location": "Washington D.C., DC, USA; Atlanta, GA, USA", "description": "Trust & Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you're a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety. At Google we work hard to earn our users’ trust every day. Trust & Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience in data analytics, Trust and Safety, policy, cybersecurity, or related fields.", "preferred_qualifications": "Master's degree in relevant field. Education in, or experience with, machine learning or AI. Experience in Trust and Safety or product risk roles. Excellent communication and presentation skills (written and verbal) and the ability to influence cross-functionally at various levels.", "responsibilities": "Design and implement integrations between business objectives and business systems, including designing and building strategies that support these business systems. Conduct strategic analysis, optimize business performance, and deliver within relevant product areas. Analyze data, identify trends, and develop solutions that improve business performance. Manage projects involving multiple stakeholders, tight timelines, important organizational implications, and changing circumstances. Use Google’s big data to conduct data-oriented analysis, architect metrics, synthesize information, solve problems, and influence business decision-making by presenting insights and market trends.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108712430929879750"}