{"title": "Program Manager, Google Cloud Business Platforms", "level": "Mid", "location": "Bengaluru, Karnataka, India; Hyderabad, Telangana, India", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. ... Google Cloud accelerates every organization’s digital transformation by delivering enterprise-grade solutions that leverage Google’s cutting-edge technology and tools to help developers build more sustainably.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in managing projects.", "preferred_qualifications": "Experience with Agile development methodology. Ability to effectively operate with flexibility in a fast-paced, constantly evolving team environment. Excellent communication skills, with the ability to represent and prepare executive level communication and articulate business or technical concepts to executive leadership. Passion for driving product innovation and excellence.", "responsibilities": "Manage a portfolio of complex projects and workstreams, and be responsible for overall program strategy, governance, operating model, and program operations. Be responsible for program scoping, planning, creating and managing integrated schedules, setting milestones, and program tracking. Lead complex and cross-functional business impacting programs. Work with Product, Engineering, and other stakeholders to drive program strategy and execution. Navigate multiple work streams, functional and technical concepts, and conversations across different areas and stakeholders to drive collaboration and consensus. Lead the creation of integrated timelines and schedules, track the progress, manage dependencies, proactively identify and communicate risks, and identify mitigations.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108751576402666182"}