{"title": "Visual Design Lead, Devices and Services", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "At Google, Visual Designers weave iconography, typography, color, space and texture together to help our users successfully navigate our products. We believe that all of our products should be beautiful and accessible. As a Visual Designer, you’ll delight users with designs that inspire, engage and excite them.  You’ll rely on user-centered design principles to produce high-quality visuals—from concept to execution—across many platforms. Like all of our UX jobs, you’ll collaborate with your fellow designers to constantly refine the Google design language and create innovative, great-looking products that people love to use. Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "key_qualifications": "Bachelor's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 8 years of experience in product design or UX. 3 years of experience leading design projects and managing people or teams. Experience implementing visual design systems across platforms in a software development environment. Include a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link or access instructions).", "preferred_qualifications": "Master's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 3 years of experience working with executive leaders. Experience collaborating with multidisciplinary UX or product teams (e.g., motion, interaction, UX research, engineering, content strategy) on technical implementation. Experience working in a complex, cross-functional organization. Experience in conceiving and documenting solutions through personas, user journeys, storyboards, value propositions and sketches. Passion for design as well as a pulse on emerging trends, products and technology.", "responsibilities": "Lead design projects that either seek to conceptualize individual products or define the goal for a category as a whole. Provide direction and leadership for visual designers to explore future opportunities for Google Hardware and deliver visual, motion and system design directions for existing surfaces. Influence stakeholders and collaborate with cross-functional partners across functions to gain support for design strategies. Create compelling visual presentations, storyboards and prototypes showing solutions and context for both peers, users and leadership. Drive a holistic design process, design system, or design language across teams or products.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108871376932086470"}