{"title": "Account Executive, Large Customer Sales", "level": "Mid", "location": "New York, NY, USA", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.\n\nOur Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.", "salary": "$114,000-$167,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of industry experience in digital advertising, consultative sales, business development, or digital marketing, or 3 years of experience with an advanced degree. Experience working with advertisers, agencies, and/or clients.", "preferred_qualifications": "Experience building trusted-advisor relationships with C-level executives. Managing multiple projects, business leads, and internal stakeholders. Experience with Google Ad Solutions, expertise in video advertising (AI-powered Performance and Video, CTV) and understanding of competitor landscape across traditional and digital media advertising. Ability to tenaciously sell/propose creative technologies across a landscape of diverse decision makers. Proven ability to develop joint business plans in complex, ambiguous environments, influence or collaborate across organizations, and drive business success for the customer and Google. Strong strategic and tactical thinking skills, systems thinking, and the ability to align strategies to deliver customer business outcomes.", "responsibilities": "Build and manage relationships with C-level clients and senior partner stakeholders. Develop a comprehensive understanding of their business challenges, marketing objectives, and success metrics. Structure a clear, long-term joint strategy between Google and clients, and lead a cross functional team within Google to collaborate on projects and drive client success. Plan for, and achieve, growth goals, through the presentation of Google advertising products/solutions that will help clients to meet their marketing objectives. Develop forward thinking, data-driven analyses and consultative recommendations that align with customer goals, and quantify high-impact opportunities with clear recommendations to present to customers. Build an in-depth knowledge of how Google Advertising products work and can be used to help meet a wide range of marketing objectives.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108873436368904902"}