{"title": "Senior Staff Product Design Engineer, Thermal/FEA", "level": "Advanced", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "key_qualifications": "Bachelor's degree in Mechanical Engineering, Product Design, or equivalent practical experience. 12 years of experience with FEA/Thermal. Experience designing mechanical components such as plastic or metal parts, mechanical assemblies, printed circuit boards, or flexes. Experience using simulation tools such as Abaqus, Hypermesh, Icepak, or Flotherm. Experience using computer-aided design tools such as NX, Creo, or Solidworks. Experience leading multiple engineering teams including FEA/Thermal teams.", "preferred_qualifications": "Master’s degree in Mechanical Engineering or Product Design. 15 years of experience in consumer product design. Experience shipping multiple consumer products in a lead, senior staff, or principal engineer role. Experience collaborating with suppliers around the world on part manufacturing and final assembly, including onsite factory support. System integration experience, including electro-mechanical components (audio, display, camera, antenna, etc.), waterproofing, thermals, grounding, or product architecture. Proficiency with Abaqus, Hypermesh, Icepak, Flotherm, NX and Teamcenter, including technical knowledge of multiple manufacturing methods used in consumer products.", "responsibilities": "Apply design, engineering, and technical expertise designing complex systems from concept to mass production with structural FEA and thermal design simulations. Collaborate with suppliers of subsystems and/or individual parts throughout the design and manufacturing process. Anticipate and address product design issues or risks, analyze data, and validate product design to suggest or implement design improvements for structural FEA and thermal design. Manage the product design, provide guidance to team members, communicate progress, and request feedback to prevent/remove roadblocks. Identify the root cause of design, manufacturing, or reliability issues and develop corrective actions. Balance design considerations such as functionality, sustainability, reliability, human factors, manufacturability, and aesthetics.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108980986644964038"}