{"title": "Logistics Operations Manager, Data Centers", "level": "Mid", "location": "Austin, TX, USA", "description": "Server Operations Logistics leads and manages all logistics operations required within the Google Data center campuses...", "key_qualifications": "Bachelor's degree in Business, Logistics, Operations, Engineering, a related field, or equivalent practical experience. 5 years of experience managing third-party logistics providers/vendors. 5 years of experience in operations management. 5 years of experience identifying issues in processes and creating solutions, and working with cross-functional teams to drive these changes.", "preferred_qualifications": "Experience managing operations in multiple locations simultaneously. Ability to be successful in operations management, problem-solving, third-party logistics vendor relationships, budget creation, and cost management.", "responsibilities": "Own the day-to-day logistics operations management of multiple data center locations. Create, lead, and support cross-functional company initiatives/projects. Manage Third-party logistics partners with associates on their teams dedicated to our account. Manage and monitor metrics for key performance indicators (KPIs), vendor performance scorecards, and development of business cases to support logistics process changes or improvements. Drive alignment and prioritization of initiatives in a fast-paced environment with many interdependencies. Manage quarterly budgets, invoice control, and capital improvement projects within your locations. Manage relationships with multiple internal customers at data centers. Recognize improvement opportunities to the cost or quality of services to be provided. Be proactive in turning these thoughts into a documented business case, present the business case to your peers and management for approval, and provide ongoing project management.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/108909349341930182"}