{"title": "Student Researcher, PhD, Fall 2024", "level": "Intern & Apprentice", "location": "Waterloo, ON, Canada; Montreal, QC, Canada", "description": "The Student Researcher Program’s primary objective is to foster academic collaborations with students through research at Google. Join us for a paid Student Researcher position that offers the opportunity to work directly with Google research scientists and developers on cutting-edge research projects. The Student Researcher Program offers more opportunities for research students to work on critical research projects at Google in a less structured way. The program allows for opportunities beyond the limitations of our traditional internship program on aspects such as duration, time commitment, and working location (with options for on-site or remote). The topics student researchers work on tend to be open-ended and exploratory, and don't always have a clear deliverable like a traditional internship would. Google Research is building the next generation of intelligent systems for all Google products. To achieve this, we’re working on projects that utilize the latest computer science techniques developed by skilled software developers and research scientists. Google Research teams collaborate closely with other teams across Google, maintaining the flexibility and versatility required to adapt new projects and foci that meet the demands of the world's fast-paced business needs.", "salary": "", "key_qualifications": "Currently enrolled in a PhD degree in Computer Science, Linguistics, Statistics, Biostatistics, Applied Mathematics, Operations Research, Economics, Natural Sciences, or related technical field. Experience in one area of computer science (e.g., Natural Language Understanding, Computer Vision, Machine Learning, Deep Learning, Algorithmic Foundations of Optimization, Quantum Information Science, Data Science, Software Development, or similar areas).", "preferred_qualifications": "Currently enrolled in a full-time degree program and returning to the program after completion of the internship. Currently attending a degree program in Canada. Experience as a researcher, including internships, full-time, or at a lab. Experience contributing research communities or efforts, including publishing papers in major conferences or journals. Experience with one or more general purpose programming languages (e.g., Python, Java, JavaScript, C/C++, etc.).", "responsibilities": "Participate in research to develop solutions for real-world, large-scale problems.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109065472208446150"}