{"title": "Security Engineer, Abuse Vulnerability Rewards Program", "level": "Mid", "location": "Seattle, WA, USA; Washington D.C., DC, USA", "description": "There's no such thing as a \"safe system\" - only safer systems. Our Security team works to create and maintain the safest operating environment for Google's users and developers. As a Security Engineer, you help protect network boundaries, keep computer systems and network devices hardened against attacks and provide security services to protect highly sensitive data like passwords and customer information. Security Engineers work directly with network equipment and actively monitor our systems for attacks and intrusions. You also work with software engineers to proactively identify and fix security flaws and vulnerabilities.\n\nYou use your industry experience to own and drive the resolution of complex security incidents, policy questions and technical security issues.\n\nThe Abuse Vulnerability Rewards Program recognizes the contributions of security researchers who invest their time and effort in helping us make our products less susceptible to bad actors that intend to commit significant acts of abuse against our products and users.\n\nThe Abuse Vulnerability Rewards Program (VRP) is a bug bounty program which covers abusive use of Google's systems, including new Generative AI products. The program recognizes the contributions of security researchers who invest their time and effort in helping us make our products less susceptible to bad actors that intend to commit significant acts of abuse against our products and users. The VRP team is responsible for assessing VRP reports, interacting directly with researchers and product teams, deciding on rewards for reporters, and managing coordinated disclosure of vulnerabilities.", "salary": "$161,000-$239,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n5 years of experience with security assessments, security design reviews, or threat modeling.\n5 years of experience with security engineering, computer and network security, and security protocols.\n5 years of experience coding in one or more general purpose languages.", "preferred_qualifications": "Experience with writing Python code in production environments.\nExperience working with external parties or in a publicly-facing role.\nExperience with generative AI or similar AI/ML systems.\nExperience working in bug bounties.\nExcellent problem-solving and critical thinking skills, with attention to detail in an ever-changing environment.", "responsibilities": "Serve as a point of technical escalation for first-line triage and manage communication between researchers and product teams.\nAssess reported bugs critically to determine what, if any, reward should be issued for them.\nGrow and develop the technical capabilities of the team and of individual team members.\nParticipate in the larger VRP community and engage in cross-team projects to improve the bug bounty experience for all reporters.\nDevelop and guide the scope and handling of Generative AI issues reported to the bug bounty.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109197166106288838"}