{"title": "Director, Google Play Partnerships", "level": "Director", "location": "Beijing, China; Shanghai, China", "description": "Google Play’s ecosystem in Greater China is dynamic and rapidly evolving. As the regional leader, you will drive the growth of apps and games ecosystem around Android and Play platforms across China, Taiwan, and Hong Kong. You will lead the local team, empower partners to succeed on Google Play, and advocate for the adoption of Android platforms and related products.", "key_qualifications": "Bachelor's degree or equivalent practical experience, 15 years of experience in Business Development, Sales, or equivalent experience in tech industry, 15 years experience leading a team or business in a cross-functional setting within an organization in tech industry, Experience working in a global product, sales, and engineering environment, Experience managing distributed teams, Experience working with mobile apps and the games ecosystem", "preferred_qualifications": "MBA degree, Experience leading and developing partnerships teams with increasing responsibility, Experience addressing policy, regulatory, and legislative issues, Excellent negotiation skills and experience solidifying strategic partnerships, Exceptional communication and advocacy skills, including the ability to engage executive stakeholders, Established network of executive-level relationships within the industry", "responsibilities": "Design and execute a multi-year strategy and plan for the Greater China Google Play business to accelerate developer success, defining clear priorities and tracking systems, Build upon Google Play’s global strategy and guide your teams to support the growing regional business, Partner strategically with Google's Greater China leadership to drive cross-product area strategy and lead regional initiatives, Advocate for initiatives for Google Play in Greater China and across Asia Pacific, actively influencing stakeholders in a matrixed organization, Ensure consistent policy guidelines and enforcement. Collaborate with cross-functional teams to anticipate local changes and maintain Google Play's readiness to respond. Lead, motivate, and nurture a high performing team to achieve the above goals.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109209295899239110"}