{"title": "Technical Program Manager III, Data Center Deployment, Cloud Networking", "level": "Mid", "location": "Atlanta, GA, USA; Thornton, CO, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish.", "key_qualifications": "Bachelor's degree in a technical field or equivalent practical experience. 5 years of experience in program management influencing across a cross-functional organization. Experience with data center or networking deployments.", "preferred_qualifications": "5 years of experience managing cross-functional or cross-team projects. Experience working with ML in a compressed deployment environment. Knowledge of data networking architectures and physical network components. Knowledge of ML product deployments. Familiarity with network planning and engineering, including data center network engineering in complex environments.", "responsibilities": "Create/maintain and drive multi-year Roadmap for Skeleton deployments for various ML products, Fabric/Cluster upgrades and decommission validations on YAWNS and Colo locations. Drive dependencies and ensure dependent projects within the portfolio are kicked off in time to support the overall MLNet Roadmap. Lead cross-functional teams and manage complex network implementations with multiple interdependencies, competing priorities in a compressed timeline while ensuring stakeholders are aware of project status. Work with key upstream planning partners to remain aligned on demand pipeline and ensure triggers are happening in the right cadence to ensure delivery success. Build relationships with cross-functional teams. Drive process improvements, especially regarding coordination and collaboration across internal deployment resources.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109319673807282886"}