{"title": "Senior Product Manager, Firestore, Google Cloud", "level": "Advanced", "location": "San Francisco, CA, USA; Sunnyvale, CA, USA", "description": "At Google, we put our users first. The world is always changing, so we need Product Managers who are continuously adapting and excited to work on products that affect millions of people every day. In this role, you will work cross-functionally to guide products from conception to launch by connecting the technical and business worlds. You can break down complex problems into steps that drive product development. One of the many reasons Google consistently brings innovative, world-changing products to market is because of the collaborative work we do in Product Management. Our team works closely with creative engineers, designers, marketers, etc. to help design and develop technologies that improve access to the world's information.  We're responsible for guiding products throughout the execution cycle, focusing specifically on analyzing, positioning, packaging, promoting, and tailoring our solutions to our users. Cloud Firestore is a serverless document database that effortlessly scales to meet any demand, with no maintenance. It is used for mobile, web, and server development from Firebase and Google Cloud. It also has the capability to keep data in sync across client apps through realtime listeners and offers offline support for mobile and web, so users can build responsive apps that work regardless of network latency or Internet connectivity. Cloud Firestore team's mission is to unlock application innovation with simplicity, speed, and confidence. We continue to innovate on behalf of our large user-base by delivering capabilities which enable application developers to achieve more with less effort. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$168,000-$252,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in product management, co-founder or related technical role. 3 years of experience building and shipping technical products. Experience developing/launching products/technologies within one or more of the following: Cloud, SaaS, enterprise, internal tools, or supply chain networks.", "preferred_qualifications": "Master's degree in Computer Science, Electrical Engineering, Mathematics, Statistics, or a related technical field. 5 years of experience as a Product Manager. Experience managing products from conception to launch and working with cross-functional teams. Experience with distributed systems, databases, or cloud technology. Experience managing business strategy and execution. Ability to work with senior executives, product leaders, and senior engineering leaders across Google.", "responsibilities": "Build a clear understanding of document database technologies, backend-as-a-service, market trends, and customer requirements to help shape the overall product strategy. Interact with customers and partners to understand their key requirements and help define a credible product roadmap. Drive product development collaborating closely with engineering, user-experience design, finance, product operations, marketing, and field teams. Drive positioning, pricing, and go-to-market strategy for our launches.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109473769717670598"}