{"title": "Scaled Abuse Analyst, YouTube Partner Program", "level": "", "location": "Hyderabad, Telangana, India", "description": "As a Scaled Abuse Analyst for YouTube Partner Program (YPP) within YouTube Trust and Safety, you are passionate about identifying abuse patterns and trends within the Youtube Partner Program. You will be a key contributor to the strategy for reducing network badness on YouTube's business generation program.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 1 year of experience in data management, metrics analysis, experiment design and automation. Experience with classification systems, ranking systems, or similar.", "preferred_qualifications": "Experience translating analytical insights into business strategies and actions. Experience creating opportunities to innovate, conceptualize, and complete while working with global teams. Experience collecting, managing and synthesizing large data sets and information from disparate sources, statistical modeling, data mining, and data analysis.", "responsibilities": "Apply advanced statistical methods to large complex data sets to understand impact of abuse to the YouTube ecosystem. Contribute strategy and development of new workflows against additional known vectors of abuse. Learn complex and technical concepts and systems, and deliver meaningful results using them. Communicate highly technical results and methods clearly. Maintain, foster, and promote quality by providing regular feedback metrics to the Global team. Manage technological solutions for streamlining quality assurance and produce scalable training solutions to emergent workflows. Perform fraud and spam investigations using various data sources, identify product vulnerabilities, and drive anti-abuse experiments to prevent abuse. Work with engineers and interact cross-functionally with stakeholders to improve workflows via process improvements, automation, and anti-abuse system creation. Develop high quality training materials, create consensus, and maintain communication for YouTube Scaled Abuse with business stakeholders.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109639122804449990"}