{"title": "Performance Specialist, Large Customer Sales", "level": "Mid", "location": "Melbourne VIC, Australia", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.\n\nOur Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in digital media, sales, marketing, or product roles. Experience working with digital organizations. Experience identifying and recommending ways to improve product and customer strategy.", "preferred_qualifications": "Experience developing customer relationships to support product adoption. Experience identifying key internal stakeholders to build network and contribute to cross-functional collaboration. Ability to develop relationships with customers acting as a product subject matter expert (SME) for customers and agencies. Ability to translate client business needs into product adoption opportunities.", "responsibilities": "Identify business growth opportunities within the market and for customers and work with internal stakeholders to determine and drive the business growth, potential of opportunities, and marketing efficiency, and the incremental investment recommended to achieve customer business outcomes. Ensure competitive perspectives and differentiated value propositions generated through market-relevant insights. Represent Google performance proposition internally (e.g., leadership engagements, communities) and externally (e.g., customers, agencies, conferences). Serve as a performance specialist for one or more industry and performance media product groups as required (e.g., value based bidding, broad match), focused on delivering performance products suite and designing custom solutions that accelerate growth. Work with APAC Product Go-To-Market teams to create goals for search offerings across devices/screens and contribute to product development.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109628711535289030"}