{"title": "Head of Silicon Operations, Google Cloud", "level": "Advanced", "location": "Taipei, Taiwan", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.", "key_qualifications": "Bachelor's degree in Electrical, Process, or Manufacturing Engineering, or equivalent practical experience. 12 years of experience in semiconductor manufacturing engineering roles. 10 years of experience in people management.", "preferred_qualifications": "Experience overseeing all aspects of silicon manufacturing operations, from wafer fabrication to final testing and packaging. Experience developing and executing strategic plans to optimize production efficiency, yield, quality, and cost-effectiveness in a high-volume manufacturing environment. Experience managing supplier relationships, negotiating agreements, and ensuring timely delivery of materials, while maintaining a focus on cost control and continuous quality improvement. Experience leading diverse teams of engineers, technicians, and other manufacturing personnel. Excellent leadership and mentoring skills.", "responsibilities": "Drive production management, delivering production schedules while maintaining high product quality and yield. Identify and resolve manufacturing bottlenecks and issues. Lead supplier management by maintaining relationships with foundry partners and other external suppliers. Implement agreements and ensure timely delivery of production materials. Own cost control, including manufacturing budgets, cost-saving opportunities and implementing efficiency measures. Be responsible for Quality Assurance (QA) by implementing robust quality control processes and ensuring compliance with industry standards. Drive continuous improvement and manage customer returns. Demonstrate leadership and strategy development. Formulate strategic plans to optimize production efficiency, quality, and cost-effectiveness. Lead and mentor a team of technicians and other manufacturing personnel.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109616809107169990"}