{"title": "Staff Product Design Engineer, Pixel Watch", "level": "Advanced", "location": "San Diego, CA, USA", "description": "As a member of a fast-paced multi-disciplinary team, you use your creativity and diverse range of engineering experience to explore solutions to a variety of engineering problems. As a mechanical engineer, you participate in the design, analysis, and prototyping of new concepts. You work in a manufacturing and product oriented development environment and collaborate with vendors and outside sources in order to see parts through to manufacture. The Google Pixel Watch team focuses on designing and delivering an exceptionally helpful wearable experience. The team works on shaping the future of Pixel devices and services through some of the most advanced designs, techniques, products, and experiences in consumer electronics. This includes bringing together the best of Google’s artificial intelligence, software, and hardware to build global wearable devices and create transformative experiences for users across the world. As a Staff Product Design Engineer, you’ll design the next generation of Pixel wearables. You will drive the design, analysis, and prototyping of new concepts while working in a manufacturing and product-oriented development environment. You will work on a Product Design team that balances comfort, performance, and appearance in an innovative and harmonious design that complements and enables the technology. You’ll collaborate with external vendors and internal cross-functional teams such as Electrical Engineering, Antenna, Industrial Design, Reliability, Operations, Camera, and Product to define and deliver excellent products. Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "salary": "$168,000-$252,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Mechanical Engineering, Product Design, or related field, or equivalent practical experience. 8 years of experience designing mechanical components such as plastic or metal parts, mechanical assemblies, printed circuit boards, or flexes. 8 years of experience using computer-aided design tools, such as NX and Teamcenter.", "preferred_qualifications": "Master's degree in Mechanical Engineering, Product Design, or related field, or equivalent practical experience. 12 years of experience in consumer product design. Experience shipping multiple consumer products in a lead or staff engineer role. Experience collaborating with suppliers around the world on part manufacturing and final assembly, including onsite factory support. Experience in system integration, including electro-mechanical components (e.g., audio, display, camera, antenna, etc.), waterproofing, thermals, grounding, or product architecture. Deep technical knowledge in multiple manufacturing methods used in consumer products.", "responsibilities": "Work with a team of Product Design Engineers in delivering future Pixel Watches that meet program requirements and milestones. Serve as the Product Design Technical Lead for the team, providing design feedback and technical direction to peers in their day-to-day activities. Balance design considerations such as functionality, sustainability, reliability, human factors, manufacturability, and aesthetics. Ensure risks and top issues are identified and have clear strategies for resolution/mitigation. Own the CAD top-level assembly, drive system/product-level analyses and prototyping strategy, and ensure deliverables for simulation (e.g., structural, thermal, antenna, audio, etc.) are met. Develop cross-functional solutions to complex, time-dependent issues by leading the team to identify the root cause of design, manufacturing, or reliability issues and develop corrective actions. Travel internationally to engineering builds to oversee mechanical validation, design, and assembly, 10-20% of the time.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109648977539801798"}