{"title": "Customer and Partner Solutions Engineer, Digitization Services, gTech", "level": "", "location": "Ann Arbor, MI, USA", "description": "At gTech’s Users and Products team (gUP), our mission is to help users get the most out of Google. We represent Google's users and many of our partners globally, sharing insights with the larger Google organization to enable exceptional customer and product experiences. gUP builds innovative solutions that take user experience and engagement with Google to the next level, supporting users across products, countries, cultures, incomes, and identities. We advocate for users through partnerships with product areas at Google (and some Alphabet businesses), supporting Google’s consumer products ecosystem and enabling numerous launches for Google’s consumer products each year. The Digitization Services team digitize content for Google Book Search, Google Arts and Culture, YouTube, Google Cloud and Google Hardware teams, to bring information to users, and to support Machine Learning development. Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products. To learn more about gTech, check out our video.", "key_qualifications": "Bachelor’s degree in Engineering, Computer Science, a related field, or equivalent practical experience.\\nExperience coding with one or more programming languages (e.g., Java, C/C++, Python).\\nExperience working with client-side web technologies (e.g., HTML, CSS, JavaScript, or HTTP).\\nExperience in technical troubleshooting, and managing internal/external partners or customers.", "preferred_qualifications": "Master’s degree in Engineering, Computer Science, Business, or a related field.\\n2 years of experience working with database technologies and data analytics (e.g., SQL, NoSQL).\\n2 years of experience in Linux/Unix, networking, and electronics.\\n2 years of experience delivering technical solutions to business problems in a semi-autonomous work environment.", "responsibilities": "Design, implement, test, and launch internal tools for gTech Digitization Services.\\nMaintain existing tools and hardware infrastructure in Book Scanning Operations and work with the regional technicians team.\\nDevelop internal databases, reports, and tools to support operations.\\nAnalyze work processes to determine inefficiencies and opportunities for automation.\\nCollaborate with a global team of Support Engineers, software developers, and operations staff to support a wide range of projects beyond book scanning.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109613632978854598"}