{"title": "Network Test Engineer, Google Distributed Cloud Edge", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "At Google, our philosophy is build it, break it and then rebuild it better. That thinking is at the core of how we approach testing at Google. Unlike roles with similar names at the other companies, Test Engineers at Google aren't manual testers -- you write scripts to automate testing and create tools so developers can test their own code. As a Test Engineer, you navigate Google's massive codebase, identify weak spots and constantly design better and creative ways to break software and identify potential problems. You'll have a huge impact on the quality of Google's growing suite of products and services.\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "4 years of experience as an Automation Test Engineer.\nExperience with testing principles, CI/CD principles, and kubernetes platform.\nExperience with Go/Python.", "preferred_qualifications": "Knowledge of Anthos and Google Kubernetes Engine (GKE) Networking.\nKnowledge of networking fundamentals with understanding of Google Cloud Platform/public cloud platform.", "responsibilities": "Test Google Cloud based platform from a functional and scale perspective.\nDevelop Automation framework for cloud platform products.\nAutomate test cases that can be executed in a CI/CD environment from build to deployment.\nWork with the engineering development, product management, and engineering productivity teams to make sure the framework is ready for automating test cases.\nWork with the Platform Deployment team to drive best practices.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109678858768130758"}