{"title": "Technical Program Manager II, Compliance", "level": "Mid", "location": "Warsaw, Poland", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company.", "key_qualifications": "Bachelor's degree in a technical field, or equivalent practical experience. 2 years of experience in program management. 2 years of experience in compliance. Experience in New Product Introduction (NPI) and leading a product through the Product Life Cycle (PLC).", "preferred_qualifications": "MBA or Master's degree in Industrial Engineering, Supply Chain, Operations Research, Operations Engineering, or other relevant field. 2 years of experience managing cross-functional or cross-team projects. Experience with manufacturing, supply chain management, or fulfillment planning and execution. Knowledge about typical hardware BOMs, process documentation, and assembly and test processes. Developed leadership, analytical, quantitative reasoning, problem-solving, creativity, and strategic skills. Effective communicator of project requirements and schedules.", "responsibilities": "Lead large, complex, cross-functional program teams within Google and with external partners to prepare for production ramp and/or product transitions. Plan and execute operations development activities and ensure transition to production within cost, quality, and capacity parameters. Ensure successful production ramp meeting program goals. Manage ramp readiness with internal teams as well as external partners (i.e., material availability, cost/assembly/test/BOM/capacity readiness, and transition plans). Drive cross-functional teams to optimize the supply chain for specific strategic reasons, while accounting for risks and changes in schedule or demand. Drive operations and new product development as well as supporting those products through production ramp, sustainment, and EOL.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109736744458298054"}