{"title": "Data Center Facilities Technician", "level": "", "location": "Singapore", "description": "The Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facilities Technicians at Google data centers operate, monitor and support physical facilities conditions. Some of these duties will include heating and cooling of air and water, power supply, generators, UPS systems, electrical distribution and control and monitoring systems. You regularly help inspect, maintain and repair various data center systems such as piping and non-critical electrical or mechanical system components). You provide daily assistance to senior technicians as you read blueprints/schematics, conduct tours of systems and assess their working order. As an advocate for best practices, you develop creative approaches to reducing operational costs while improving overall data center efficiency. You ensure that environmental and safety standards are consistently met, identifying problems and making repairs quickly. In emergency situations or abnormal conditions, you manage data center performance issues and outages to minimize the recovery time from failures. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "key_qualifications": "Associate's degree, trade school certification, verifiable training in a relevant technical field, or equivalent practical experience. Experience with electrical, mechanical, and controls systems including: Feeders, Transformers, Generators, Switchgear, UPS systems, ATS/STS units, PDU/PMM units, Chillers, Air handling units, and CRAC units. Experience in troubleshooting. Ability to work non-standard, on-call rotation weekend hours.", "preferred_qualifications": "Electrical Technician's Licence. Experience troubleshooting for electrical systems. Knowledge of industrial networking and coordinating with others in order to determine problems and implement solutions. Familiar with SCADA, Power monitoring system, building monitoring system, and PLC programming. Ability to work in varying outdoor temperature conditions and perform material handling (lifting/shifting) to work on platforms, ladders, and under raised floors. Ability to learn quickly and address issues as they arise during normal operations or during emergency conditions and follow the site’s environmental health and safety policies.", "responsibilities": "Operate, maintain, troubleshoot, and repair electrical equipment in a Data Center environment. Provide Root Cause Analysis (RCA), recovery, and prevention actions for service failure. Prepare and execute operation procedures, respond to work request/service failure, and provide operational and technical expertise in required areas. Coordinate vendor support in repairs/replacement and support project implementation (site acceptance tests, factory acceptance tests, site inspection for defects, etc.). Improve site WUE and PUE, operational efficiency, and minimize environmental impact. Develop a good understanding of the infrastructure design and sequence of operation. Prepare and conduct training/sharing to the team. Ensure safety rules and regulations associated with operating infrastructure.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109843828394861254"}