{"title": "Business Intelligence Developer, Cloud Finance", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "The Cloud Finance Business Intelligence team is part of the Finance Transformation Office and supports the broader Cloud Finance organization and senior leadership. The team owns the financial analytics and automation roadmap and works with Finance and Engineering partners to build stable financial reporting, analytics, forecasting, simulation and modeling assets. The goal is to enable decision intelligence while reducing the reporting burden on analysts.", "key_qualifications": "Bachelor's degree in a quantitative discipline or equivalent practical experience. 4 years of experience in business intelligence, analytics, or quantitative analysis related fields. Experience in Programming and SQL. Experience developing, running, and working with Big Data pipelines", "preferred_qualifications": "Master's degree in a technical or quantitative field, or equivalent practical experience. Experience building Business Intelligence/Online Analytical Processing (OLAP) solutions using SQL or similar query language. Experience building and maintaining Machine Learning models for forecasting and detection purposes. Ability to operate with flexibility in a fast-paced and ambiguous environment. Excellent written and verbal communication, with the ability to communicate findings in a concise manner to a non-technical audience.", "responsibilities": "Develop, test, and maintain data solutions, data marts, pipelines and dashboards for Cloud Finance with the objective of building financial reporting infrastructures. Develop an intuitive understanding of Cloud systems and utilize the most innovative Google technologies to deliver scalable forecasting and what-if modeling solutions, surface insights at scale, and shed light on financial logics for business. Work in partnership with Finance colleagues supporting processes and teaching how to use various analytical tools to support work deliverables. Develop and automate financial models, forecasts, and simulations, streamline reporting and generate insights, present financial analyses to diverse executive leadership.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109855336558404294"}