{"title": "Pursuit Lead, Google Cloud Consulting", "level": "Advanced", "location": "Bogotá, Bogota, Colombia; Lima, Peru", "description": "As a Pursuit Lead for Google Cloud Consulting (GCC), you will help customers successfully adopt Google Cloud products. You will lead the development of Professional Services, Learning, and Technical Account Manager pitches, strategies, and engagements with our customers to help drive the successful adoption of Google Cloud working alongside our Go-to-Market teams.\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree in Computer Science, Mathematics, a related technical field, or equivalent practical experience.\n10 years of experience in customer-facing roles, including interfacing with executive stakeholders and managing and delivering IT technical implementations, transformation programs, or other initiatives.\nExperience supporting enterprise customers in Cloud Professional Services organizations, IT consulting, or program management organizations.\nAbility to communicate in Spanish and English fluently to support client relationship management in this region.", "preferred_qualifications": "Master's degree in a management, technical, or engineering field.\n5 years of experience in building strategic business partnerships with public sector customers.\nExperience in value consulting, proposal development, and execution with public cloud providers like Google Cloud.\nExperience collaborating with channel partners, systems integrators, and third-parties to deliver and manage implementation of solutions.\nKnowledge in IT operations, database systems, networking, IT security, application development, service architecture, cloud-native application development, hosted services, storage systems, or cyber security.\nAbility to communicate in Portuguese fluently to support client relationship management in this region.", "responsibilities": "Accelerate customer adoption of Google Cloud by leading the development of implementation strategies for Google Cloud customers, taking customer business use cases and translating them into actionable delivery models.\nManage the services business process, taking customer use cases from lead stage through delivery stage, while driving operational excellence during the solutioning process with forecast management, scoping documentation, and agreement closure.\nCollaborate with Sales and Customer Engineers to capture customer use cases and requirements to develop GCC strategies, and act as the Services point of contact for the Sales team.\nManage regional and industry business relationships with internal teams and develop proactive services business strategies based on regional needs.\nCollaborate with our Professional Service Organization (PSO) Consultants to determine project goals, define success criteria, and create Statements of Work for customer-related projects.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109832298555155142"}