{"title": "Global Innovation Programs Manager, Ecosystem Investments", "level": "Mid", "location": "New York, NY, USA; Austin, TX, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company. Global News Programs is part of an international effort to accelerate the digital transformation of a diverse news ecosystem through Google’s services, products, partnerships and secure reliable information for our users. Working with cross-functional teams across the Google News Initiative, our focus areas are strengthening AI literacy, fighting misinformation and training and tools to build newsrooms of the future. In this role, you will lead industry partnerships to enable academics, nonprofits and news publishers to experiment with AI technologies. Working with cross-functional colleagues, you will devise new ways to support innovation and drive implementation. You will work with Product teams to help shape tools and services for the news industry and strengthen our outreach efforts.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 7 years of experience in program or project management. Experience working in the media, within journalism or similar content-driven industries. Experience influencing and collaborating with Product teams.", "preferred_qualifications": "Passion for technology, and a strong track record of using technology and online tools in innovative ways in journalism. Ability to manage several concurrent projects with timely deliverables. Demonstrated thought-leadership, relationship building, and management skills, with internal stakeholders and external partners. Excellent public speaking and people management skills. Excellent organizational skills.", "responsibilities": "Deliver the Global News Program strategy focusing on AI literacy and digital transformation for journalists and publishers across the world. Forge new industry partnerships, coalitions and conversations that support the implementation of AI technologies designed to strengthen local journalism, support experimentation and a sustainable future for news publishing. Manage budget and administrative responsibilities for their focus area, supporting the global lead to drive operations to meet business requirements. Partner with journalism organizations, associations, and individual publishers to hold joint technology training workshops. Bring an entrepreneurial spirit to work everyday, conceiving of new opportunities and avenues to help the media industry grow with Google.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109907887630754502"}