{"title": "Technical Lead, ChromeOS Developer Commerce", "level": "Advanced", "location": "Kraków, Poland", "description": "ChromeOS is a modern OS where we’ve re-imagined every feature from the ground up to be smarter, speedier, and more secure. It offers the best of Google through tight integration with the Chrome Browser, Android and Google Play Store, and AI. Since its initial launch, ChromeOS has been growing fast and leads the industry in K-12 education market. Recently, ChromeOS made a breakthrough and has seen strong demand with family and consumer users. To become a general purpose computing platform, ChromeOS needs to attract and grow productive, successful app developers at a scale. The ChromeOS Developer team focuses on building a platform that enables third-party developers to build successful apps.\nChrome OS delivers quality computing at scale to provide universal and unfettered access to information, entertainment, and tools. Our mission is to empower anyone to create and access information freely through fast, secure, simple, and intelligent computing.", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Science, relevant technical field, or equivalent practical experience. 8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). 3 years of experience in a technical leadership role; overseeing projects, with 2 years of experience in a people management/team leadership role.", "preferred_qualifications": "Experience with leading the development of full-stack solutions, such as web page design and development. Experience leading the maintenance of customer-facing products and solutions, authoring documentations, and converting developed solutions. Experience managing critical user journeys implementation, from client side to server endpoints as well as testing, analyzing, bench-marking new or existing solutions.", "responsibilities": "Lead the Krakow-based team of Software Engineers that build a developer commerce platform. Manage a team of engineers in ChromeOS and grow the team with additional engineers. Develop full-stack solutions and build a developer commerce platform that helps third-party developers gain success. Prioritize, plan, and scope feature work. Work closely with UX, PM, and cross-functional global teams. Support the team's career development. Shape the culture of the team, promoting inclusion and psychological safety.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/109905713504887494"}