{"title": "Technical Writer, Google Cloud Databases", "level": "Mid", "location": "New York, NY, USA; Cambridge, MA, USA", "description": "Technical writers communicate complex information clearly, concisely and accurately, and without relying on jargon. As a technical writer, your role involves tasks such as writing conceptual overviews and procedures, reading and writing example code, or updating help center queries and FAQs. Technical writers play a big part at Google. They are a key link between developers, marketing associates, developer advocates, as well as all the external users and developers, tying together many vital but disparate parts of the Google ecosystem.\n\nYou develop complex, in-depth communications for internal and external audiences and manage projects that involve coordinating multiple junior writers.\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\nThe US base salary range for this full-time position is $125,000-$185,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n6 years of experience creating content for technical audiences (e.g., developer documentation, Computer Science course material, or IT administration playbooks).\nExperience writing for the web and with Markdown, HTML, CSS, or JavaScript.", "preferred_qualifications": "Experience with Databases, SQL, and Cloud products.\nExperience producing technical documentation for a technical audience for enterprise cloud services.\nAbility to navigate ambiguity, support multiple projects, and meet deadlines in a fast-paced environment.\nExcellent communication and teamwork skills.", "responsibilities": "Plan, design, write, and publish technical documentation including customer user journeys, concepts, how-to guides, and API reference documentation for enterprise customers.\nWork with Product Managers, Engineering Leads, UX researchers, and User Interface partners to identify the critical user journeys and create information architectures that help customers.\nCollaborate with Cloud Database writers to refine ways of working to deliver a positive customer experience.\nWork with functional partners to manage and prioritize the technical writing workload.\nMentor and support other writers on the Cloud Databases team.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/110189337911403206"}