{"title": "Account Strategist, Google Customer Solutions (Czech or Slovak)", "level": "Mid", "location": "Dublin, Ireland", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. The Mid-Market Sales (MMS) team is a critical growth engine for clients in Google Customer Solutions (GCS) designed to grow medium and large-sized fast growing businesses in Czech Republic. Through long-term relationship development, we’re dedicated to understanding the business goals by providing advertising solutions to drive business success. As a Mid-Market Sales Account Strategist, You will improve campaign performance, drive thoughtful Google product adoption, and build short and medium term strategies to meet business and marketing objectives. In this role, you will design transformative media strategies for growth based on the customer objectives. You will provide Google-caliber solution promotions, partnership management, and analysis to deliver successful business outcomes. You'll uncover the business needs of Google's key clients and achieve their objectives, while driving incremental business agreements through our industry leading advertising solutions. Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow.  Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.", "salary": "", "key_qualifications": "Bachelor's degree in Marketing, Advertising, Sales, or equivalent practical experience. 5 years of experience in sales, business development, advertising, online media environment, or marketing role. Ability to communicate in Czech or Slovak and English fluently to support client relationships and drive sales in this region.", "preferred_qualifications": "Experience strategically assessing and achieving client success via sales techniques including effective questioning, objection handling, and engaged promotions. Experience in managing digital advertising campaigns with a focus on performance marketing. Knowledge of sales, online marketing strategy and tactics. Demonstrated ability to consistently overachieve sales quotas to drive growth. Demonstrated ability to own a portfolio in an advertising or media sales context in Czech Republic and Slovakia.", "responsibilities": "Deliver against ambitious quarterly business and product growth goals. Own a portfolio of medium and large-size businesses by thoroughly understanding growth drivers, identifying opportunities for growth, managing risks, and building multi-quarter plans for achievement. Pitch and consult with customers proactively to support annual digital marketing discussions and budgets. Drive customer growth by delivering outstanding customer sales experience and achieving customer business and marketing objectives. Assist with stakeholder management and build relationships with the end customer or agencies.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/110264230866756294"}