{"title": "AI/ML Engineer, Google Cloud", "level": "Mid", "location": "Reston, VA, USA; Washington D.C., DC, USA", "description": "As a Cloud Artificial Intelligence/Machine Learning (AI/ML) Engineer, you will guide governments, universities, and other public sector customers on how to configure and deploy their virtual agents and machine learning solutions. Together with the team, you will support customer implementations of Google Cloud products through architecture guidance, best practices, data migration, capacity planning, implementation, troubleshooting, monitoring, and more. You will consult with customers on how to best design their conversational AI and machine learning solutions including intent development, CI/CD, pipeline design, and training and evaluation of Machine Learning models. You will travel to customer sites up to 30% of the time to deploy solutions and deliver workshops to educate and empower customers. Additionally, you will work closely with Product Management and Product Engineering to drive excellence in Google Cloud products and features.", "key_qualifications": "Bachelor’s degree in Engineering, Computer Science, a related field, or equivalent practical experience. 6 years of experience working with machine learning or deep learning systems. 6 years of experience coding with one or more programming languages (e.g., Java, C/C++, Python). Experience in technical troubleshooting, and managing internal/external partners or customers. Active US Government Top Secret/Sensitive Compartmented Information (TS/SC) Security Clearance.", "preferred_qualifications": "Experience in optimizing Large Language Models (LLMs) leveraging RAG/retrieval augmented generation architectures and fine-tuning techniques. Experience working with recommendation engines, data pipelines, or distributed machine learning. Experience with data analytics, data visualization techniques, and software. Experience with deep learning frameworks (e.g., Tensorflow, pyTorch, XGBoost). Experience with web standards (e.g., REST APIs, and web security mechanisms). Ability to lead the design and implementation of AI-based solutions, web services, and debugging tools.", "responsibilities": "Serve as a trusted technical advisor to customers and solve complex Machine Learning problems. Create and deliver best practices recommendations, tutorials, blog articles, sample code, and technical presentations adapting to different levels of key business and technical stakeholders. Work with Customers, Partners, and Google Product teams to deliver tailored solutions into production. Coach customers on the practical challenges in Machine Learning systems: feature extraction/feature definition, data validation, monitoring, and management of features/models.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/110367379875078854"}