{"title": "Senior Government Affairs and Public Policy Manager", "level": "Advanced", "location": "California, USA", "description": "As a member of Google’s Government Affairs and Public Policy team, you'll be part of a diverse global government affairs team, working across regions, product areas, and functions. You’ll combine creativity and intellectual excellence with the organizational skills to manage various campaigns, projects and initiatives. In this role, you’ll advocate for Google to bring external perspectives back into the company to inform our perception and direction. You're passionate about the opportunity to shape the future of how we use and build technology for everyone. In this role, you will be responsible for ownership and management relationships and interactions with the Governor’s Office, State Legislature, monitor and actively engage with regulatory agencies as appropriate, manage our political giving portfolio and attend events therein. You will also work closely with other colleagues on the team to develop third-party partnerships to advocate for a friendly business environment. Google takes its responsibilities seriously, including engaging with government and other stakeholders on important public policy challenges. The Government Affairs and Public Policy (GAPP) team leads the company’s engagement with executive branch officials, legislators, regulators and third-parties in the formation of public policy. Working closely with Google leaders, GAPP seeks to identify key policy issues, listen carefully to others’ views and opinions, and distill and share the company’s perspective on those issues with external stakeholders. While we focus on challenges affecting the internet, our issue areas are increasingly broad and encompass many areas where public policy, business, and technology intersect.", "salary": "$221,000-$314,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 14 years of experience working on technology policy issues within state and local government.", "preferred_qualifications": "JD or equivalent degree. Experience in government relations, political campaigns, outreach, or research in the State of California. Experience working with or in state/local government, or leading policy or public affairs work for third-party organizations, (e.g., being a lobbyist or running campaigns). Experience with staffing and managing executives, with excellent leadership, communication and collaboration skills. Familiarity with Internet/technology policy with demonstrated interest in keeping the Internet open and free. Ability to integrate public policy with business strategy and corporate development.", "responsibilities": "Advocate before relevant elected officials and public entities (Governor, state legislature, state agencies). Monitor policy issues of importance to Google. Create a positive regulatory environment to enable innovation and growth. Synthesize Google’s positions and educate policy makers on key policy issues. Communicate policy positions effectively to California government constituencies. Build relationships with the Governor’s Office, the Legislature, third-parties and others. Establish and implement strategies to communicate policy positions to key constituencies. Develop public affairs strategies that build relationships and strengthen our reputation. Catalyze trade associations, industry partners, non-profit groups, and others to build support for Google’s policy positions. Manage executive engagement with legislators and the Governor’s Office, state agencies and regulatory agencies, including staffing executives for visits, preparing documents and briefing executives, updating executives on hot topics.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/110439314671706822"}