{"title": "Software Engineering Manager, Android Telephony Apps and Services", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "Like Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers. You not only optimize your own code but make sure Engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way. With technical and leadership expertise, you manage engineers across multiple teams and locations, a large product budget and oversee the deployment of large-scale projects across multiple sites internationally. The Pixel Telephony team is redefining the connectivity experience and growing to support the next wave of technologies and devices. The team works on developing and launching mobile communication technologies and collaborates with internal and external partners to ensure performance and reliable data connectivity for Pixel and Android users. In this role, you will design and develop Android applications, and the Android telephony connectivity framework that improves connectivity of Phones, and will also work on other standardization bodies related to telecom. Android is Google’s open-source mobile operating system powering more than 3 billion devices worldwide. Android is about bringing computing to everyone in the world. We believe computing is a super power for good, enabling access to information, economic opportunity, productivity, connectivity between friends and family and more. We think everyone in the world should have access to the best computing has to offer. We provide the platform for original equipment manufacturers (OEMs) and developers to build compelling computing devices (smartphones, tablets, TVs, wearables, etc) that run the best apps/services for everyone in the world.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). 8 years of experience with Android framework, internals, or applications. 3 years of experience in a technical leadership role; overseeing projects, with 2 years of experience in a people management, supervision/team leadership role.", "preferred_qualifications": "Master's degree or PhD in Computer Science or related technical field. 5 years of experience working on the Android operating system or Telephony and connectivity frameworks. 3 years of experience working in an organization. Experience working with carrier requirements, engaging with external teams, and developing client-side metrics, dashboard, monitoring and instrumentation. Experience in Android application package (APK) release management.", "responsibilities": "Propose, design, and develop new Telephony features in Pixel-specific Android applications or in the Android framework, and software components on the server side when needed. Manage and lead a team of engineers, and collaborate with other software teams in Google and external parties (e.g., mobile chipset vendors, mobile operators and OEMs) to design, develop, and launch features and products on-time. Understand mobile wireless requirements and carrier specifications to implement new features defined by standard bodies or mobile operators that enhance the user experience. Propose and implement various performance optimizations across the telephony stack (e.g., memory, power, or bandwidth reduction). Define metrics that allow monitoring of the performances of Pixel devices to validate implementations and detect issues that impact user experience or the performance of devices.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/110536837809742534"}