{"title": "Cloud Technical Solutions Engineer, Data AI/ML", "level": "Mid", "location": "Warsaw, Poland", "description": "The Google Cloud team helps companies, schools, and government seamlessly make the switch to Google products and supports them along the way. You listen to the customer and swiftly problem-solve technical issues to show how our products can make businesses more productive, collaborative, and innovative. You work closely with a cross-functional team of web developers and systems administrators, not to mention a variety of both regional and international customers. Your relationships with customers are crucial in helping Google grow its Cloud business and helping companies around the world innovate.\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor’s degree in Science, Technology, Engineering, Mathematics, or equivalent practical experience. 6 years of experience coding in a general purpose coding language or in system design. 6 years of experience troubleshooting and advocating for customers needs, and triaging technical issues. 6 years of experience with two or more of the following: Web Tech, Data/Big Data, Systems Admin, Machine Learning, Networking, Kubernetes, Oracle, SAP.", "preferred_qualifications": "Experience with cloud computing (i.e., certifications, internships, coursework, etc.).", "responsibilities": "Suggest code level resolutions for complex product bugs by leveraging relevant tools and effective communication to all stakeholders internally and externally. Resolve technical incidents and escalations by performing analysis utilizing relevant tools (e.g., SQL, R, Python) and leveraging custom data infrastructure or existing data models as appropriate, and formulating and interpreting data to reach specific conclusions and next steps. Identify opportunities and build solutions to improve support or empower customers to solve issues by using self-service tools and documentation. File issue reports against product, documentation and procedures by documenting desired behavior or steps to reproduce, and driving bugs to resolution.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/110544233743426246"}