{"title": "Reverse and Returns Logistics Manager", "level": "Mid", "location": "Las Vegas, Nevada, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe...", "key_qualifications": "Bachelor's degree in HR, Business or related field, or equivalent practical experience. 7 years of experience in a customer or client-facing role supporting logistics operations. 7 years of experience working in domestic and international environments managing vendors (i.e., suppliers, manufacturers) or Third-Party Logistics. 5 years of experience managing operations and leading cross-regional teams.", "preferred_qualifications": "MBA or Master's degree in a related field or CSCMP certification. 7 years of experience using data analysis to drive decision making. 7 years of experience building relationships with stakeholders or clients. Experience in data center equipment environments or computer component manufacturing. Knowledge of SQL, analytics and Operations Six Sigma certification or other relevant operations coursework. Excellent problem-solving skills with the ability to apply structured thinking and logic to your work and provide solutions to challenge.", "responsibilities": "Develop, update and communicate the reverse logistics de-population, rack removal, RMA and rack movement plans by site for GSO logistics. Ensure accurate and understandable de-population, rack removal, battery decommission, rack movement, and reverse logistics documents are available to all 3PL partners and ensuring Third-Party Logistics (3PL) training is documented. Be responsible for process improvement recommendations, change management, standardization of user documentation, creating processes that drive action, and preventing decommisions from missing service level objective (SLO) promises. Be accountable for 3PL Centralized Reverse and Return Merchandise Authorizations (RMA) teams working blockers and bugs that inhibit the GSO team from meeting or beating SLO’s. Be the subject matter expert on all Google systems utilized to plan and execute reverse logistics and rack move functions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/110627904202646214"}