{"title": "Policy Specialist, Global Policy and Standards, Child Safety", "level": "Mid", "location": "Austin, TX, USA; Washington D.C., DC, USA", "description": "We are user trust experts who think big across Google and the technology ecosystem. Join a team dedicated to safeguarding children online. You'll work on complex challenges of Child Sexual Abuse and Exploitation (CSAE) by crafting innovative policies and strategies to proactively address CSAE risks across Google's platforms and beyond. Collaborate with internal partners, industry leaders and policymakers to raise the bar for child safety in the technology ecosystem, and take safety by design into practice with strategies to ensure child safety risk is addressed and prevented.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in internships, policy, legal, Trust and Safety, or technology environment directly working as a protector for children. Experience using data and technology to solve business problems. Experience with technology related policy enforcement operations, policy development, and policy maintenance.", "preferred_qualifications": "Experience with advanced product/program management. Ability to translate complex issues into simple, clear language and to collaborate with cross-functional stakeholders and navigate organizational boundaries. Distinctive ability to effectively operate in a fast-paced, constantly evolving team environment and the ability to influence/communicate cross-functionally and across levels. Excellent problem-solving and critical thinking skills with attention to detail in an ever-changing environment. Excellent written and verbal communication skills.", "responsibilities": "Develop and implement effective Child Sexual Abuse and Exploitation (CSAE) policies, informed by research and data. Collaborate with diverse stakeholders to improve user safety, resolving high-profile policy issues, and influence product design to prioritize child safety and build trust. Provide expert policy counsel on CSAE to internal partners. Analyze CSAE issues and recommend solutions for technology platforms. Lead collaboration and set industry standards for child safety. Identify product risks and draft policies to reduce harm to children. Update executives on child safety issues on Google products. Review or be exposed to sensitive or graphic content as part of the core role.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/110792939730281158"}