{"title": "Senior Technical Solutions Consultant, Android Business Communications", "level": "Mid", "location": "San Jose, CA, USA; Bellevue, WA, USA", "description": "As a Technical Solutions Consultant, you will be responsible for the technical relationship of our largest advertising clients and/or product partners. You will lead cross-functional teams in Engineering, Sales and Product Management to leverage emerging technologies for our external clients/partners. From concept design and testing to data analysis and support, you will oversee the technical execution and business operations of Google's online advertising platforms and/or product partnerships. Android is Google’s open-source mobile operating system powering more than 3 billion devices worldwide.", "key_qualifications": "Bachelor’s degree in Engineering, Computer Science, a related field, or equivalent practical experience. 5 years of experience in technical project management, stakeholder management, professional services, solution engineering or technical consulting, and 1 year of experience in technical leadership. 1 year of experience in technical troubleshooting and writing code in one or more programming languages.", "preferred_qualifications": "Master’s degree in Engineering, Computer Science, Business, or a related field. 5 years of experience with Rich Communication Services (RCS), IP Messaging, SIP and any other communication protocols. Experience in internet technologies such as HTTP, TCP/IP, HTML, JavaScript, and/or Unix/Linux. Experience with mobile technology solutions/applications, especially iOS.", "responsibilities": "Build and maintain strategic relationships with executive stakeholders in customer and/or partner organizations to deliver or manage quality technical solutions and services. Provide feedback on Product Requirement Documents (PRDs) and design documents, and lead PRDs, particularly around the developer experience. Scale existing or create repeatable solutions (e.g., best practices recommendations, tutorials, blog articles, sample code) and ensure effective documentation of repeatable solutions. Drive solution code development in collaboration with internal or external developers, users, partners, clients, stakeholders as needed. Review Product Requirement Documents (PRDs) to record product specifications, validate PRDs to ensure customer/partner and internal needs are met.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/110919578116072134"}