{"title": "Senior Manager, UX Educational Search Vertical, LearnX", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "At Google, we follow a simple but vital premise: 'Focus on the user and all else will follow.' Google’s UX leaders help define and drive the future of Google design...", "key_qualifications": "Bachelor's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 10 years of experience in product design or UX. 5 years of experience leading design projects and managing people or teams. 3 years of experience working with executive leaders.", "preferred_qualifications": "Experience using existing frameworks to solve problems, as well as extending and evolving frameworks to achieve new business objectives. Ability to build relationships and influence in a professional and thoughtful manner amongst a team of equally strong players. Strong communication, collaboration, and presentation skills. Capable of distilling the complex into simple narratives and communicating these stories effectively to leadership. Solid command of product design, with a passion for crafting useful and delightful experiences. A strong portfolio of work samples showcasing UX capabilities, creativity, and depth of thought.", "responsibilities": "Manage a small team, and also contribute on strategic product design with shipping new features on Google platforms. Inspire new thinking and influence our priorities through mockups, prototypes, storyboards, and presentations to effectively communicate design ideas. Establish strong cross-functional partnerships and relationships to build empathy and support product roadmap through planning, design, testing, iterations, and launch based on user feedback and executive steering. Work with the engineering team to ensure designs are implemented to specification and collaborate with them to come up with creative design solutions when technical challenges arise. Work with teachers, students and educational leaders, and visit schools to improve how people learn.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/110962306598216390"}