{"title": "Strategy and Operations Associate, Awareness and Consideration Solutions", "level": "", "location": "New York, NY, USA", "description": "The Go-To-Market (GTM) Operations team ensures Google's complex and ever-evolving Ads business runs smoothly. We are instrumental in setting Go-To-Market strategy and ensuring flawless execution and operations against that strategy. We have teams embedded in each of the major Ads business areas as well as global teams that work across the business areas. Team members are analytical and strategic and have a pragmatic sense of how to get things done.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in a management consulting, sales operations, business strategy, investment banking, venture capital or private equity role, or 1 year of experience with an advanced degree.", "preferred_qualifications": "1 year of experience creating complex data sets, data modeling, and reporting. Experience in advertising, consultative sales, business development, or a digital media environment. Experience supporting or deploying strategy (driving complex initiatives) for sales or partner teams. Familiarity with annual planning and Go-To-Market strategies. Ability to manage multiple projects while maintaining a high level of attention to detail.", "responsibilities": "Contribute to the development of the Go-To-Market strategy activation by helping define play structure, target advertisers, and segmentation. Partner with in-market and counterparts (GTM, Sales) to activate key plays on a quarterly basis to drive play adoption and impact. Gather feedback from sales and other teams on strategy (and its activation) to provide inputs to A&C leadership for updates on plans/activation. Support development of the annual strategy for the A&C business with inputs from A&C GTM leads, Sales, GPS, and other product GTM teams. Own offerings mapping to key priorities and plays to effectively track adoption of A&C strategy and plays across ALCS. Define and co-own the operations for strategy activation for A&C strategy in co-ordination with gTech, ABS&O, and the GPS teams.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/111010976630743750"}