{"title": "Principal Architect, Enterprise Business, Google Cloud", "level": "Advanced", "location": "Mumbai, Maharashtra, India", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners. As a Principal Architect, you will be a part of the customer developing organization for Google Cloud. You will lead cross-functional teams to help customers design, plan, implement, and govern enterprise cloud strategies. In this role, you will be a hybrid technical and business advisor, direct the conversation, and guide the execution of the Business team by combining both technical strategy and business insight. You will closely partner with Value Engineering in order to articulate the total value of each technical solution and the overall business partnership with Google Cloud. You will travel to customer sites, conferences, and other related events as needed. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, a related technical field, or equivalent practical experience. 10 years of experience as an enterprise architect or equivalent experience in a customer-facing role. Experience in cloud market insights and cloud computing across applications, infrastructure, storage, platforms, or data. Experience engaging with, and presenting to, technical stakeholders and executive leaders.", "preferred_qualifications": "Experience with structured Enterprise Architecture practices, hybrid cloud deployments, and on-premise-to-cloud migration deployments/roadmaps. Experience in enterprise technology buying and evaluating processes. Experience in building, architecting, designing, implementing highly distributed global cloud-based systems, network infrastructure, security, and application development. Knowledge of technology solutions and ability to learn, understand, and work quickly with new emerging technologies, methodologies, and solutions in the Cloud/IT technology space. Understanding of large-scale computing solutions. Ability to deliver results, work cross-functionally, engage/influence audiences, and identify expansion engagements.", "responsibilities": "Build a relationship with strategic accounts and engage with architects and C-level stakeholders. Provide domain expertise around public cloud and enterprise technology, and effectively promote Google Cloud with customers, at conferences, and online. Make recommendations to implement a complete solution providing best practice advice to customers to optimize Google Cloud effectiveness. Manage the enterprise architecture relationship with customers by collaborating with specialists, product management, engineering, and more. Identify customer priorities and technical objections, and design strategies to deliver business value and resolve blockers.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/111061577586614982"}