{"title": "Associate Red Team Security Consultant, Mandiant, Google Cloud", "level": "", "location": "Boulder, CO, USA; San Francisco, CA, USA", "description": "In this role, you will be responsible for assessing and advising clients on both technical and process-based controls for all manner of environments. You will perform Red and Purple team assessments, including adversarial emulation of cyber attacks against customer organizations, and other technical cyber assessments including external pen testing, web application, mobile, and wireless security testing. You will expand the team’s capabilities through tool creation, research on offensive techniques, incorporation of threat actor intelligence, internal presentations, and knowledge sharing.", "key_qualifications": "Bachelor's degree in Computer Science, Information Systems, Cybersecurity, related technical field, or equivalent practical experience. Internship, co-op, or equivalent experience in cybersecurity in one of the following areas: network security, wireless security, web application assessments, social engineering, scripting, cloud security, reverse engineering, pen testing or incident response.", "preferred_qualifications": "Certifications related to offensive security including OSCE, OSEP, OSEE, OSCP, CCSAS, CCT, INF, or relevant SANS courses. Experience implementing or assessing information security implementation or assessment of security controls. Experience with tools used for wireless, web application, and network security testing. Excellent written/verbal communication skills, with the ability to develop documentation and explain technical details in a concise manner.", "responsibilities": "Conduct external and internal wireless assessments, web and mobile applications testing, and embedded system assessments. Recognize and safely utilize attacker tools, tactics, and procedures. Perform Red and Purple team assessments, pen testing, ransomware readiness reviews (e.g., assessing susceptibility to modern ransomware threats), threat analysis, and social engineering assessments. Develop comprehensive and accurate reports and presentations for both technical and executive audiences. Communicate findings, strategy, and remediation guidance to client stakeholders including technical staff, executive leadership, and legal counsel.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/111072043012629190"}