{"title": "Power Design Engineer, Devices and Services", "level": "Mid", "location": "Mountain View, CA, USA", "description": "As a Power Engineer at Google, you will be at the forefront of developing new and innovative power technologies. Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users.", "key_qualifications": "Bachelor's degree in Electrical Engineering, a related field, or equivalent practical experience. 4 years of experience in hardware power electronics, or 3 years of experience with an advanced degree. Experience in system consumer electronics power architecture, power regulator circuit design and verification. Experience in AC/DC products design, circuit topology or regulatory specifications.", "preferred_qualifications": "Master's or PhD degree in a technical field or equivalent practical experience. Experience in wireless charging. Experience in battery fuel gauges, algorithm development, firmware development, circuit design and verification for battery management. Experience with on-board power design in consumer electronics or related fields. Knowledge on system power delivery, voltage regulator, power IC and power electronics. Ability to execute work with limited supervision, with excellent investigative and organizational skills and attention to detail.", "responsibilities": "Lead system power architecture design for consumer electronics devices and implement design from schematic to Printed Circuit Board (PCB). Simulate and design power circuits like battery charger, fuel gauge, wireless charging, audio amplifier, backlight, and more. Select critical power components to optimize power system electric performance, Bill of Materials (BOM), cost, and design trade-offs. Drive innovative new technologies or new applications of existing technologies, and partner with power industry leaders to lead evaluation and adoption of compelling technologies. Engage with cross-functional teams to ensure power system design, integration, and complete validation. Provide technical leadership and direction while troubleshooting system-level power network issues.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/111078313128010438"}