{"title": "Technical Program Manager, Spaces Engineering", "level": "Mid", "location": "Hyderabad, Telangana, India", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.", "key_qualifications": "Bachelor's degree in Computer Science, a related technical field, or equivalent practical experience. 10 years of experience in program management. Experience translating engineering discussions into actionable tasks and next steps.", "preferred_qualifications": "Experience with leadership roles, leading other program managers through program strategies, project execution, and risk management. Experience managing software development and integration programs in the physical security or workplace productivity domain. Experience working with software engineers, product managers, and user experience. Ability to run and deliver results on technical projects and develop strategies to align to business requirements. Excellent technical, problem solving, and quantitative skills.", "responsibilities": "Plan and prioritize work across multiple teams, build alignment, and execute on roadmap deliverables. Manage cross-functional programs and projects, communicate schedules, priorities, status, and risks. Work with partner teams to launch key features and projects on-time.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/111136981911511750"}