{"title": "Maintenance and Operations Technician, Mechanical (English, Dutch)", "level": "", "location": "Eemshaven, Netherlands", "description": "The Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facilities Technicians at Google data centers operate, monitor and support physical facilities conditions. Some of these duties will include heating and cooling of air and water, power supply, generators, UPS systems, electrical distribution and control and monitoring systems. You regularly help inspect, maintain and repair various data center systems such as piping and non-critical electrical or mechanical system components). You provide daily assistance to senior technicians as you read blueprints/schematics, conduct tours of systems and assess their working order.\n\nAs an advocate for best practices, you develop creative approaches to reducing operational costs while improving overall data center efficiency. You ensure that environmental and safety standards are consistently met, identifying problems and making repairs quickly. In emergency situations or abnormal conditions, you manage data center performance issues and outages to minimize the recovery time from failures.\n\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "key_qualifications": "Associate's degree, trade school certification, or other certified training in a related technical field, or equivalent practical experience.\n2 years of Mechanical/HVAC, experience in an industrial or commercial environment.\nAbility to lift and move 50 lbs of equipment, and work on platforms, ladders, and under raised floors\nAbility to communicate in English and Dutch fluently, to support the client management in the region as well as interact with local stakeholders.", "preferred_qualifications": "Experience in mechanical maintenance of critical large-scale facilities (e.g., Data Centers, Pharma/Medical/Electrical installations) including maintenance of UPS systems, generators, and associated devices.\nExperience investigating failures and performing data analysis.\nKnowledge of electrical, mechanical, and controls systems including Feeders, Transformers, Generators, Switchgear, UPS systems, ATS/STS units, PDU/PMM units, Chillers, or commercial HVAC units.\nAbility to learn quickly and adapt to new processes, procedures, and equipment.\nAbility to communicate clearly and effectively to perform maintenance or projects on the systems.\nAbility to work non-standard hours including, shift-based schedules, weekends, and holidays.", "responsibilities": "Monitor multiple information streams in the control room and make accurate mission-critical decisions.\nBe responsible for the uptime, maintenance, and troubleshooting of various data center systems such as pumps, HVAC, control and monitoring systems, stand-by power generation, and electrical distribution.\nOperate, monitor, maintain, and respond to abnormal conditions in the data center facilities systems and equipment.\nLead the execution of complex controls system programming, start-up, commissioning, documentation, and full facilities turnover on assigned projects.\nFollow the site’s environmental health and safety policies.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/111437312063087302"}