{"title": "Pixel System Architect Lead, Graphics", "level": "Advanced", "location": "Mountain View, CA, USA; San Diego, CA, USA", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.\n\nThe Pixel System Architecture team is responsible for defining the next-generation Systems for Pixel devices from concept to volume production to post deployment. As a Pixel System Architect lead for graphics, you will work cross-functionally with Hardware, Software, and Silicon teams to ensure trade-off decisions are made in the interest of the user by taking a system view. You will assume architecture ownership of graphics and gaming use cases. You will establish system-level models and methodologies to help drive projections to make data-driven systems and component decisions. You will work cross-functionally with System-on-a-Chip (SoC), IP, and software engineering teams to drive optimizations, track projections to fix issues, and enable Pixel leadership in this domain.", "salary": "$214,000-$305,000 + bonus + equity + benefits", "key_qualifications": "Master’s degree in Electrical Engineering, a related field, or equivalent practical experience. 8 years of experience working in a general-purpose compute, graphics, or multimedia pipelines, or 7 years of experience with an advanced degree. 7 years of experience with mobile phones or embedded hardware systems. 5 years of experience in technical leadership.", "preferred_qualifications": "Advanced degree in Electrical Engineering or a related field. Experience working cross-functionally to drive system architecture activities for consumer electronics devices. Experience in one or more areas in Graphics Rendering, GPU IP, graphics software infrastructure, and GPU machine learning compute. Experience working from use cases to drive architecture and component definition. Ability to profile systems, identify performance bottlenecks and drive optimizations of system resources including battery life, thermals and power delivery.", "responsibilities": "Manage ownership of Graphics and gaming use cases to optimize user experience and performance while accounting for system constraints such as battery life, thermals, and power delivery. Take a first-principles approach, ensuring rationale for key software decisions and hardware requirements are made in the interest of the user. Establish system-level models and methodologies, driving projections in the Product Development Process, informing software, SoC and IP requirements. Document system architecture specifications that establish flows and how user experiences are delivered by the underlying systems and components. Drive architecture investigations for optimization features across hardware and software. Collaborate with hardware, SoC, IP and software engineering teams to track projections/fix issues and improve modeling methodologies.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/111524021748540102"}