{"title": "Senior Materials Engineer, Glass, Platforms and Devices", "level": "Mid", "location": "Mountain View, CA, USA", "description": "Our mission is to revolutionize the use of brittle materials through research, design, and engineering. We develop innovative solutions that unlock the full potential of these materials, pushing the boundaries of performance, reliability, and safety in diverse applications.", "key_qualifications": "Bachelor's degree in Mechanical Engineering, Materials Science, Physics, Chemistry, a related field, or equivalent practical experience. 5 years of experience with glass/ceramics in engineering design and mass-manufacturing (e.g., consumer products, automotive, etc.)", "preferred_qualifications": "Master's degree or PhD in Materials Science, Ceramic Engineering, Mechanical Engineering, Physics, Chemistry, or a related field. 8 years of experience with glass/ceramics in engineering design and mass-manufacturing (e.g., consumer products, automotive, etc.). Experience in fundamental failure analysis methodology to derive a root cause of failure. Experience in glass characterization techniques (e.g., thermal analysis, microscopy, mechanical testing). Experience in glass formulation principles and manufacturing processes. Ability to travel internationally up to 20% of the time.", "responsibilities": "Create and develop glass roadmap that enables future design and product development, in close cooperation with product designers, industrial designers, and manufacturing partners. Engage with global glass suppliers on multiple projects simultaneously, analyze test results, and select the best material for an application. Travel to factories in Asia to provide on-site support for project trials and builds. Partner with Corporate Sustainability, Product Design, Industrial Design, Operations and Reliability teams on material qualification and pass all product level testing. Develop engineering solutions that mitigate risks, prevent catastrophic failures, and enhance the performance of systems that rely on these materials. Develop glass modeling and simulation software (e.g., finite element analysis (FEA)). Statistical analysis and data interpretation to help with Glass FEA.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/111690012906398406"}