{"title": "Technical Program Manager III, Software Engineering, Core", "level": "Mid", "location": "Sunnyvale, CA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company. As a Technical Program Manager, you will lead software engineering projects in one of our core programming languages. You will also influence teams that design, develop, test, deploy, maintain, and improve software. The Core team builds the technical foundation behind Google’s flagship products. We are owners and advocates for the underlying design elements, developer platforms, product components, and infrastructure at Google. These are the essential building blocks for excellent, safe, and coherent experiences for our users and drive the pace of innovation for every developer. We look across Google’s products to build central solutions, break down technical barriers and strengthen existing systems. As the Core team, we have a mandate and a unique opportunity to impact important technical decisions across the company. The US base salary range for this full-time position is $142,000-$211,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "key_qualifications": "Bachelor's degree in a relevant field, or equivalent practical experience. 5 years of experience in program management. Experience with software development and managing execution of programs that span multiple engineering teams.", "preferred_qualifications": "5 years of experience managing cross-functional and/or cross-team projects. Experience with lifecycle management in a fast-paced software environment. Ability to use technical judgment to solve software engineering challenges involving bug triage, source control, continuous integration, etc. Ability to be influential on a highly integrated team of technical and non-technical members.", "responsibilities": "Manage technology programs by defining milestones and success criteria, resource allocation, and successful on-time delivery. Use technical judgment while working with large, cross-functional teams. Develop tools and processes to improve software engineering productivity. Communicate schedules, priorities, and status to all levels in the company.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/111669569600266950"}