{"title": "Technical Program Manager, Google Ads Operations", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nGoogle is an engineering company at heart. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on users around the world. At Google, engineers not only revolutionize search, they routinely work on scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, social to local, Google engineers are changing the world one technological achievement after another.", "key_qualifications": "Bachelor's degree in Engineering, or equivalent practical experience.\n2 years of experience in program management.\nExperience identifying issues and working cross-functionally with partners.", "preferred_qualifications": "2 years of experience managing cross-functional or cross-team projects.\nExperience with the software development life cycle.\nExperience with the Ads product area/business.\nAbility to manage ambiguous programs with cross-functional teams.\nAbility to collaborate across organizational boundaries, and build relationships to achieve broader organizational goals.", "responsibilities": "Manage a portfolio of projects and work-streams, and be responsible for overall program strategy, governance, operating model, and program operations.\nBe responsible for program scoping, planning, creating and managing integrated schedules, setting milestones, and program tracking.\nUse leadership, product, and technical knowledge to drive program delivery, work with engineering, product management, UX, and other partner teams.\nNavigate multiple work-streams, functional and technical concepts, and conversations across different areas and stakeholders to drive collaboration and consensus.\nLead the creation of integrated timelines and schedules, track the progress, manage dependencies, identify and communicate risks, and identify mitigations.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/111600631952614086"}