{"title": "Product Manager II, Content Delivery Networks, Google Cloud", "level": "Mid", "location": "Sunnyvale, CA, USA; Cambridge, MA, USA", "description": "At Google, we put our users first. The world is always changing, so we need Product Managers who are continuously adapting and excited to work on products that affect millions of people every day. In this role, you will work cross-functionally to guide products from conception to launch by connecting the technical and business worlds. You can break down complex problems into steps that drive product development.One of the many reasons Google consistently brings innovative, world-changing products to market is because of the collaborative work we do in Product Management. Our team works closely with creative engineers, designers, marketers, etc. to help design and develop technologies that improve access to the world's information.  We're responsible for guiding products throughout the execution cycle, focusing specifically on analyzing, positioning, packaging, promoting, and tailoring our solutions to our users.Google Cloud helps employees and organizations empower their employees, serve their customers, and build what’s next for their business with technology built in the cloud. The team is focused on products that help customers quickly and reliably deliver content to users. In this role, you will work cross-functionally to influence strategy and roadmap and deliver products from conception to launch.Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$142,000-$211,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in product management or related technical role. 2 years of experience taking technical products from conception to launch. Experience developing/launching products/technologies within one or more of the following: Cloud, CDN, SaaS, enterprise, internal tools, or supply chain networks.", "preferred_qualifications": "Master's degree in a technology or business related field. 3 years of experience in a business function or role (e.g., strategic marketing, business operations, consulting). 3 years of experience in a role preparing and delivering technical presentations to senior leadership. 2 years of experience in software development or engineering. 2 years of experience working cross-functionally with engineering, UX/UI, sales finance, and other stakeholders. 1 year of experience in technical leadership.", "responsibilities": "Understand markets, competition, and customer/user requirements. Identify market opportunities, build business cases, and refine product idea and strategy for Google Content Delivery products, APIs, and key verticals. Work collaboratively with stakeholders across engineering, products, customer experience, and sales/support. Define, lead, and execute a cohesive product strategies related to Media CDN, Cloud CDN, or Service Extensions, collaborating as needed across regions, product areas, and functions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/111828001280139974"}