{"title": "Business Experience Team Manager, People Consultants", "level": "Advanced", "location": "Dublin, Ireland", "description": "People Operations strives to revolutionize human resources the same way that Google has revolutionized search. We are helping to find, grow and keep the remarkable assemblage of talent who are our Googlers. You'll be an advocate of Google's culture and values, partnering with our business leaders to help them build their organizations and make sure all people decisions are based on data.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 12 years of experience as an HR Business Partner or HR Generalist providing consultations to the business on topics such as performance management, workplace concerns, etc. 5 years of experience managing a HR team. Experience in global HR operations. Experience managing multiple stakeholders.", "preferred_qualifications": "Ability to extrapolate insights from data and metrics, understand trends, and develop recommendations for actions based on the analysis. Deep HR expertise working with clients, stakeholders, and central functions.", "responsibilities": "Lead a team responsible for all EMEA aligned product areas and functions, Business HR (BHR) relationships, and delivery of the full Leadership, Team, and Organizational Efectiveness (LTOE) menu of service. Work closely with business responsiveness leaders in other regions to ensure there is a joined-up view of priorities for each product area and function. Lead  a small team to provide excellent support, from Googler questions to implementation of global reorganizations. Lead a team of expert LTOE People Consultants, delivering expert consulting services in a strategic, value-added manner across the EMEA product areas and function. Advise People Consultants (PC) Leadership on our PC strategy for developing and delivering the service lines under the business responsiveness team. Owns capacity planning and defining of success metrics for aligned service lines under the business responsiveness team.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/112045427355722438"}