{"title": "Global Process Manager, Revenue Operations", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "The Finance Operations team manages Google's cash transactions on a global basis and ensures that Google's incoming and outgoing cash processes are controlled, effective and efficient. As a member of this team, you'll find innovative ways to manage our complex set of transactions. You'll make processes more efficient and scalable, work to ensure the highest level of quality of our operations, and proactively minimize operational risk. Externally, you collaborate with our extended workforce partners and internally, you will collaborate across the multiple areas of the Financial Operations team.", "key_qualifications": "Bachelor's degree in Business, Finance, Engineering, or Operations, or equivalent practical experience.\n7 years of experience in management consulting, or an operations-related function; or 5 years of experience with an advanced degree in business, accounting, or finance.", "preferred_qualifications": "MBA or Master’s degree.\nExperience managing cross-functional projects, identifying, assessing, and controlling risks on the operations side.\nExperience with SAP.\nKnowledge of Six Sigma, Lean or other process improvement methodology.\nAbility to communicate and influence leadership teams in Google’s product areas and Finance, with excellent problem solving skills.\nExcellent leadership, project management, and process design skills.", "responsibilities": "Define process requirements for operations, design for new products and systems implementation in collaboration with cross-functional teams.\nLead the operational integration for operations of acquired companies in conjunction with partners.\nConsult with Google product areas and global counterparts to understand the operational environment and impacts of changes and issues, and drive resolution of identified gaps .\nAnalyze data sets to test hypotheses and provide insights to influence decision making.\nEnsure readiness on supporting new and existing functionality.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/112039798532645574"}