{"title": "Cố vấn phân tích, Ứng dụng và Trò chơi", "level": "Mid", "location": "Ho Chi Minh City, Vietnam", "description": "Những doanh nghiệp hợp tác với Google thuộc đủ loại hình, quy mô và giá trị vốn hoá thị trường, trong khi đó, mỗi doanh nghiệp cần có một chiến lược và giải pháp quảng cáo khác nhau. Kiến thức về truyền thông trực tuyến kết hợp với các kỹ năng giao tiếp và năng lực phân tích của bạn sẽ giúp định hình đường hướng phát triển cho cả doanh nghiệp mới lẫn doanh nghiệp hiện hữu. Bằng kỹ năng tạo dựng mối quan hệ, bạn sẽ cung cấp dịch vụ khách hàng, các nghiên cứu và phân tích thị trường theo các tiêu chuẩn chất lượng của Google. Bạn sẽ đưa ra dự đoán về cách đưa ra quyết định, không ngừng tìm tòi và khám phá nhu cầu kinh doanh từ phía các khách hàng chiến lược của Google, đồng thời tìm hiểu xem các sản phẩm của Google có thể giúp họ phát triển hoạt động kinh doanh ra sao. Trong quá trình làm việc với khách hàng, bạn sẽ đề ra tầm nhìn và chiến lược để giúp quảng cáo của họ có thể tiếp cận hàng nghìn người dùng.\nTrong vai trò một Cố vấn phân tích thuộc Khối Khách Hàng Chiến Lược (LCS), bạn sẽ áp dụng các khung phân tích và mô hình dữ liệu nâng cao để tạo thông tin chi tiết nhằm đưa ra đề xuất kinh doanh, đồng thời đánh giá các nguyên tắc cơ bản trong hoạt động kinh doanh của khách hàng, qua đó giúp thúc đẩy quá trình tăng trưởng và chuyển đổi của khách hàng. Bạn sẽ định hướng một cách độc lập cho nhiều khách hàng và/hoặc nhiều hoạt động tương tác với đối tác bằng cách xây dựng các mối quan hệ và mạng lưới chuyên sâu. Bạn sẽ phát triển thông tin phân tích tuỳ chỉnh trong ngành và thông tin chuyên sâu về các cơ hội để trình bày với nhóm Bán hàng trước các cuộc họp với khách hàng.\nKhối Khách Hàng Chiến Lược của chúng tôi hợp tác chặt chẽ với nhiều nhà quảng cáo và công ty quảng cáo lớn nhất thế giới nhằm phát triển những giải pháp kỹ thuật số giúp xây dựng doanh nghiệp và thương hiệu. Chúng tôi nắm giữ góc nhìn toàn cảnh về sự chuyển đổi mạnh mẽ trong bối cảnh hoạt động quảng cáo chuyển dịch sang các nền tảng di động và trực tuyến. Chúng tôi ở một vị thế đặc biệt, có thể giúp định hình cách các công ty phát triển trong thời đại số. Chúng tôi tư vấn cho khách hàng về đa dạng sản phẩm của Google trên mạng tìm kiếm, nền tảng video và thiết bị di động để giúp họ kết nối tức thì và liền mạch với tập khán giả mục tiêu của họ.", "salary": "", "key_qualifications": "Bằng cử nhân hoặc kinh nghiệm thực tế tương đương. 5 năm kinh nghiệm trong các lĩnh vực dựa trên dữ liệu, như phân tích số liệu, nghiên cứu thị trường, tư vấn chiến lược hoặc tư vấn doanh nghiệp. Khả năng giao tiếp thông thạo bằng cả tiếng Anh và tiếng Việt để phục vụ khách hàng nói tiếng Việt.", "preferred_qualifications": "Kinh nghiệm trong ngành Ứng dụng hoặc Trò chơi. Kiến thức thực tiễn/thành thạo về dữ liệu và các công cụ phân tích. Năng lực xử lý các tập dữ liệu lớn, phức tạp, cùng tư duy phân tích. Tầm ảnh hưởng đến các hoạt động và năng lực kể chuyện truyền cảm hứng cho đối tượng mục tiêu. Năng lực tương tác một cách tự tin với lãnh đạo cấp trung của tổ chức. Kỹ năng tư vấn kinh doanh xuất sắc và năng lực nắm bắt hành vi kỹ thuật số của người tiêu dùng, trong đó chú trọng vào mức tiêu thụ video và ứng dụng.", "responsibilities": "Phân tích các tập dữ liệu lớn và phức tạp, xác thực thông tin chi tiết và dựa vào đó để đưa ra đề xuất kinh doanh. Phối hợp với nhóm Bán hàng đề ra những giải pháp có thể mở rộng dựa trên thông tin chi tiết. Trợ giúp tự động hoá các quy trình cốt lõi cũng như xây dựng những trang tổng quan hiệu quả và có thể mở rộng quy mô. Điều phối các mốc thời gian, mục đích cũng như mục tiêu theo những khía cạnh cụ thể được giao trong một dự án cung cấp thông tin chuyên sâu. Là một cộng sự đóng góp ý tưởng cho đội ngũ lãnh đạo về dữ liệu phân tích, nghiên cứu, kiến thức và tầm nhìn về ngành. Phối hợp cùng các lãnh đạo cấp quốc gia và cấp ngành để xây dựng lộ trình và những khía cạnh ưu tiên đối với các dự án thông tin chuyên sâu về ngành. Hỗ trợ tư vấn và hợp tác giữa đội ngũ chuyên viên và các đối tác liên ngành trong những dự án chung của ngành.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/112112507765564102"}