{"title": "CPU Technical Program Manager, Silicon", "level": "Advanced", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "key_qualifications": "Bachelor’s degree in Electrical, Electronics, Computer Engineering, Computer Science, or equivalent practical experience. 10 years of experience with CPU engineering, CPU program management, or similar experience. Experience with modern processor micro-architecture and processor design flows, RTL, Design Simulation and Emulation, and Physical Design technologies.", "preferred_qualifications": "Master’s or PhD degree in Electrical, Electronics, Computer Engineering, Computer Science, or a related field. Experience with industry standard CPU benchmarks, with knowledge of CPU Performance Power Area (PPA) metrics and trade-offs. Experience with Google suite of applications (e.g., Google App Scripts, Sheets), and knowledge of modern project management tools (e.g., Confluence, JIRA). Experience interacting with global teams and excellent communication skills. Knowledge of up-to-date ARM Instruction Set Architecture.", "responsibilities": "Drive inter-discipline discussions at the project level. Coordinate among CPU Architecture, Performance, Design, Design Verification, Emulation, Physical Design, and Support teams. Coordinate regular Engineering and Management meetings at various levels and across multiple geographical locations, and ensure smooth operation of well-functioning programs. Host issue and resolution meetings at the project level, and create and track issues. Ensure programs are executed for quality and schedule.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/112181174092079814"}