{"title": "Global Strategy and Operations Program Manager, YouTube Incentives", "level": "Mid", "location": "Redwood City, CA, USA", "description": "Product and Sales Activation (PSA) brings expertise in product and business strategies enabling Google Customer Solutions (GCS) to drive success with millions of small businesses. PSA’s mission is to shape, simplify and scale product solutions to help businesses of all sizes grow with Google.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of work experience in Management Consulting, Sales Operations, Digital Product Strategy, and Product Marketing Management. 2 years of experience in relevant business analytics with SQL.", "preferred_qualifications": "Masters degree in a quantitative field (Finance, Statistics, Economics) or MBA. Experience with sales incentive design. Experience in digital ad strategy. Passion for connecting the dots across formats, audiences, and channels through data. Advanced technical and problem-solving skills in automation, dashboarding, data visualization, data infrastructure, machine learning, SQL. Strong written and verbal communications skills with the ability to structure a compelling storyline and build presentation decks/documents to support their position.", "responsibilities": "Drive the ideation, development, and execution of our go-to-market to provide sustainable, long-term growth for YouTube. Structure and organize data, run analyses, synthesize findings, and present clear recommendations to leadership to drive future strategy. Design, develop and automate efficient business processes and analytics solutions to provide insights at scale. Build a strong network across Sales, Operations, Finance, Marketing, Data Science, and others to deliver on a range of GTM, investigative, and operational workstreams. Develop content for and present to stakeholders across multiple levels and multiple organizations across Google.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/112298646480790214"}