{"title": "Product Manager II, Google Play", "level": "Mid", "location": "Mountain View, CA, USA; San Francisco, CA, USA", "description": "At Google, we put our users first. The world is always changing, so we need Product Managers who are continuously adapting and excited to work on products that affect millions of people every day. In this role, you will work cross-functionally to guide products from conception to launch by connecting the technical and business worlds. You can break down complex problems into steps that drive product development. One of the many reasons Google consistently brings innovative, world-changing products to market is because of the collaborative work we do in Product Management. Our team works closely with creative engineers, designers, marketers, etc. to help design and develop technologies that improve access to the world's information.  We're responsible for guiding products throughout the execution cycle, focusing specifically on analyzing, positioning, packaging, promoting, and tailoring our solutions to our users. Google Play offers music, movies, books, apps and games for devices, powered by the cloud. It syncs across devices and on the web. As part of the Android and Mobile team, Googlers working on Google Play do everything from engineering our backend systems, to shaping product strategy, to forming great content partnerships. They make it possible for people to do things like buy an ebook or song on their Android phone, then have it instantly available on their laptop. The Google Play team enhances the Android ecosystem by giving developers and partners a premium store where they can reach millions of users.", "salary": "$142,000-$211,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in product management or related technical role. 3 years of experience in mobile application development. 2 years of experience taking technical products from conception to launch. 2 years of experience with go-to-market and go-to-market strategies.", "preferred_qualifications": "Master's degree in a technology or business related field. 3 years of experience in a business function or role (e.g., strategic marketing, business operations, consulting). 2 years of experience in software development or engineering. Experience creating product roadmap(s) from conception to launch, driving the product outlook, defining the GTM strategy, and leading design discussions. Technical experience. Applications development experience. Experience building and launching a customer-facing product.", "responsibilities": "Work with partner teams (e.g., engineers, program managers, UX) during product design and development to implement the requirements to turn PRDs into OKRs for one or more teams. Define product roadmaps by operationalizing strategy. Validate the market size and opportunity (e.g., user-based, strategic opportunity, business generation).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/112239802744480454"}