{"title": "ASIC Design Verification Engineer, Google Cloud", "level": "Mid", "location": "Sunnyvale, CA, USA", "description": "As a ASIC Design Verification Engineer, you will be part of a team developing ASICs used to accelerate computation in data centers. You will have dynamic, multi-faceted responsibilities in areas such as project definition, design verification, and silicon bringup. You will participate in the architecture, documentation, and verification of the next generation of data center accelerators.", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Engineering, Computer Science, a related field, or equivalent practical experience. Experience with industry-standard tools, languages and methodologies relevant to the development of silicon-based ICs and chips. Experience with SystemVerilog (i.e. SystemVerilog Assertions or functional coverage).", "preferred_qualifications": "Master's degree or PhD in Electrical Engineering, Computer Engineering or Computer Science, with an emphasis on computer architecture, or a related field. 6 years of experience in design verification. Experience with one or more of the following: networking, switching, congestion control protocols, PCIe, TCP/IP, RDMA, NVMe, or ARM interconnect protocols. Experience in Power aware verification, Gate level simulations, and Post silicon bring-up. Experience verifying digital logic at Register-Transfer Level (RTL) using SystemVerilog for Application-Specific Integrated Circuits (ASICs). Familiarity with ASIC standard interfaces and memory system architecture.", "responsibilities": "Plan the verification of complex digital design blocks, understand the design specification, and interact with design engineers to identify important verification scenarios. Create a constrained-random verification environment using SystemVerilog and Universal Verification Methodology (UVM). Identify and write all types of coverage measures for stimulus and corner-cases. Debug tests with design engineers to deliver correct design blocks. Close coverage measures to identify verification holes and to show progress towards tape-out.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/112404865853858502"}