{"title": "Resident Data Migration Engineer", "level": "Mid", "location": "Reston, VA, USA; Washington D.C., DC, USA", "description": "As a Resident Data Migration Engineer, you will guide the migration of transactional database systems to Google Cloud Platform. You will understand technical requirements and assist in designing, planning, managing, and troubleshooting the data migration process. You will travel to the customer site to deploy solutions and deliver workshops to educate and empower customers. Additionally, you will work closely with Product Management and Product Engineering to build and constantly drive excellence in our products.", "salary": "$142,000-$211,000 + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree in Engineering, Computer Science, a related field, or equivalent practical experience. 6 years of experience with database technologies such as PostgreSQL, MySQL, SQL Server, Oracle. 6 years of experience in writing software in one or more languages, such as Java, Python, or Go. Experience in database administration techniques including storage, clustering, availability, disaster recovery, security, logging, monitoring and auditing.", "preferred_qualifications": "Experience with data migration strategies and moving large-scale production systems either in on-premise/data center environments or migration to cloud scenarios. Experience with database management tools for backups, recovery, snapshot management, sharding, partitioning and as well as database performance tuning. Experience working with cloud databases such as RDS, Aurora, DynamoDb, ElastiCache, CloudSQL, Datastore, Firestore, or Cloud Spanner. Experience developing ELT or ETL workflows. Experience in SQL databases with deep query troubleshooting knowledge such as isolating blocks of poor performing SQL, determining root cause, and developing remediation actions.", "responsibilities": "Serve as a trusted technical advisor to solve complex database migration challenges. Analyze on-premises and cloud database environments and consult on the optimal design for performance and deployment on Google Cloud Platform. Create and deliver best practices recommendations, tutorials, blog articles, sample code, and technical presentations adapting to different levels of key business and technical stakeholders. Travel regularly (up to 30%) in-region for meetings, technical reviews, and onsite delivery activities.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/112543833077490374"}