{"title": "Software Engineering Manager, Systems Acceleration, Silicon", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "Like Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers. You not only optimize your own code but make sure Engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way. With technical and leadership expertise, you manage engineers across multiple teams and locations, a large product budget and oversee the deployment of large-scale projects across multiple sites internationally. As a Software Engineering Manager, you will focus on software power and performance optimization for the SoCs, and will work with people from different teams and functions. Google's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "key_qualifications": "Bachelor's degree in Computer Science, Electrical Engineering, a related technical field, or equivalent practical experience. 5 years of experience with software development in C/C++. 1.5 years of experience in a leadership role (e.g., technical leadership or people management, supervision, or team leadership). Experience working with hardware accelerators (e.g., GPU, TPU, DSP).", "preferred_qualifications": "Experience with power and performance measurement and optimization. Experience optimizing CPU/DSP SIMD code using intrinsics or assembly language. Experience developing software for Android or other embedded systems. Knowledge of mobile SoC Architecture. Ability to bring ideas to solve or improve issues. Ability to communicate in English fluently to communicate with teams across various regions.", "responsibilities": "Optimize the performance of production software running on Google’s SoCs. Contribute to the software and hardware architecture designs for Google’s future SoCs and software features. Collaborate across organizations and teams to move the software and hardware design into production.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/112581875213443782"}