{"title": "Senior Test Automation Engineer", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "At Google, our philosophy is build it, break it and then rebuild it better. That thinking is at the core of how we approach testing at Google. Unlike roles with similar names at the other companies, Test Engineers at Google aren't manual testers -- you write scripts to automate testing and create tools so developers can test their own code. As a Test Engineer, you navigate Google's massive codebase, identify weak spots and constantly design better and creative ways to break software and identify potential problems. You'll have a huge impact on the quality of Google's growing suite of products and services. As a Test Automation Engineer, you will stress Google’s Consumer Hardware product line, identify weak spots and constantly design better and creative ways to break hardware and identify potential problems. You'll have a huge impact on the quality of Google's growing suite of products and services. In this role, you will use knowledge of testing and testability to influence better hardware and software design, promote proper engineering practice, and bug prevention strategies, testability, accessibility, and other advanced quality concepts across products. Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "key_qualifications": "Bachelor's degree in Electrical Engineering, a related technical field, or equivalent practical experience. 5 years of experience in coding, developing test methodologies, writing test plans, creating test cases, and debugging. Experience with the development of automated test solutions in Python, C, C++, or Java.", "preferred_qualifications": "Master's degree in Electrical Engineering, or a related technical field. Experience using lab instruments (e.g., oscilloscope, DMM, Power Supplies, etc.). Experience with test methodologies, writing test plans, creating test cases and debugging. Knowledge of Python development, Unix/Linux/Android environments and Bash scripting. Knowledge of system components, interfaces, and protocols on consumer electronic devices such as touch, display, camera, audio, cellular, Wi-Fi, Bluetooth, power and battery, system performance, multimedia, sensors, USB, Type-C,SPI, I2C, I2S, UART, etc.", "responsibilities": "Contribute to engineering efforts from planning and organization to execution and delivery to solve complex engineering problems in tools and testing. Develop scalable and reliable automated tests and frameworks for testing consumer hardware devices. Automate repeated tasks and build test coverage through existing or new infrastructure. Write moderately complex code/scripts to test systems, implementing infrastructure as necessary. Explore cutting-edge AI solutions to test automation.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/112673438211941062"}