{"title": "Global Investigator", "level": "Mid", "location": "Gurugram, Haryana, India; Bengaluru, Karnataka, India", "description": "As an Investigator on the Security Investigations and Assessments team, you will be responsible for protecting Google's assets, people, and information from insider threats by conducting comprehensive investigations and proactive threat assessments. You will collaborate with cross-functional teams such as Security Operations, Security Engineering, Ethics and Compliance, People Operations (Human Resources) and others to ensure a safe and secure environment.\nFrom keeping Googlers safe and secure to managing disruptive events, the ability to anticipate, deter, detect, and act are the pillars of Google’s Global Security and Resilience Services (GSRS) team. As a member of GSRS you will help develop a culture where safety, security and resiliency are integrated into every facet of Google, including the creative process. You will help us continually identify, evaluate and monitor enterprise risks that could affect business activities and provide business leaders the information they need to make critical decisions. You'll collaborate with cross-functional teams to create innovative strategies and develop programs that drive sustainable effectiveness.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience in investigations.\n4 years of experience conducting legally compliant security investigations regarding threats, risks, or other potential security issues in the Asia Pacific region.\n2 years of experience analyzing, interpreting, and drawing solutions from data, as it relates security investigations, and reporting issues.\nExperience with investigative and interview training from a national or internationally recognized organization.", "preferred_qualifications": "Certification in security including CISSP and CISM certifications.\nExperience using threat assessment (e.g., WAVR21).\nKnowledge of threat types and trends.\nExcellent problem solving and decision making skills.\nExcellent written and verbal communication skills.", "responsibilities": "Investigate a diverse range of security incidents, (e.g., physical policy violations, data leaks, and theft of IP), gather and analyze evidence, conduct interviews, and present legally complaint objective findings and recommendations to stakeholders at all levels.\nAssess potential threats, evaluate identified risks, and collaborate with teams to implement strategies to mitigate potential harm.\nAssess existing processes to identify security vulnerabilities that could enable unethical behavior, and develop comprehensive recommendations to enhance security protocols.\nWork collaboratively with various teams across Google to build a culture of security awareness and preparedness. Build relationships with stakeholders to ensure communication and coordination of security efforts.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/113120373045633734"}