{"title": "Digital Marketing Apprenticeship, January 2025 Start", "level": "Intern & Apprentice", "location": "New York, NY, USA; Atlanta, GA, USA; Chicago, IL, USA", "description": "The Google Digital Marketing apprenticeship is a Department of Labor Registered Apprenticeship Program and a structured learning and development opportunity. Apprentices will participate in on-the-job training, related technical instruction, and career development workshops to develop professional and durable skills. Upon completion, apprentices receive a nationally-recognized credential, certified by the United States Department of Labor. As a Digital Marketing apprentice at Google, you will develop the skills you need to pursue an entry-level career in digital marketing. You will help define, design, and execute campaigns across a variety of digital platforms for the biggest brand marketers in the world. You may interact directly with external clients to help manage accounts, support marketing strategy and help represent the Google brand. You will get exposure to different Google products, including consumer (like Gmail, Search, Maps, Chrome, Android) and business products (Google Ads, AdSense, Google Analytics). Apprentices are paid hourly for their time split between on-the-job training and related technical instruction, and are required to dedicate 40 hours each week to the program. Apprenticeships begin with an immersive virtual onboarding experience to build a foundational understanding of the profession. Apprentices will then join a Google team to train on-the-job, while continuing to engage in track-specific learnings and career workshops throughout the program. As part of the program, apprentices receive holistic career readiness support, and towards the end of the program will have the time and space to prepare for their next endeavor. Find more details about apprenticeships and a list of FAQs on g.co/Apprenticeships.", "salary": "$41,000-$54,500", "key_qualifications": "High school degree, GED equivalent, or practical experience. Not currently enrolled in or completed a Bachelor’s, Master’s, or PhD degree program in a digital marketing related field. Less than 1 year of relevant digital marketing experience.", "preferred_qualifications": "Experience thinking critically and excellent problem solving capabilities. Experience using Google Workspace or a similar suite of productivity tools. Ability to navigate multiple ambiguous tasks and competing priorities while finding suitable solutions and seeking help/advice where appropriate. Ability to work independently and within a team framework. Enthusiasm and passion for new technologies, demonstrated through personal projects and commitment to learning new skills. Excellent communication and organizational skills, proactive, motivated, positive attitude, and excellent customer service capabilities.", "responsibilities": "Analyze and evaluate organizations’ digital strategies and actions. Support execution of go-to-market strategies and coordination for new product launches and programs (e.g., positioning, naming, external communications, competitive analysis, and feature prioritization). Support insight gathering to better serve our users (e.g., via focus groups, working with a research agency to develop and test hypotheses, etc.) and manage social media campaigns, and develop ideas to better engage our users. Attend team meetings to keep colleagues informed and to create a forum for knowledge sharing. Manage externally facing interactions with clients/partners, executing and following up on tasks/action items that result from interacting with a given client/partner.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/113230448225592006"}