{"title": "Technical Program Manager Lead, User Experience, Pixel Software", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in program/project management. 2 years of experience in a leadership role with/without direct reports. Experience in mobile application user experience.", "preferred_qualifications": "Experience with program management in software application and user-facing experience on mobile phone devices, consumer hardwares, or embedded devices. Experience in problem solving within fast-paced and constantly changing environments. Experience managing dynamic technical projects, with competing resources and priorities. Ability to collaborate with stakeholders across different functions and time zones to manage change and drive continuous improvement initiatives. Excellent communication, presentation, and executive leadership stakeholder management skills.", "responsibilities": "Oversee the development of mobile applications with a focus on UI and seamless integration with the Android framework. Design, execute, and promote PoC plans for new features and initiatives, and leverage data analysis to validate concepts. Partner with engineering, UX, product management, and testing teams to define roadmaps, assess ability to incorporate data analysis, estimate efforts, create milestones, and manage resources. Track project progress using data-informed metrics, remove obstacles, and identify/mitigate risks using data analysis. Update stakeholders and leadership on project status with data-backed insights, and escalate issues as needed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/113296078882644678"}