{"title": "Strategic Pursuit Lead, Public Sector, Google Cloud", "level": "Advanced", "location": "Canberra ACT, Australia; Brisbane QLD, Australia; Melbourne VIC, Australia; Sydney NSW, Australia", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners. In this role, you will advocate for the innovative power of Google products to enable companies in the Public Sector segment to reach their full potential with Google Cloud Platform. You will represent the Google Cloud Public Sector business across the APAC region both internally across various Google product areas and externally within the market. You will own accountability of ongoing relationships and future business growth in strategic key retail accounts, orchestrating a broad set of internal and external stakeholders. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 13 years of experience in tech sales, with 5 years of experience in the Public Sector segment. Experience working with Government bodies and related organizations.", "preferred_qualifications": "Experience in management consulting in a strategy consulting firm. Experience in promoting cloud computing technologies to large organizations across geographies. Understanding of Platform-as-a-Service (PaaS), Infrastructure-as-a-Service (IaaS), data and networking technologies, the global cloud computing market, and key drivers for growth in the industry segment. Understanding of how various cloud technologies work together to drive technology adoption within the existing large account base. Ability to grow a business on a global scale through broad expertise in the industry segment.", "responsibilities": "Drive business engagements for large, strategic Public Sector customers across APAC, with a transformational industry goal and a differentiated Google solution partnership to accelerate customer digital transformation. Take the lead for APAC in global Public Sector cadence and engagements, including cascading global direction, strategy, best practices, and learnings to APAC as well as escalating APAC specific issues. Align and lead key internal stakeholders including Sub-Regional teams, Product Engineering, Government Affairs and Public Policy, Pricing Google Partnership teams, Customer Experience teams, etc. Drive and scale existing solutions in the select accounts, and also co-create first of their kind solutions based on industry, customer and technology trends. Be accountable for ongoing relationships and future business growth across the account by creating and driving innovative business engagements focused on achieving growth at scale.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/113270809442558662"}