{"title": "Security Engineer, Cloud Vulnerability Research", "level": "Mid", "location": "New York, NY, USA", "description": "There's no such thing as a \"safe system\" - only safer systems. Our Security team works to create and maintain the safest operating environment for Google's users and developers. As a Security Engineer, you help protect network boundaries, keep computer systems and network devices hardened against attacks and provide security services to protect highly sensitive data like passwords and customer information. Security Engineers work directly with network equipment and actively monitor our systems for attacks and intrusions. You also work with software engineers to proactively identify and fix security flaws and vulnerabilities. Product Security Engineering is the team within the Cloud CISO organization responsible for helping ensure product Cloud ships as secure as it can be and increasing the assurance levels of security in the infrastructure. The team also focuses on increasing the capabilities of each product team to develop more secure products by design and by default, from patterns, tools, and frameworks. The mission is to find vulnerabilities in Cloud, and align scope and priorities to focus on establishing the risk, impact vulnerabilities, and work in the domain of unknowns. Google Cloud accelerates every organization's ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google's cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems. The US base salary range for this full-time position is $136,000-$200,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience with security assessments or security design reviews or threat modeling. 2 years of experience with security engineering, computer and network security and security protocols. 2 years of coding experience in one or more general purpose languages. 2 years of experience in vulnerability research.", "preferred_qualifications": "Experience discovering impactful vulnerabilities. Experience in cloud vulnerability research.", "responsibilities": "Find vulnerabilities in Google Cloud. Conduct vulnerability research. Identifying unknown bugs. Communicate results and influence the remediation of issues.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/113362882267095750"}