{"title": "Strategic Business Partner, gTech", "level": "Mid", "location": "Toronto, ON, Canada", "description": "gTech's Extended Workforce Solutions (xWS) team empowers Product Areas (PAs) to optimize extended workforce operations while reducing risks and driving efficiency through the enforcement of Google best practices and policies. We drive informed decision-making, ensuring our partners find the right talent in the right locations. Our collaboration across Google leads to streamlined processes, minimizing administrative burdens and optimizing the Extended Workforce (xW) experience. We ensure Google's policies and guidelines are consistently adhered to. The Partner Engagement team is the advocate for xWS, building essential relationships with Product Areas, Bets, Functions, and the Global Procurement Office (GPO). Our mission is to facilitate xW success, enforcing compliance, building resilient operations, and promoting durable cost savings. We prioritize understanding user needs to develop solutions that address their specific challenges. In this role, you will directly shape Google's strategy impacting regulatory, commercial, and operational decisions. Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in business development, partnerships, management consulting, or investment banking. Experience working with cross-functional teams across all levels of management.", "preferred_qualifications": "MBA or Master's degree. Experience managing contingent workforce strategies and initiatives across functions. Experience managing agreements or partnerships. Experience working with and managing partners in complex programs. Ability to cultivate global partnerships, aligning stakeholders towards strategic initiatives with regional/global impact.", "responsibilities": "Build trusted relationships with decision-makers, gaining an understanding of their strategic priorities within Product Areas and Bets. Support decision-makers, and get the right talent responsibility by shaping and enforcing cost effective practices and adherence to xWS policies. Have an understanding of decision-maker business objectives, operating model, structure, demand versus capacity needs. Support extensive change management within PAs to simultaneously launch multiple large-scale enterprise-wide xWS efforts, consult decision-makers on xWS policies, and understand the impact of changes. Apply understanding of cost-saving strategies and regulatory compliance requirements to position xWS solutions that drive results while mitigating risk. Collaborate with in-country stakeholders to develop and execute a unified regional approach for xWS policies, balancing global consistency with local market needs.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/113470864053150406"}