{"title": "CPU Design Verification Lead, Silicon", "level": "Advanced", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.\n\nWith your technical expertise, you lead projects in multiple areas of expertise (i.e., engineering domains or systems) within a data center facility, including construction and equipment installation/troubleshooting/debugging with vendors.\n\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Engineering, Computer Science, or a related field, or equivalent practical experience.\n10 years of experience in design verification. \nExperience with functional verification and performance validation of modern mobile processors, microarchitecture, and related technologies.\nExperience developing and maintaining verification testbenches, test cases, and test environments.", "preferred_qualifications": "Master's degree or PhD in Electrical Engineering, Computer Engineering or Computer Science.\nKnowledge of ARM Instruction Set Architecture.\nKnowledge of general purpose operating systems (e.g., Linux and Android).", "responsibilities": "Verify designs for future CPU developments.\nBuild functional verification infrastructure (e.g., unit, multi-unit, core, and subsystem level verification).\nVerify and validate performance for both pre-silicon and post-silicon.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/113542903935967942"}