{"title": "Database Migration Customer Engineer, Google Cloud", "level": "Advanced", "location": "Paris, France", "description": "When leading companies choose Google Cloud, it's a huge win for spreading the power of cloud computing globally. Once educational institutions, government agencies, and other businesses sign on to use Google Cloud products, you come in to facilitate making their work more productive, mobile, and collaborative. You listen and deliver what is most helpful for the customer. You assist fellow sales Googlers by problem-solving key technical issues for our customers. You liaise with the product marketing management and engineering teams to stay on top of industry trends and devise enhancements to Google Cloud products.\nAs a Database Migration Customer Engineer for Google Cloud, you will help our customers migrate from their current database portfolios to Google Cloud's offerings. You will anticipate and address key technical challenges for our customers in close partnership with Sales teams. Additionally, you will collaborate with Product and Engineering teams to stay ahead of industry trends and proactively devise enhancements to Google Cloud products.\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science or equivalent practical experience. 10 years of experience with database technologies, PL/SQL development, administration and management tools, database performance tuning techniques, and troubleshooting. 10 years of experience with enterprise-wide database to PostgreSQL data migrations, including Schema/Code conversion tools, zero downtime migration strategies and technologies, and regression testing strategies and automation tools. Experience engaging with, and presenting to, technical stakeholders and executive leaders.", "preferred_qualifications": "Experience with Oracle and similar database technologies, enterprise wide Oracle/Database 2 to PostgreSQL data migrations, including proficiency with Schema/Code conversion tools, zero downtime migration strategies and technologies. Experience with technical sales or professional consulting in the fields of systems integration, large-scale data transfer/management, and enterprise database performance. Experience optimizing database performance with respect to transactional or analytic workloads, and knowledge of disaster recovery and data backup strategies. Knowledge of DevOps principles, database automation tools, and regression testing strategies. Understanding of cloud-based database architectures and deployments.", "responsibilities": "Work with the team to identify and qualify business opportunities for migrations. Understand key customer business and technical issues, and develop strategies and solutions to support their migrations. Inspire customers and peers to solve difficult problems with ambitious and novel solutions. This includes product and solution briefings, proof-of-concept work, and coordinating technical resources. Design the target architecture and the migration strategy, minimizing the migration effort, risk, and downtime. Work with customers to demonstrate and prototype migration to Google Cloud database offerings in customer/partner environments, and travel to customer sites, conferences, and other related events as needed. Recommend integration strategies, enterprise architectures, platforms, and application infrastructure required to implement complete solutions using best practices on Google Cloud.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/113641126555984582"}