{"title": "Silicon Design Verification Lead, Google Cloud", "level": "Advanced", "location": "Bengaluru, Karnataka, India", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration. In this role, you will collaborate with design, performance, and architecture teams, and work to ensure delivery of production-quality IPs and SoCs. The infrastructure will include unit, multi-unit, core, and subsystem-level verification environments. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "salary": "", "key_qualifications": "Master's degree in Electrical Engineering, Computer Science, or equivalent practical experience. 16 years of experience with functional verification and performance validation of modern mobile processors, microarchitecture, and related technologies. Experience leading a functional verification team delivering IPs, SoC and Subsystems. Experience in development of verification environment using UVM/SystemVerilog. Experience in assembly level programming and debugging.", "preferred_qualifications": "Experience with UVM, SystemVerilog, or other scripting languages (e.g., Python, Perl, Shell, Bash, etc.). Experience scripting using Python, Perl, or shell scripts. Experience leading and managing complex verification projects. Understanding of ARM instruction set architecture.", "responsibilities": "Develop and execute verification plans. Architect, develop and maintain verification test benches that support both random and directed testing. Participate in design, architecture and code reviews. Work closely with micro architects, architects and design teams and influence design decisions/feature intercepts. Lead performance validation for both pre-silicon and post-silicon. Work with emulation/FPGA prototyping teams in verifying system level use cases. Drive convergence of verification and coverage plans towards high quality and on-time tape-out. Drive methodology initiatives to improve efficiency and design quality. Lead a team of design verification engineers focusing on IP, Subsystem/SoC verification at unit, cluster, subsystem and full chip levels.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/113740625915847366"}