{"title": "Software Engineer, New Verticals, Search (English)", "level": "Mid", "location": "São Paulo, State of São Paulo, Brazil", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nWe foster a collaborative, data-driven environment where engineers lead cross-functional partnerships, embrace rapid experimentation, and relentlessly optimize search features. Our goal is to provide the tools and support to innovate and make a lasting impact on how users interact with information.\n\nIn Google Search, we're reimagining what it means to search for information – any way and anywhere. To do that, we need to solve complex engineering challenges and expand our infrastructure, while maintaining a universally accessible and useful experience that people around the world rely on. In joining the Search team, you'll have an opportunity to make an impact on billions of people globally.", "salary": "", "key_qualifications": "Bachelor’s degree or equivalent practical experience.\n2 years of experience with software development in one or more programming languages (e.g., Go, Java, or C++), or 1 year of experience with an advanced degree in an industry setting.\n2 years of experience with data structures or algorithms in either an academic or industry setting.\nExperience in developing and maintaining both the front-end and back-end components of software applications.\nAbility to communicate in English fluently to interact with local stakeholders in this customer-facing role.", "preferred_qualifications": "Master's degree or PhD in Computer Science or related technical fields.\n2 years of experience with performance, large-scale systems data analysis, visualization tools, or debugging.\nExperience with code and system health, diagnosis and resolution, and software test engineering.\nExperience developing accessible technologies.\nUnderstanding of the full stack to ingest, process and serve partner-data, and Content-Platforms and their capabilities, Search Quality, and building Search Frontend Features.", "responsibilities": "Establish collaborations with teams across real world journeys, Geo, and Search-platforms, to quickly prototype and test hypothesis with the team.\nContribute and lead work in different stages of maturity.\nContribute to new efforts in early stages, validate key-hypothesis, make data-driven decisions, and unafraid to fail fast.\nApply the Search Developer Platform toolkit.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/113885216526738118"}