{"title": "Program Manager, Supply Chain, Global Logistics Operations", "level": "Mid", "location": "Amsterdam, Netherlands", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nIn this role, you will facilitate fast-paced needs to standardize, optimize, and transform warehouses capabilities and lead projects to integrate technology and partners into our operations. \nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in program or project management. 5 years of experience in logistics and operations management.", "preferred_qualifications": "5 years of experience managing cross-functional or cross-team projects. Experience defining, developing, and documenting business processes and procedures. Experience with spreadsheet and presentation software, VISIO, or other project tools. Ability to travel up to 20% of the time as needed. Ability to grow in a fast-paced business environment with frequent and rapid priority changes.", "responsibilities": "Support and deliver warehouse capabilities and operations based on business requirements and present status reports to major stakeholders and internal teams. Track strategic and execution tasks by aligning with operational owners to prioritize standardization and innovation agenda to improve cost and service, and contribute to optimize speed, scale, efficiency and predictability. Support the implementation and roll-out of operational excellence and quality requirements for warehouse operations, including risk management and business continuity plans and proactively escalate risk and delays associated with global operations. Execute and deliver benchmarking and optimization of warehousing needs to improve cost, productivity, efficiency, and service. Deliver and implement standardization across global programs within Environmental, Health, and Safety (EHS) and Security in collaboration with enterprise goals at Google.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/113853057959109318"}