{"title": "Digital Marketing Strategist, Customer Success Acceleration, gTech Ads (English, French)", "level": "Mid", "location": "Warsaw, Poland", "description": "As a Digital Marketing Strategist at Google, you will collaborate closely with the Google Customer Solutions (GCS) Sales team to grow Mid-Market Sales (MMS) customers. You will analyze our customers advertising activities and the markets in which they operate. You'll craft unique recommendations and solutions for our customers, and have a deep understanding of the market, industry, and business model of the companies. You'll anticipate how decisions are made, persistently explore and uncover the business needs of Google's clients, and interpret how our range of product offerings can grow their business. You will set the goal and the strategy for how their advertising can reach their ideal audience. Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products. To learn more about gTech, check out our video.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience working with digital media or digital marketing/advertising solutions, implementing and measuring digital advertising campaigns and providing client solutions. 4 years of experience in a client-facing role working with partners across multiple levels. Ability to communicate in English and French fluently to support client relationship management in this region.", "preferred_qualifications": "Experience in managing digital advertising campaigns with a focus on performance marketing. Experience in building and maintaining relationships with key stakeholders. Knowledge of online marketing strategy and tactics. Ability to collect, analyze, and interpret data to derive actionable insights. Ability to build compelling narratives to influence clients utilizing data and insights.", "responsibilities": "Collaborate closely with account managers, account executives to determine the optimal support for the client portfolio. Develop and apply knowledge of the market, industry, products, and tools in preparation to offer solutions for our clients business issue. Analyze data and trends in order to create meaningful insights for clients. Implement solutions, track performance, and optimize against advertiser goals. Report on key performance indicators and value delivered for customers. Create proposals to represent solution design around client goals.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/113995544908440262"}