{"title": "Network Engineer, Public Sector", "level": "Mid", "location": "Reston, VA, USA", "description": "Google is proud to boast a network that provides service to millions of Internet users around the world. The Network Engineering team is responsible for operating that network reliably and at scale. As a member of the team, you have a direct impact on design and feature enhancements to keep our systems running smoothly. You also ensure that network operations are safe and efficient by monitoring network performance, coordinating planned maintenance, adjusting hardware components and responding to network connectivity issues. Google's complex network generates a constant stream of challenges which require you to continually be innovative with an evolving set of technologies. Keeping the network reliable ensures that our users stay connected with our suite of applications, products and services. The Sovereign Cloud Operations team supports cloud infrastructure deployments, configuration management, incident triage and resolution, monitoring, and the automation of manual tasks with code for data center networking components. We keep internal and cloud-hosted services available 24x7 while ensuring customer traffic is managed efficiently and securely. In this role, you will be required to obtain or currently possess and maintain an active TS/SCI with polygraph. You will obtain a commensurate clearance for each government agency for which they perform GPS work. Google Public Sector brings the magic of Google to the mission of government and education with solutions purpose-built for enterprises. We focus on helping United States public sector institutions accelerate their digital transformations, and we continue to make significant investments and grow our team to meet the complex needs of local, state and federal government and educational institutions.", "salary": "$122,000-$178,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Engineering, a related field, or equivalent practical experience. 3 years of experience in the networking industry in Top Secret, classified environments. Experience with one or more scripting or programming languages such as Bash, Python, Golang, or C. Active US Government Top Secret/Sensitive Compartmentalized Information (TS/SCI) security clearance with polygraph.", "preferred_qualifications": "Experience with network design, installation and maintenance for service providers or large enterprise networks with broad understanding of network theory, technologies and the operation routing protocols (e.g., OSPF, IS-IS, BGP, MPLS). Experience with field-based work in POPs, carrier hotels, Data Centers, and Central Office environments. Experience creating rack elevations and other planned/install/as-built documentation. Understanding of networking equipment and infrastructure. Ability to work in a network operations center environment.", "responsibilities": "Engage and improve the whole life-cycle of classified networks from inception and design, to qualification and validation, through deployment, operation and optimization. Scale systems sustainably through mechanisms such as automation, and evolve systems by pushing for changes that improve reliability and velocity. Work with other team members and groups to analyze requirements or potential problems and proactively develop solutions and policy recommendations. Partner with Google’s internal application groups and design network infrastructure which meets their networking requirements. Lead development of Google’s production network infrastructure through Published Engineering design documents and specifications. Lead the requirement analysis, Engineering design, and solution development of Google’s production network infrastructure.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/113931439837192902"}