{"title": "Strategic Outreach and Engagement Lead, Go-To-Market", "level": "Mid", "location": "Nairobi, Kenya", "description": "As a Strategic Outreach and Engagement Lead, you will closely collaborate with the Government Affairs and Public Policy team in implementing local engagement programs in South and Sub-Saharan Africa and Emerging Markets. Google takes its responsibilities seriously, including engaging with government and other stakeholders on important public policy challenges. The Government Affairs and Public Policy (GAPP) team leads the company’s engagement with executive branch officials, legislators, regulators and third-parties in the formation of public policy. Working closely with Google leaders, GAPP seeks to identify key policy issues, listen carefully to others’ views and opinions, and distill and share the company’s perspective on those issues with external stakeholders. While we focus on challenges affecting the internet, our issue areas are increasingly broad and encompass many areas where public policy, business, and technology intersect.", "key_qualifications": "Experience setting strategy, leading workstreams, defining metrics, translating data to insights, and measuring results in the brand, reputation, and regulation space. Experience creating and delivering presentations at the executive-level with stakeholders. Experience in public affairs, public policy, or brand and reputation topics.", "preferred_qualifications": "Experience in developing presentations and talking points for senior internal and external audiences and translating regulatory and reputational updates into simple, but accurate language that people who are not experts can understand. Understanding of public affairs, public policy, or brand and reputation topics relevant for Google or tech. Ability to identify opportunities and areas for improvement, and operate in a fast-paced environment. Ability to advise, partner, and influence executives and lead cross-functional teams to achieve project objectives. Excellent leadership and written/verbal communication skills, with the ability to collaborate with multiple teams simultaneously.", "responsibilities": "Support the Government Affairs and Public Policy team in developing and executing a strategy for consistent and meaningful engagement with key stakeholders (e.g., policymakers, think tanks, NGOs, academics, business customers, industry leaders, etc.). Manage the process for development, tracking, communicating, and updating stakeholder engagement plans. Coordinate, compose, consolidate, and edit written materials such as briefing documents, letters, and talking points. Support the Government Affairs and Public Policy (GAPP) team in public affairs operations and projects. Support the GAPP team to plan and execute strategic engagements between Google executives, government officials and other policy stakeholders, including event planning and coordination.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/114007789860201158"}