{"title": "Principal Engineer, Business Intelligence/AI Security, Google Cloud", "level": "Director+", "location": "Sunnyvale, CA, USA; Kirkland, WA, USA", "description": "Google Cloud Data Analytics is a suite of services that helps customers collect, store, process, and analyze data in the cloud. It includes a variety of tools and features that can be used to build data pipelines, create data warehouses, and run analytics queries. Google Cloud Data Analytics can be used to support a wide range of business use cases, from massive data-parallel batch pipelines to real-time streaming data.", "key_qualifications": "Bachelor’s degree in Computer Science, related field, or equivalent practical experience. 15 years of experience in software engineering. 10 years of experience with enterprise and cloud security. Experience with security principles, authentication protocols, and threat modeling for BI, AI, and generative AI products and services. Experience providing the security of data analytics, ensuring the confidentiality, integrity, and availability of sensitive business data, in a highly regulated industry (e.g., information technology, healthcare, financial services, etc.).", "preferred_qualifications": "Experience leading technical strategy for long-term security, privacy, and compliance across BI and AI products. Expertise in addressing unique security challenges in cloud and hybrid environments, including GCP. Ability to collaborate effectively with diverse teams across different disciplines and organizations. Ability to collaborate closely with Engineering teams to ensure seamless implementation, fostering a culture of security excellence and efficiency. Excellent communication skills, with the ability to effectively convey complex technical concepts to both technical and non-technical audiences.", "responsibilities": "Partner with BI, Data Analytics, and GCP teams to ensure a holistic security approach, addressing both immediate needs and long-term strategic goals, and make informed decisions regarding product releases, including the authority to delay launches if security concerns are not adequately addressed. Foster a culture of security awareness and best practices across the organization, embedding security considerations into the design and development processes. Identify and address emerging threats to BI and AI systems proactively, including those unique to generative AI, such as model poisoning and adversarial attacks. Ensure the confidentiality, integrity, and availability of sensitive customer data, maintaining the highest standards of data privacy and security. Develop and implement a comprehensive security roadmap for BI and AI products and services, ensuring alignment with Google's overall security goals.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/114030873161933510"}