{"title": "Account Strategist, Engage, Google Customer Solutions (Cantonese, English)", "level": "", "location": "Hong Kong", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. As an Account Strategist, you will provide quality client service, research, and market analysis in the local language (Cantonese). You will anticipate decisions, uncover the business needs of Google's key clients, and understand how our range of product offerings can grow their business. You'll set the direction and the strategy for how their advertising can reach thousands of users. In this role, your understanding of online media and commercial acumen will shape how new and existing businesses grow. You will understand the details of separate campaigns and explore and uncover business opportunities for key clients. Working with the clients, you'll set a strategy for how their products and services can reach users. You will work as part of a team and use your creativity to grow and transform the business. Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow. Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 3 years of experience working in advertising sales, marketing, consulting, or media. Ability to communicate in Cantonese and English fluently to support client relationship management in this market.", "preferred_qualifications": "Experience in advertising, media account management, and achieving quotas to drive client growth. Ability to assess and solve client needs through effective questioning, objection handling, and engaged promotions. Ability to manage multiple projects while paying strict attention to detail, working individually and with others. Ability to use problem-solving skills to leverage data to uncover insights, support proposals, and analyze impact. Excellent presentation and communication skills with peers, management, cross-functional teams and clients.", "responsibilities": "Manage a portfolio of medium-sized businesses by understanding growth drivers, identifying opportunities for growth, managing risks, and creating plans for achievement. Collaborate within the Sales team, align workflow among team members to execute on a plan and ensure accountability to meet or exceed goals while delivering outstanding customer experience. Improve our customer relationships and share performance-enhancing suggestions. Conduct outbound calls to establish relationships and work with existing clients to generate growth and improved client success. Identify key client stakeholders to support Customer Business Objectives and annual digital marketing plans.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/114226634013188806"}