{"title": "Staff Visual Designer, Core", "level": "Advanced", "location": "New York, NY, USA; San Francisco, CA, USA", "description": "At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" Google’s Visual Designers weave space, typography, color, iconography, and texture together to help people successfully navigate our products. We believe that all of our products should be beautiful and accessible.", "key_qualifications": "Bachelor's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 8 years of experience in product design or UX. Include a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link and/or access instructions).", "preferred_qualifications": "Master's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 12 years of experience in product design or UX. 5 years of experience working in a complex, cross-functional organization. 4 years of experience leading design projects. 3 years of experience working with executive leaders. Experience with industry standard design tools (e.g. Photoshop, Illustrator, Sketch). Experience implementing visual design systems across platforms in an iterative software development environment. Portfolio highlighting multiple projects and your direct contributions", "responsibilities": "Influence stakeholders across functions to gain support for design strategies. Drive the development of innovative design solutions to user, product, and business problems. Drive a holistic design process, design system, or design language across teams or products. Drive design solutions based on user insights, business needs, and industry trends that further business outcomes. Provide direction to UX designers in creating design concepts for product ideation and/or user research/testing.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/114461905543668422"}