{"title": "Senior Federal Civilian Marketing Manager, Public Sector", "level": "Advanced", "location": "Reston, VA, USA; New York, NY, USA", "description": "Whether you're on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product's journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the representation of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you'll be involved with product marketing strategy from beginning to end. Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google's products solve the world's problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself. The US base salary range for this full-time position is $159,000-$239,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n8 years of experience in marketing.\n4 years of experience with integrated marketing.\nExperience managing cross-functional or cross-team projects.", "preferred_qualifications": "Experience in defining and launching effective account-based programs at scale.\nExperience building and leading a distributed regional team and managing highly leveraged, measurable marketing initiatives in a global, fast-paced environment.\nExperience managing budgets and organizing events with a large number of attendees.\nKnowledge of multi-touch campaigns, with digital first expertise.\nKnowledge of public sector channel requirements and processes, and cloud products and market trends.\nAbility to take a data-driven approach, including the use of AI, to design and optimize programs and results.", "responsibilities": "Lead the Federal Civilian strategy and function to deliver results through account-based marketing, and alignment with Sales, Customer Engineering, and Marketing teams.\nPartner with Content and Product Marketing, Creative, Digital Marketing, Strategy and Operations, Events, and Partner Marketing to develop integrated marketing strategies and deliver go-to-market programs that drive growth.\nDevelop structure and process for transparency of the plan through campaign calendars and consistent measurement at every stage of the audience journey, integrated across channels.\nDevelop, socialize, and get buy-in for the sector's marketing strategy and programs, working closely with the region's marketing and local business leadership teams.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/114667560925831878"}