{"title": "Lead Technical Program Manager, Embedded Pixel", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "Google's projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You're equally at home explaining your team's analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.\n\nUsing your extensive technical and leadership expertise, you manage various Engineering-specific programs and teams.\n\nThe Google Pixel team focuses on designing and delivering the world's most helpful mobile experience. The team works on shaping the future of Pixel devices and services through some of the most advanced designs, techniques, products, and experiences in consumer electronics. This includes bringing together the best of Google’s artificial intelligence, software, and hardware to build global smartphones and create transformative experiences for users across the world.\n\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.\n\nThe US base salary range for this full-time position is $168,000-$252,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "key_qualifications": "Bachelor's degree in a technical field, or equivalent practical experience in embedded systems development. 8 years of experience in program management. 3 years of experience managing people or teams. Experience working with consumer electronics development, Android Operating Systems or mobile networks.", "preferred_qualifications": "8 years of experience managing cross-functional/team projects. Experience shipping software for complex silicon and hardware. Knowledge of Android, Android OS, performance, and power optimization.", "responsibilities": "Establish a reliable and visible cadence for program reviews, decision-making, prioritization, and Resource Stewardship (effective deployment of machine and people resources) whereby improvements such as efficiency and utilization gains are measurable and the impact can be felt organization-wide. Manage highly complex and mission-critical cross-functional Software projects. Interface with engineering managers and engineers across both Hardware and Software, estimate work efforts, define milestones and manage resources. Drive features, track progress, resolve dependencies, evaluate risks and communicate status to upper management and project stakeholders. Understand technical implementation at the architecture level and propose technical alternatives when necessary. Ask questions that clarify priorities and push the team to be highly effective. Partner with Product Managers and leads to set power product strategy, and manage our multi-year roadmap for Pixel.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/114778974524973766"}