{"title": "Senior Cellular Modem Firmware Engineer, Protocol Stack", "level": "Mid", "location": "Mountain View, CA, USA; San Diego, CA, USA", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. With your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions. As an Executive Cellular Modem Firmware Engineer, you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions for devices. The Google Pixel team focuses on designing and delivering the world's most helpful mobile experience. The team works on shaping the future of Pixel devices and services through some of the most advanced designs, techniques, products, and experiences in consumer electronics. This includes bringing together the best of Google’s artificial intelligence, software, and hardware to build global smartphones and create transformative experiences for users across the world.", "salary": "$142,000-$211,000 + bonus + equity + benefits", "key_qualifications": "Master's degree in Engineering, a related field, or equivalent practical experience; 8 years of experience with 3GPP standards; Experience with Android RIL, Telephony, C, and Embedded RTOS; Experience in cellular protocol stack", "preferred_qualifications": "Experience in modem performance analysis and improvement (i.e., call performance (e.g., CSFB/VoLTE/EPSFB/VoNR, WiFi calling), data performance, connectivity performance, thermal/power performance); Experience in cellular protocol stack (i.e., control plane, data plane, NAS/RRC/PDCP/RLC/MAC/PHY, ENDC, NRDC); Experience using Keysight UXM, PRT, Propsim Fader, Amarisoft; Experience with 3GPP (e.g., NR, LTE, WCDMA); Excellent programming skills in C/C++/Python", "responsibilities": "Develop modem software and verify modem feature functionalities and performance to improve user experience including call, voice quality, data, thermal/power, connectivity. Identify modem software performance gaps by analyzing system requirements, design, software implementation, issue analysis, and simulation of real world scenarios. Debug, analyze, and fix modem issues from factory, certification (e.g., GCF/PTCRB/IOT), field, and end users. Identify key performance scenarios and recreate the scenario in the lab environment for further research and development for more optimized solutions. Provide technical leadership on high-impact projects.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/114785460261135046"}