{"title": "Technical Program Manager III, Site Reliability Engineering, Google Cloud", "level": "Mid", "location": "Cambridge, MA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company. Using your technical and leadership expertise, you run Engineering-focused projects that are well-defined under supervision. The Technical Program Manager (TPM) role within Site Reliability Engineering (SRE) is at the heart of fulfilling SRE’s mission: making things faster, more reliable, and preparing for the continued growth of Google's infrastructure. As a TPM, you ensure that systems and services are carefully planned and deployed, taking into account multiple variables such as price, availability and scheduling, while always keeping the bigger picture in mind. You are comfortable driving massive projects which span many teams, have a strong interest in doing the right thing for our users and always think critically and strategically about Google as a business. You are equally at home explaining your analyses and project recommendations to wider audiences as you would be discussing the technical merits of next generation architectures with Google's engineers, or building tools to automate and scale their impact. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems. The US base salary range for this full-time position is $142,000-$211,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "key_qualifications": "Bachelor's degree in a relevant field, or equivalent practical experience. 5 years of experience in program management. Experience working with code, storage, or operating systems.", "preferred_qualifications": "5 years of experience managing cross-functional and/or cross-team projects. Experience in Unix/Linux systems programming with C, C++, Java, Python, Shell and/or Perl. Experience with the design and architecture of software to improve availability, scalability, latency and efficiency. Experience analyzing global scale distributed systems and critical production service environments. Ability to take initiative, adapt quickly to changing priorities and work with a high sense of urgency with high attention to detail. Ability to interact with technical and non-technical teams. Excellent presentation and communication skills. Effective problem-solving skills.", "responsibilities": "Coordinate with stakeholders to manage, track and control project challenges and ensure timely delivery of products. Identify and/or analyze challenges relating to mission critical services and manage the building of automation tools/processes to prevent recurrence. Engage in a service capacity planning and forecasting software performance analysis and system tuning. Exercise technical judgment to keep goals for programs, projects and products attainable within a given timeline. Influence and manage the creation of new designs, architectures, standards and methods for large-scale distributed systems.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/114851979104002758"}