{"title": "Technical Program Manager, Site Reliability Development", "level": "Mid", "location": "Waterloo, ON, Canada", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company. The team is focused on strategic planning, execution, and reporting of the highest priority initiatives to predictably deliver the most impactful programs for ATS (AI, Trust and Security) Site Reliability Development and our partners. ATS runs, protects, and ensures the resiliency of some of Google’s largest platforms and also supports important Cloud Security and Cloud AI platforms and products. We also work with teams involved in production to promote best practices for production security, reliability, and resilience. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience in the security or resilience space. 2 years of experience in program or project management.", "preferred_qualifications": "Experience with increasing levels of responsibility and independence. Ability to influence and communicate cross-functionally with all levels of management. Ability to work on tasks that are not clearly defined but can help to drive clarity within those initiatives. Ability to independently define projects, setup processes, and execute within timelines, with multiple stakeholders.", "responsibilities": "Manage multiple, time-sensitive projects simultaneously while providing clear communication to the team regarding project status, risks/issues, mitigation plans, and escalations. Identify process improvements for scale and efficiency. Set up lightweight processes to fill gaps. Track progress, unblocking dependencies, identifying, evaluating, and mitigating risks, and put into motion the solutions. Drive deliverables with the highest quality to achieve business goals. Work closely with cross-functional teams in execution, OKR planning, and drive accountability to OKR execution.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/114839034273899206"}