{"title": "Shopping Specialist gTech Ads", "level": "", "location": "Hyderabad, Telangana, India; Gurgaon, Haryana, India", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.\nGoogle creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.To learn more about gTech, check out our video.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in Digital Marketing and Advertising. Experience in Search Advertising, Consulting, and Google Shopping. Experience working with analytical problem-solving projects.", "preferred_qualifications": "Master's degree, PhD, or equivalent practical experience. Experience in cross-functional and multi-layered stakeholder project management, driving business outcomes and customer solutions through collaboration. Experience in campaign management and digital advertising (e.g., planning, measurement). Experience in SQL, Scripting, Dashboards, Automation, Search Engine Marketing.", "responsibilities": "Work across business and plan, pitch, implement, and optimize with other teams. Manage business objectives and be an advocate to drive performance and investment. Work with cross-site and cross-functional teams to drive account growth. Lead, drive, and scale product adoption (e.g., Performance Max, Local Inventory Ads, etc.).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/114835049416663750"}