{"title": "Display and Video 360 Lead, Google Customer Solutions (Fixed Term Contract)", "level": "Mid", "location": "Sydney NSW, Australia", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow.  Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience working with digital media or digital marketing/advertising solutions, implementing and measuring digital advertising campaigns and providing client solutions. 4 years of experience in a client-facing role working with partners across multiple levels.", "preferred_qualifications": "Experience optimizing and troubleshooting products or services. Experience delivering insights from multiple data sources through executive communications and presentations, with excellent communication skills. Knowledge of Google’s advertising solutions or similar digital advertising campaigns and platforms to proactively identify and recommend creative ways to improve on solutions to advertisers. Familiarity with offline media, Brand Lift, marketing measurement and attribution techniques (e.g., offline measurement, MMM, MTA, attribution) and Google advertising products (e.g., Google Ads, Google Analytics, Google Marketing Platform, etc.). Ability to work with cross-functional teams.", "responsibilities": "Build in-depth knowledge about digital marketing/advertising, Google products, competitor offerings, and the industry vertical, and stay current in the advertising environment and competitive landscape through required training and other resources. Create growth plans for large advertisers through collaboration with industry managers from in-market cross-functional teams with minimal guidance. Create and support multi-product solution promotions and collaborate with in-market Sales teams to create a growth strategy for potential advertisers with minimal guidance. Draw interpretable insights from deep dives and data analysis, provide data-driven strategic and tactical recommendations to customers, partner teams, and leadership based on analysis to influence and drive change across teams.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/114942914299077318"}