{"title": "Analytical Consultant, Consumer Goods and Retail", "level": "Mid", "location": "Ho Chi Minh City, Vietnam", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.\n\nAs an Analytical Consultant within the Large Customer Sales (LCS) team, you will apply analytical frameworks and advanced data modeling to generate insights for business recommendations and evaluate various client business fundamentals to help accelerate client growth and transformation. You will lead at least one client and/or partner engagement independently by building deep relationships and networks. You will develop customized industry analysis and headroom insights to present them to the Sales teams in advance of client-facing meetings.Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in data-driven functions, such as analytics, market research, strategy, or business consulting. Ability to communicate in English and Vietnamese fluently to communicate with and serve Vietnamese speaking customers.", "preferred_qualifications": "Experience in the Consumer Packaged Goods or Retail industry. Working knowledge/familiarity with data and analytics tools. Ability to handle large, complex data sets, with an analytical mindset. Ability to influence actions and inspire an audience with storytelling. Ability to interact confidently with mid-senior leaders of the organization. Excellent business consulting skills and ability to learn about consumer digital behavior with a deep focus on video and apps consumption.", "responsibilities": "Analyze large, complex data sets, validate insights, and translate them into business recommendations. Identify scalable insights solutions in collaboration with the Sales team. Help automate core processes and develop scalable impactful dashboards. Coordinate timelines, goals, and objectives for assigned areas of an insights project. Act as a thought partner for the leadership team on industry analysis, research, knowledge, and foresight. Support consultation and collaboration among specialist and other cross-functional partners on joint industry projects.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/114909942908887750"}