{"title": "Component Engineering Manager, Google Cloud", "level": "Advanced", "location": "Taipei, Taiwan", "description": "Google's custom-designed machines make up one of the largest and most powerful computing infrastructures in the world. The Hardware Testing Engineering team ensures that this cutting-edge equipment is reliable. In the R&D lab, you design test equipment for prototypes of our machinery and develop the protocols used to scale these tests for the entire global team. Working closely with design engineers, you give input on designs to improve our hardware until you're sure it meets Google's standards of quality and reliability.", "key_qualifications": "Bachelor's degree in Electrical, Process, or Manufacturing Engineering, or equivalent practical experience. 10 years of experience in component engineering or supplier quality engineering. 8 years of experience in people management. Ability to travel as required.", "preferred_qualifications": "Master's degree in Engineering (e.g., Quality, Electrical, Mechanical, Optical), or equivalent practical experience. Experience working in a company specializing in server or compute segments, or related equipment. Understanding of electronic component materials, and manufacturing processes (e.g., supply chain, suppliers, sub-tiers).  Excellent organization, prioritization, leadership, collaboration, and communication skills.", "responsibilities": "Manage a Supplier Quality and Component Engineering team, grow the team, and collaborate with the Engineering, Manufacturing, and Commodity teams, and suppliers in qualification and application of components. Perform Bill of Material (BOM), risk analysis, second sourcing, and technical review of components to ensure adherence to industry requirements and Google quality standards. Collaborate with cross-functional teams to provide specification reviews, product qualifications, second source qualifications, and supplier management, development.  Lead management of Product Change Notifications (PCNs), and drive appropriate evaluation and qualification with the appropriate cross-functional teams. Interface with component suppliers on various requests for data sheets, application notes, Restriction of Hazardous Substances (RoHS), PCN, and qualification reports.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/114979744448946886"}