{"title": "Engineering Site Director, Privacy, Safety and Security", "level": "Director+", "location": "Hyderabad, Telangana, India", "description": "As the Privacy, Safety and Security (PSS) Engineering Site Director, you will work with the cross-functional leaders in PSS to grow the engineering presence in the Hyderabad office, provide a clear outlook and strategy, and enable the team to be an autonomous engineering unit as a part of the global workforce for PSS. The Core team builds the technical foundation behind Google’s flagship products. We are owners and advocates for the underlying design elements, developer platforms, product components, and infrastructure at Google. These are the essential building blocks for excellent, safe, and coherent experiences for our users and drive the pace of innovation for every developer. We look across Google’s products to build central solutions, break down technical barriers and strengthen existing systems. As the Core team, we have a mandate and a unique opportunity to impact important technical decisions across the company.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, a related technical field, or equivalent practical experience. 15 years of experience in a technical leadership role overseeing projects, with 5 years of experience in managing managers and leading technical teams across geographies. Experience building and scaling a new organization. Experience collaborating across organizational boundaries.", "preferred_qualifications": "Master's degree or PhD in Electrical Engineering or Computer Science. Experience leading large, complex cross-functional engineering projects. Experience in developing security products. Experience indirectly leading a distributed team of engineers across organizations and core teams. Entrepreneurial and strategic mindset with broad technical experience. Experience creating a shared sense of outlook or purpose, with clear communication skills and ability to influence and motivate direct and indirect teams, employing a collaborative leadership approach.", "responsibilities": "Work with cross-functional leaders in PSS to get alignment on the roadmaps, and oversee the execution and delivery of the engineering projects. Lead the execution against strategy for some critical projects and areas. Partner with the relevant engineering and cross-functional directors. Cultivate, inspire, and reward a highly functional inclusive engineering team to ensure that goals are met. Support career development of team members and be a good coach.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/114915286921945798"}