{"title": "Chip Package Signal and Power Integrity Engineer", "level": "Mid", "location": "Sunnyvale, CA, USA", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide...", "key_qualifications": "Bachelor's degree in Electrical Engineering or equivalent practical experience. 4 years of experience in chip package SI/PI design for interconnections and advanced package design. Experience in post silicon bring up or model correlation.", "preferred_qualifications": "Experience in signal and power integrity for various high speed interconnects (e.g., HBMx, D2D, high speed SerDes, PCIex). Experience in programming and data analysis in Matlab, Python, C++ to establish automation flows and data processing. Experience with 2.5D/3D package design such as silicon interposer, silicon bridge, 3D die stacking. Experience with chip top design, physical design, STA, package, system, validation teams. Familiarity with memory testing, next generation memory and chiplet standards and timing budget methodology, including SI/PI co-analysis/design and channel design optimization. Understanding of Static Timing Analysis (STA) and voltage budget.", "responsibilities": "Contribute to chip package system co-design by performing SI/PI analysis and optimization to involve in the product definition and optimize chip floorplan, power tree structure, net lists for High Performance Computing (HPC) based on 2.5D/3D package technology. Develop the next generation memory interface considering input/output physical layer, SI/PI and physical design and interface IP evaluation. Collaborate with chip design, system design teams and suppliers to drive chip package SI/PI design goal, define boundaries of chip design and explore SI/PI and Design for Manufacturing (DFM) trade-off for package design closure for production. Provide feedback on chip floorplan considering package/system routability and Signal Integrity (SI)/Power Integrity (PI).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/115100019639362246"}