{"title": "Strategic Partnership Manager (English, Japanese)", "level": "Mid", "location": "Tokyo, Japan", "description": "Google's line of products and services to our clients never stops growing. The Partnerships Development team is responsible for seeking and exploring new opportunities with Google's partners. Equipped with your business acumen and extensive product knowledge, you are right on the front line of interacting with our partners, and helping them find ways to grow using Google's newest product offerings. Your knowledge of relevant verticals and relationships with key industry players will help shape our great applications and content for products such as YouTube, Google TV and Commerce.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in consulting, software, internet, media industries, or early stage companies. Ability to communicate in English and Japanese fluently as this is a customer-facing role that requires interactions in English and Japanese with local stakeholders.", "preferred_qualifications": "Experience selling consumer electronics or products to retailers or mobile network companies. Experience with ongoing partner relationship management. Ability to interpret legal documents keeping in mind local context and work with attorneys on specific agreement language. Ability to represent companies in discussions and structure terms, demonstrating excellent business judgment.", "responsibilities": "Drive and action distribution agreements for Google-branded hardware. Initiate agreements with potential partners, lead exploratory talks, build consensus with internal and external executives. Consult with strategic partnerships, manage partnerships to deliver results, and build long-term partner relationships. Identify and prioritize partner goals. Become an expert on organization, business model, and strategic priorities. Serve as Google-branded hardware relationship manager for the current existing agreements. Help realize and optimize value from the partnership.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/115271330248434374"}