{"title": "Enterprise Architect, Google Cloud Professional Services (English, Japanese)", "level": "Mid", "location": "Tokyo, Japan", "description": "Enterprise Architects are senior principal architects or principal engineers who work on complex Google Cloud customer proposals and sell, design, and lead technical solutions. As an Enterprise Architect, you will work on large, transformational projects with customers to design large-scale, cloud-ready infrastructure and application architectures, develop solutions in migrating, building, modernizing, and maintaining applications in Google Cloud Platform, troubleshoot potential platform challenges, and more. As a lead on these projects, you will provide leadership around customer delivery, scoping and estimating services delivery, and resource profiling during pre-sales. During delivery, you will lead the technical cross-functional Partner team to deliver on customer goals. In this role, you will be working with key strategic Google Cloud customers, and with the team, you will support customer implementation of Google Cloud products. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, Math, a related technical field, or equivalent practical experience. 6 years of experience performing customer-facing services focused on translating enterprise customer needs into Enterprise Architectures and approaches. Experience writing software in one or more languages (e.g., Java, Python, Go, etc.). Ability to communicate in English and Japanese fluently to engage and support customers. Ability to travel 30% of the time.", "preferred_qualifications": "Experience architecting and developing software or internet scale, production-grade infrastructure/migration solutions in virtualized environments. Experience working with channel partners, systems integrators, and third-party developers to deliver successful solutions. Experience designing and deploying large-scale distributed data processing systems with technologies (e.g., SQL Server, MongoDB, Hadoop, etc.). Experience with cloud architectural capabilities with a broad set of enterprise use cases. Experience with standard IT security practices (e.g., identity and access management, data protection, encryption, certificate and key management). Experience automating infrastructure provisioning, developer operations, or integration/delivery.", "responsibilities": "Provide customers expertise and leadership focused on enterprise-wide cloud architecture and migration planning for both scoping and during delivery. Recommend and document migration paths, integration strategies, and application architectures required to successfully implement solutions using best practices on Google Cloud. Engage with our customers at executive stakeholder level, providing a single point of technical contact for the customer into the consulting delivery team. Provide technical architecture and enterprise-wide Google Cloud subject matter expertise. Oversee technical delivery excellence, exceptional customer satisfaction, and accurate estimation of customer outcomes in partnership with the delivery teams. Drive the capturing, developing, and sharing of best practices internally and externally to scale expertise to accelerate implementation.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/115242416864142022"}