{"title": "Account Manager, Ad Sales", "level": "", "location": "Gurgaon, Haryana, India", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n2 years of experience in sales, advertising, account management, or marketing.", "preferred_qualifications": "Experience leading and managing multiple projects with a broad range of internal/external stakeholders simultaneously.\nKnowledge of traditional and online marketing strategy, tactics, and products across all digital advertising product areas.\nKnowledge of the local market.\nAbility to think strategically about complex issues and develop recommendations/action plans.\nExcellent investigative skills.", "responsibilities": "Manage a portfolio of customers alongside account managers to consistently deliver against goals, while prioritizing and delivering an excellent experience to customers.\nEstablish credibility with executives and act as a trusted consultant to optimize/expand their advertising investment, understand business drivers, identify opportunities for growth, manage risks, and create multi-quarter plans for sustainable business growth.\nDrive business growth, long-term partnerships, business planning/strategy, review, and education for customers.\nDrive customer growth and contribute to overall team success.\nPartner with cross-functional teams to enable customer growth.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/115723851693728454"}