{"title": "Operations and Maintenance Manager, Critical Facilities", "level": "Mid", "location": "Eemshaven, Netherlands", "description": "The Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facility Technicians at Google data centers operate, monitor and support physical facilities conditions. Some duties will include heating and cooling of air and water, power supply, generators, UPS systems, electrical distribution and control and monitoring systems. You regularly help inspect, maintain and repair various data center systems such as piping and non-critical electrical or mechanical system components). You'll provide daily assistance to senior technicians as you read blueprints/schematics, conduct tours of systems and assess their working order.\n\nYou will develop creative approaches to reducing operational costs while improving overall data center efficiency. You ensure that environmental and safety standards are consistently met, identifying problems and making repairs quickly In emergency situations or abnormal conditions, you manage data center performance issues and outages to minimize the recovery time from failures.\n\nIn a typical week, you'll assess technical systems, address performance issues, and support technical teams to minimize downtime while maintaining high EHS standards. You'll review operational budgets, expense forecasts, and performance metrics to ensure cost-effective strategies. \n\nOther regular tasks include managing vendor performance and contracts, aligning goals with partners, and developing and delivering project management for internal and global initiatives. You'll handle emergency preparedness, operational excellence, and strategic planning.\n\nAt any time, you'll be ready to lead the response to critical events and ensure high facility availability. Additionally, you'll lead regulatory and customer audits, ensure compliance, and participate in community events to drive talent acquisition and retention.\n\nThe Data Center team designs and operates some of the most sophisticated electrical and HVAC systems in the world. We are a diverse, upbeat, creative, team-oriented group of engineers committed to building and operating powerful data centers.", "key_qualifications": "Associate's degree, trade school certification, or other verifiable training in a relevant technical field, or equivalent practical experience.\n9 years of experience working as a Facilities/Operations Manager or Chief Engineer within a critical facility, with 5 years of experience in people management.\nExperience in electrical or mechanical roles.\nAbility to communicate in Dutch and English fluently to work with local councils/communities on a regular basis.\nAbility to work non-standard hours, including weekends, and holidays on shift based schedules", "preferred_qualifications": "Experience planning and executing installation, commissioning, and equipment startup, following industry best practices and protocols.\nSolid understanding of the operations and maintenance of electrical, control systems, and mechanical systems in a data center environment.\nKnowledge of Electrical Distribution Systems (e.g., HV, LV, Protection and Controls, Power Quality).\nUnderstanding of mechanical systems in data center environments and controls/monitoring systems.\nKnowledge of meters, devices, sensors, and troubleshooting utilizing standard hand tools, digital metering, or calibration/diagnostic equipment.", "responsibilities": "Empower your team through equitable hiring, talent development, and career support. Integrate Google-wide strategy with internal and external partners, ensuring aligned goals.\nPlan and manage operational budgets and expense forecasting. Create and deploy strategies for cost-effective operations focused on total cost of ownership.\nMeet service level agreements (SLAs) on uptime, efficiency, and cost with internal teams. Set strategy and plan deployments across multiple sites.\nDemonstrate critical thinking and innovation in addressing traditional and emergent data center challenges. Demonstrate flexibility and the ability to support our operations, taking the lead in responding to critical events when necessary.\nImplement and drive a strong safety culture at the site. Lead by example, deliver results, develop people, and build community.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/115781959245800134"}