{"title": "Senior Research Scientist, Google Research", "level": "Mid", "location": "Mountain View, CA, USA", "description": "As an organization, Google maintains a portfolio of research projects driven by fundamental research, new product innovation, product contribution and infrastructure goals, while providing individuals and teams the freedom to emphasize specific types of work. As a Research Scientist, you'll setup large-scale tests and deploy promising ideas quickly and broadly, managing deadlines and deliverables while applying the latest theories to develop new and improved products, processes, or technologies. From creating experiments and prototyping implementations to designing new architectures, our research scientists work on real-world problems that span the breadth of computer science, such as machine (and deep) learning, data mining, natural language processing, hardware and software performance analysis, improving compilers for mobile platforms, as well as core search and much more. As a Research Scientist, you'll also actively contribute to the wider research community by sharing and publishing your findings, with ideas inspired by internal projects as well as from collaborations with research programs at partner universities and technical institutes all over the world. Google Research is building the next generation of intelligent systems for all Google products. To achieve this, we’re working on projects that utilize the latest computer science techniques developed by skilled software developers and research scientists. Google Research teams collaborate closely with other teams across Google, maintaining the flexibility and versatility required to adapt new projects and foci that meet the demands of the world's fast-paced business needs.", "salary": "$161,000-$239,000 + bonus + equity + benefits", "key_qualifications": "PhD degree in Computer Science, a related field, or equivalent practical experience. 2 years of experience leading a research agenda. One or more scientific publication submission(s) for conferences, journals, or public repositories.", "preferred_qualifications": "2 years of coding experience. 1 year of experience leading research efforts and influencing other researchers.", "responsibilities": "Author research papers to share and generate impact of research results across function and in the research community. Help in growing research business by sharing research trends and best practices within the community. Drive project work by defining the data structure, framework, design, and evaluation metrics for research solution development and implementation. Identify timelines and obtain resources needed. Identify new and upcoming research areas by interacting with potential external and internal collaborators. Help in developing long-term research strategy and plans to expand the impact of Google research. Identify defined problems/gaps in existing technology and engage stakeholders and leaders to address them.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/115704018675606214"}