{"title": "Account Manager, Agreements and Packaging", "level": "Mid", "location": "New York, NY, USA; Boulder, CO, USA; San Francisco, CA, USA", "description": "Connect the world's advertising demand to publisher inventory and protect user privacy so that publishers grow in a transparent, safe and sustainable ads ecosystem. As an Account Manager, you will have a unique opportunity to be a key, high-visibility partner in a strategic and ever evolving business at Google. You will become an expert in the dynamic world of Programmatic Direct Buying, Exchanges and Real-Time Bidding.  You will utilize this experience to hit business growth goals, advocate for agreements and packaging opportunities and commercialize new agreements and packaging products in-marketing.  You will help to improve programmatic direct, 1:1 agreements delivery, bringing greater efficiencies of real time ad-serving into the direct reservation channels.  The Global Partnerships organization is responsible for exploring new opportunities with Google's partners. Google’s Global Partnerships team works with a wide range of partners to bring the best of Google to power their business. The Global Partnerships team supports Google’s own Product teams with essential partnerships to help Google’s user experiences in advertising, Search, Assistant, Maps, Travel, Shopping, Payments and more. Teams create product-enabling partnerships, go-to-market strategies and incubate business growth for a variety of products.", "salary": "$103,000-$152,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in business development, partnerships, management consulting, or investment banking, in the Consumer Electronics, Auto, OEMs, Telecom, E-Commerce/Retail, Apps, Ads, Gaming, or Technology industries. Experience with online media buying and selling, Demand Side Platform (DSP), Supply Side Platform (SSP), and programmatic capabilities.", "preferred_qualifications": "Experience in account management with the ability to advocate on behalf of the customer experience. Ability to be flexible and adaptable in a dynamic and ever-changing environment. Ability to navigate ambiguity and manage competing priorities. Excellent organizational and written/verbal communication skills.", "responsibilities": "Meet and exceed business growth goals by driving agreement and packaging growth across authorized buyers and open bidders. Coordinate with Account teams to ensure successful relationships with our Agency and DSP partners. Partner with internal support teams to help scale programmatic agreement and packaging efforts across our customer set. Monitor industry trends, competitive landscape and identify opportunities to improve our execution. Be a subject matter expert on unique Google Ad Manager publisher inventory, help to grow media investments.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/115836299910226630"}