{"title": "Supplier Security Lead, Supply Chain Security and Resilience (English)", "level": "Advanced", "location": "Shenzhen, Guangdong Province, China", "description": "In this role, you will lead Google global supply chain security and resilience function...", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience managing supply chain security operations within a multi-national corporation. Ability to communicate in English fluently to partner with teams and stakeholders in APAC.", "preferred_qualifications": "Experience in asset protection/loss prevention. Experience in managing security operations and security personnel and in delivering high quality, customer-oriented security programs. Experience conducting security audits and risk assessments at facilities engaged in design, supply, testing, assembly, manufacture, and scrapping processes. Experience developing and deploying security programs around confidential prototypes and unreleased products. Knowledge of Transported Asset Protection Association (TAPA) standards, C-TPAT, AEO, and ISO Standards related to supply chain security. Ability to manage confidential and sensitive information.", "responsibilities": "Collaborate with Global Security and Resilience Services (GSRS) function leadership to align strategy and priorities. Engage with internal stakeholders to understand areas of concern and prioritization of GSRS support. Lead innovation and identification of new security hardware, software, and processes. Present metrics, updates, and achievements to leadership. Collaborate with cross-functional groups within Google and outside of Google as they relate to daily operations. Perform data analysis and create benchmarking to support risk assessments and threat identification. Create and present briefings on risks in specified geographical regions or during a particular period of time. Manage embedded product security managers and vendor staff to respond to emergencies, support planned and unplanned operations, and support special activities as needed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/115811762225193670"}