{"title": "Business Development Representative III, Google Cloud (English, French)", "level": "Mid", "location": "Montreal, QC, Canada", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience in Business-to-Business (B2B) sales. Experience in sales development and relationship management. Ability to communicate in English and French fluently to support client relationship management in this region.", "preferred_qualifications": "4 years of experience in exceeding sales goals in the technology industry with cloud computing solutions. Experience sourcing leads and generating sales pipeline. Experience in account management. Understanding of technology, cloud computing solutions, and digital transformation from a business perspective. Ability to quickly establish trustworthy relationships with prospects and assess their needs.", "responsibilities": "Generate demand with prospective and existing customers via Google Meet (e.g., video conferencing) and phone calls to identify, qualify, and cultivate opportunities. Learn and implement solution strategies mapping Google Cloud solutions against customer’s business imperatives particularly as it relates to digital transformation. Maintain business opportunities, upkeep with timely and accurate updates on opportunities in Customer Relationship Management (CRM) tools. Perform research to provide account intelligence, identify stakeholders, and build relationships/identify workloads in discussions with IT decision-makers and practitioners. Partner with field promoters to drive customer attendance at marketing events, training, and other activities to build awareness and education on Google’s solutions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/115939649171399366"}