{"title": "Creator Engagement Program Manager, Business Go-To-Market, YouTube", "level": "Advanced", "location": "San Bruno, CA, USA; New York, NY, USA", "description": "The YouTube Business Strategy and Operations team is responsible for driving all go-to-market functions for the YouTube Business Organization including strategy and business operations, analytics and data science, partnership enablement, and product activation. The team would be responsible for shaping go-to-market priorities to accelerate growth and resource the business accordingly, enhancing skills and capabilities to support execution of business priorities, driving efficiency across business operations, building excellent go-to-market infrastructure (e.g., data, reports, dashboards). This team combines deep strategic, operational, and problem solving skills with a pragmatic sense of how to get things done and drive change across a global organization. At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connec...", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in creator or partner management, marketing, or business development, with experience managing cross-functional projects and decisions. Experience communicating with Product, Marketing, and Business Development partners.", "preferred_qualifications": "Experience working in complex fast-moving, and ambiguous business environments. Experience in regular executive-level engagement, with the ability to build strong professional relationships with executive leadership across regions and organizations. Knowledge of YouTube large partners, the creator ecosystem, and their competitive contexts. Ability to drive cross-functional collaboration and influence, rally teams around shared goals, and work with multiple teams in delivering complex initiatives successfully. Excellent business acumen with distinctive problem solving and analysis skills. Excellent written and verbal communication and people management skills.", "responsibilities": "Partner with regional leadership to identify strategic opportunities, generate plans, and drive advocacy for creator and business needs with cross-functional teams. Define, socialize, and align principles for creator selection to drive fit for purpose event strategy, diversity in representation, and rotation of creator talent. Run cross-functional processes to coordinate approvals for the most critical events, serving as liaison to our Chief Business Officer and Chief Executive Officer. Coordinate the ingestion of requests, tracking, and outreach/offer process. Develop executive reporting and insights across regions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116017439619064518"}