{"title": "Analytical Consultant (Fixed-Term Contract) ( English, Czech, Slovak)", "level": "Mid", "location": "Prague, Czechia", "description": "Being an Analyst at Google is about much more than simply crunching numbers – it’s about finding compelling insights within data and using your exceptional business and communication skills to translate those insights into action. As one of the masterminds behind our strategic planning, forecasting and analysis, you’ll spend your time digging into big, complex data sets. The data will not remain inert in your hands, however, since you’ll use your critical thinking, problem solving and communication skills to influence and drive thoughtful and well-informed decision making with our most senior business leaders within the organization, and potentially some of our biggest clients.\n\nOur Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in digital advertising, consultative sales, digital media sales, business development, online media environment, or digital marketing role. Experience in marketing analytics or return on investment/financial modeling or statistical analysis. Experience with advertising either in agency, advertiser or media company. Ability to communicate in English, Czech and Slovak fluently to support client relationship management in this region.", "preferred_qualifications": "Experience in working with sales and cross-functional teams and influence key stakeholders (e.g., internally and externally) across all levels. Ability to work in fast-paced environments with effective time-management and prioritization skills. Excellent problem-solving skills.", "responsibilities": "Analyze large complex data sets, validate insights and translate them into business recommendations. Identify scalable insights solutions for Customer Business Objective (CBO)/Marketing Objective (MO) in collaboration with sales team. Conduct market/consumer analysis for a specific group of customers. Act as a thought partner for the leadership team on industry analysis, research, knowledge and foresight. Co-develop project roadmap and priorities for industry insights projects in collaboration with country and industry heads.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116032406841893574"}