{"title": "Country Director, South Africa", "level": "Director+", "location": "Johannesburg, South Africa", "description": "This role offers the opportunity to lead Google’s business in South Africa and to help millions of users make the most of the web. Reporting to the Managing Director, Sub Saharan Africa, you are a member of the SSA Management Group and expected to contribute to the strategy and business development of the region.\nAs Country Director, South Africa, you directly lead a highly skilled and ambitious commercial team based in Johannesburg. You are also the leader across various functional teams and represent all aspects of Google in South Africa. You are the official representative of Google in the region and drive how businesses, government and consumers view Google. Your knowledge of online media and digital combined with your communication skills and analytical abilities shape how new and existing businesses grow. You leverage your entrepreneurial drive to educate and persuade existing and new customers to embrace Google's latest advertising products and technologies. You share the opportunities and challenges of the market, and voice the priorities for our products. You set transparent objectives, collaborate with your product and functional counterparts and deliver together. You are an excellent communicator with a proven capacity to develop and motivate a large team. You use an analytical approach to business strategy, sales and management to develop and grow Google in the region.", "key_qualifications": "Experience in sales and commercial leadership, with a focus on digital and online experience.\nExperience in sales coaching, mentoring, team management, and delivering on business goals in an organisation.\nExperience working with C-level contacts within South Africa and building and sustaining a network among business, political decision makers, NGO leaders and regulatory bodies on policy topics.\nPrevious Country Manager or leader of a business unit across the region.", "preferred_qualifications": "Experience of working with a small but growing team to deliver significant growth.\nDemonstrated track record of cross functional leadership.\nProven influencer and performer across media, business and government channels with strong relationships within the advertising, technology and startup sectors.\nExperience in working in a multinational environment in a highly matrixed organisation.\nAnalytical acumen and thought leadership, paired with agile mindset and can-do attitude.", "responsibilities": "Lead sales and commercial operations to deliver revenue growth, with a focus on large advertisers and agency partners. Build key external relationships to open up key business opportunities.\nDirect management of the Large Customer Sales (LCS) organisation, all based in South Africa. LCS teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build strong businesses and brands. \nSetting business plans, sales strategy, and taking ownership of driving Google’s activities working in collaboration with expert functions and product leaders.\nBe the internal representative for Google in South Africa and external representative of Google across South Africa. Represent Google in the market beyond business relationships and represent South Africa to Google.\nCross-functional leadership, bringing teams together around an integrated plan for Google’s success in the market.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116100192431678150"}