{"title": "Program Manager II, Risk and Compliance Audit Analyst, CISO", "level": "Mid", "location": "New York, NY, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nAs part of the Google Cloud Chief Information Security Office (CISO) Risk and Compliance organization, the Cloud Audit and Assurance team is responsible for Compliance Assurance and Audits. The Cloud Audit and Assurance program is offered to external parties providing customers and partners with the right level of assurance in cases.\n\nCyber-security, operational resilience, data privacy, and regulatory compliance are key security topics for regulated Google Cloud customers as they migrate their services to the cloud. In this role, you will engage with Google Cloud customers, partners, and regulators leading risk based audits and addressing cyber-security risks, operational resilience, and regulatory requirements on the Google common infrastructure, application services, and operating environment.\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$117,000-$172,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n3 years of experience with risk management or compliance in regulated industries (e.g., financial services, public sector, healthcare).\n2 years of experience in program or project management.", "preferred_qualifications": "2 years of experience managing cross-functional or cross-team projects.\nExperience with ISO, SOC reports, PCI DSS, FedRAMP, or equivalent information security and privacy compliance certifications.\nExperience in IT Audit, and regulatory analysis.\nExperience in problem solving within fast-paced and constantly changing environments.\nExperience in a customer-facing role.\nKnowledge of Security capabilities of Cloud products.", "responsibilities": "Lead cloud security risk, operational resilience and regulatory compliance audit engagements requested by Google Cloud’s customers, their internal IT audit teams, assigned third-party auditors, or their regulators.\nCollaborate across Google engineering, data center operations, and other teams to prepare and execute audit engagements and educate customers on Google Cloud’s ongoing compliance postures to meet business and regulatory requirements.\nPartner with customer security, risk, and compliance functions to help them navigate the journey to cloud usage and address any concerns.\nHelp shape Google Cloud security and compliance, and help support the community of Google Cloud security and compliance professionals.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116224999819223750"}