{"title": "Field Solutions Developer IV, Generative AI, Google Cloud", "level": "Advanced", "location": "Toronto, ON, Canada", "description": "As a Generative AI Field Solutions Developer, you will support the Google Cloud sales organization. You will be responsible to construct rapid prototype Generative AI applications tailored to Google Cloud customers, catering to diverse clients ranging from early stage startups to prominent companies.", "key_qualifications": "Bachelor's degree in Science, Technology, Math, Engineering, or equivalent practical experience. 10 years of experience in AI applications (e.g., Deep Learning, NLP, Computer Vision, or Pattern Recognition). Experience in statistical programming language (e.g., Python), applied machine learning techniques, and using OSS frameworks (e.g., TensorFlow, PyTorch). Experience delivering technical presentations and leading business value sessions.", "preferred_qualifications": "Master's degree in Computer Science, Engineering, or a related technical field. Experience with distributed training and optimizing performance versus costs. Experience with CI/CD solutions in the context of MLOps and LLMOps including automation with IaC (e.g., using terraform). Experience designing and deploying with one or more of the following ML frameworks: TensorFlow, PyTorch, JAX, Spark ML, etc. Experience in systems design, with the ability to design and explain data pipelines, ML pipelines, and ML training and serving approaches.", "responsibilities": "Be a trusted advisor to our customers by understanding the customer’s business process and objectives. Design Generative AI-driven solutions, spanning AI, Data, and Infrastructure, and work with peers to include the full cloud stack into overall architecture. Demonstrate how Google Cloud is differentiated by working with customers on application prototypes, demonstrating Generative AI features, prompting and tuning models, optimizing model performance, profiling, and benchmarking. Troubleshoot and find solutions to issues in Generative AI applications. Build repeatable technical assets such as scripts, templates, reference architectures to enable customers and internal teams. Work cross-functionally to influence Google Cloud strategy and product direction at the intersection of infrastructure and AI/ML by advocating for enterprise customer requirements. Coordinate regional field enablement with leadership and work closely with product and partner organizations on external enablement. Travel as needed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116266986345767622"}