{"title": "Hardware Reliability Engineer, Devices and Services", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "As a Reliability Engineer, you will play a key role in creating new consumer electronic products that meet a high bar for reliability and performance. You will work closely with the product management and design engineering teams to define standards, specify tests, and then supervise test execution and failure analysis. A broad engineering background and command of statistical methods will help to inform design of new products. Your strong interpersonal and communication skills will be key to ensuring adoption of your technical recommendations.", "salary": "", "key_qualifications": "Bachelor's degree in mechanical engineering, electrical engineering, material engineering, a related field, or equivalent practical experience. 8 years of experience in reliability engineering with consumer products. Experience in hardware reliability.", "preferred_qualifications": "Experience developing and qualifying high complexity, high volume consumer hardware products with various modules. Experience in hardware reliability and consumer electronics reliability disciplines (e.g., display, sealing, connector, plastic, PCBA, and materials). Knowledge of accelerated life testing theory and methods (development, planning and execution). Knowledge of Failure analysis and Data Analysis. Excellent communication and problem solving skills.", "responsibilities": "Represent reliability engineering to cross-functional teams (e.g., engineering, operations, quality, etc.). Act as tech lead for projects of moderate complexity and impact, manage project priorities and technical resources. Lead hardware risks (DFMEA) analysis, and specify test qualification plans, and include these requirements in the early stages of product development. Define product usage models, develop reliability test, enhance test coverage to detect potential risk at earlier phases, and estimate AFR (Annual Failure Rate). Drive activity across different functions to provide faster time to effective corrective actions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116254189490709190"}