{"title": "Staff Software Engineer, Google Cloud Infrastructure", "level": "Advanced", "location": "Sunnyvale, CA, USA", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in software development, and with data structures/algorithms. 5 years of experience testing, and launching software products, and 3 years of experience with software design and architecture. 5 years of experience in network architecture and network systems.", "preferred_qualifications": "Master’s degree or PhD in Engineering, Computer Science, or a related technical field. 3 years of experience in a technical leadership role leading project teams and setting technical direction. 3 years of experience working in an organization involving cross-functional or cross-business projects. 3 years of experience or interest in networking technologies/concepts such as Software Defined Networking (SDN). Experience in Mathematical programming and modeling and statistics.", "responsibilities": "Provide technical leadership and mentorship to a distributed team of engineers, driving impact projects while supporting collaboration and alignment on goals, outcomes, timelines, priorities, deadlines, and deliverables. Design, develop, test, deploy, maintain, and enhance software solutions. Help set the roadmap for data center network evolution by designing and implementing topology and traffic engineering solutions to enable ML training. Working on improving the efficiency and scalability of data center fabrics and conduct performance evaluation of networks. Use data-driven approaches to improve different aspects of the data center network, from tooling for capacity planning to real-time topology and routing control.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116432114752070342"}