{"title": "SoC Design Verification Engineer, AI Accelerators", "level": "Mid", "location": "Sunnyvale, CA, USA", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Engineering, Computer Science, a related field, or equivalent practical experience. Experience with industry-standard tools, languages and methodologies relevant to the development of silicon-based ICs and chips. Experience with SystemVerilog (i.e., SystemVerilog Assertions or functional coverage).", "preferred_qualifications": "Master's degree or PhD in Electrical Engineering, Computer Engineering or Computer Science, with an emphasis on computer architecture, or a related field. 4 years of experience in design verification. Experience verifying digital logic at Register-Transfer Level (RTL) using SystemVerilog for Application-Specific Integrated Circuits (ASICs). Experience in power aware verification, gate level simulations, and post silicon bring-up. Familiarity with ASIC standard interfaces and memory system architecture.", "responsibilities": "Plan the verification of complex digital design blocks, understand the design specification, and interact with design engineers to identify important verification scenarios. Create a constrained-random verification environment using SystemVerilog and Universal Verification Methodology (UVM). Identify and write all types of coverage measures for stimulus and corner-cases. Debug tests with design engineers to deliver correct design blocks. Close coverage measures to identify verification holes and to show progress towards tape-out.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116490303170323142"}