{"title": "Data Center Technician II", "level": "", "location": "Leesburg, VA, USA", "description": "Google isn't just a software company. The Hardware Operations team is responsible for monitoring the state-of-the-art physical infrastructure behind Google's powerful search technology. As an Operations Technician, you'll install, configure, test, troubleshoot and maintain hardware (like servers and its components) and server software (like Google's Linux cluster). You'll also take on the configuration of more complex components such as networks, routers, hubs, bridges, switches and networking protocols...", "key_qualifications": "Bachelor's degree or equivalent practical experience.Experience diagnosing and troubleshooting one of the following: operating systems and computer/server hardware or networking protocols. Experience with performing component-level repairs on IT equipment. Ability to work non-standard hours, including working weekends, holidays and on shift-based schedule as required. Ability to lift/move 50lb (23kg) of equipment and ability to exert yourself physically over extended periods of time, including frequent bending, kneeling, climbing, pushing/pulling and lifting.", "preferred_qualifications": "Completion of the online Google IT Support Professional Certificate program. Experience working within a data center or network operation center environment. Ability to collaborate and partner with teams to overcome challenges. Ability to adapt to changes in a dynamic work environment.", "responsibilities": "Deploy and operate new data center infrastructure across projects or functions.Report issues and follow data center procedures to troubleshoot and diagnose straightforward issues with equipment or infrastructure as they arise, and apply the resources needed to resolve identified issues.Maintain the security and integrity of data, and track various forms of media to check for standard data security issues (e.g., data was not properly erased) handled in accordance with Google security standards.Disassemble specific equipment that has reached its end-of-life via part replacement or maintenance, in a team setting.Repair, fix, and perform preventative maintenance on equipment, servers, machines, or infrastructure based on identified issues with defined solutions and limited guidance.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116510644135436998"}