{"title": "Customer Engineer, AI, Google Cloud", "level": "Advanced", "location": "Gurugram, Haryana, India; Bengaluru, Karnataka, India", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners. As a Customer Engineer, you will work with technical Sales teams as a machine learning subject matter expert to differentiate Google Cloud to our customers. You will help prospective customers and partners understand the power of Google Cloud, explaining technical features, helping customers design architectures, and problem-solving any potential roadblocks. In this role you will work with customers and product development to shape the future of the AI/Gen AI platform. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 10 years of experience in virtualization or cloud native architectures in a customer-facing or support role. Experience with big data and machine learning frameworks such as Tensorflow, PyTorch or scikit-learn, along with implementing Machine Learning Operations at enterprise scale, on any cloud platform. Experience engaging with, and presenting to, technical stakeholders and executive leaders.", "preferred_qualifications": "Experience in building and deploying data and ML pipelines with a focus on automation. Experience with building Machine Learning (ML) Solutions, Machine Learning Operations frameworks like kubeflow, and leveraging specific machine learning architectures (e.g., deep learning, LSTM, convolutional networks, etc.). Experience in understanding a complex customer’s existing software workloads and the ability to define a technical migration roadmap to the Cloud reflecting specific customer needs. Familiarity with machine learning programming frameworks such as LangChain, PyTorch, HuggingFace, and Tensorflow. Familiarity with prompt tuning and experience delivering successful prototypes.", "responsibilities": "Work with the team to identify and qualify business opportunities, understand key customer technical objections and develop the strategy to resolve technical blockers. Provide machine learning expertise to support the technical relationship with Google’s customers, including product and solution briefings, proof-of-concept work, and partner directly with product management to prioritize solutions impacting customer adoption to Google Cloud. Recommend integration strategies, enterprise architectures, platforms and application infrastructure required to implement a complete solution using best practices on Google Cloud. Travel to customer sites, conferences, and other related events as needed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116564334783406790"}