{"title": "Software Engineer, Silicon", "level": "Mid", "location": "Bangalore, Karnataka, India", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nGoogle's software engineers develop the next-generation technologies that change how users connect, explore, and interact with information and one another. As a Software Engineer, you will work on a specific project for Google’s needs with opportunities to switch teams and projects as the business grows and evolves. \n\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "salary": "", "key_qualifications": "Bachelor's degree in Electrical, Electronics, or Computer Engineering, or equivalent practical experience. 8 years of experience in development, test, and deployment of consumer electronics/embedded systems. Experience with embedded programming in C/C++. Experience with embedded systems, Kernel, Linux, RTOS, or firmware, device drivers.", "preferred_qualifications": "Experience with performance analysis. Experience with interface protocols (e.g., USB, SPI, I2C, UART, UFS, PCIe), power management, system integration, and drivers. Experience with ARM or other low-power SoC architectures, memory systems, or fabric. Knowledge of embedded systems development, RTOS concepts, device drivers, and hardware/software integration.", "responsibilities": "Design software for application developers to make use of hardware accelerators in a timely manner. Implement and validate firmware and Linux drivers for optimal power and performance. Design, develop, and test embedded software drivers for the next generation smart devices. Define architecture in collaboration with stakeholders to identify user experience characteristics and how they can be mapped onto hardware or in development. Lead a team of engineers for delivery of software for subsystems and for power and performance.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116649238093275846"}