{"title": "Technical Program Manager III, Machine Learning, Search", "level": "Mid", "location": "Mountain View, CA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.", "key_qualifications": "Bachelor's degree in a relevant field, or equivalent practical experience.\n5 years of experience in program management.\nExperience in Machine Learning or Artificial Intelligence.", "preferred_qualifications": "5 years of experience managing cross-functional or cross-team projects.\nExperience with one or more of the following: automation, deep learning, speech recognition, TensorFlow.\nExperience managing execution and high quality product delivery.\nExperience with consumer facing products.\nAbility to exercise technical judgment in solving software engineering challenges.\nAbility to be an influential member of a highly integrated team composed of both technical and non-technical members.", "responsibilities": "Collaborate with team members and stakeholders to understand or identify defined work problems and program goals, obtain prioritized deliverables, and discuss program impact.\nPrioritize program goals, understand and translate other stakeholders’ needs into program goals and prioritized deliverables with minimal assistance, and contribute to decisions on prioritizing goals and deliverables.\nDefine the scope of projects and develop, execute, and/or manage project plans for supported program(s).\nReview key metrics pertaining to a program, monitor potential metric deviations, and define corrective actions for critical deviations. Identify, communicate, and collaborate with relevant stakeholders within one or more teams to drive impact and work toward mutual goals.\nUnderstand Machine Learning technologies and their applications used at Google and beyond.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116785506473124550"}