{"title": "Program Manager, Geo Data Operation", "level": "Early", "location": "Hyderabad, Telangana, India", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nThe Geo team is focused on building the most accurate, comprehensive, and useful maps for our users, through products like Maps, Earth, Street View, Google Maps Platform, and more. Every month, more than a billion people rely on Maps services to explore the world and navigate their daily lives.\n\nThe Geo team also enables developers to use the power of Google Maps platforms to enhance their apps and websites. As they plot a course for the future of mapping, they are solving complex computer science problems, designing beautiful and intuitive product experiences, and improving our understanding of the real world.", "salary": "", "key_qualifications": "Bachelor's degree in Engineering or equivalent practical experience. 1 year of experience in Program Management. Experience in Process Improvement, Vendor Management, Budget Planning, Stakeholder Management, or cross-functional program management.", "preferred_qualifications": "Experience in defining measurements and data quality metrics. Experience in mapping technologies and or mapping operations. Experience in process improvement, lean, six sigma, and agile. Ability to be part of an integrated team composed of both technical and non-technical members. Excellent business communication skills, with the ability to manage analysis insight.", "responsibilities": "Manage projects from concept to launch, develop, and coordinate realistic project estimates, plans, or metrics. Work and communicate with Engineering, Product Management, Quality Assurance, Operations teams, and customers.\nSetup and manage project execution teams with associated processes to ensure completion of the program.\nUnderstand Google products, internal tools, and processes, and leverage those to push automation and increase work efficiency, as well as drive people management and contribute to the program management community.\nMonitor, measure, and communicate project progress, potential risks/delays, and team performance to Program teams, executives, and other sponsors, while leading cross-office collaboration and resolving any site-related differences.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116772780283699910"}