{"title": "Senior Visual Designer, Pixel", "level": "Mid", "location": "Mountain View, CA, USA", "description": "Google’s Visual Designers weave space, typography, color, iconography, and texture together to help people successfully navigate our products. We believe that all of our products should be beautiful and accessible.", "key_qualifications": "Bachelor's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 6 years of experience in product design or UX. Experience implementing visual design systems across platforms in an iterative software development environment, applying design tools (e.g. Figma, Photoshop, Illustrator, Sketch). Include a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link and/or access instructions).", "preferred_qualifications": "Master's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 8 years of experience in product design or UX. 3 years of experience working in a complex, cross-functional organization. 2 years of experience leading design projects. 1 year of experience working with executive leaders. Problem-solving skills and familiarity with technical constraints and limitations as they apply to designing for platforms such as desktop and mobile (Android and iOS). Ability to communicate conceptual ideas and design rationale within a user-centered design process. Skills in communicating and influencing product design strategy.", "responsibilities": "Mature and evolve the notion of framework by collaborating with other leads to form a cohesive offering across Google products. Work across programs to define, maintain, and evolve the tools, processes, and communication around asset management. Leverage principal contributors to explore concept development to influence product, a point-of-view around visual style, and product commitments. Defend Google products, our brand promise, and its unique value prop amid an interlaced relationship with Google’s master brand. Partner with visual programs within our organization to evolve and apply new design styles and aesthetics for our suite of products.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116890149593195206"}