{"title": "Global Account Lead, Global Client and Agency Solutions", "level": "Advanced", "location": "Tokyo, Japan", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research, and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. Our Global Clients and Agency Solutions (GCAS) team helps shape how companies grow their businesses in the digital age. We aspire to advise clients on all aspects of their online business strategy. Using Google's broad range of products, we help our clients connect instantly and seamlessly with their audiences.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 15 years of experience in advertising sales, digital marketing, consulting, or media. Experience working within the Japanese business environment.", "preferred_qualifications": "Experience in making and delivering presentations to C-level/executive audiences. Experience in project management, with experience in business development and sales leadership. Experience in leading, coaching, and developing teams, and with people management experience. Understanding of the industry's issues, a direction for growth, and commitment to advancing Google's strategies within the marketplace. Knowledge of Search, YouTube, or Google Marketing Platform. Ability to effectively grow relationships and deepen partnerships with an executive presence.", "responsibilities": "Manage, coach, and develop a team of client partnership experts, cultivating a collaborative environment where individual growth and collective success are fostered. Lead the development and execution of global account strategies, aligning with client goals and maximizing growth opportunities, and oversee the creation and implementation of joint business plans and innovative solutions to achieve key objectives. Take charge of internal operational processes, ensuring the team efficiently achieves strategic goals, delivers insightful reporting, and consistently exceeds performance expectations. Represent Google at the highest levels, building and nurturing C-level relationships with clients and internal stakeholders, showcasing thought leadership, and fostering trust-based partnerships. Be proactive in identifying and removing roadblocks, ensuring seamless client service and successful outcomes.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116801094520054470"}