{"title": "Product Manager, Apigee", "level": "Advanced", "location": "Hyderabad, Telangana, India", "description": "At Google, we put our users first. The world is always changing, so we need Product Managers who are continuously adapting and excited to work on products that affect millions of people every day. In this role, you will work cross-functionally to guide products from conception to launch by connecting the technical and business worlds. You can break down complex problems into steps that drive product development.One of the many reasons Google consistently brings innovative, world-changing products to market is because of the collaborative work we do in Product Management. Our team works closely with creative engineers, designers, marketers, etc. to help design and develop technologies that improve access to the world's information.  We're responsible for guiding products throughout the execution cycle, focusing specifically on analyzing, positioning, packaging, promoting, and tailoring our solutions to our users.", "key_qualifications": "Bachelor's degree or equivalent practical experience.8 years of experience in product management or related technical role.3 years of experience taking technical products from conception to launch.", "preferred_qualifications": "Experience in developing and launching products and technologies in the enterprise infrastructure systems area. Knowledge of API development, cloud operational use cases, application operation, data, networking, security, and troubleshooting. Knowledge of the regulatory environment within Financial Services. Ability to work cross-functionally.", "responsibilities": "Break problems into steps that drive product development to help design and develop technologies that improve access to information. Guide products throughout execution, analyzing, positioning, packaging, promoting, and tailoring solutions to users. Collaborate on product strategy and definition for API Management in controlled environments, including owning the associated business outcomes and driving alignment across key stakeholders in Google Cloud. Manage platform refresh and roadmap planning, business forecasting, and ecosystem and customer adoption. Develop solutions to problems by collaborating as needed across regions, product areas, and functions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116887958153241286"}