{"title": "Data Center System Architect", "level": "Mid", "location": "Sunnyvale, CA, USA", "description": "Our thirst for technology is a part of everything we do. The Data Center Engineering team takes the physical design of our data centers into the future. Our lab mirrors a research and development department -- cutting-edge strategies are born, tested and tested again. Along with a team of great minds, you take on complex topics like how we use power or how to run state-of-the-art, environmentally-friendly facilities. You're a visionary who optimizes for efficiencies and never stops seeking improvements -- even small changes that can make a huge impact. You generate ideas, communicate recommendations to senior-level executives and drive implementation alongside facilities technicians.\n\nWith your technical expertise, you ensure compliance with codes and standards, develop infrastructure improvements and serve as an expert in your specialty (e.g., cooling, electrical).\n\nIn this role, you will enable new infrastructure technology and IT technology insertion into a modular data center portfolio focused on improving development and deployment velocity.\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "key_qualifications": "Bachelor's degree in Electrical Engineering, Mechanical Engineering, Computer Science, or equivalent practical experience.\n5 years of experience in the design of Data Center Systems Engineering, system architecture, design and integration.\n5 years of experience coordinating work with outside design consultants on new Data Center designs from layout construction documents.\n4 years of experience with designing reconfigurable modular interfaces for Data Centers.", "preferred_qualifications": "Master's degree or PhD in Electrical Engineering, Industrial Engineering, or Mechanical Engineering.\n10 years of experience in data center design, development and construction.\nExperience in reading civil drawings produced by vendors and flagging coordination items that deviate from a standard civil configuration (e.g., skeleton model).\nKnowledge of civil construction methodologies and timelines, and ability to provide impact assessments based on deviations.", "responsibilities": "Ensure designs and installations meet requirements (e.g., predicted cooling, structural, operational concerns, etc.).\nLead investigations and innovations in flexible building layouts that balance minimizing day one impact, while maximizing scalability in incremental phases and efficiency of overall space utilization for master planning.\nDefine, implement, and maintain critical data center system architecture and interfaces within product areas to enable modular introduction and incremental phasing of new technologies into the data center fleet.\nDrive development of solutions with our partners and play a key role in driving, influencing, and evolving the strategy to adapt to a modular, multidisciplinary product development approach.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/116954347341783750"}