{"title": "Senior Validation Security Consultant, Mandiant, Google Cloud", "level": "Mid", "location": "Reston, VA, USA", "description": "In this role, you will be responsible for supporting customers by utilizing Mandiant (now part of Google Cloud) Security Validation (MSV), deployment of the platform, and long-term operational use of the solution. You will be working in large-scale and fast-moving operational environments focusing on cyber defense.", "key_qualifications": "Certification in DoD 8570.01 Information Assurance Technical (IAT) Level II. 7 years of experience in information security and engineering. 4 years of experience with pen testing and Red teaming functions, including network, web application, mobile, cloud, social engineering, scripting, or tool development. 2 years of experience with Networking (DHCP, DNS, HTTP, TCP/IP, etc.), Security Incident, and Event Management (SIEM) alert/rule correlation. Experience with tools used for wireless, web application, and network security testing. Active US Government Top Secret/Sensitive Compartmentalized Information (TS/SCI) security clearance with polygraph.", "preferred_qualifications": "Certifications related to offensive security including OSCE, OSEP, OSEE, OSCP, CCSAS, CCT, INF, or relevant SANS courses. Certification in CCNA or CCNP. 2 years of experience in the Security Operations Center. Experience implementing or assessing information security implementation or assessment of security controls. Excellent written/verbal communication skills, with the ability to develop documentation and explain technical details in a concise manner.", "responsibilities": "Perform Red and Purple team assessments, assumed breach assessments (e.g., Red team engagements with a pre-deployed implant), ransomware readiness reviews (e.g., assessing susceptibility to modern ransomware threats), threat analysis, and social engineering assessments. Develop integration, deployment, and validation assessment engagements. Manage the design and architect stage of Mandiant Security Validation deployments. Provide product expertise and guidance to customers on the use of Mandiant Security Validation Security Instrumentation Platform (SIP) for improving their ability to detect, block, alert, and respond to cyber security threats. Help establish the global government team by supporting clients and collaborating with the customer success organization on the Mandiant Security Validation product line.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/117041164938289862"}