{"title": "Software Engineering Manager, Titan", "level": "Advanced", "location": "Warsaw, Poland", "description": "Like Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers. You not only optimize your own code but make sure Engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way.\n\nWith technical and leadership expertise, you manage engineers across multiple teams and locations, a large product budget and oversee the deployment of large-scale projects across multiple sites internationally.\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science or equivalent practical experience. 8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). 3 years of experience in a technical leadership role; overseeing strategic projects, with 2 years of experience in a people management, supervision/team leadership role. Experience managing project timelines and deliverables.", "preferred_qualifications": "Master's degree or PhD in Computer Science or related technical field. 3 years of experience working in a complex, matrixed organization.", "responsibilities": "Lead a team of engineers at various levels building the infrastructure behind Google Cloud's latest offering - Gemini Cloud Assist, Gemini Code Assist, and more. Work with internal product teams to translate their platform, tooling and infrastructure needs and constraints into project roadmaps. Manage project schedules, identify risks and clearly communicate them to stakeholders. Work closely with engineers, product managers and other teams to create, deliver and evolve high-quality products and features. Grow, coach and mentor engineers and engineering managers to build a healthy team culture with focus on technical excellence.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/117133215751119558"}