{"title": "Cross-Industry Lead, Strategic Pursuits, Google Cloud", "level": "Advanced", "location": "Sunnyvale, CA, USA", "description": "As a Strategy Lead with Google Cloud’s Strategic Industries organization, you will be responsible for helping drive the industry strategy for Google’s Data and AI innovations. You will collaborate with market leads, solutions, marketing, business, and executive leadership to jointly define, implement, and communicate Google Cloud’s cross-industry direction.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 10 years of experience working in a consulting capacity with customers. Experience working with more than one enterprise industry (i.e., Healthcare, Retail, Telco).", "preferred_qualifications": "MBA or equivalent advanced degree. 10 years of experience with consulting. 5 years of experience working within an enterprise tech organization/software company. Understanding of AI and Data technologies and their applications in various industries. Ability to develop, execute, and measure comprehensive strategies, and comfortable using data to drive decisions and communicate impact. Excellent communication skills, with the ability to effectively articulate complex ideas to diverse audiences.", "responsibilities": "Collaborate across industry market leads to define, consolidate, and ensure consistency among strategy templates, solution offerings, documentation, and playbooks. Lead key industry program related to strategy definition and executions. Serve as an industry analytics to be up-to-date on trends, report and analysis that will help drive industry strategy. Interact with cross-functional teams to share relevant strategy components and drive go-to-market industry strategies across the organization. Involve in program management and managing deadlines and deliverables from multiple internal executive stakeholders. Use data to drive decisions and impact with internal teams.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/117197146876191430"}