{"title": "Quantitative Marketing Analyst, Growth Lab, Gemini", "level": "Mid", "location": "New York, NY, USA", "description": "As a Quantitative Marketing Analyst on the Growth Lab Gemini team, you will play a pivotal role in understanding and optimizing the usage and subscription lifecycle for Gemini. You will leverage your SQL expertise and investigative skills to uncover insights, drive data-informed decisions, and ultimately enhance user engagement and retention. You will be a key player in our data-driven approach to user acquisition, engagement, and retention.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience designing, scoping, executing, and delivering research and analysis projects, and managing research and measurement agencies. 5 years of experience translating business problems into research questions and translating research findings and insights into marketing recommendations. Experience in analyzing subscription metrics and key performance indicators (e.g., churn rate, lifetime value, conversion rates).", "preferred_qualifications": "8 years of experience in data analysis and driving growth in subscription-based products or services. Experience with R or Python for statistical analysis and data visualization, and SQL to write queries, extract data from various sources, and perform in-depth analysis. Experience in designing and analyzing A/B tests, multivariate experiments, or other controlled studies. Experience working in a cross-functional team, managing projects with multiple stakeholders and priorities. Knowledge of subscription billing systems and processes. Familiarity with Google's data infrastructure (e.g., BigQuery).", "responsibilities": "Conduct in-depth analysis of user and subscriber behavior, identify trends, and uncover insights that drive product improvements and marketing strategies. Create clear and informative reports and dashboards to track key subscription metrics and communicate findings to stakeholders. Collaborate with cross-functional teams to design and implement A/B tests to evaluate the impact of product changes on business outcomes. Build models to predict subscriber churn, identify at-risk subscribers, and forecast future user trends. Work closely with Product Managers, Marketers, and Engineers to translate data insights into actionable recommendations.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/117220214608667334"}