{"title": "Strategic Negotiator, Networking Infrastructure", "level": "Mid", "location": "Singapore", "description": "As Google's products and services grow to serve our billions of users, the Strategic Negotiation team works behind the scenes to secure infrastructure for Google's future. It's a big job that involves everything from operating underwater cables to finding data center space. In this role you combine your deep market knowledge with tech industry savvy to find solutions that support Google's growth. You'll ensure that we receive contract compliance on our third-party agreements, while identifying the most cost-effective solutions for our needs. You'll take lead on special projects, manage vendors and present your recommendations to Google leadership.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 6 years of experience negotiating and structuring agreements or leading business development. 6 years of experience in relevant work, including with contract development and vendor management across many vendors and types of network infrastructure. Experience in acquisition of services from, or business development with, providers around colocation, submarine cable landings, dark fiber, and network capacity.", "preferred_qualifications": "Ability to derive strategic clarity and consensus in ambiguous regulatory, business and technical environments. Excellent aptitude, quantitative, and problem-solving skills. Ability to travel up to 20% of the time as needed.", "responsibilities": "Articulate Google's infrastructure position in the region to internal and external stakeholders. Collaborate with internal business and infrastructure technical teams to identify and define strategic initiatives necessary to meet Google's near-term and future needs. Build strategic relationships with vendors, identify compelling opportunities for partnership or expansion, and determine specific solutions that meet commercial, technical and timing requirements. Identify and conclude contractual agreements with vendors providing network infrastructure services and assets. Lead partnerships in tandem with Google's legal, treasury, policy and tax teams. Communicate progress internally and collaborate with network deployment teams.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/117266200085308102"}