{"title": "Technical Program Manager, Search Vertical", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Google's projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks, and clearly communicating them to project stakeholders. You're equally at home explaining your team's analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers. Using your extensive technical and leadership expertise, you manage projects of various size and scope, identifying future opportunities, improving processes, and driving the technical directions of your programs. The Search Verticals team in Search is responsible for developing knowledge and building experiences in Google's key knowledge verticals including Sports, Language, Jobs, Health, and more.", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n2 years of experience with the software development life-cycle, quality assurance testing.\n2 years of experience managing projects.", "preferred_qualifications": "Experience managing effective and data-driven communication with diverse stakeholders via email, written documents, and slides.\nExperience with machine learning platforms, including training and inference systems.\nAbility to manage ambitious strategic projects with cross-functional teams.\nExcellent data analysis skills.", "responsibilities": "Manage a portfolio of projects within the Language vertical team, be responsible for project planning, managing schedules, setting milestones, and project tracking.\nDrive project delivery, work with engineering and product management, and provide knowledge of platform engineering in order to uncover and build operational improvements and processes.\nBuild relationships with infrastructure and other feature development teams across the organization, and lead overall communication within the team and outside to stakeholders and leads.\nNavigate multiple work-streams, technical concepts, and conversations across different areas and stakeholders to drive collaboration.\nLead the integration with external partners, gather internal requirements, and communicate with partners to influence delivery of requirements.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/117503643057300166"}