{"title": "Staff Software Engineer, AI/ML, Google Cloud", "level": "Advanced", "location": "Hyderabad, Telangana, India", "description": "Google Cloud's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google Cloud's needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. You will anticipate our customer needs and be empowered to act like an owner, take action and innovate. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in Software development and with data structures/algorithms. 5 years of experience testing, and launching software products, and 3 years of experience with software design and architecture. 3 years of experience in AI/ML related engineering, developing, deploying, managing, and maintaining Machine Learning infrastructure. 2 years of experience in people management.", "preferred_qualifications": "Experience collaborating with cross-functional teams located around the globe in different timezones. Knowledge of Enterprise customers and experience working with them. Knowledge of AI/ML frameworks and techniques, and how they fit into HPC workloads.", "responsibilities": "Hire, train, and lead a team of engineers on a team responsible for the definition of reference architectures for AI/ML platforms on GCP. Develop and deliver solutions for deploying and running common ML/HPC systems and workload configurations on Google Cloud. Identify and validate common and valuable system and workload deployment configurations for customers. Design and develop reference architectures leveraging a range of components, including OS, platform, system size, orchestration system, frameworks, reference models, storage stack, and consumption model. Develop and run a pipeline for keeping reference architectures up to date with the latest AI/ML framework.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/117796734041498310"}