{"title": "Generative AI Specialist, Google Cloud", "level": "Advanced", "location": "New York, NY, USA; Sunnyvale, CA, USA", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners. As a Generative AI Specialist, you will work with Product Development and Technical Sales teams as an Generative Artificial Intelligence (AI) subject matter expert to bring Google Cloud AI products to our customers and Partners. In this role, you will help prospective customers and partners understand the power of Google AI, explaining technical features, helping customers design architectures, build AI powered applications, and problem-solving any potential roadblocks. You will also have the opportunity to help customers leverage Google Cloud’s Generative AI services, including Large Language Models (LLM) and specialized Machine Learning (ML) hardware developed by Google. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$171,000-$257,000 + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree in Engineering, Computer Science, a related field, or equivalent practical experience. 7 years of experience in technical project management, stakeholder management, professional services, solution engineering or technical consulting. 1 year of experience in technical troubleshooting and writing code in one or more programming languages. Experience with LLMs, Open Source, Big Data, Machine Learning, and numerical programming frameworks.", "preferred_qualifications": "Master's degree in Computer Science or a related technical field. Experience architecting and developing software or infrastructure for scalable, distributed systems and with machine learning technologies. Experience with building AI and machine learning solutions, Machine Learning Operation frameworks such as Kubeflow, and leveraging specific machine learning architectures (e.g., deep learning, LSTM, etc.). Understanding of AI Models, Large Language Models, and AI specialized infrastructure especially as it relates to AI trends and issues within businesses. Understanding of responsible AI practice.", "responsibilities": "Provide AI expertise to support the technical relationship with Google’s customers, including product and solution briefings, proof-of-concept work, and partner with product management to prioritize solutions impacting customer adoption to Google Cloud. Recommend integration strategies, enterprise architectures, platforms, and application infrastructure required to implement a complete solution using best practices on Google Cloud. Support developers, creators, and enterprises to leverage Google’s Generative Language APIs so they can build their own AI products in the future. Work with the team to identify and qualify business opportunities, understand key customer technical objections, and develop the strategy to resolve technical blockers. Strategize surrounding solution code development in collaboration with internal or external developers, users, partners, clients, or stakeholders as needed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/117764940674015942"}