{"title": "Software Engineer III, Embedded Systems, Silicon", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, Electrical Engineering, a relevant technical field, or equivalent practical experience. 2 years of experience with software development in C or C++, or 1 year of experience with an advanced degree. 2 years of experience with data structures or algorithms. Experience with Git, repurchase agreement (repo), and bug tracking tools.", "preferred_qualifications": "Experience in ARM architecture and standard interfaces, bare-metal programming, bootloader and firmware. Experience in Linux kernel, device drivers, and Android system programming. Experience in verification using FPGAs or emulation platforms. Experience in software/hardware integration. Familiarity with computer architecture, compilers, machine learning, or image processing.", "responsibilities": "Deploy and optimize the next generation on voltage/frequency control, GSM protocol and products on Google’s latest SoC, enhance its performance, and reduce power and memory footprint. Build prototype/production software for embedded software stacks running inside Google’s SoCs. Contribute to the software and hardware architecture designs for Google’s future SoCs and software features. Collaborate across organizations and teams to move the architecture design into production. Build prototype/production software across the android stack including kernel, Board Support Package (BSP), framework, and application to prove the feasibility of designs.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/117754536994448070"}