{"title": "Technical Program Manager II, System Integration, Consumer Hardware", "level": "Mid", "location": "Mountain View, CA, USA; Chicago, IL, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You'll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay …", "key_qualifications": "Bachelor's degree in a technical field, or equivalent practical experience. 2 years of experience in program management. Experience with consumer electronics or systems management.", "preferred_qualifications": "2 years of experience managing cross-functional or cross-team projects. Experience in consumer electronics phone development. Experience shipping high volume/high quality products.", "responsibilities": "Manage key interface for overall system readiness for validation and alignment on test plan, priorities, and execution, and ensure NPI hardware is tested and issues are identified, tracked, and root caused. Create and manage schedules for system validation during hardware NPI development builds, work with cross-functional EPMs on design/tooling locks, and incorporate validation feedback before next hardware release. Synthesize data into a clear story and communicate to key stakeholders across all levels of the organization, as wel...", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/117828084349969094"}