{"title": "Industrial Designer, Onsite Support", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "In this role, you will be responsible for onsite part-level and device reviews to ensure they meet the quality standards set by the Industrial Design (ID) team. Additionally, you will lead the design of sustaining design projects working closely with the ID team.\n\nYou will be part of a team of designers and Color, Material and Finishing (CMF) experts working closely with engineering, quality, and supply chain to deliver the best of Google through our devices.\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "key_qualifications": "Bachelor's degree in Industrial Design, or equivalent practical experience.\n6 years of experience working in product design.\nExperience in assessing cosmetic quality across a variety of materials and finishes.\nExperience in communicating quality assessment to suppliers and developing plans for improvements.", "preferred_qualifications": "Experience in Color, Material, and Finishing (CMF) development and execution.\nExperience in collaborating with US based design teams.\nKnowledge of technical and manufacturing.\nAbility to work separately while taking direction from team members in other regions.\nAbility to travel throughout Asia and the United States when needed.", "responsibilities": "Conduct onsite supplier visits as a member of the Industrial Design team and communicate with suppliers to achieve quality standards.\nReview parts for cosmetic quality throughout development to ensure they meet the standards established by the Industrial Design team.\nReview fully-assembled devices to assess build quality, fit and finish, and step and gap.\nDrive the design of accessories and sustaining products working closely with ID team based in Mountain View, CA.\nCollaborate with cross-functional team members including CMF, engineering, quality, and supply chain.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/117863379317465798"}