{"title": "Account Strategist, Scaled, Google Customer Solutions", "level": "Early", "location": "Shanghai, China", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. As an Account Strategist, you will provide clients with consultancy services and help advertisers grow their business through a combination of one-to-one and scalable outreach or support. You will work in partnership with key advertisers to understand their strategies and increase their knowledge of Google advertising solutions, as well as to provide them with tactical implementation and maintenance support of their Google Ads accounts. Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow. Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. Ability to communicate in English and Mandarin fluently to support client relationship management in this region.", "preferred_qualifications": "2 years of experience in advertising, marketing, media account management, and achieving quotas to drive client growth. Ability to use analytical skills to leverage data to uncover insights to support proposals and analyze impact. Ability to assess and solve client needs through effective questioning and objection handling. Ability to manage multiple projects while paying attention to detail and working individually and with others. Excellent presentation and communication skills with peers, management, cross-functional teams, and clients.", "responsibilities": "Manage a portfolio of small size businesses by understanding growth drivers, identifying opportunities for growth, managing risks, and creating plans for achievement. Collaborate within the sales team, align workflow among team members to execute on a plan, and ensure accountability to meet or exceed goals while delivering outstanding customer experience. Improve our customer relationships and share performance-enhancing suggestions. Conduct outbound calls to establish relationships and work with existing clients to generate growth and improved client success. Identify key client stakeholders to support Customer Business Objectives and annual digital marketing plans. Assess and solve client needs through effective questioning, objection handling, and competitive selling.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/117827532446671558"}