{"title": "Engineering Manager, Trusted Partner Cloud", "level": "Advanced", "location": "Munich, Germany", "description": "Like Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers. You not only optimize your own code but make sure Engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way. Trusted Partner Cloud is a multi-year program to build local, isolated clouds operated by partner companies. These clouds, operated by a local partner but powered by Goolge Cloud Platform (GCP), will meet strict data and operational sovereignty requirements in jurisdictions across Europe and APAC. The team delivers functionality, tools, and processes to enable partner operational sovereignty. As the Enginnering Manager, you will partner with the Product Management teams to develop and execute comprehensive go-to-market strategies to ensure the broad adoption of Trusted Partner Cloud (TPC). Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor’s degree, or equivalent practical experience. 8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). 5 years of experience in a technical leadership role; overseeing projects, with 5 years of experience in a people management, supervision/team leadership role.", "preferred_qualifications": "Master's degree or PhD in Computer Science or related technical field. Experience with open source tools and frameworks like Kubernetes, Prometheus, Fluent Bit, Grafana, Loki, etc. Experience with successful product delivery. Experience with system integration, configuration management, control management, orchestration layer, etc. Experience with data collection, monitoring, alerting, and analysis infrastructure. Knowledge of cloud infrastructure (e.g., GCP, etc.).", "responsibilities": "Develop and grow leadership and talent through effective mentoring, coaching, succession planning, and retention strategies in a fast-paced, competitive environment. Work with a team of tech leads to provide oversight and leadership on technical aspects of development, including technical requirements definition, design, implementation, testing, and delivery. Form relationships with partners across Google (Germany/US/India) and with our French partner teams to collaborate effectively, define goals, and drive execution. Work closely with product development, marketing, sales, and customer support teams to ensure alignment and effective execution of go-to-market plans.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/117970338767086278"}