{"title": "Supplier Quality Engineer, Interconnect (Copper Cables and Connectors)", "level": "Mid", "location": "Xiuyuan Village, Yonghe District, New Taipei City, Taiwan", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.", "key_qualifications": "Bachelor's degree in Electrical Engineering, Mechanical Engineering, related science fields, or equivalent practical experience. 8 years of experience as a Component, Quality, Reliability, or Product Engineer in interconnect or copper cable commodities. Ability to travel as required.", "preferred_qualifications": "Master's degree in Electrical Engineering, Mechanical Engineering, related science field, or equivalent practical experience. 10 years of experience as a Component, Quality, Reliability, or Product Engineer in interconnect (copper cables and connectors) commodities. Ability to succeed in ambiguity, and change course as needed. Excellent team player, ability to take initiative, and result and detail oriented. Excellent leadership and communication skills.", "responsibilities": "Improve the quality and reliability of interconnects (copper cables and connectors) throughout the product lifecycle. Evaluate interconnect quality/reliability in our CMs and data centers, drive continuous improvements, investigate and coordinate failure analysis, isolate true root causes, and drive corrective/preventative actions in collaboration with the design, commodity, and supplier teams. Drive proactive quality improvement initiatives with suppliers and Google Engineering. Manage quality section of supplier scorecards during business reviews and drive systemic quality/reliability improvements. Conduct and manage supplier quality audits, driving high standards in manufacturing, quality, and reliability.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/117916553160073926"}