{"title": "Partner Development Manager, State, Local, and Education", "level": "Advanced", "location": "New York, NY, USA; Chicago, IL, USA", "description": "Google Public Sector teams work with schools, cities and states, and government agencies to make them more productive, mobile, and collaborative. On this team, you will drive Google Cloud business relationships by analyzing partner business performance, identifying methods of increasing partner and Google returns, pitching ideas to and identifying opportunities within partners, and coordinating across Google teams to deliver. You will educate our partners on the power of Google Cloud and enable them to be successful in driving innovation to our customers. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 10 years of experience working with SaaS and cloud computing solutions in a Channel Sales/Partner-oriented role. Experience in a direct selling or channel sales role in the US Public Sector vertical.", "preferred_qualifications": "Master's degree. Experience with Public Sector partner ecosystems, agile partners, Global System Integrators (GSIs), System Integrators (SIs), Managed Service Providers (MSPs), or Independent Software Vendors (ISVs). Excellent communication skills, including experience presenting to multiple audiences including leadership and C-suite teams. Excellent management skills, with experience working in and through a cross-functional organization.", "responsibilities": "Identify the right Google partner for each opportunity from the portfolio of partners, and suggest opportunities for partner sourced agreements. Set the partner business insight for your Sales team and identify which partners are industry or workload aligned in order to drive demand generation activities with partners through events, campaigns, and an industry focused plan in coordination with partner marketing. Collaborate with internal teams, including Sales and Partner Management teams to discuss the joint plan with the partner. Commit partner resources to product business and implementation for customers in order to accelerate the ramp and drive business. Report on all partner business activity and work closely with Sales and Partner Management teams to optimize efforts and ensure alignment.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/117913689691955910"}