{"title": "Senior Software Engineer, Machine Learning Performance", "level": "Mid", "location": "London, UK", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\nIn this role, you will focus on Large Language Models (LLMs) (e.g., Google Deepmind Gemini, Bard, Search Magi, Cloud LLM APIs, etc.) performance analysis and optimizations.\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience with software development in one or more programming languages, and with data structures/algorithms. 3 years of experience testing, maintaining, or launching software products, and 1 year of experience with software design and architecture. 3 years of experience with machine learning algorithms and tools, AI, deep learning, or natural language processing.", "preferred_qualifications": "Master's degree or PhD in Computer Science or a related technical field. 1 year of experience in a technical leadership role. Experience with performance analysis and optimization, including system architecture, performance modeling, or similar. Experience with distributed development and large-scale data processing. Experience with compiler optimizations or related fields.", "responsibilities": "Identify and maintain LLM training and serving benchmarks that represent Google production, industry and Machine Learning community, identify performance opportunities and drive TensorFlow/JAX TPU performance, and gate TF/JAX releases. Engage with Google Product teams to solve their LLM performance problems. Onboard new LLM models and products on Google new TPU hardware, enabling LLMs to train efficiently on large-scale. Analyze performance and efficiency metrics to identify bottlenecks, design, and implement solutions. Work with tooling and fleet metrics subteams to build tools to track performance and efficiency and to extract metrics from Google running workloads. Explore model/data efficiency techniques, new machine learning model architecture/optimizer/training technique to solve a machine learning task, new techniques to reduce the label/unlabeled machine learning data needed to train a model.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/118049701978088134"}