{"title": "AI Sales Specialist, Google Cloud", "level": "Advanced", "location": "Singapore", "description": "As an AI Sales Specialist, you will be responsible for growing our AI business by building and expanding relationships with new and existing customers. You will possess the necessary promoting skills to effectively build relationships with both Cloud Field Sales Representatives (FSRs), Customer Engineers (CEs) as well as new and existing customers. You will develop relationships with external customer stakeholders, identifying innovative ways to multiply your impact and the impact of the team as a whole. You will partner with internal Google Cloud Platform (GCP) Sales teams to grow their AI businesses and drive overall value for GCP. Business cycles will include a combination of productivity use cases, as well as working with product teams to help our customers build new products leveraging our AI.\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n12 years of experience in promoting IT business solutions and executing a territory business strategy.\nExperience partnering with technical staff to build business cases and implementation plans.\nExperience identifying and driving use cases to solve customer problems.", "preferred_qualifications": "Experience working with and managing partners in complex implementation projects including global system integrators and packaged software vendors.\nExperience with promoting the AI technology stack.\nExperience working with product teams and an understanding of how to embed our technology into their product set.\nFamiliarity with Google Cloud and Google Cloud AI offerings.\nAbility to connect AI/ML with business value and engage executive stakeholders as an advisor and thought leader.\nAbility to drive business growth across a broad set of industry-specific AI/ML use cases.", "responsibilities": "Calibrate the business against the objectives and key results. Forecast and report the state of the business for your territory.\nBuild and maintain executive relationships with customers as the AI Subject Matter Expert, influence long-term strategic direction for the new and existing customers as well as the Google Cloud Field Sales Representatives (FSRs) and Customer Engineers (CEs).\nAssist customers in identifying AI use cases suitable for Google Cloud AI products and solutions. Articulate key solution differentiators and the measurable business impact.\nDevelop and execute strategic account plans, including a broader enterprise plan across key verticals.\nWork with Google Account and technical teams to develop and drive pipelines, and provide expertise. Execute Go-To-Market business plays and related efforts with the Cloud teams and GCP Partners.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/118171635294315206"}