{"title": "Material Program Manager, Manufacturing Operations and Delivery", "level": "Mid", "location": "Warsaw, Poland", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.", "key_qualifications": "Bachelor’s degree in Engineering or Supply Chain Management, or equivalent practical experience. 2 years of experience in program or project management. Experience across all phases of a product from prototype to mass production to end of life. Experience working with Bill of Materials.", "preferred_qualifications": "Ability to grow in a highly ambiguous/unstructured environment, institutionalize new methods with partners (e.g., collaborate, build consensus). Ability to take existing systems/process and drive/suggest optimizations. Ability to successfully deliver complex products, in-depth knowledge of project management. Excellent verbal and written communication and presentation skills, with the ability to interact with technical and non-technical groups and customize communications based on the audience. Excellent critical thinking, judgment, and problem solving skills.", "responsibilities": "Use cross domain expertise in material readiness, procurement, Clear to Build (CTB), Operations and Engineering to positively impact supply chain strategies and execution. Ensure supplier diversity by qualifying new sub-components and suppliers to meet capacity goals. Ensure material availability and supply assurance. Manage supply chain risk management and inventory execution. Ensure supplier rapid responsiveness and recovery due to supply chain disruptions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/118269663359443654"}