{"title": "Senior Quantitative UX Research Manager, Google Ads", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" Google’s UX leaders help define and drive the future of Google design. They create and clarify product strategy, conceptualize UX ecosystems in ways that mitigate complexity, and inspire teams to push the boundaries of what’s possible. They possess a clear vision of the future of user experience and have the courage to pursue forward-thinking design. Google User Experience (UX) is made up of multi-disciplinary teams of UX Designers, Researchers, Writers, Content Strategists, Program Managers, and Engineers: we care deeply about the people who use our products. You are a thoughtful team leader, manager, expert researcher, and visionary. You'll be responsible for guiding the careers of your team members, working closely with each of them to help them realize their full potential. Quantitative UX Research Managers are fierce advocates for the people who use our products as well as the members of their teams. They’re experts at using data and quantitative analysis to shape product development and influence overall strategy. In this role, you’ll take the time to understand not just the execution side of UX, but also the business aspects of the products we build. You’ll collaborate with leaders of other UX, Engineering, and Product Management teams to create innovative experiences across all of Google’s products, leveraging your passion for brand, craft, and design quality.", "key_qualifications": "Bachelor's degree in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, related field, or equivalent practical experience. 10 years of experience in an applied research setting, or similar. 5 years of experience leading design projects and managing people or teams. 3 years of work experience working with executive leaders. Include a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link and/or access instructions).", "preferred_qualifications": "Master's or PhD degree in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, or related field. 15 years of relevant work experience, including experience integrating user research into product designs and design practices. 10 years of experience conducting UX research on products and working with executive leadership (e.g., Director level and above). 8 years of experience managing projects, and working in a large, matrixed organization. Strong understanding of the strengths and shortcomings of different research methods, including when and how to apply them during each product phase. Excellent working knowledge of statistics and the principles of experiment design.", "responsibilities": "Influence stakeholders across organizations to gain support for research-based, user-centric solutions. Own project priorities in alignment with larger product goals, and oversee allocation of resources within the project. Drive ideas to improve products and services through research-driven insights and recommendations. Lead teams to define and evaluate product, service, ecosystem impact. Own vision and strategy discussions through research by analyzing, consolidating, or synthesizing what is known about user, product, service, or business needs.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/118255317833130694"}