{"title": "Information Security Engineer, Google Photos", "level": "Mid", "location": "Mountain View, CA, USA", "description": "There's no such thing as a 'safe system' - only safer systems. Our Security team works to create and maintain the safest operating environment for Google's users and developers. As a Security Engineer, you help protect network boundaries, keep computer systems and network devices hardened against attacks and provide security services to protect highly sensitive data like passwords and customer information. Security Engineers work directly with network equipment and actively monitor our systems for attacks and intrusions. You also work with software engineers to proactively identify and fix security flaws and vulnerabilities.\n\nYou use your industry experience to own and drive the resolution of complex security incidents, policy questions and technical security issues. Google Photos mission is to be a home for memories so users can save and share what matters to them. The team works to create trusted and compelling user experiences on a platform for users and their memories. The Photos Information Security Engineering team plays a key role and is tasked to ensure that the standards of security are embedded within applications, safeguarding users and their sensitive data.", "key_qualifications": "Bachelor's degree in Computer Science, a related technical field, or equivalent practical experience.\n6 years of experience with technical security assessments, code audits, and design reviews.\nExperience with software development in one or more programming languages (e.g., Java, C++).", "preferred_qualifications": "Experience with project engineering and cross-functional collaboration to achieve common goals.\nExperience with systems security and mobile security.\nKnowledge of threat modeling, risk assessments, or security assessments of systems.\nAbility to develop technical solutions to help mitigate security vulnerabilities.", "responsibilities": "Contribute to developing the Photos Security Strategy.\nReview, develop, and implement operational practices to provide security guidance for engineers and support staff.\nConduct threat assessments to identify vulnerabilities and attack vectors against infrastructure and products.\nPerform project security reviews, drive product vulnerability response and remediation, including mitigations and hardening.\nAdvocate security and secure coding practices throughout Photos.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/118281379694682822"}