{"title": "Senior Manager, Custom Silicon Engineering Operations", "level": "Advanced", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "Google has one of the largest and most powerful computing infrastructures in the world. Your team is responsible for providing the manufacturing capability to deliver this state-of-the-art physical infrastructure. As a Manufacturing Engineer, you evaluate the product designs and create the processes, tools and procedures behind Google's powerful search technology. When vendors build parts for our infrastructure, you're right there alongside ensuring manufacturing processes are repeatable and controlled. You collaborate with Commodity Managers and Design Engineers to determine Google's infrastructure needs and product specifications. Your work ensures the various pieces of Google's infrastructure fit together perfectly and keep our systems humming along smoothly for a seamless user experience.\n\nThrough your leadership, you leverage your technical expertise to design and analyze products and related data, develop and improve manufacturing and supportive processes, and provide consultation to vendors, manufacturers, and internal teams. You lead complex projects to completion by managing resources and activities along the way.", "salary": "", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Engineering, Material Engineering, or equivalent practical experience. 12 years of experience managing SOC manufacturing and operations. 10 years of experience in people management. Experience with leading edge technology of semiconductor engineering. Experience in test/yield and cycle time improvements, excursion management and prevention, cost engineering, and other similar manufacturing areas.", "preferred_qualifications": "Experience in hiring and building a performance organization for engineering operations. Experience leading cross-functional teams with technical leadership and executive communication. Knowledge of foundry and OSAT suppliers, roadmap, and ecosystem. Ability to travel to manage supplier deliverables in US, Taiwan, Korea, and other countries. Excellent communication and presentation skills, with the ability to present to executive audiences.", "responsibilities": "Execute manufacturing milestones from NPI through ramp and sustaining with foundry and assembly/test suppliers. Drive cross-functional efforts in the supply chain for operational readiness from NPI through product ramp, sustaining, and End of Life (EOL). Drive and resolve technical and operational issues of material, process, fixtures, and equipment to enable delivery of product and manufacturing process into mass production. Manage continuous quality monitoring and quality improvement efforts in the supply chain, and identify and execute cost reduction/value engineering. Attend regular on-site meetings, supplier visits, and strengthen relationships with key manufacturing partners. Partner with engineering to execute sourcing evaluation and selection of foundry and assembly/test suppliers in a structured manner to meet selection evaluation milestones until supplier selection is finalized.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/118398817857872582"}