{"title": "Site Reliability Engineer, Enterprise Applications", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Site Reliability Engineering (SRE) combines software and systems engineering to build and run large-scale, massively distributed, fault-tolerant systems. SRE ensures that Google's services—both our internally critical and our externally-visible systems—have reliability,  uptime appropriate to users' needs and a fast rate of improvement.  Additionally SRE’s will keep an ever-watchful eye on our systems capacity and performance. Much of our software development focuses on optimizing existing systems, building infrastructure and eliminating work through automation.\n\nOn the SRE team, you’ll have the opportunity to manage the complex challenges of scale which are unique to Google, while using your expertise in coding, algorithms, complexity analysis and large-scale system design.\n\nSRE's culture of diversity, intellectual curiosity, problem solving and openness is key to its success. Our organization brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, a related technical field, or equivalent practical experience. 2 years of experience with data structures/algorithms and software development in one or more programming languages. Experience with Unix/Linux operating systems internals and administration or networking and debugging/troubleshooting.", "preferred_qualifications": "3 years of experience with large systems software design and development. Experience in analyzing and troubleshooting large-scale complex enterprise systems. Experience in navigating enterprise software, deployment, and management of workloads on Cloud.", "responsibilities": "Design, code, and execute on projects to improve the reliability posture of critical enterprise applications. Reduce the operational work significantly for our footprint on Google Cloud Platform and Google Stack. Collaborate with the United States Site Reliability Engineering (SRE) team to support Corp Eng services, develop and implement SRE best practices. Work with other engineering teams to ensure that our infrastructure is reliable, scalable, and secure and participate in the team's on-call rotation. Shape the future of the team, leverage your leadership to bring creative solutions to an Enterprise Services stack at Google.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/118490526281278150"}