{"title": "Revenue Solutions Manager, Large Partners Solutions Apps", "level": "Mid", "location": "Dublin, Ireland", "description": "As a Strategic Partner Development Manager, you'll open doors with potential partners, lead exploratory discussions and evaluate/develop business opportunities. You will lead cross-functional teams, provide thought leadership and serve as a mentor to managers and associates. You are comfortable escalating and presenting business development strategies and key issues to senior management. You'll work closely with Google Product, Engineering, Legal and Sales teams on new product initiatives and key strategic relationships that support our online advertising business. The Large Partners Solutions (LPS) Apps team is responsible for client relationships and business development with the largest ad-funded developers in EMEA, including those who use AdMob Mediation and Google Ad Manager to manage their in-app ad businesses. We collaborate closely with PM and cross-functional stakeholders to develop new approaches to increase our partners' usage of Google platforms, and the value they generate from them. We also support expansion into new content verticals who may not have used ads before, adding new business streams to their existing businesses. In this role, you will be part of a team focused on driving incremental business for the largest and most complex AdMob Apps and Gaming publishers in EMEA. In partnership with the Strategic Partner Manager(s) for our key clients, you will develop relationships with sophisticated users of AdMob Mediation and help them maximize the value the platform provides. The Global Partnerships organization is responsible for exploring new opportunities with Google's partners. Google’s Global Partnerships team works with a wide range of partners to bring the best of Google to power their business. The Global Partnerships team supports Google’s own Product teams with essential partnerships to help Google’s user experiences in advertising, Search, Assistant, Maps, Travel, Shopping, Payments and more. Teams create product-enabling partnerships, go-to-market strategies and incubate business growth for a variety of products.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in business development, partnerships, management consulting, or investment banking in the Consumer Electronics, Auto, OEMs, Telecom, E-Commerce/Retail, Apps, Ads, Gaming, or Technology industries. Experience working with C-level executives and cross-functionally across all levels of management. Experience managing agreements or partnership. Experience with apps ecosystem, business models, distribution channels, industry landscape, and developer success metrics.", "preferred_qualifications": "5 years of experience in the mobile or advertising space. Experience with AdMob Mediation or Google Ad Manager. Experience with development and release of mobile apps and associated tools and processes, such as game engines, analytics providers, and mobile measurement platforms. Demonstrated ability to work and navigate through ambiguity with little or no guidance.", "responsibilities": "Analyze data, trends, and partner performance to track operational metrics correlated to partner success. Consult with partners to understand their business and identify opportunities to expand and/or optimize ad business streams in their apps, owning their implementation in direct contact with the partner. Collaborate with specialist teams in our New Growth Services team to deliver value added services to partners and help quantify their impact. Collaborate with our ATS technical teams to implement solutions in partner applications. Innovate on new optimization approaches using Limited Access features and services only available to our largest AdMob clients.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/118696036037206726"}