{"title": "App and Measurement Specialist, Large Customer Sales", "level": "Mid", "location": "Shanghai, China", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience with measurement platforms, analytics, and attribution modeling. Ability to communicate in English and Mandarin fluently to support client relationship management in this region.", "preferred_qualifications": "Knowledge of measurement tools such as incrementality, attribution, or brand measurement. Knowledge of Appsflyer, Firebase or other App measurement tools. Understanding of the digital ad ecosystem and the impact of recent privacy changes in the industry (e.g., regulatory and technology). Understanding of data collection, integration, and activation in media platforms and privacy implications (e.g., website analytics, CRM onboarding, conversion tracking and import, audience management, consent management).", "responsibilities": "Lead measurement and privacy efforts in the Large Customer Sales team. Consult with advertisers and agency partners to understand their measurement goals and assess how Google measurement and privacy solutions can effectively address their needs. Partner with pods, gTech, and specialists to drive adoption of measurement and privacy solutions (e.g., GA4, OGT, Consent Mode, Enhanced Conversions, SKAN, etc.) and convince advertiser stakeholders to apply learnings, insights, and recommended actions. Build business cases for feature requests, controlling roadmap around Privacy features (e.g., modeled conversions, AC on iOS, etc.) and measurement solutions (e.g., Conversion Lift, GA4, etc.) and provide feedback loop to regional and global product leads in the area of Privacy. Enable clients and partners to increase efficiency and effectiveness of their Ad campaigns by integrating relevant first-party data-based conversions or audiences.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/118720309783077574"}