{"title": "Silicon ASIC Reliability Engineer", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "As a Reliability Engineer, you will play a key role in creating new consumer electronic products that meet a high bar for reliability and performance. You will work closely with the product management and design engineering teams to define standards, specify tests, and then supervise test execution and failure analysis.", "key_qualifications": "Bachelor's degree in Hardware Engineering, Electrical Engineering, Material Science, Physics, or equivalent practical experience. 6 years of experience in applying Design for Reliability techniques. Experience in ASIC industry and package reliability testing (e.g., HTOL, ELFR, ESD, LU, TC, THB, HAST). Experience in semiconductor device physics, transistor reliability physics, CMOS technology or manufacturing.", "preferred_qualifications": "Master's degree or PhD in Hardware Engineering, Electrical Engineering, Material Science, Physics, or equivalent practical experience. Experience in semiconductor device physics, transistor reliability physics (e.g., HCI, BTI, TDDB, EM), advanced CMOS technology, semiconductor materials, and manufacturing. Experience in ASIC devices and package reliability testing (e.g., HTOL, ELFR, ESD, LU, TC, THB, HAST) and reliability qualification of ICs according to JEDEC standards. Experience in statistical analysis (e.g., Design Expert, JMP, Weibull), lifetime, FIT, failure rate projection of semiconductor devices and components. Experience in semiconductor failure analysis tools such as SEM, TEM, FIB, EDX, CSAM, Nanoprobe, X-Ray imaging, De-encapsulation.", "responsibilities": "Define the custom ASIC reliability specifications based on JEDEC standards and Google product field usage conditions. Use statistical methods to estimate SOC life times. Execute ASIC chip-level reliability qualifications, covering ESD, LU, ELFR, and HTOL testing. Collaborate with multiple teams inside and outside of Google, such as CMOS foundries, OSATs, and third-party ASIC qualification facilities.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/118742425978970822"}