{"title": "Staff Mechanical Product Design Engineer, Platforms", "level": "Advanced", "location": "Sunnyvale, CA, USA", "description": "Our computational challenges are so big and unique we can't just buy our hardware, we've got to make it ourselves. Our Platforms Team designs and builds the hardware, software and networking technologies that power all of Google's services. As a Mechanical Engineer you design and evaluate our data center systems, identifying product requirements and contributing to research and project planning. From the chip to chiller, you are responsible for designing and optimizing an architecture that will scale with Google's continued growth.\n\nWith your technical expertise, you lead and manage projects, develop product and process improvements, provide consultation to others and help facilitate training and development.\n\nThe Platforms Infrastructure Engineering team designs and builds the hardware and software technologies that power Google's services.  The Mechanical Product Design Engineering team members work cross-functionally to design, build, and deploy technology to support the needs of compute, storage, networking, and machine learning hardware.\n\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.\n\nThe US base salary range for this full-time position is $168,000-$252,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "key_qualifications": "Bachelor's degree in Mechanical Engineering, Product Design, or related field, or equivalent practical experience.\n8 years of experience designing mechanical components such as plastic or metal parts, mechanical assemblies, printed circuit boards, or flexes.\n8 years of experience using computer-aided design tools such as 3D MCAD, NX, Creo, or Solidworks.", "preferred_qualifications": "Master's degree in Mechanical Engineering, Product Design, or related field, or equivalent practical experience.\n10 years of experience in design and analysis of electro-mechanical systems and products.\nExperience with mapping product-level requirements to physical IT designs and data center deployment processes/interfaces.\nExperience with mechanical (e.g., structural and thermal) analysis using finite element analysis (FEA).\nExperience with design and analysis for thermal engineering fundamentals with heat transfer and fluid dynamics.\nExperience with GPU systems and liquid cooling thermal solutions.", "responsibilities": "Own and design product design life-cycle, requirements gathering, concept generation, detailed design with analysis, verification testing, cross-functional reviews, and manufacturing release.\nDevelop and execute designs for systems backed by engineering analysis.\nCreate test plans, perform testing, and validate designs to meet engineering requirements. Troubleshoot, root cause, and resolve potential technical challenges.\nInfluence and shape future products by providing mechanical and product design engineering knowledge into the technology roadmap with data-driven decisions.\nProvide engineering knowledge and mentor team members.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/118760651672691398"}