{"title": "Software Engineering Manager, Search Growth", "level": "Mid", "location": "Belo Horizonte, State of Minas Gerais, Brazil", "description": "Like Google's own ambitions, the work of a Software Engineer (SWE) goes way beyond just Search. SWE Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of engineers. You not only optimize your own code but make sure engineers are able to optimize theirs. As a SWE Manager you manage your project goals, contribute to product strategy and help develop your team. SWE teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible. In Google Search, we're reimagining what it means to search for information – any way and anywhere. To do that, we need to solve complex engineering challenges and expand our infrastructure, while maintaining a universally accessible and useful experience that people around the world rely on. In joining the Search team, you'll have an opportunity to make an impact on billions of people globally.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). 1.5 years of experience in a leadership role (e.g., technical leadership or people management, supervision, or team leadership).", "preferred_qualifications": "Master's degree or PhD in Computer Science or a related technical field. 1 year of experience working in a complex, matrixed organization.", "responsibilities": "Set and communicate team priorities that support the broader organization's goals. Align strategy, processes, and decision-making across teams. Set clear expectations with individuals based on their level and role and aligned to the broader organization's goals. Meet regularly with individuals to discuss performance and development and provide feedback and coaching. Help develop and drive the short-term technical direction and roadmap within the scope of the team. Evolve the roadmap to meet anticipated future requirements and infrastructure needs. Design, guide, and vet systems designs within the scope of the broader area, and write product or system development code to solve ambiguous problems. Review code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/118859054742151878"}