{"title": "Data Center Technician", "level": "Early", "location": "Papillion, NE, USA", "description": "The Hardware Operations team is responsible for monitoring, maintaining and deploying the state-of-the-art physical infrastructure behind Google's powerful search technology. As a Data Center Technician, you'll deploy and maintain Google's advanced Data Center Server and Network Infrastructure. You'll also participate in or lead local project teams on larger installations and develop project contingency plans.\n\nIn this role, duties range from the physical deployment of data center-related technology to working closely with the various stakeholders. It will fall to you to ensure that our goals, missions and projects are successfully delivered, and, more importantly, that they are repeatable across our global array of data centers. This position offers a great introduction to the wider engineering world at Google. Depending of your area of interest, capabilities, and geographical mobility, you will have the opportunity to develop either within Hardware Operations or move towards software development, engineering, networking operations or our project management groups.\n\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "salary": "$81,000-$119,000 + bonus + equity + benefits", "key_qualifications": "Experience with troubleshooting hardware/network issues using Linux tools. Experience working within a data center or network operation center environment. Experience with troubleshooting and diagnosing computer, server, and network hardware.", "preferred_qualifications": "Experience with light coding or scripting. Experience in project management and leadership. Experience with networking protocols. Ability to collaborate and partner with teams to overcome issues.", "responsibilities": "Contribute to and lead efforts/projects in the deployment, maintenance, and support of current and new data center infrastructure. Participate in or lead complex troubleshooting and resolve critical or escalated technical issues. Test and troubleshoot new server hardware components and designs. Configure and troubleshoot Linux OS-related issues on servers. Deploy and maintain Google's advanced Data Center Server and Network Infrastructure.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/118862128596558534"}