{"title": "Business Performance Manager, Google Cloud", "level": "Mid", "location": "Bengaluru, Karnataka, India; Gurugram, Haryana, India", "description": "As a Business Performance Manager, you will be partnering across Strategy and Operations and the Functional Go-To-Market (GTM) teams to help with business insights and understanding core drivers of the partner business. As a result, you will drive an understanding of the business and facilitate core decisions. You will partner with teams such as the Small and Medium Businesses and Partners teams to understand business problems and evolving requirements. You will work to deliver practical but innovative solutions for real business benefit in a fast-paced environment. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Master's degree in a technical or scientific field of study or equivalent practical experience. 8 years of experience in a consulting and analytics role. Experience developing reporting portals (e.g., Looker, Data Studio, Plx, Tableau, Spotfire, etc.) for users with various security access levels and GTM/Enterprise Sales Software such as Salesforce, Anaplan. Experience with Enterprise Sales, Go-To-Market strategy, Partner/Ecosystem businesses, including managing Independent Software Vendors, System Integrators, Resellers and others.", "preferred_qualifications": "Experience partnering with business teams and influencing executive stakeholders in a matrixed organization. Knowledge of Cloud Industry, products, trends and dynamics. Ability to be flexible in a fast paced environment with limited direction, balance engaging priorities, and manage several time-sensitive projects at once.", "responsibilities": "Drive insights into Go-To-Market including monthly performance metrics as well as forward looking analytics. Establish cadence, requirements, approach, decision making principles for core metrics and standardization to run the business. Act as an advocate of information accuracy, including understanding business and core metrics. Work across business functions to standardize, define and implement business metrics and Key Performance Indicators. Make decisions on, and architect the framework for data and visualization assets (e.g., data sets, workflows, dashboards) to support the business.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/118898833655505606"}