{"title": "Head of Customer Success Acceleration", "level": "Advanced", "location": "Shanghai, China", "description": "gTech Global Customer Care (gGCC) is a solution-generating effort that helps our sales teams and advertisers. These solutions need to be scalable to support millions of customers worldwide. In addition to troubleshooting on the customer side, we work with Sales, Product, and Engineering teams within Google to develop better tools and services and improve our products based on the evolving needs of our users. As a cross-functional and global team, it's our job to help keep the lights on and the ads fresh. The gTech Ads GCS Customer Success Acceleration (CSA) team is designed to drive high value and impact for the largest small and medium businesses (MMS) in the GCS portfolio. We develop customer-centric strategy and solutions to meet the business/marketing objectives of our advertisers, leveraging deep expertise in cross-product solutioning, insights and measurement. Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 15 years of experience working in the Advertising or Media industry. 5 years of experience managing teams. Ability to communicate in English and Mandarin fluently to support client relationship management in this region.", "preferred_qualifications": "MBA degree. Experience in strategy consulting in a media or advertising industry. Knowledge of advertising solutions and the media landscape, both online and offline. Track record of successfully managing cross-functional and cross-regional partnerships. Ability to engage with and influence executive leadership with excellent communication skills.", "responsibilities": "Lead a team of high performing Digital Marketing Strategists who work collaboratively with GrCN Mid Market Sales teams. Achieve goals and growth objectives for multiple segments at the cluster/market level. Coach your team to support and help advertisers maximize Opportunities, improve performance and enhance ROI across Lead Generation, Ecommerce and Multi-channel businesses. Collaborate cross-functionally with Sales, Marketing, Product and Program Management teams to enable Google’s Go-to-Market strategy for Ads solutions across the Mid-Market segment of customers. Drive active partnership with Sales leadership to align priorities, address customer needs and achieve business goals, leveraging CSA service strategy (MoS, service segmentation).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/119073666943066822"}