{"title": "Product Manager, Identity Assurance", "level": "Mid", "location": "Mountain View, CA, USA", "description": "The Payments Identity team is the real world Identity Provider to Google's products. We enable users and businesses to provision their identities, verify them, and transact across the Google ecosystem across all first-party and third-party. We do this while understanding, modeling, and sharing the risk associated with every real world identity. We enable PaaS Identity and Payments features for every product area at Google. We work on initiatives like Transparency for all Ads, Election Advertiser verifications, GPay, One Merchant Experience, and more.  Our work underpins all Buyflows across Google (e.g., Ads, Google Cloud, Play, YouTube, Shopping, Store, etc.). We are the stewards for all user payments data and lead Payments Privacy, Payments Portals, and Customer Management. Whether it is paying online with Autofill, using tap and pay in stores, or using the Google Pay app, the Payments team at Google is focused on making payments simple, seamless, and secure. In addition to consumer payment technologies, the Payments team also powers the money movement between Google and its consumers and businesses.", "salary": "$122,000-$178,000 + bonus + equity + benefits", "key_qualifications": "Bachelors degree or equivalent practical experience. 3 years of experience in product management or related technical role. 1 years of payments industry experience. Experience driving elements of the product development lifecycle such as product outlook, go-to-market strategy, driving requirements, and product launch.", "preferred_qualifications": "Bachelor's or Master's degree in Computer Science or Engineering (e.g., CE, ME, IE, etc.) or equivalent. 1 year of experience in the Identity Verification/Assurance domain. Experience working for an e-commerce provider/e-commerce merchant managing providers that enable identity verification services, fraud services, or payment processing.", "responsibilities": "Lead the charge in defining the future of digital trust. Shape the product outlook and strategy for innovative identity verification, risk and authentication solutions that enable Google's users, businesses, and partners to be safe, compliant, and transparent. Empower users with seamless and secure experiences. Design and deliver identity assurance products that strike the perfect balance between user convenience and robust security, minimizing friction while maximizing protection. Drive product innovation from concept to reality. Collaborate with engineering, design, and other cross-functional teams to bring your product ideas to life, from ideation to launch and beyond. Be the customer advocate. Use feedback, trends, and competitor insights to guide product decisions. Advocate for data-driven decision-making. Leverage quantitative and qualitative data to measure product performance, identify areas for improvement, and drive continuous optimization.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/119145674015941318"}