{"title": "Global Partner Development Manager, System Integrator, Google Cloud", "level": "Advanced", "location": "Sunnyvale, CA, USA; Kirkland, WA, USA; Washington D.C., DC, USA; Remote eligible", "description": "As the Global Partner Development Manager, you will ensure that Google Cloud's products and solutions translate to a sound and relevant technology platform for our partners by leveraging their vertical and functional expertise. You will define the solution strategy, build a cross-functional team, create critical relationships with C-level partners, and showcase Google’s innovation and technology solutions to our potential customers. In this role, you will also work closely with Google Cloud sales leaders across all markets and be seen as a collaborative thought partner to ensure productive sales engagement across the globe. Additionally, you will partner with Product, Legal, Compliance, and Enablement to remove barriers and ensure flawless execution and success of the alliances. You'll help design go-to-market solutions and establish relationships with key executives within the Global Services Infrastructure organization. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$211,000-$300,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience; 15 years of experience in strategy consulting or go-to-market business development; 7 years of experience leveraging relationships with global system integrators; Experience managing executive stakeholders and product solutions", "preferred_qualifications": "Experience using Google technologies to develop businesses; Experience as an advisor to key technology decision makers on strategic plans; Understanding of how Global Technology stakeholders operate; Understanding of how the C-suite builds and views technology as a strategic asset to their business; Understanding of how to use cloud and mobile technology to generate strategic differentiation within the customers across industries and geographies; Ability to discuss collaboration, cloud, mobility technologies, trends and benefits with the C-suite, including an established network of contacts within the industry", "responsibilities": "Engage C-level stakeholders, foster relationships between Google leaders and partner executives across sales and engineering. Develop well thought out business plans and go-to-market strategies with a clear set of priorities, joint initiatives and specific goals for growing pipeline, wins, and consumption. Create compelling offerings with the partner by quantifying opportunities and making a business case for investments, as necessary. Create compelling offerings to help customers transform their businesses by leveraging the partner’s unique capabilities and optimizing Google Cloud technologies. Define, track, and analyze performance against specific measures of success for quantifiable, tangible progress.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/119293408006021830"}