{"title": "Information Security Engineer, Product Security Engineering, Cloud CISO", "level": "Mid", "location": "Kirkland, WA, USA; Seattle, WA, USA", "description": "There's no such thing as a \"safe system\" - only safer systems. Our Security team works to create and maintain the safest operating environment for Google's users and developers. As a Security Engineer, you help protect network boundaries, keep computer systems and network devices hardened against attacks and provide security services to protect highly sensitive data like passwords and customer information. Security Engineers work directly with network equipment and actively monitor our systems for attacks and intrusions. You also work with software engineers to proactively identify and fix security flaws and vulnerabilities.\\n\\nProduct Security Engineering is the team within the Cloud CISO organization responsible for helping ensure every product Cloud ships is as secure as it can be and increasing the assurance levels of security in the infrastructure underlying products. The team will also focus on increasing the capabilities of each product team to develop more secure products by design and by default from patterns, tools, and frameworks. As an information security engineer you will help to ensure that software and systems are designed and implemented to security standards. You will perform technical security assessments, code reviews, and vulnerability testing to highlight risk, helping Google teams and partners to improve security, and work on a wide variety of software designs and technology stacks.\\n\\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$136,000-$200,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience.\\n2 years of experience with security assessments or security design reviews or threat modeling.\\n2 years of experience with security engineering, computer and network security and security protocols.\\n2 years of coding experience in one or more general purpose languages.", "preferred_qualifications": "Experience with security consulting.\\nAbility to influence others.\\nExcellent communication skills.", "responsibilities": "Perform security reviews, research and reproduce vulnerabilities, design secure protocols and systems, and write tests.\\nReview and develop secure operational practices, and provide security guidance for engineers and support staff.\\nReview designs and look for vulnerabilities, both with one-time reviews and longer term engagements.\\nLook for vulnerabilities with techniques including reverse engineering and static analysis.\\nRespond to vulnerabilities with mitigation and hardening.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/119413542536258246"}