{"title": "Content Risk Management Program Analyst, Trust and Safety", "level": "Mid", "location": "Washington D.C., DC, USA", "description": "Trust and Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam, and account hijacking. As diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience in compliance, risk management, investigation, auditing, legal, or consulting.", "preferred_qualifications": "Experience with data visualization, business intelligence, or risk and compliance tools. Experience operationalizing or developing systematic structure within a complex environment, with excellent attention to detail, analytic capacity. Practical technical risk management expertise (e.g., risk and control assessments, risk measurement). Excellent project/program management, and verbal and written communication skills. Excellent problem-solving skills with attention to detail in an ever-changing environment.", "responsibilities": "Design and implement a systemic risk program including governance and oversight practices. Support execution and scaling of risk assessments across global products and functions. Support efforts to set and develop standards for risk identification and classification, measurement, risk appetite. and treatment strategies. Operationalize risk processes. Drive collaboration and alignment of risk initiatives with a broad range of Google-wide cross-functional partner teams to influence Google risk practices (e.g., Enterprise Risk Management, Legal, RCI, Product Areas). Establish a leadership presence with a global mindset and the ability to influence, inspire, and think holistically. Take initiative and utilize problem-solving skills and attention to detail.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/119497580013855430"}