{"title": "Principal Architect, Retail, Google Cloud (English, Mandarin)", "level": "Advanced", "location": "Taipei, Taiwan", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud...", "key_qualifications": "Bachelor's degree in Computer Science, a related technical field, or equivalent practical experience.\n10 years of experience as an enterprise architect in a cloud computing environment or customer-facing role.\nExperience in cloud computing, cloud market and engaged dynamics.\nAbility to communicate in English and Mandarin fluently as it is a customer-facing role that requires interactions in English and Mandarin with local stakeholders.", "preferred_qualifications": "Experience with structured enterprise architecture practices, hybrid cloud deployments, and on-premise-to-cloud migration deployments/roadmaps.\nExperience in building, architecting, designing, and implementing distributed global cloud-based systems, network infrastructure, security, and application development.\nExperience in enterprise technology buying and evaluation processes.\nUnderstanding of large-scale computing solutions.\nAbility to deliver results, work cross-functionally, engage/influence audiences, and identify expansion engagements.\nAbility to learn, understand, and work quickly with new emerging technologies, methodologies, and solutions in the Cloud/IT technology space.", "responsibilities": "Build a relationship with strategic accounts and engage with architects and C-level stakeholders.\nProvide domain expertise around public cloud and enterprise technology, and effectively promote Google Cloud with customers, at conferences, and online.\nMake recommendations to implement a complete solution providing best practice advice to customers to optimize Google Cloud effectiveness.\nManage the enterprise architecture relationship with customers by collaborating with specialists, product management, engineering, and more.\nIdentify customer priorities and technical objections, and design strategies to deliver business value and resolve blockers.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/119417430018532038"}