{"title": "Technical Program Manager III, Chrome OS Platform", "level": "Mid", "location": "San Jose, CA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company. We partner with OEMs to bring innovative products to life, from concept to customer launch. In this role, you will lead the program management and technical execution of new Platforms and Chrome OS devices. Chrome OS delivers quality computing at scale to provide universal and unfettered access to information, entertainment, and tools. Our mission is to empower anyone to create and access information freely through fast, secure, simple, and intelligent computing. The US base salary range for this full-time position is $142,000-$211,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits.", "key_qualifications": "Bachelor's degree in a technical field, or equivalent practical experience. 5 years of experience in program management. 3 years of client-facing experience in partner and stakeholder relationship management. 3 years of experience in consumer electronics or hardware.", "preferred_qualifications": "5 years of experience managing cross-functional or cross-team projects. Engineering experience on complex hardware and software systems. Experience with Chrome OS and hardware bring-up. Knowledge of SoC Architecture.", "responsibilities": "Own the entire life-cycle from initial concept to final OEM product launch, driving both hardware and software development. Collaborate with product managers to shape the Chrome OS roadmap, allocate resources, create detailed project plans, and track progress. Partner with internal engineering teams, external partners, and OEM/ODMs to deliver high-quality devices on time and within budget. Work with cross-functional teams to thoroughly test devices, manage bug triage, and support ongoing Chrome OS updates. Develop efficient tools and processes to enhance engineering productivity and streamline device bring-up.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/119413977066152646"}