{"title": "Product Manager II, Google Tensor", "level": "Mid", "location": "Mountain View, CA, USA", "description": "At Google, we put our users first. The world is always changing, so we need Product Managers who are continuously adapting and excited to work on products that affect millions of people every day. In this role, you will work cross-functionally to guide products from conception to launch by connecting the technical and business worlds.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in product management or related technical role. 2 years of experience taking technical products from conception to launch. Experience with machine learning or software (memory performance, CPU scheduling) or hardware (system architecture) in mobile platforms.", "preferred_qualifications": "Master's degree in a technology or business related field. 3 years of experience in a role preparing and delivering technical presentations to senior leadership. 2 years of experience in software development or engineering. 2 years of experience working cross-functionally with engineering, UX/UI, sales finance, and other stakeholders. 1 year of experience in technical leadership. Familiarity with mobile computing constraints, OS and Software frameworks/tools, and software development life cycles.", "responsibilities": "Collaborate with Pixel and Android partners to identify compute Critical User Journeys (CUJs) and corresponding workloads that drive the performance requirements for the flagship Pixel phones. Prioritize these CUJs/Workloads and partner with the cross-functional engineering teams for deeper understanding and analysis of the performance limiters (KPIs). Define differentiated and compelling silicon solutions and roadmap that leverage Google’s hardware, software, research, and ML capabilities. Co-work with marketing, engineering, legal, and multiple cross functional teams for product and feature launches enabled with Google Tensor.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/119608145558282950"}