{"title": "Performance Design Verification Lead, Silicon", "level": "Advanced", "location": "Bengaluru, Karnataka, India", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration. Google's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "key_qualifications": "Bachelor's degree in Electrical Engineering or Computer Science, or equivalent practical experience. 8 years of experience in SoC design/verification. Experience in verifying digital logic at the Register Transfer Level (RTL) using SystemVerilog at subsystem or full chip level. Experience in leading a mobile SoC performance model development, performance analysis, and workload characterization.", "preferred_qualifications": "Experience in microarchitecture innovation. Knowledge of CPU, Graphics Processing Unit (GPU) benchmark characterization. Knowledge of system software components, such as Linux, drivers, and runtime. Knowledge of performance analysis tools.", "responsibilities": "Develop simulators and architectural models of Google's Tensor System on a chip (SoC). Collaborate with system architects, SoC and CPU/GPU/Tensor Processing Unit (TPU) architects/designers, and software and application experts to understand current and future requirements. Participate in architectural and design evaluation of Tensor SoC features studies. Perform pre-silicon performance simulation and correlate with pre and post-silicon measurements. Communicate analysis results qualitatively and quantitatively.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/119637626549347014"}