{"title": "Senior SoC Design Verification Engineer, Google Cloud", "level": "Mid", "location": "Tel Aviv, Israel; Haifa, Israel", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.", "key_qualifications": "Bachelor's degree in Electrical Engineering or equivalent practical experience. 5 years of experience with creating and using verification components and environments in standard verification methodology. Experience verifying digital systems using standard IP components/interconnects (microprocessor cores, hierarchical memory subsystems). Experience verifying digital logic at RTL level using SystemVerilog or Specman/E for FPGAs or ASICs.", "preferred_qualifications": "Master's or PhD degree in Electrical Engineering. Experience with verification techniques, and the full verification life cycle. Experience with performance verification of ASICs and ASIC components. Experience with ASIC standard interfaces and memory system architecture. Experience in 4 or more SOC cycles.", "responsibilities": "Plan the verification of digital design blocks by fully understanding the design specification and interacting with design engineers to identify important verification scenarios. Create and enhance constrained-random verification environments using SystemVerilog and UVM, or formally verify designs with SVA and industry-leading formal tools. Identify and write all types of coverage measures for corner-cases. Debug tests with design engineers to deliver functionally correct design blocks. Close coverage measures to identify verification holes and to show progress towards tape-out.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/119619416961753798"}