{"title": "Technical Program Manager, Technical Infrastructure", "level": "Mid", "location": "Sunnyvale, CA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’re equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us.", "key_qualifications": "Bachelor's degree in a technical field, or equivalent practical experience. 2 years of experience with systems engineering and mission critical or adjacent industries. 2 years of experience managing projects.", "preferred_qualifications": "Knowledge of financial analysis including Total Cost Ownership. Knowledge of data center infrastructure. Ability to forecast resource requirements in a data-driven way. Excellent communication skills, with the ability to tailor format and style to match the situation whether in person, emails, documents, or presentations. Excellent data analysis, risk assessment, and problem-solving skills.", "responsibilities": "Collaborate with engineering, supply chain, and project execution to develop market requirement documentation. Provide Technical Program Management support for several concurrent projects that span mechanical engineering, electrical engineering, systems engineering, and controls. Design and ensure effective execution of the interface between project teams and equipment vendors, including readiness reviews with cross-functional teams.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/119782076701385414"}