{"title": "Administrative Business Partner, Global Procurement Organization", "level": "Mid", "location": "Chicago, IL, USA", "description": "As an Administrative Business Partner, you're at the heart of your team's business operations and activities and the soul that keeps your team moving forward. You anticipate the needs of your managers and team members and help them stay focused on their projects by resolving operational and administrative issues before they arise. You move quickly with the changing environment and are up to date with the latest Google products and services. You also use that knowledge to strategically support your team's projects. In addition to being organized and analytical, you possess the strong business judgment and communication skills needed to interact with a variety of people and job functions. Administrative jobs at Google are staffed by organized and dependable people driven by a common company goal: to help us accomplish great things. Working behind the scenes, we make a significant impact on the people we support as well as on Google users around the world. We're adept at leading and managing a variety of simultaneous projects, which requires the particular talent of being able to communicate effectively with all levels of the organization.", "salary": "$90,500-$132,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 3 years of administrative experience in a high-tech or international environment working on core administrative tasks (e.g., travel management, expense reports, calendar management, facilities coordination, etc.).", "preferred_qualifications": "6 years of administrative experience supporting executive-level management in a corporate environment, and managing small-scale projects and events from pre-planning to execution. Experience supporting global teams across multiple time zones. Ability to effectively communicate and collaborate with a diverse range of people and job functions. Ability to operate autonomously and establish structure, identifying problems and effectively implementing solutions. Ability to adhere to an expectation of complete confidentiality on all business matters. Excellent organizational skills, with an ability to think strategically and prioritize often engaging tasks.", "responsibilities": "Perform an extensive array of administrative tasks (i.e., manage busy calendars, book travel, create expense reports, organize events, and schedule facilities and equipment). Manage calendars, anticipating scheduling conflicts, and proposing effective solutions to ensure smooth operations and maximize productivity. Build efficiency and effective responsiveness into existing operations, and help define new operational strategies with the executives and the teams they manage, as well as within the admin community. Lead or co-lead projects and initiatives of different magnitude. Plan, manage and execute events from team events (digital and in person), all team meetings, leadership forums and other celebrations and milestones. Manage office space needs, coordinate moves/desk assignment, and maintain efficient office operations. Build relationships, fostering strong connections with other A/EBPs and business leaders across the organization.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/119804927873557190"}