{"title": "Program Manager II, Strategy and Operations, Consumer Hardware", "level": "Mid", "location": "Mountain View, CA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "salary": "$117,000-$172,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n2 years of experience in program or project management.\nExperience working on Strategy and Operations with cross-functional partners.", "preferred_qualifications": "MBA or Master's degree in engineering, operations, or analytics.\n2 years of experience managing cross-functional or cross-team projects.\nExperience driving process improvement with change management and execution.\nExperience in Supply Chain and Operations or Management Consulting.\nKnowledge of financial analysis, budgeting, return on investments (ROI) process as it relates to Supply Chain.", "responsibilities": "Drive formulation of the annual strategy by aggregating inputs from business and operations leads.\nLead prioritization, governance, and reporting of key initiatives with Global Operations leadership as an outcome of annual strategy formulation.\nLead development of annual organization-wide communication by developing the narrative and messaging to communicate the strategy and direction to the broader organization in liaison with cross-functional teams.\nCollaborate with functional strategy leads and chiefs of staff to have a unified view of strategic priorities and operational performance in a dynamic and changing environment.\nLead cross-functional strategic initiatives for supply chain and operations organization to build scalable processes, tools, capabilities, and systems.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/119969247618048710"}