{"title": "Staff Wireless Cross-Device Experience Engineer, Pixel", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in software development, and with data structures/algorithms. 5 years of experience testing, and launching software products, and 3 years of experience with software design and architecture. 3 years of experience in WiFi domain and software development (e.g., WiFi Aware or NAN protocols).", "preferred_qualifications": "Master’s degree or PhD in Engineering, Computer Science, or a related technical field. 3 years of experience in a technical leadership role leading project teams and setting technical direction. 3 years of experience with connectivity technologies such as Bluetooth or Ultra-wide band (UWB). 3 years of experience working in an organization involving cross-functional or cross-business projects. 3 years of experience in a technical leadership role, with the ability to code in one more language (e.g., Java, Kotlin, C++). Experience with Android (e.g., Open Source, app development, or Android systems).", "responsibilities": "Provide technical leadership on projects. Influence and coach a distributed team of engineers. Support alignment and clarity across teams on goals, outcomes, and timelines. Manage project priorities, deadlines, and deliverables. Design, develop, test, deploy, maintain, and enhance software solutions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/119939649991779014"}