{"title": "Technical Program Manager III, Security, Google Public Sector", "level": "Advanced", "location": "Reston, VA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.", "key_qualifications": "Bachelor's degree in a technical field or equivalent practical experience. 8 years of experience in a technical consulting or leadership capacity supporting U.S. Federal Government contracts. 8 years of experience in technical program management and implementing cross domain systems. Active US Government Top Secret/Sensitive Compartmentalized Information (TS/SCI) security clearance with polygraph.", "preferred_qualifications": "10 years of experience delivering and integrating systems to include hardware and software architecture design. 5 years of experience with cloud computing platforms. Experience in compliance, information security, IT audit, or risk management in the Unites States Federal Government Assessment and Authorization process. Experience engaging with regulators to shape technical regulatory requirements impacting the compliance of Google Cloud Products and Services. Experience with cross domains solution technologies.", "responsibilities": "Provide technical program management of multi-functional programs, covering program planning, delivery assurance, tracking and reporting. Influence the direction of security services and capabilities within a large technical organization. Partner with Google Public Sector and Google engineering, compliance, and operations teams to design and implement new program processes to support US Government engagements. Use technical judgment to drive project delivery, technology reviews, challenge proposals and artifacts while building consensus. Leverage your expertise in enterprise IT and Cloud systems architecture design and management to ensure our customers gain the most benefit from Google Cloud products and services.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/119915631930680006"}