{"title": "Technical Solutions Engineer, Serverless, Google Cloud", "level": "Mid", "location": "Bengaluru, Karnataka, India; Pune, Maharashtra, India", "description": "The Google Cloud team helps companies, schools, and government seamlessly make the switch to Google products and supports them along the way. You listen to the customer and swiftly problem-solve technical issues to show how our products can make businesses more productive, collaborative, and innovative. You work closely with a cross-functional team of web developers and systems administrators, not to mention a variety of both regional and international customers. Your relationships with customers are crucial in helping Google grow its Cloud business and helping companies around the world innovate.Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree in the field of Science, Technology, Engineering, Math or equivalent practical experience. 4 years of experience coding in a general purpose coding language or in system design, and troubleshooting and advocating for customers' needs, and triaging technical issues. Experience with Linux/Unix or Windows systems, from the kernel to the shell, file systems, and client-server protocols and experience in reading/debugging code and in virtualization and orchestration frameworks. Ability to communicate in English fluently in order to communicate in this customer-facing role.", "preferred_qualifications": "Experience debugging complex workload issues across large-scale, multi-node environments. Experience with exploratory kernel debugging and performance analysis of containerized systems. Experience in Computer Networking (e.g., TCP/IP, Routing, Load balancing, etc.). Experience working with any public cloud (i.e., GCP, AWS, and Azure) services and infrastructure. Understanding of basic web technologies (e.g., HTTP, HTML, DNS, TCP, etc.)", "responsibilities": "Work with customers on their production Serverless deployments to resolve issues and achieve product readiness, availability, and scale. Develop an in-depth understanding of Google Cloud's Serverless product technology and underlying architectures by troubleshooting, reproducing, and determining the root cause for customer-reported issues, building tools, and faster diagnosis. Act as consultant and subject matter expert for internal stakeholders in engineering, sales, and customer organizations to resolve technical deployment obstacles and improve Google Cloud. Work as part of a team of engineers/consultants that globally ensure 24-hour customer support. This will include a need to sometimes work non-standard work hours/shifts, and may include weekend work. Understand customer issues, advocate for their needs with internal teams, including product and engineering teams, to find ways to improve the product, and drive production.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/120083871503917766"}