{"title": "Research Scientist, Google Assistant", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "As an organization, Google maintains a portfolio of research projects driven by fundamental research, new product innovation, product contribution and infrastructure goals, while providing individuals and teams the freedom to emphasize specific types of work. As a Research Scientist, you'll setup large-scale tests and deploy promising ideas quickly and broadly, managing deadlines and deliverables while applying the latest theories to develop new and improved products, processes, or technologies. From creating experiments and prototyping implementations to designing new architectures, our research scientists work on real-world problems that span the breadth of computer science, such as machine (and deep) learning, data mining, natural language processing, hardware and software performance analysis, improving compilers for mobile platforms, as well as core search and much more. As a Research Scientist, you'll also actively contribute to the wider research community by sharing and publishing your findings, with ideas inspired by internal projects as well as from collaborations with research programs at partner universities and technical institutes all over the world. Research emerging AI topics in NLP, such as data/modeling strategies with LLMs, design of LLM-agents to orchestrate tools usage, multilingual understanding, multi-turn/multi-user context understanding, LLM training recipes (e.g., architectures, augmentation, reward-alignment), and model optimization/efficiency. In this role, you will work with researchers, and cross-functional teams to address AI challenges, collaborate on POCs with novel ML techniques, and scale the POCs to demonstrate feasibility and potential impact. You will contribute to the technical direction of the team and participate in the broader ML research community.", "salary": "", "key_qualifications": "PhD degree in Computer Science, a related field, or equivalent practical experience. One or more scientific publication submission(s) for conferences, journals, or public repositories.", "preferred_qualifications": "Experience with NLU for multi-turn dialog/context, LLMs for modeling actions/APIs, Aligning LLMs with rewards, novel data/training recipes for domain adaptation. Experience in modeling strategies with LLMs, and design of LLM-agents to orchestrate tool usage. Experience in ML Operations, ML infrastructure, Search/Assistant or with related technologies. Experience with research communities, including publishing in forums (e.g., ACL, EMNLP, NeurIPS, ICML). Experience with PAX, JAX, or TensorFlow.", "responsibilities": "Author research papers to share and generate impact of research results across the team and in the research community. Help in growing research business across teams by sharing research trends and best practices within the community. Define the data structure, framework, design, and evaluation metrics for research solution development and implementation, and identify timelines and obtain resources. Identify new and upcoming research areas by interacting with potential external and internal collaborators, and help in developing long-term research strategy and plans to expand the impact of Google research with some guidance. Contribute to conducting experiments based on research questions, develop research prototypes or conduct simulations to further evaluate the impact of research, finalize hypotheses, and refine the research methodology.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/120130255741428422"}