{"title": "Performance Verification Engineer, Silicon", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration. Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "salary": "", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Engineering, Computer Science, or equivalent practical experience. 8 years of experience in performance verification of ASIC components. Experience verifying digital logic using SystemVerilog for FPGAs and ASICs.", "preferred_qualifications": "Experience with post silicon validation or verification techniques. Experience with image processing, computer vision, or machine learning applications. Experience creating/using verification components and environments in methodology (e.g., VMM, OVM, UVM). Experience in using scripting languages such as Perl or Python. Familiarity with ASIC standard interfaces and memory system architecture.", "responsibilities": "Develop benchmarks to validate the Tensor Processing Unit (TPU). Collaborate with TPU architects/designers to ensure performance requirements are being met. Perform pre-silicon performance simulation and correlate with pre and post-silicon measurements. Communicate analysis results qualitatively and quantitatively.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/120256421815034566"}