{"title": "Senior Product Manager, Geo", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "At Google, we put our users first. The world is always changing, so we need Product Managers who are continuously adapting and excited to work on products that affect millions of people every day. In this role, you will work cross-functionally to guide products from conception to launch by connecting the technical and business worlds. You can break down complex problems into steps that drive product development. One of the many reasons Google consistently brings innovative, world-changing products to market is because of the collaborative work we do in Product Management. Our team works closely with creative engineers, designers, marketers, etc. to help design and develop technologies that improve access to the world's information.  We're responsible for guiding products throughout the execution cycle, focusing specifically on analyzing, positioning, packaging, promoting, and tailoring our solutions to our users. The Geo team is focused on building the most accurate, comprehensive, and useful maps for our users, through products like Maps, Earth, Street View, Google Maps Platform, and more. Every month, more than a billion people rely on Maps services to explore the world and navigate their daily lives. The Geo team also enables developers to use the power of Google Maps platforms to enhance their apps and websites. As they plot a course for the future of mapping, they are solving complex computer science problems, designing beautiful and intuitive product experiences, and improving our understanding of the real world.", "salary": "$168,000-$252,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in product management or related technical role. 3 years of experience taking technical products from conception to launch.", "preferred_qualifications": "Master's degree in a technology or business related field. 5 years of experience working cross-functionally with engineering, UX/UI, sales finance, and other stakeholders. 5 years of experience in a business function or role (e.g., strategic marketing, business operations, consulting). 4 years of experience in a role preparing and delivering technical presentations to senior leadership. 3 years of experience in software development or engineering. 3 years of people management experience with direct reports, and in technical leadership.", "responsibilities": "Lead PRDs by collaborating with partner teams (e.g., engineers, PgMs, UX) during product design and development to implement the requirements to turn PRDs into OKRs for multiple teams. Own and define project roadmaps. Drive development and secure buy-in for a product vision that identifies, defines, and supports the overall product narrative and direction, achieving an outcome that is greater than the sum of its parts. Manage validation of market size and opportunity (e.g., user-based, strategic opportunity, revenue). Lead and harmonize processes to define, identify, collect, and track appropriate product or business metrics, both quantitative and qualitative for new or existing products or business ventures.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/120214135177650886"}