{"title": "Senior Account Manager, Large Customer Sales (Hebrew, English)", "level": "Mid", "location": "Dublin, Ireland", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.\n\nOur Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of advertising, consultative sales, business development, online media environment, or marketing role. Ability to communicate in Hebrew and English fluently to support client relationship management in this market.", "preferred_qualifications": "Experience with Google solutions (e.g.,Search, Video, Display, Apps). Experience working in the area of data analysis, highly analytical with excellent problem-solving and research skills. Knowledge of online marketing strategy and tactics. Expertise in managing digital advertising campaigns with a focus on performance marketing. Ability to seek additional business development opportunities. Ability to own a portfolio in an advertising or media sales context and consistently overachieve quotas to drive growth. Excellent attention to detail, organized and thorough with desire for continuous improvement.", "responsibilities": "Deliver against ambitious quarterly business and product growth goals. Own a portfolio of large complex businesses by managing trusted relationships with clients, developing a thorough understanding of their business, identifying opportunities for growth, and managing risks. Drive customers value and ensure growth of their business by delivering outstanding customer sales experience and achieving customer business and marketing objectives. Act as the primary client point of contact on media planning, delivery, and performance of Google Media across Google platforms. Ensure high performance and measure the impact of the most complex and high value campaigns. Go above and beyond service excellence to showcase clients' business value and encourage future growth of our partnerships. Own and orchestrate engagement of relevant Google teams in all problem solving, troubleshooting, client campaign requests, media planning, and key implementation.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/120349819368547014"}