{"title": "Workday Solutions Consultant", "level": "Mid", "location": "London, UK", "description": "Google's known for our innovative technologies, products and services -- and for the people behind them. Whether you are making our staffing systems more efficient, planning for our growth, building relationships on college campuses or cultivating the next generation of computer scientists, you have an eye on the staffing needs of Google and the broader hiring landscape. You are focused on cultivating outstanding candidates for Google's long-term hiring needs, and work across a cross-functional and international group of staffing teams. You are both scrappy and resourceful, creative and driven -- and excited to share the magic of working at Google.", "key_qualifications": "Bachelor's degree or equivalent practical experience. Certification in Workday HCM and Reporting, Talent, Performance, Advanced Compensation, or Absence Management modules. 5 years of experience in Workday administration, implementation, or system configuration.", "preferred_qualifications": "Experience with Global HR and Payroll (e.g., HCM administration). Experience with SaaS HR system configuration. Ability to analyze and understand complex problems and their resulting dependencies. Ability to work across geographies and different regulatory environments. Exceptional attention to detail, time management, and multitasking skills.", "responsibilities": "Be responsible for the business-side management of Google’s Human Capital Management system in partnership with People Operations (POps) and Engineering which includes software update management, solution design, configuration, training, communications, and feature roadmap prioritization. Own and drive stakeholder engagement across POps teams, raising product awareness, establishing and acting upon feedback from stakeholders. Ensuring Workday is aligned to HR best practice. Create and maintain project plans, schedules and other key documents that keep the project on track for successful execution and on-time delivery. Understand and represent the customer in identifying and prioritizing functionality enhancements, including international users. Identify and implement improvements to team quality assurance processes and create detailed product requirements documents illustrating new proposed system features in a clear and logical manner while partnering with Engineering, Product Management and Vendors to translate requirements into reality.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/120358323873555142"}