{"title": "Technical Program Manager, Energy Contracts and Asset Management", "level": "Mid", "location": "Paris, France", "description": "Google's projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You're equally at home explaining your team's analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.\n\nUsing your extensive technical and leadership expertise, you manage projects of various size and scope, identifying future opportunities, improving processes and driving the technical directions of your programs.\n\nAs an Energy Contracts and Asset Management Technical Program Manager on the Portfolio Management team, you will lead individual strategic initiatives and projects and work with teams across the company in support of Google's global data center energy portfolio, including our efforts to reach 24/7 carbon-free energy and other clean energy objectives. In particular, this position will focus on operational management of energy contracts, conducting portfolio analysis, generating actionable insights, and proactively identifying improvements that support portfolio operations.\n\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "salary": "", "key_qualifications": "Bachelor's degree in Finance, Math, Statistics or Engineering or equivalent practical experience. 5 years of experience in electricity tariffs, rate structures, wholesale energy market contracts, energy portfolio operations, or energy contract management. 2 years of experience in program management. Experience building SQL based queries, creating dashboards and reports and converting data into insightful actionable information.", "preferred_qualifications": "Master's degree. Experience in wholesale electricity markets, utility tariffs, and Power Purchase Agreements in multiple regions. Experience in Python and understanding of applied and financial mathematics concepts and techniques (including statistical techniques) with direct experience performing quantitative analysis. Excellent cross-functional collaboration and ability to coordinate with energy experts and non-experts alike; lead projects requiring inputs from multiple teams.", "responsibilities": "Work with internal and external parties to maximize the value of Google’s energy contracts, while ensuring contractual performance metrics are being met. Assist in calculation of portfolio profit and loss, tracking, reporting, and forecasting on energy portfolio performance and attribution, quantifying drivers of spend, etc. Project management activities for strategic projects and initiatives relating to our portfolio operations, interface with a variety of team members and cross-functional partners on topics related to utility tariffs, rate structures, long-term renewable energy agreements, and contract management. Interpret, analyze, communicate, and resolve complex issues that arise during contract management such as team majeure, non-compliance, regulatory requirements, market and payment operations, etc. Review and operationalization of contracts while driving efficiencies through data-driven analysis and continued process improvement.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/120477554850046662"}