{"title": "Program Manager III, Data Center Hardware Integration, Cloud", "level": "Mid", "location": "Atlanta, GA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.", "salary": "$139,000-$207,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n5 years of experience in program or project management.\n5 years of experience in data center operations.", "preferred_qualifications": "5 years of experience managing cross-functional or cross-team projects.\nExperience within an organizational setting (e.g., PMO, geographic dispersion, etc.).\nAbility to present materials to a range of partners on both technical and non-technical matters.\nExcellent communication, project and stakeholder management skills.", "responsibilities": "Work with customer technical leads, executives, and partners to manage and deliver infrastructure solutions.\nWork with operations managers, data center technicians, and partner teams in order to execute existing processes, improve processes, and identify efficiencies that can be implemented.\nBecome a trusted expert in data center infrastructure solutions, and provide operational and technical advice around technologies.\nChannel customers’ feedback to the delivery project management team to ensure a positive experience.\nDevelop best practice recommendations based on experience gained during customer engagements.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/120660241820852934"}