{"title": "Data Center Facilities Manager", "level": "Advanced", "location": "Ciudad de la Costa Canelones Department, Uruguay", "description": "The Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facility Technicians at Google data centers operate, monitor and support physical facilities conditions. Some duties will include heating and cooling of air and water, power supply, generators, UPS systems, electrical distribution and control and monitoring systems. You regularly help inspect, maintain and repair various data center systems such as piping and non-critical electrical or mechanical system components). You'll provide daily assistance to senior technicians as you read blueprints/schematics, conduct tours of systems and assess their working order. You will develop creative approaches to reducing operational costs while improving overall data center efficiency. You ensure that environmental and safety standards are consistently met, identifying problems and making repairs quickly In emergency situations or abnormal conditions, you manage data center performance issues and outages to minimize the recovery time from failures. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 7 years of experience in critical facilities management (e.g., facility, technical, and team management). Experience working as a facilities manager or chief engineer.", "preferred_qualifications": "Experience in mission critical systems operations (e.g., power generation, data center, refinery, chip fabrication, chemical processing, or other high consequence environments). Experience in collaborating with other business units to meet company goals and standards. Understanding of the operations and maintenance of electrical, control systems, and mechanical systems in a data center environment. Ability to develop and grow team members through coaching, mentoring, and training. Excellent people management and leadership skills.", "responsibilities": "Plan and execute campus operational budgets, expense forecasting, and manage established budgets. Integrate Google-wide strategy and execution with internal and external business partners. Create strategy for cost-effective operations, focused on total cost of management. Demonstrate thinking and innovation in approaching traditional data centers and emergent issues. Build Operations team and lead campus turn up of a greenfield data center.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/120656531573088966"}