{"title": "Trưởng ngành hàng, Khối Khách hàng chiến lược", "level": "Advanced", "location": "Ho Chi Minh City, Vietnam", "description": "Những doanh nghiệp hợp tác với Google thuộc đủ loại hình, quy mô và giá trị vốn hoá thị trường, trong khi đó, mỗi doanh nghiệp cần có một chiến lược và giải pháp quảng cáo khác nhau. Kiến thức về truyền thông trực tuyến kết hợp với các kỹ năng giao tiếp và năng lực phân tích của bạn sẽ giúp định hình đường hướng phát triển cho cả doanh nghiệp mới lẫn doanh nghiệp hiện hữu. Bằng kỹ năng tạo dựng mối quan hệ, bạn sẽ cung cấp dịch vụ khách hàng, các nghiên cứu và phân tích thị trường theo các tiêu chuẩn chất lượng của Google. Bạn sẽ đưa ra dự đoán về cách đưa ra quyết định, không ngừng tìm tòi và khám phá nhu cầu kinh doanh từ phía các khách hàng chiến lược quan trọng của Google, đồng thời tìm hiểu xem các sản phẩm của Google có thể giúp họ phát triển hoạt động kinh doanh ra sao. Trong quá trình làm việc với khách hàng, bạn sẽ đề ra tầm nhìn và chiến lược để giúp quảng cáo của họ có thể tiếp cận hàng nghìn người dùng.\n\nKhi đảm nhận vai trò này, bạn sẽ định hướng và dẫn dắt đội ngũ bán hàng và các phòng ban liên ngành để thúc đẩy một hệ sinh thái quảng cáo lớn mạnh cho thị trường Việt Nam. Bạn sẽ cộng tác và phối hợp chéo với các phòng ban cũng như xuyên quốc gia để tập hợp đội ngũ phụ trách cho từng khách hàng chiến lược trong ngành Bán lẻ, Viễn thông và Tập đoàn, nhằm phát triển các mối quan hệ chiến lược lâu dài.\n\nKhối Khách hàng chiến lược của chúng tôi hợp tác chặt chẽ với nhiều nhà quảng cáo và công ty quảng cáo lớn nhất thế giới nhằm phát triển những giải pháp kỹ thuật số giúp xây dựng doanh nghiệp và thương hiệu. Chúng tôi nắm giữ góc nhìn toàn cảnh về sự chuyển đổi mạnh mẽ trong bối cảnh hoạt động quảng cáo chuyển dịch sang các nền tảng di động và trực tuyến. Chúng tôi ở một vị thế đặc biệt, có thể giúp định hình cách các công ty phát triển trong thời đại số. Chúng tôi tư vấn cho khách hàng về đa dạng sản phẩm của Google trên mạng tìm kiếm, nền tảng video và thiết bị di động để giúp họ kết nối tức thì và liền mạch với tập khán giả mục tiêu của họ.", "salary": "", "key_qualifications": "Bằng cử nhân hoặc kinh nghiệm thực tế tương đương. 11 năm kinh nghiệm trong lĩnh vực quảng cáo, tư vấn bán hàng, phát triển kinh doanh hoặc công nghệ thông tin, hoặc 8 năm kinh nghiệm với bằng cấp sau đại học. Có kinh nghiệm trong lĩnh vực quản lý con người. Có khả năng giao tiếp thông thạo bằng cả tiếng Anh và tiếng Việt để giao tiếp và phục vụ các bên liên quan trọng yếu trong thị trường.", "preferred_qualifications": "Kinh nghiệm lãnh đạo bán hàng, quản lý đội nhóm hiệu suất cao, cũng như thúc đẩy tăng trưởng kinh doanh mang tính đột phá. Kinh nghiệm quản lý và tác động đến các lãnh đạo cấp cao của khách hàng và các bên liên quan khác. Khả năng hoàn thành mục tiêu trong môi trường làm việc đa quốc gia và nhiều phòng ban phối hợp. Kinh nghiệm xây dựng thương hiệu và khả năng phối hợp cùng các đối tác nội bộ lẫn bên ngoài đến từ những nền văn hoá và khu vực địa lý đa dạng. Kinh nghiệm lãnh đạo tư tưởng và tạo dựng các mối quan hệ uy tín cả trong nội bộ lẫn bên ngoài, cũng như khả năng tác động đến những quyết định trọng yếu và thúc đẩy sự đồng thuận về các ưu tiên chính.", "responsibilities": "Xây dựng lộ trình, phát triển chiến lược, và quản lý việc thực thi trong toàn bộ đội ngũ để tối đa hoá tiềm năng hỗ trợ khách hàng. Thấu hiểu sâu sắc nhu cầu kinh doanh của các nhà quảng cáo trong ngành, đồng thời cung cấp thông tin chi tiết về hành vi tiêu dùng liên quan nhằm đưa ra những sáng kiến thúc đẩy tăng trưởng. Tạo và triển khai các chiến lược tăng trưởng kinh doanh, kế hoạch hằng năm và kế hoạch phát triển khách hàng, cũng như quy trình kinh doanh cho ngành mà mình phụ trách. Thiết lập và duy trì mối quan hệ chiến lược cấp cao với các khách hàng và công ty quảng cáo, đồng thời chủ động đề xuất các giải pháp của Google. Xây dựng và quản lý một đội ngũ chuyên mang đến những giải pháp đột phá, tập trung vào doanh nghiệp, đồng thời nuôi dưỡng văn hoá hướng đến sự đổi mới trong kinh doanh và sự thành công của khách hàng. Huấn luyện, khuyến khích, truyền cảm hứng và phát triển một đội ngũ gồm các Quản lý ngành hàng chiến lược, Quản lý khách hàng chiến lược cũng như những thành viên liên ngành. Đại diện cho Google với vai trò là diễn giả chủ chốt tại các sự kiện ngành, phát triển thương hiệu của Google và xác định đối tác tiềm năng.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/120624413130269382"}