{"title": "App Solutions Lead, Sales (Fixed Term Contract)", "level": "Mid", "location": "Zürich, Switzerland", "description": "Businesses that partner with Google get significantly more ROI from their Google advertising when they have a fast, intuitive and compelling mobile experience. Using your consulting and relationship-building skills, you will provide Google-caliber service helping our largest partners to improve their client’s holistic Mobile success (web and Applications/Apps). As an Apps Solutions Lead, you have a passion for sales. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key partners and clients and understand how our range of product offerings can grow their business - from helping them understand the business case for building App, to helping them optimize it, to making sure they have the right measurement setup, to driving app installs and user engagement in a close partnership with the Account Managers (AM)/Industry Managers (IM). Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in digital advertising, consultative sales, business development, or digital marketing, or 6 years of experience with an advanced degree. Ability to communicate in English and German fluently to collaborate with German speaking clients.", "preferred_qualifications": "Experience managing complex customer relationships, driving significant business growth, and creating a mutually beneficial environment that builds value in the long term. Media sales and media consulting background. Ability to handle fast-paced environments with a high degree of autonomy. Able to deliver results in evolving technology and market environments. Ability to navigate ambiguity, operating in a complex environment with multiple internal and external stakeholders. Proven track record in reaching and exceeding sales targets and OKRs.", "responsibilities": "Help Google’s largest partners and customers grow their business by leveraging Apps. Identify, prioritize and align top priority prospects with our vertical teams and align our Specialist support across teams. Help top opportunities and C-level stakeholders evaluate the need for a Mobile App (Business model) and support them to making sure their app is set up for success. Consult our advertisers on their measurement and attribution setup. (e.g. Web-to-App-Connect). Partner with Industry Managers and Account Managers to help customers grow their app users and usage.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/120817089194664646"}