{"title": "International Growth Consultant (French)", "level": "", "location": "Dublin, Ireland", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow.  Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 3 years of experience gathering and presenting technical and financial data to promote products, services, and solutions. 3 years of experience using technological tools to accomplish business objectives and goals. Ability to communicate in French fluently to support client relationship management in this region.", "preferred_qualifications": "3 years of experience analyzing and applying industry, market, product, and organizational information to strategies and plans. 2 years of experience working in a customer-facing role.", "responsibilities": "Act as a consultant to work with client/partner leadership and stakeholders to develop joint business plans (JBPs), review JBPs, and provide input to improve the JBPs or add agreement/services. Use analytical insights to align products and offerings with clients'/partners’ marketing objectives, leveraging and collaborating with product specialist teams, and create forward-thinking and data-driven stories, narratives, and business pitches. Build dashboards to generate, synthesize, and report relevant data to clients/partners, develop or use tools to analyze or forecast client/partner business, the industry, or consumer behaviors, and identify opportunities for improvement. Provide support and consulting on client's/partner’s strategy in the areas of business, marketing, or product development, and translate data into answers to questions or insights to facilitate business decision-making and analyze/build an understanding of client/partner business and stakeholders.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/120856249968272070"}