{"title": "Engineering Manager, Machine Learning Infrastructure, Core", "level": "Advanced", "location": "Bengaluru, Karnataka, India", "description": "Like Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers. You not only optimize your own code but make sure Engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way. With technical and leadership expertise, you manage engineers across multiple teams and locations, a large product budget and oversee the deployment of large-scale projects across multiple sites internationally. Woodshed is expanding to grow an engineering team to invest in the goal of improving centralized management of Machine Learning (ML) data. The team is a significant investment in Woodshed's availability to support more types of ML data used for Large Language Models (LLMs), research-oriented applications, and integrate with different ML frameworks for training and analysis. This team will grow to be a full partner team with shared responsibility of the production deployment and a significant ownership stake in the future of ML data engineering. The Core team builds the technical foundation behind Google’s flagship products. We are owners and advocates for the underlying design elements, developer platforms, product components, and infrastructure at Google. These are the essential building blocks for excellent, safe, and coherent experiences for our users and drive the pace of innovation for every developer. We look across Google’s products to build central solutions, break down technical barriers and strengthen existing systems. As the Core team, we have a mandate and a unique opportunity to impact important technical decisions across the company.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). 3 years of experience in a technical leadership role, overseeing projects, with 3 years of experience in a people management, supervision/team leadership role.", "preferred_qualifications": "Master’s degree or PhD in Engineering, Computer Science, or a related technical field. 3 years of experience working in a complex, matrixed organization.", "responsibilities": "Provide technical leadership on high-impact projects. Collaborate on planning roadmap and manage project priorities, deadlines, and deliverables. Assist with infrastructure productionization and deployment, and large-scale distributed system development. Partner with infrastructure and client teams to guide integrations. Review designs and code of other engineers for quality and correctness.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/120841295965889222"}