{"title": "Technical Solutions Engineer, Data AI/ML, Google Cloud", "level": "Mid", "location": "Sunnyvale, CA, USA", "description": "As a Technical Solutions Engineer, you will be a part of a global team that provides support to help customers make the switch to Google Cloud. You will ensure we have the necessary tools, processes, and needed technical knowledge to resolve the issue. In this role, you will troubleshoot technical problems for customers with a mix of debugging, networking, system administration, updating documentation, and when needed coding/scripting. You will make our products easier to adopt and use by making improvements to the product, tools, processes, and documentation. You'll help drive the success of Google Cloud by understanding and advocating for our customers’ issues.\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$117,000-$172,000 + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree in Science, Technology, Engineering, Mathematics, or equivalent practical experience. 4 years of experience coding in a general purpose coding language or in system design, and troubleshooting and advocating for customers' needs, and triaging technical issues. 4 years of experience with 2 or more of the following: Web Tech, Data/Big Data, Systems Admin, Machine Learning, Networking, Kubernetes, Oracle, SAP. Experience in artificial intelligence (AI) concepts and techniques and utilizing Google Cloud Platform services for various applications.", "preferred_qualifications": "2 years of experience in recommendation systems, natural language processing, speech recognition, or computer vision. Experience developing and/or training models using machine learning technologies (e.g., Tensorflow, Keras, PyTorch). Experience with specific machine learning architectures (e.g., AlexNet, LSTM, Conformers, BERT, etc.). Experience with the production deployment of machine learning. Experience with exploratory data analysis, model development, and auxiliary practical concerns in production ML systems. Effective leadership and influencing skills in the application of AI or Machine Learning, with the ability to lead the design and implementation of AI-based solutions, web services, debugging tools.", "responsibilities": "Be a thought leader in machine learning (ML) operations helping customers proactively. Work with immediate teams to increase operational efficiency and improve Product Supportability. Work with customers on their production ML deployments to resolve issues and achieve production readiness, availability, and scale. Partner with Product and engineering teams to improve products based on customer feedback. Manage customer problems through effective diagnosis, resolution, documentation, or implementation of investigation tools to increase productivity for customer issues on Google Cloud Platform products. Develop an in-depth understanding of Google Cloud’s AI/ML products/solutions and underlying architectures by troubleshooting, reproducing, and determining the root cause for customer reported issues, building tools for faster diagnosis. Act as consultant and subject matter expert for internal stakeholders in engineering, sales, and customer organizations to resolve technical deployment obstacles and improve Google Cloud.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/121017283861455558"}