{"title": "Operations Program Manager, Cases Program", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in program or project management. 2 years of experience in one or more of the following fields: supply planning, supply chain management, manufacturing operations, or operations engineering. Ability to travel internationally up to 25% of the time.", "preferred_qualifications": "MBA or Master's degree in Industrial Engineering, Supply Chain, Operations Research, Operations Engineering, or other relevant fields. 2 years of experience managing cross-functional or cross-team projects. Experience leading complex operational and strategic programs, with the ability to multitask, analyze opportunities, define successful approaches, and solve problems. Ability to build relationships, work effectively cross-functionally, manage multiple projects simultaneously, and lead cross-functionally with excellent communication skills. Excellent leadership, investigative, quantitative reasoning, problem-solving, creative, and strategic skills.", "responsibilities": "Manage a new product ramp, from initial design validation to mass production phase. Drive ramp readiness with engineering, operations, and contract manufacturers, with a focus in overall capacity planning, manufacturing process scalability, and bring up plans that include factory space, labor hiring, training, and production lines qualifications. Manage all operations-related communications through the organization, call out key issues, and present solutions and risk mitigations to cross-functional executive teams. Support critical mechanical tooling fixture validation builds when design is mature, from the last phase of design development through initial mass production. Lead PRQs for yield/quality improvement and cost reduction, clarify Post Ramp Qualification (PRQ) requests and validation plans with Engineering team, and drive approval processes and execution.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/121074882258576070"}