{"title": "Technical Program Manager, YouTube Shopping", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Google's projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You're equally at home explaining your team's analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.\n\nUsing your extensive technical and leadership expertise, you manage projects of various size and scope, identifying future opportunities, improving processes and driving the technical directions of your programs.\n\nThe YouTube Shopping team is building experiences to make shopping content more discoverable and engaging, and to make YouTube more engaging for viewers and valuable for brands.\n\nAt YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.", "salary": "", "key_qualifications": "Bachelor's degree in a relevant field, or equivalent practical experience. 5 years of experience in program management. Experience in Program Management on technical cross-functional projects. Experience building, automating, and developing distributed systems.", "preferred_qualifications": "Experience managing and enabling performing software engineering teams. Experience delivering cross-organizational and cross-functional software engineering projects. Ability to make technical decisions. Ability to work in ambiguity and thrive in a fast-paced, dynamic environment with excellent communication and cross-functional skills.", "responsibilities": "Work across functions (e.g., Product Management, UX, Engineering) and levels to define and deliver software engineering projects. Partner with leads to support the evolution of operational capabilities within the Horizontal space and wider organization. Manage dependencies and escalations, drive visibility on progress and risks to leadership, build internal and cross-functional partnerships, and bring alignment across stakeholders. Reduce process friction and build efficiencies, partner with engineering and product teams, and provide encouragement to learn and adopt project delivery best practices.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/121099455913960134"}