{"title": "Digital Strategy Lead, Accelerated Growth, Google Customer Solutions", "level": "", "location": "New York, NY, USA", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. The Accelerated Growth team aims to approach existing advertisers and increase their Google Ads investment through sustainable and long-term strategies. As a Digital Strategy Lead, you will drive business growth, solution promoting and consulting with clients to work with an engaged team, and bring creativity to grow and expand the business. Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow.  Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it. The US base salary range for this full-time position is $81,000-$119,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in advertising sales and media account management.", "preferred_qualifications": "Experience driving business growth and maintaining client relationships.\nExperience exceeding sales goals.\nKnowledge of sales and working with and educating new advertisers.\nAbility to deliver comprehensive advertising solutions over the phone.\nAbility to work well with a team, be proactive, and organized.\nExcellent verbal and written communication skills.", "responsibilities": "Identify customers and leads via provided account list.\nManage pipeline and develop a strategy for long-term sustained success.\nGrow customers' Google Ads footprint by presenting customized search marketing solutions. Implement creative ways to expand customers existing accounts, tailor and share performance-enhancing suggestions, and promote other Google products.\nCommunicate proactively with customers, via phone, email, and in-person.\nDeliver against assigned goals while prioritizing and delivering an excellent customer experience to Google's advertisers.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/121181719905608390"}