{"title": "Lead CPU Architect, Architecture and Performance, Silicon", "level": "Advanced", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.", "key_qualifications": "Master's degree in Electrical Engineering, Computer Engineering, Computer Science, a related field, or equivalent practical experience. 8 years of experience in high-performance microprocessor architecture, micro-architecture, performance, and design. Experience in CPU architecture with CPU blocks. Experience with C/C++ and scripting languages. Experience in performance modeling, analysis, correlation, and workload characterization.", "preferred_qualifications": "PhD in Electrical Engineering, Computer Engineering, Computer Science, or a related field. Experience leading CPU/ML micro-architecture exploration, performance model development, performance analysis, performance correlation, and workload characterization. Knowledge of system software components, such as Linux, drivers, and runtime. Knowledge of processor instruction set architecture (e.g., ARM, RISC-V, x86). Excellent verbal and written communication skills.", "responsibilities": "Deliver solutions to problems that may be ambiguous or lacking clear precedent including CPU performance, micro-architecture design, tool infrastructure, and methodology. Plan, drive, and evaluate ARM’s architecture features from both architecture and performance angles. Define and write CPU subsystem architecture specifications. Lead the collaboration with RTL, design verification, and physical design teams to develop an efficient CPU implementation. Drive performance correlation between the performance model and RTL implementation and perform pre-silicon and post-silicon performance bug triage.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/121284106758562502"}