{"title": "Software Engineering Manager II, Multiplatform, Core", "level": "Advanced", "location": "Mexico City, CDMX, Mexico", "description": "Like Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers...", "key_qualifications": "Bachelor's degree or equivalent practical experience.8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).3 years of experience in a technical leadership role; overseeing projects, with 2 years of experience in a people management, supervision/team leadership role.", "preferred_qualifications": "Experience as a full-stack developer with proficiency in Android, iOS, or web technologies.Ability to design, develop, and maintain scalable developer frameworks.Excellent communication and collaboration skills, with the ability to work effectively across multiple teams and stakeholders.", "responsibilities": "Help define the technical direction for server driven UI, ensuring alignment with key partners and stakeholders.Set clear expectations with individuals based on their level and role and aligned to the broader organization's goals. Meet regularly with individuals to discuss performance and development and provide feedback and coaching.Develop the mid-term technical direction and roadmap within the scope of the (often multiple) team(s). Evolve the roadmap to meet anticipated future requirements and infrastructure needs.Design, guide, and vet system designs within the scope of the broader area, and write product or system development code to solve ambiguous problems.Review code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/121282468228539078"}