{"title": "Engineering Manager, Youtube Creator Support Workflows", "level": "Advanced", "location": "Bengaluru, Karnataka, India", "description": "Like Google's own ambitions, the work of a Software Engineer goes way beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of engineers. You not only optimize your own code but make sure engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way.", "key_qualifications": "Bachelor’s degree, or equivalent practical experience. 8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). 3 years of experience in a technical leadership role; overseeing projects, with 2 years of experience in a people management, supervision/team leadership role.", "preferred_qualifications": "Experience with privacy and security. Experience optimizing workflows or building tools. Experience managing teams of software engineers and developing technical leads. Experience leading teams to work end-to-end on a variety of technologies ranging from frontend, backend, security, and data analysis. Familiarity with the support domain, ideally having worked on customer support. Crisp technical judgment with a track record of driving the technical decisions in distributed systems with multiple integration points.", "responsibilities": "Build a diverse and performant organization and manage growth. Build a suit of workflow tools to make agents efficient at scaling their support to Youtube Creators. Figure out how to fully automate some of those workflows in product. Be able to platformize so other teams can contribute worfklows to the ecosystem. Develop technical leadership across a wide range of technologies (backend, frontend, security, data analysis). Ensure creators have access to only the data they need, to protect against insider risk.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/121372268008743622"}