{"title": "Principal Developer, Site Reliability, Google Ads", "level": "Director+", "location": "Waterloo, ON, Canada; Mountain View, CA, USA; Pittsburgh, PA, USA", "description": "Google Ads supports a free and open internet, as well as funds Google's innovation more broadly. Today, Google Ads is a complex set of systems that interoperate with each other and most Google products and services. Site Reliability focuses on production health to prevent outages and it does so by defining and developing deep software development solutions which simplify the operating environment and make not only Google Ads reliable, but also make feature development faster and safer. Alongside this work, we also focus on efficiency, helping Ads find ways to sustainably scale and open up avenues for more innovation. As a Principal Developer, you will help develop, design, and drive technical development projects and decisions for Ads infrastructure and production systems. You'll mentor and lead other senior level developers within Ads Site Reliability and Ads to power the open and free internet with the best technology that connects users and businesses everywhere. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$278,000-$399,000 + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree in computer science or equivalent practical experience. 15 years of experience in software and technical development. Experience working across organizational boundaries, building relationships, and importing and exporting ideas.", "preferred_qualifications": "Experience working on Google products or one of the services in the product ecosystem, or experience with a technical infrastructure outside of Google with similar scope. Experience with Site Reliability or DevOps. Expertise in data structures, algorithms, and analysis. Expertise in analyzing and troubleshooting distributed systems. Ability to understand the relationship between the organization and its environment, identify connections, adopt different perspectives, and quickly respond to changing circumstances. Excellent critical thinking, analytical, problem-solving, and organizational skills, with outstanding communication skills.", "responsibilities": "Ensure that Google Ads services have reliability and uptime appropriate to users’ needs and a fast rate of improvement while staying mindful of capacity and performance. Build creative development solutions to operations and infrastructure problems, focusing on optimizing existing systems, building infrastructure, and eliminating work through automation. Determine how our systems relate to each other and use a breadth of tools and approaches to solve a variety of problems. Build a culture of diversity, intellectual curiosity, problem-solving, and openness. Manage, innovate, and create designs for software that drives improvements to the availability, scalability, latency, and efficiency of Google’s Advertising products and/or services. Work cross-functionally with product area leads to guide product development, and collaborate with Ads feature developers.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/121336854124339910"}