{"title": "Configuration Engineer, Manufacturing", "level": "Mid", "location": "Sunnyvale, CA, USA", "description": "Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "salary": "$111,000-$163,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Mechanical/Industrial/Electrical Engineering or equivalent practical experience. 5 years of experience with configuration/systems engineering and related system assembly, including BOM structure and product configuration management. Experience in using technical productivity tools, CAD 3D Modeling tools, and Google productivity tools (e.g. Google Sheets).", "preferred_qualifications": "Experience developing and maintaining system level compute architectures, with understanding of interdependencies from a power, networking, and physical interface perspective. Ability to influence the product design process for Design for Manufacture and Assembly considerations. Ability to produce a timely and highly accurate work product. Excellent problem-solving and organizational skills, coupled with well-focused attention to detail.", "responsibilities": "Design and create system-level deployment configurations (rack, rack payloads) for compute and networking assemblies based on customer and technical infrastructure requirements. Create required design documentation (BoMs, payload layouts, wiring diagrams) for approved production definitions for compute and networking systems. Provide technical expertise and system-level guidance to internal design and development teams to ensure deployment of optimized configurations. Participate in and contribute to cross-functional transformation efforts as pertinent to configuration engineering processes and deliverables. Provide engineering and manufacturing guidance to our integration supply chain partners, as it pertains to rack configuration and deployment activities.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/121592754181415622"}