{"title": "Strategy and Operations Manager, Knowledge and Information Trust", "level": "Advanced", "location": "San Francisco, CA, USA; Mountain View, CA, USA; New York, NY, USA", "description": "Product and Business Strategy Leaders bring together teams across Google’s functions to help products execute optimally. Our team pushes Google to scale at key points that refine our products and infrastructure by executing efficiently, bringing solid business sense and sound judgment, and working effectively across organizational lines. Our roles often include components of strategy, operations, and communications. Our team partners with senior leadership to run important functions that deliver high impact projects.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 11 years of experience in management consulting, product management and strategy, or analytics in a technology company. Experience working with and analyzing data, managing multiple cross-functional programs or projects, developing and managing advocacy campaigns, and partnering with senior-level executives.", "preferred_qualifications": "Advanced degree or equivalent practical experience. Experience working on regulatory strategies focused on data use, working with product and engineering teams, experience at a tech, media, or telecom company, and excellent communication skills.", "responsibilities": "Influence team members and executive management to act and drive projects to completion. Establish and lead operating processes and tools for effectively managing the organization. Provide strategic recommendations to leadership based on analysis, technical acumen, and solid judgment. Facilitate the creation of a long-term strategy balancing the regulatory landscape and product opportunities. Build relationships and ensure alignment on strategic Trust strategies across key product areas and stakeholders.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/121512708003504838"}