{"title": "Program Manager III, Government Affairs, Privacy Sandbox", "level": "Mid", "location": "Mountain View, CA, USA; Cambridge, MA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nChrome provides a safe, speedy, simple, and stable experience to app and web users. The team’s mission is to create a thriving web and app ecosystem that is respectful of users and private by default.\n\nChrome is dedicated to building a better, more open web. We’re focused on making a better browser (on both desktop and mobile) to help users take advantage of all the web has to offer in a safe and secure way.Chrome is available across all major platforms — iOS, Android, Windows, Mac, Linux and Chrome OS. We also built Chrome as an open source project so the entire web ecosystem could benefit from the latest innovations in speed, simplicity and security.", "salary": "$139,000-$207,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n5 years of experience in program or project management.\nExperience working in compliance-related program management.\nExperience with privacy domains.", "preferred_qualifications": "5 years of experience managing cross-functional or cross-team projects.\nExperience with privacy and advertising technology domains.\nExcellent written communication skills, with experience writing legally-sensitive documents and emails.", "responsibilities": "Develop and lead scalable and sustainable processes to drive key recurring regulatory deliverables, quarterly reports under legal commitments with the Competition and Markets Authority (CMA).\nPartner with senior cross-functional stakeholders to organize, plan, and execute recurring Monitoring Trustee and Technical Expert engagements.\nTrack and document key design decisions for work that entails material impacts on privacy and competition, in partnership with fellow program managers and product/engineering/legal stakeholders.\nEstablish and drive an intake/prioritization process for inbound regulatory concerns, coordinate execution across a broad set of Privacy Sandbox and cross-functional teams including GAPP, Competition/Compliance/Privacy/Product Legal, Public Relations.\nDrive team-wide improvement for critical work-streams, and management of cross-functional dependencies, automation, process improvements, and operational efficiencies.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/121865442930107078"}