{"title": "Software Engineer, Chrome OS Infrastructure", "level": "Mid", "location": "Taipei, Taiwan", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. Chrome OS delivers quality computing at scale to provide universal and unfettered access to information, entertainment, and tools. Our mission is to empower anyone to create and access information freely through fast, secure, simple, and intelligent computing.", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 2 years of experience with software development in either an academic or industry setting, and with data structure or algorithms. 2 years of experience with software design, testing, architecture, and launching software products. Experience programming in C++ or Python.", "preferred_qualifications": "Experience in Machine Learning development, including data preparation, training, evaluation, performance optimization and productization for on-device use cases. Experience in full-stack development, building applications. Knowledge of advanced AI models (e.g., Large Language Model, diffusion models) design or implementation and their application to real-world problems. Ability to work with new technology or pick-up new skills. Excellent communication skills, with the ability to manage changes and multi-tasks during the development phase.", "responsibilities": "Build on-device Machine Learning infrastructure for Aluminum. Adapt models for on-device Machine Learning (e.g., computational graph, quantization). Create model serving infrastructure for latest models. Orchestrate quality tests and benchmark model's performance. Perform Trust and Safety analysis.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/121880134939484870"}