{"title": "Systems Development Engineer, Google Distributed Cloud", "level": "Mid", "location": "Sunnyvale, CA, USA; Seattle, WA, USA; Thornton, CO, USA", "description": "Google Distributed Cloud (GDCE) extends Google Cloud infrastructure to the edge and data centers, enabling local data processing, low-latency edge computing, and addressing sovereignty, security, and privacy requirements. It's a fully managed hardware and software solution powered by Anthos. A dedicated in-house operations support team plays a critical role in ensuring successful GDCE deployments. They serve as the primary contact for field deployers facing challenges, providing timely resolutions and meeting SLAs for repairs. This team operates independently from cloud support, participating in on-call rotations even during weekends and holidays. To minimize manual effort, the team identifies recurring issues and develops automated solutions. They also collaborate with external hardware vendors to guarantee GDCE server specifications are met and work with internal labs to align lab deployments with product design. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$142,000-$211,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience with technical infrastructure (e.g., deployment, maintenance, troubleshooting), and with reliability of technical infrastructure. 5 years of experience in data center operations, hardware, or design.", "preferred_qualifications": "Experience with systems design, automation, and troubleshooting complex IT issues. Experience with Linux system administration, scripting, and cloud platforms.", "responsibilities": "Troubleshoot GDCE installation problems, customer workload migration errors, and machine repair tasks. Act as the primary contact for field deployers facing challenges, ensuring timely issue resolution, and meeting SLAs. Participate in on-call rotations, identify recurring issues, develop automated solutions, and collaborate with hardware vendors and internal labs to maintain product quality and alignment.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/121831328743072454"}