{"title": "Director, Mid Market Sales, Lead Generation", "level": "Director", "location": "New York, NY, USA", "description": "The Mid-Market Sales (MMS) team partners with the largest accounts in the small and medium business segment in the US Market. We are focused on providing scaled solutions to our partners that solve their marketing challenges and provide insight into their marketplace opportunities. In addition, this team partners internally across multiple functions and regions. At Google, our culture is paramount and you will advocate for these values and reinforce our way of doing business throughout the organization. You will help find, grow, and retain the talent who are our Googlers. As a Business Leader, you will be responsible for operating in a transparent way and setting an example of respect and inclusion. Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow.  Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.", "key_qualifications": "Bachelor's degree or equivalent practical experience in a B2B sales-related or business development role. 15 years of experience in sales and marketing, including leadership in technology, Internet, or media industries. Experience in people management, including managing managers and leading geographically-distributed sales teams. Experience partnering and working with cross-functional teams, senior management, and external C-suite stakeholders. Ability to travel for client meetings and trainings, as required.", "preferred_qualifications": "Experience with external thought leadership and as a recognized authority in digital marketing solutions. Expertise in systems thinking including implementations, test/learn scenarios, and establishing/adapting systems and processes to scale. Ability to synthesize information and identify trends across a diverse account portfolio, consisting of multiple industries and ranges of spend. Ability to build an innovative and effective vision and growth strategy, including internal and external sell-in, amidst a well-established organization and standards. Excellent strategic thinking, creative problem-solving, and data analysis and synthesis skills.", "responsibilities": "Create an inspiring vision and strategy for a team, including critical initiatives and Key Performance Indicators, while ensuring that the resources are in place to exceed goals, all while utilizing the full power of the Google Platform. Hire, retain, inspire, and grow a passionate and diverse customer-focused sales team that is successful engaging with high-level client leadership teams. Deliver against business goals and drive incremental business growth to accelerate year over year growth. Own and strengthen executive-level relationships through key C-level meetings, events, quarterly reviews, and speaking engagements. Drive cross-functional collaboration and alignment with key partner teams, including MMS counterparts, Marketing, New Business Sales, Finance, Central Strategy, and Large Customer Sales vertical teams. Be an executive spokesperson for MMS at key industry events within the Lead Generation industries.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/121970906925802182"}