{"title": "Senior Systems Software Engineer, Platforms", "level": "Mid", "location": "Taipei, Taiwan", "description": "Google Cloud's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google Cloud's needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. You will anticipate our customer needs and be empowered to act like an owner, take action and innovate. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.", "key_qualifications": "Bachelor's degree in Computer Science, a related technical field, or equivalent practical experience. 5 years of experience with software development in one or more programming languages, and with data structures/algorithms. 3 years of experience testing, maintaining, or launching software products, and 1 year of experience with software design and architecture. Experience in system software development (e.g., firmware, BIOS, BSP, Linux kernel, BMC, device drivers, and system libraries). Experience in Unix/Linux environments and embedded Linux. Experience coding in C/C++.", "preferred_qualifications": "Master's degree or PhD in Computer Science, Electrical Engineering, or a related technical field. Experience with developer operations, release management, integration testing, open source development, or Open Compute Projects (OCP). Experience in server system software development with Linux Boot, coreboot, boot loader, or Linux kernel.", "responsibilities": "Design the system software for servers to support various workloads and manageability needs. Manage early system board bring-up, troubleshoot, issue triage, and deploy servers to the data center. Design and implement tools for automating diagnostics, performance evaluation, and reliability assurance for servers. Collaborate with internal and external partners to plan and execute the engineering programs, including product development and productivity improvements. Contribute innovative ideas and skills to the team.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/121992965340963526"}