{"title": "Product Manager, Security Command Center Platform", "level": "Advanced", "location": "Bengaluru, Karnataka, India", "description": "At Google, we put our users first. The world is always changing, so we need Product Managers who are continuously adapting and excited to work on products that affect millions of people every day. In this role, you will work cross-functionally to guide products from conception to launch by connecting the technical and business worlds. You can break down complex problems into steps that drive product development. One of the many reasons Google consistently brings innovative, world-changing products to market is because of the collaborative work we do in Product Management. Our team works closely with creative engineers, designers, marketers, etc. to help design and develop technologies that improve access to the world's information.  We're responsible for guiding products throughout the execution cycle, focusing specifically on analyzing, positioning, packaging, promoting, and tailoring our solutions to our users. Security Command Center (SCC) is one of the most cutting-edge risk intelligence and threat protection products on the market today. The companies who rely on SCC operate with better awareness of the security risks that threaten their businesses, and then take action to remediate so they can stay protected and serve their customers. We are rapidly broadening our capabilities, incorporating more advanced risk data, and expanding to multi-cloud coverage in order to provide even more comprehensive and useful protection for security teams worldwide. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in product management, consulting, co-founder or a related technical role. 3 years of experience building and shipping technical products.", "preferred_qualifications": "Experience in building security products for cloud. Experience collaborating with multiple teams and product areas, and influencing technical stakeholders. Experience with complex infrastructure products, and large systems. Experience with governance, compliance, risk management. Experience working collaboratively with UX to best align user, business, and legal needs. Ability to build strong consensus among engineering counterparts, and align on product strategy, direction, product quality goals, and metrics.", "responsibilities": "Collect and analyze customer feedback and customer requests and inject the salient knowledge into the team. Incorporate user feedback, user research, and technical requirements into a holistic strategy. Define and refine the approach for creation, modification, and adoption of our technologies by our customers. Define and create materials to aid adoption of key customer facing products, including roadmaps, customer playbooks, support playbooks, go to market materials, etc. Ensure fastest time to delivery of in-scope software products for Security Command Center.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/121998233118352070"}