{"title": "Senior Product Manager, BigQuery Data Sharing", "level": "Advanced", "location": "Bengaluru, Karnataka, India", "description": "At Google, we put our users first. The world is always changing, so we need Product Managers who are continuously adapting and excited to work on products that affect millions of people every day. In this role, you will work cross-functionally to guide products from conception to launch by connecting the technical and business worlds.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in product management or related technical role. 3 years of experience taking technical products from conception to launch.", "preferred_qualifications": "Knowledge of the enterprise data warehousing and data analytics product market segments. Understanding of the use cases around data sharing, data governance, and privacy data handling within key industries such as financial services, retail, advertising, and healthcare. Excellent technical skills for working closely with engineering teams to ensure that product releases meet technical and business requirements.", "responsibilities": "Own the data sharing and data clean rooms feature sets in BigQuery, from ideation and requirements to launching and landing. Work closely with UX, engineering, internal and external stakeholders, and early adopters to ensure that BigQuery data sharing and data clean room capabilities meet technical and business objectives. Ensure that BigQuery is dynamic with other enterprise data platform offerings in the areas of data sharing and data clean rooms. Collaborate with other product teams and partner teams to build joint roadmaps and drive integrations. Be a go-to person for questions about BigQuery data sharing, including field and partner teams. Build launch and go-to-market plans to scale areas of ownership.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/122000861638337222"}