{"title": "Associate Product Marketing Manager", "level": "Early", "location": "Sydney NSW, Australia", "description": "Whether you're on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product's journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the representation of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you'll be involved with product marketing strategy from beginning to end. As an Associate Product Marketing Manager (APMM), you will be part of Google’s global program for early career Marketers, where you will work on priority marketing projects, develop marketing skills, join a community of peers and alumni, and be supported by dedicated mentors and executive leaders. In addition to your core work, you will complete learning and development milestones, attend APMM programming, and contribute to the APMM community. In this role, you will make direct contributions under the scope of a larger project, with general guidance. For example, you may help represent the user into the product development process or develop the go-to-market plans for driving awareness and adoption for new products and features among selected segments. You will drive growth marketing and optimization, contribute to Google’s brand strategy, generate user insights, or manage campaigns and programming. Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google's products solve the world's problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 1 year of experience in marketing.", "preferred_qualifications": "Knowledge and passion for Google's products, technology, and leadership in the Artificial Intelligence (AI) space. Ability to manage ambiguity. Ability to think across disciplines, industries, cultures, and scenarios. Excellent problem solving skills, with ability to develop and understand strategy. Excellent program management and communication skills. Interest in marketing, brand management, strategy consulting, agency, AI, technology, or related fields.", "responsibilities": "Assist in defining and executing go-to-market strategies and campaigns for new product or feature launches and measure efficacy against key performance indicators (KPIs). Assist in developing programs aimed at acquiring customers (including business strategies, messaging, collateral, events), increasing our engagement with them and measuring the efficacy of such programs. Support the team in evaluating product and feature improvements to better meet user needs, product readiness for launch, and communicate the new developments to users. Assist in developing client and executive narratives and presentations, case studies, and content designed to accelerate the business momentum to better engage Google's customers and agency partners. Assist in executing marketing related tasks within the scope of a larger product or project, under guidance from the manager.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/122212133763982022"}