{"title": "Cloud Consultant, Data and Analytics, Google Cloud Consulting", "level": "Mid", "location": "Boulder, CO, USA; San Diego, CA, USA", "description": "Google Cloud helps employees and organizations empower their employees, serve their customers, and build what’s next for their business, all with technology built in the cloud. Our products are engineered for security, reliability, and scalability, managing the full-stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers, developers, small and large businesses, educational institutions and government agencies, see the benefits of our technology come to life.\n\nAs a Cloud Consultant for Data and Analytics, you will work with Google’s customers on critical projects to help them transform their businesses. You will provide management, consulting and technical aptitude to customer engagements while working with client executives and key technical leaders to deploy solutions via Google’s Cloud Platform. \n\nYou will also work closely with key Google partners currently servicing accounts to manage programs, deliver consulting services, and provide technical guidance and best practice expertise.  \n\nYou will travel up to 30% of the time for client engagements.\n\nGoogle Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nThe US base salary range for this full-time position is $118,000-$174,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about <a href=\"https://careers.google.com/benefits/\">benefits at Google</a>.", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, a related technical field, or equivalent practical experience.\n4 years of experience project managing and delivering technical solutions.\nExperience architecting, designing, and deploying distributed data processing systems with one or more open source technologies.\nExperience in technical consulting delivery for data solutions in cloud environments.", "preferred_qualifications": "MBA or Master's degree in Computer Science or Engineering field.\nCloud certification.\n7 years of experience demonstrating technical client service.\nExperience with reading software code in one or more languages such as Java, JavaScript, or Python.\nExperience designing and deploying large scale distributed data processing systems with one or more technologies such as Oracle, SQL Server, MySQL, PostgreSQL, MongoDB, Cassandra, Redis, Hadoop, Spark, HBase, Vertica, Netezza, Teradata, Tableau, or MicroStrategy.\nExperience devising migration approach, and migrating on premises data processing systems to cloud.", "responsibilities": "Work with customer technical leads, client executives, and partners to manage and deliver implementations of cloud solutions becoming a trusted advisor to decision makers throughout the engagement.\nWork with internal specialists, product and engineering teams to package best practices and lessons learned into thought leadership, methodologies, and published assets.\nInteract with sales, partners, and customer technical stakeholders to manage project scope, priorities, deliverables, risks/issues, and timelines for client outcomes.\nAdvocate for customer needs in order to overcome adoption blockers and drive new feature development based on your field experience.\nPropose solution architectures and manage the deployment of cloud based big data and analytics solutions according to complex customer requirements and implementation best practices.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/122209165941580486"}