{"title": "Business Controller, Chrome", "level": "Mid", "location": "Chicago, IL, USA", "description": "Google accountants are a savvy bunch who handle the core accounting responsibilities at Google. You know your accounting principles and the full accounting process end to end. You'll advise on financial reports required by governmental regulations, and review, analyze, and interpret financial and budgetary reports. Every day is a new challenge, and you're continually looking for ways to help our team become more efficient and effective. A team player at heart, you collaborate with our global team, advocate best practices and pitch in where needed. You move fast while keeping your attention to detail, and you tap into your problem-solving skills to support business objectives.", "key_qualifications": "Bachelor's degree in Accounting or Finance, or equivalent practical experience. 4 years of experience in accounting or a related function. 4 years of experience in a financial reporting/operational accounting role. 3 years of experience in external or internal audit controls/compliance. Experience with accounting principles, including US GAAP and related accounting standards.", "preferred_qualifications": "Experience managing and influencing large-scale cross-functional projects and initiatives. Experience in managing process improvement. Experience with ASC 606 implementation and revenue recognition. Experience with SQL and growing business decisions by analyzing data sets. Excellent business acumen, with the ability to recognize and present data.", "responsibilities": "Own the complete financial reporting processes for Chrome OS, supporting the business with all of its initiatives including product development, launch/GTM, and partnerships. Design, implement, and manage global accounting processes for Chrome OS, including business growth and customer incentives, cost of business, operational expenses, and the related balance sheet reconciliations. Lead large-scale, cross-functional process improvement initiatives. Partner with FP&A, product, engineering, and other cross-functional business partners to define, establish, and implement accounting systems, processes, and procedures. Review processes and implement controls to ensure mitigated risk for Google. Perform month-end close processes, including agreement review and preparing/posting journal entries. Prepare and present financials to management and support with any ad-hoc requests from cross-functional teams.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/122422895325389510"}