{"title": "Strategy Lead, Android, Product Strategy and Operations", "level": "Mid", "location": "Mountain View, CA, USA", "description": "Product and Business Strategy Leaders bring together teams across Google’s functions to help products execute optimally. Our team pushes Google to scale at key points that refine our products and infrastructure by executing efficiently, bringing solid business sense and sound judgment, and working effectively across organizational lines. Our roles often include components of strategy (e.g. analyzing and understanding new trends in the industry, building business plans), operations (e.g. running the cadence of organizations, connecting the operating lines between our functions), and communications. Our team partners with senior leadership to run important functions that cross-cut our existing organizations and deliver high impact projects. We help Engineers, PMs, UX, and all of our other functions to build amazing products that delight our users, and then get those products into their hands. The Mission of the Android strategy team is to proactively drive a strategic agenda and align priorities to enable the healthy growth of the Android ecosystem for users, partners and Google. The team is focused on providing strategic thought leadership and critical insights to enable the best decision making, at pace and where it matters most.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in management consulting, product management and strategy, or analytics in a technology company. Experience working with and analyzing data, and managing multiple projects.", "preferred_qualifications": "Advanced degree or equivalent practical experience. Experience with R, SQL, spreadsheets, or similar analytics tools. Experience working with product and engineering teams. Excellent written and verbal communication skills.", "responsibilities": "Establish and lead operating processes and tools for effectively managing the organization and achieving goals. Partner with Android product and cross-functional leadership to identify and evaluate, influence and execute on growth opportunities, focusing on data-driven insights and delivering executive-ready content. Ensure team stays up-to-date on ecosystem trends, and articulate implications for Android ecosystem. Lead cross-functional project teams to structure and execute a range of strategic analyses and develop executive-level recommendations, including but not limited to market sizing and opportunity analysis, benchmarking and positioning, build vs buy analyses, etc. Support executive narratives that communicate the Android strategy and how we are executing against our strategy.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/122569934604509894"}