{"title": "Associate Product Marketing Manager", "level": "Early", "location": "Jakarta, Indonesia", "description": "Whether you're on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product's journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the representation of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you'll be involved with product marketing strategy from beginning to end. As an Associate Product Marketing Manager, you will be part of a two year, cohort based, development program. This unique career path within Google’s Marketing team includes an activity community, a robust support network, and unique learning experiences. During your time in the program, you will work on priority marketing projects in your organization, develop a breadth of marketing skills, join a strong community of peers and alumni, and be supported by dedicated mentors and executive leaders. In addition to your core work, you will complete learning and development milestones and actively contribute to the community. In this role, you will be assigned marketing projects and make direct contributions under the scope of a larger project. You will represent the user into the product development process or develop the go-to-market plans for driving awareness and adoption for new products and features. You will drive growth marketing and optimization, contribute to Google’s brand strategy, generate user insights, or manage campaigns. Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google's products solve the world's problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. Less than 3 years of work experience in a Marketing related field.", "preferred_qualifications": "Knowledge of and passion for Google's products and the technology industry. Ability to think across disciplines, industries, cultures, and scenarios with a global mindset. Excellent program management and communication skills. Excellent analytical skills, with ability to develop and understand strategy. Comfort with ambiguity and agility. Interest in marketing, brand management, strategy consulting, agency, technology, or related fields.", "responsibilities": "Assist in defining and executing go-to-market strategies and campaigns for new product or feature launches and measure efficacy against KPIs. Assist in developing programs aimed at acquiring customers (including business strategies, messaging, collateral, events), increasing our engagement with them, and measuring the efficacy of such programs. Support team in evaluating product and feature improvements to better meet user needs, product readiness for launch, and communicate the new developments to users. Assist in developing client and executive narratives and presentations, case studies, and content designed to accelerate the business momentum to better engage Google's customers and agency partners. Assist in executing marketing related tasks within the scope of a larger product or project, under guidance from the manager.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/122632539457102534"}