{"title": "Program Enablement Manager, Google Procurement Organization", "level": "Mid", "location": "Chicago, IL, USA", "description": "In the Google Procurement Organization (GPO), our aim is to unlock value for Google to reinvest in what matters most. We do this by bringing velocity, efficiency, and security to buying at Google, while partnering deeply across Google to deliver solutions fit for purpose. As a centralized organization operating in a high complexity environment, we bring 'one voice' to stakeholders and suppliers to ensure the best outcomes.", "key_qualifications": "Bachelor's degree in Business, Accounting, Finance, or equivalent practical experience. 4 years of experience in management consulting, or project management from a public accounting firm or multi-national company. Experience supporting or leading cross-functional projects and identifying process improvements. Experience managing and delivering programs and projects aligned with organizational goals.", "preferred_qualifications": "Project Management Professional (PMP) or similar certifications. Ability to establish and maintain standardized processes, methodologies, and best practices for project and program management. Excellent project and program management skills, including planning, scheduling, and execution capabilities paired with strong team leadership and mentorship. Analytical and problem-solving skills to monitor project performance, track key metrics, and evaluate project outcomes against predefined goals and KPIs. Exceptional communication and people skills for facilitating communication between project teams, stakeholders, and leadership. Flexibility to adjust to changing circumstances, prioritize competing demands, and make sound decisions under pressure.", "responsibilities": "Develop and align programs and projects with GPO's overall strategic goals, and ensure individual projects contribute to the broader objectives of GPO. Support management of resources across various projects and optimization of resource allocation to ensure efficient utilization and prioritization of tasks. Help identify and manage risks that may impact project delivery or program success, and work to resolve issues and mitigate risks promptly. Facilitate communication between project teams, stakeholders and leadership, and ensure transparency while keeping stakeholders informed about project progress, risks, and changes. Monitor the performance of various programs and projects, tracking key metrics, and generate reports for leadership to make informed decisions. This includes evaluating project outcomes against predefined goals and KPIs.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/122605011937960646"}