{"title": "Signal Integrity and Power Integrity Engineer, Pixel Watches", "level": "Early", "location": "Mountain View, CA, USA", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration. As a Signal Integrity and Power Integrity (SIPI) Engineer, you will be responsible for the SIPI analysis and design of next-generation Pixel watches. You will be involved in each stage of the product development from the prototype to the mass production including PCB/FPCB stackup, design rules, pre-layout and post-layout simulations for electrical interfaces, critical signals, and power delivery networks (PDNs). You will closely work with cross-functional teams to solve any SIPI related design issues and provide solutions. Simulation and measurement correlation is the key to maintaining the simulation confidence level in product development. In this role, you will be responsible for the correlation between simulation and lab measurement including the characteristics of passive channels, interface timing and PDN impedances, which require you to be familiar with lab equipment including VNA, TDR, and Oscilloscope, etc. Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "salary": "$102,000-$150,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Electrical Engineering, a related field, or equivalent practical experience. Experience with EDA tools such as Ansys HFSS, Q3D, SIwave, Cadence PowerSI, PowerDC, Allegro, APD, CST Microwave Studio, Keysight ADS, and Synopsys Hspice. Experience with SIPI analysis, including frequency domain and time domain modeling, simulation, and correlation.", "preferred_qualifications": "Master's degree in Electrical Engineering, or a related field. Experience working in a technical environment. Experience with advanced instruments, including VNA, TDR, Spectrum analyzer, and high-bandwidth Oscilloscope, etc. Experience working in a lab environment, and knowledge of lab measurement and basic lab equipment. Experience with PCB layout tools and familiarity with constraints manager. Scripting ability for lab measurement automation or EDA simulation automation.", "responsibilities": "Participate in all stages of Pixel watch development. Own Signal Integrity (SI) and Power Integrity (PI) of Pixel watches and their subsystems. Provide detailed SI and PI analyses report and sign-off for each design release of the product you own, including interface timing, compliance, eye mask, reflection, IO driving strength optimization etc. for signals, and DCR and PDN check to meet given power rail SPECs. Own PCB layout constraint manager file and provide SIPI PCB layout rules for critical signal nets and power nets. Drive solutions of SIPI issues with stakeholders with cross-functional teams. Provide simulation and simulation Design of Experiment (DOEs) to support cross-functional teams and system teams on issue debugging, root cause, solution finding, and solution optimization. Perform correlation study between simulation and lab measurement to confirm simulation accuracy.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/122742822942974662"}