{"title": "Quantitative UX Research Lead, Wear OS", "level": "Advanced", "location": "London, UK", "description": "At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" Quantitative User Experience Researchers make this possible. Google User Experience (UX) is made up of multi-disciplinary teams of UX Designers, Researchers, Writers, Content Strategists, Program Managers, and Engineers: we care deeply about the people who use our products. The UX team plays an integral part in gathering insights about the attitudes, emotions, needs, and behaviors of people who use our products to inspire and inform design. We collaborate closely with each other and with engineering and product management to create industry-leading products that deliver value for the people who use them, and for Google’s businesses. As a Quantitative User Experience Researcher (Quant UXR), you’ll help inform your team of UXers, product managers, and engineers about user needs. You’ll play a critical role in creating useful, usable, and delightful products. You’ll work with stakeholders across functions and levels and have impact at all stages of product development. You will investigate user behavior and user needs using empirical research methods such as logs analysis, survey research, path modeling, and regression analysis. Quant UXRs vary in background and use skills from computer science, quantitative social science, econometrics, data science, survey research, psychology, human-computer interaction, and other fields. You’ll combine skills in behavioral research design, statistical methods, and general programming to improve user experience. The Quantitative UXR community at Google will help you do your best work. You’ll have the opportunity to work with and learn from UXRs across Google through regular meetups, mentor programs, and access to internal research tools.", "salary": "", "key_qualifications": "Bachelor's degree in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, related field, or equivalent practical experience. 8 years of experience in an applied research setting, or similar. Include a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link or access instructions).", "preferred_qualifications": "Master's degree in Mathematics, Statistics, Computer Science or Engineering or equivalent practical experience. 8 years of experience conducting UX research on products. 8 years of experience with User Experience or Human-Computer Interaction teams. Experience in multivariate statistics and the design of experiments. Experience in programming computational and statistical algorithms for large data sets. Experience in leading complex research projects, involving multiple researchers and stakeholders appropriately at each stage of the life-cycle, with demonstrated impact on product goals, strategy, and direction.", "responsibilities": "Influence stakeholders across organizations to gain support for research-based, user-centric solutions. Drive ideas to improve products and services through research-driven insights and recommendations. Own goals and strategy discussions through research by analyzing, consolidating, or synthesizing what is known about user, product, service, or business needs. Lead a key Wear program that measures or predicts the impact of feature/device launches, providing insights and recommendations with a focus on the user. Guide the goals for Wear’s quantitative and data analytics efforts, aligning cross-functional teams to work effectively together on outcomes in the interest of users and the business.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/122851156782129862"}