{"title": "Technical Program Manager II, Software Engineering, Google Workspace", "level": "Mid", "location": "Kirkland, WA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nIn this role, you will be supporting our fundamental program and provide engineering support to our team to assist with automation, reporting, dashboard and other more code-focused activities.\nThe web is what you make of it and our team is helping the world make more of the web. From open-source pros to user-experience extraordinaires, we develop products that help users connect, communicate and collaborate with others. Our consumer products and cloud platforms are giving millions of users at homes, businesses, universities and nonprofits around the world the tools that shape their web experience -- and changing the way they think about computing.\nThe US base salary range for this full-time position is $122,000-$178,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n2 years of experience in managing projects.\n1 year of experience with software development in one or more programming languages (e.g., Python, JavaScript).1 year of experience with data analytics, reporting, scripting using SQL or similar technologies.", "preferred_qualifications": "2 years of experience in managing cross-functional or cross-team projects.\nExperience with software development.\nAbility to manage priorities, escalate, resolve roadblocks, conflicts and facilitate projects across a distributed team.\nExcellent communication skills, with the ability to represent and prepare executive level communication and articulate business or technical concepts to executive leadership.", "responsibilities": "Create and maintain dashboards for our velocity tracking efforts, use internal tools to streamline processes via code.\nPlan, track, execute, and report on project timelines and milestones across multiple programs.\nDrive and track progress, manage risks and dependencies leading to successful outcomes.\nIdentify and drive resolution of Real-Time Communication (RTC) and cross-functional process gaps that obstruct efficiency and scaling.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/122890370638848710"}