{"title": "Business Systems Analyst, Enterprise Reference Data", "level": "Mid", "location": "Hyderabad, Telangana, India", "description": "At Google, we work at lightning speed. So when things get in the way of progress, the Business Systems Integration team steps in to remove those roadblocks. The team identifies time-consuming internal processes and then builds solutions that are reliable and scalable enough to work within the size and scope of the company. You listen to and translate Googler needs into high-level technical specifications, design and develop recommended systems and consult with Google executives to ensure smooth implementation. Whether battling large system processes or leveraging our homegrown suite of Google products for Googlers themselves, you help Googlers work faster and more efficiently.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience designing and implementing Master Data Management and Enterprise Data Management systems. 5 years of experience building integrated systems throughout the entire lifecycle (e.g., analyze, design, build, test, implement, and support). Experience in evaluating, standardizing, and promoting data governance tools in enforcing Data Catalog, Reference and Master Data Management, Data Warehousing, Data Pipelines, and BI and Analytics.", "preferred_qualifications": "15 years of experience in architecting and driving full-scale enterprise solutions working with globally distributed teams. Experience with Graph Mining models, Machine Learning applications. Experience creating and maintaining data governance workflows to improve the organization's data management maturity. Ability to drive alignment and build strong partnerships with leadership from teams outside of their extended team.", "responsibilities": "Define enterprise data architecture, identify canonical schemas, set standards and best practices for establishing and enforcing enterprise data governance. Facilitate the delivery of Enterprise Data Solutions and contribute to transformation programs involving master data management, data governance, data security, data warehousing, data quality, and connected views. Develop, own, and maintain data architecture, data models, designs, integration across the various innovation processes and IT systems. Identify opportunities to drive enterprise data programs working with multiple executive business stakeholders and engaging with Engineering as well Product Management teams. Define data strategy spanning across products and services to enable several high-impact business initiatives in areas such as legal, core finance, order-to-cash, payroll, source-to-pay, and supply chain.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/123071171582141126"}