{"title": "Technical Solutions Consultant, Android TV", "level": "Mid", "location": "San Jose, CA, USA", "description": "Google TV is about bringing the magic of Google into living rooms around the world with helpful, engaging, and delightful experiences.\n\nThere are 400M TVs shipped every year, and people watch ~5 hours of television daily. The rise in Internet delivered TV services (aka OTT) has accelerated the transformation of how consumers watch TV. The Google TV team is re-defining the TV experience to make it highly personalized, Google-smart, content and voice-forward and powered by AI/ML, including helping users access the world’s media and knowledge. It will bring together the best of Google across all our services.\n\nThe TV Partner Engineering team is responsible for working with device manufacturers, OEM's and SOC providers to deliver an exceptional TV experience.\n\nGoogle TV is redefining the TV experience to make it highly personalized, Google-smart, and content-forward to help users access the world’s media. Through recent launches like Chromecast with Google TV, we bring together the best of Google. Google TV is focused on scaling across the OEM ecosystem; working closely with third-party streaming partners plus many teams across Google (for example: Ads, Play, and YouTube); and building a business on TV platforms, OTT devices, and mobile devices. With over 110 million active users of our products plus being amidst the quickly evolving media and entertainment industry, there are plenty of opportunities for the team and individuals in it.", "salary": "$142,000-$211,000 + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree or equivalent practical experience.\n6 years of experience in system design or any one programming language (e.g., Java, C++, Python, etc.).\n6 years of experience in technical troubleshooting, and managing internal/external partners or customers.\n6 years of experience in Android application or platform development.", "preferred_qualifications": "Experience with TV and video technologies, such as TV/Set-top box software stacks, media services, and content protection.\nExperience working with embedded systems, Linux kernel, device driver APIs, chipset, and Android.\nExperience with the mobile/CE/embedded space including knowledge of audio, video, graphics, and security technologies.\nExcellent problem-solving skills, combined with a strong sense of ownership.\nExcellent communication skills.", "responsibilities": "Perform implementation reviews, advocate new product features, and ensure the prompt and proper resolution of technical challenges.\nImprove product feature offerings by providing partner feedback to internal cross-functional teams including Product Management and Engineering.\nGuarantee the technical aspects of a partner’s integration (both new and ongoing) by providing necessary documentation and technical guidance.\nAct as the engagement manager taking responsibility for the success of our Android TV and Google TV partnerships.\nOptimize implementations to increase business opportunities and manage the overall technical aspects to build strong, successful, long-term partnerships.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/123196742131688134"}