{"title": "Product Data Scientist, Google Play", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Google Play provides apps, games, and digital content services that bring Android devices to life. In this role, you will work on engineering our back-end systems, to shaping the product strategy, to forming great content partnerships.", "key_qualifications": "Bachelor's degree in Statistics, Mathematics, Data Science, Engineering, Physics, Economics, a related quantitative field, or equivalent practical experience. 5 years of experience with analysis applications (e.g., extracting insights, performing statistical analysis, or solving business problems) and coding (e.g., Python, R, SQL).", "preferred_qualifications": "Master's degree in Engineering, Business, or quantitative field. Experience in identifying opportunities for business/product improvement and defining/measuring the success of those initiatives. Experience working with Engineers and Product Managers providing product centric insights. Experience in developing new models, methods, analysis and approaches. Experience in one or more of the following methods: time series forecasting, statistical and causal inference, classification methods. Experience in risk, commerce, fraud and abuse, or trust and safety role. Business knowledge and understanding of online App stores.", "responsibilities": "Drive analysis for Google Play, focusing on product features and user experience across Google Play business generation. Partner with cross-functional teams to provide data feed, experiment design, and product insights, that will improve performance and ensure proper logging and metrics are available for performance measurement. Act as thought partner to produce insights and metrics for various technical and business stakeholders across Google Play. Deliver effective presentations of findings and recommendations to multiple levels of leadership, creating visual displays of quantitative information. Develop framework and build views to measure product success and provide insights at scale.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/123132922071786182"}