{"title": "Product Quality Engineer, Google Home", "level": "Mid", "location": "Hanoi, Vietnam", "description": "Google has one of the largest and most powerful computing infrastructures in the world. Your team is responsible for providing the manufacturing capability to deliver this state-of-the-art physical infrastructure. As a Manufacturing Engineer, you evaluate the product designs and create the processes, tools and procedures behind Google's powerful search technology. When vendors build parts for our infrastructure, you're right there alongside ensuring manufacturing processes are repeatable and controlled. You collaborate with Commodity Managers and Design Engineers to determine Google's infrastructure needs and product specifications. Your work ensures the various pieces of Google's infrastructure fit together perfectly and keep our systems humming along smoothly for a seamless user experience. As a Product Quality Engineer, you will evaluate the product designs and create the quality processes, tools and procedures to help continuously improve the customer experience by improving product quality at our manufacturing site. You will work closely with product management, product design, system engineering, product operations and supply chain teams. You will ensure the various pieces of Google’s operations fit together perfectly while providing a great customer experience. Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "key_qualifications": "Bachelor's degree in Industrial, Mechanical, or Product Engineering, Business Administration, or equivalent practical experience. 5 years of experience in product quality development or manufacturing engineering, and best practices within consumer electronics products. Experience supporting cross-functional problem-solving teams by using practical approaches (e.g., quality metrics, design of experiments, statistical process control/ Six Sigma).", "preferred_qualifications": "Experience preventing quality loss in the early stage of manufacturing, implementing quality escalation processes, and product improvement with Contract Manufacturer (CM) partners. Experience in Mechanical and Electrical Design For Quality (DFQ), Design for Excellence (DFX), Design for Manufacturing (DFM), Design for Test (DFT), and Design for Reliability (DFR), etc. Experience with gauge metrology for process capability analysis (e.g., Cp/Cpk), First Article Inspection (FAI), and equipment gauge repeatability and reproducibility, etc. Experience in Surface Mount Technology (SMT), Printed Circuit Board Assembly (PCBA), system assembly/sub-assembly manufacturing processes with fixture design and implementation.", "responsibilities": "Lead cross-functional teams on quality initiatives, build consensus, communicate and influence at all levels of the company. Define and implement product quality plans through the product development cycle and ensure effective execution in the sustaining cycle. Participate in the design for quality review process with engineering and manufacturing partners. Drive Design of Experiments (DOE) and collect Statistical Process Control (SPC) data to enable evaluation, qualification, and verification cost-effectively in manufacturing quality across functional teams. Implement production quality metric integration, design/process controls and audits. Define specific cosmetic requirements at product and key component level and communicate with manufacturing partners to implement in quality control processes.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/123102963131392710"}