{"title": "Customer Engineer II, Data Analytics, Google Cloud", "level": "Mid", "location": "San Francisco, CA, USA; Irvine, CA, USA", "description": "When leading companies choose Google Cloud, it's a huge win for spreading the power of cloud computing globally. Once educational institutions, government agencies, and other businesses sign on to use Google Cloud products, you come in to facilitate making their work more productive, mobile, and collaborative. You listen and deliver what is most helpful for the customer.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 6 years of experience with cloud native architecture in a customer-facing or support role. Experience with Big Data technologies or concepts. Experience engaging with technical stakeholders and executive leaders.", "preferred_qualifications": "Experience with architecture design, implementing, tuning, schema design and query optimization of scalable and distributed systems. Experience with developing data warehousing, data lakes, batch/real-time event processing, streaming, data processing, data migrations, data visualization tools, and data governance on cloud native architectures. Experience in technical sales or consulting in cloud computing, data analytics, or Big Data. Experience with aspects of cloud computing, market dynamics, and customer buying behavior. Experience in understanding customer requirements.", "responsibilities": "Work with the team to identify business opportunities, understand customer objections, and develop strategies. Share data analytics knowledge to support the technical relationship with customers. Identify business and technical requirements, conduct technical discovery, and architect client solutions. Demonstrate and prototype integrations with Google Cloud products. Deliver business messaging highlighting the Google Cloud value proposition.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/123178275181601478"}