{"title": "Strategic Partnership Manager, YouTube (Mandarin, English)", "level": "", "location": "Taipei, Taiwan", "description": "Google's line of products and services to our clients never stops growing. The Partnerships Development team is responsible for seeking and exploring new opportunities with Google's partners. Equipped with your business acumen and extensive product knowledge, you are right on the front line of interacting with our partners, and helping them find ways to grow using Google's newest product offerings. Your knowledge of relevant verticals and relationships with key industry players will help shape our great applications and content for products such as YouTube, Google TV and Commerce. At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in client management and sales or a related role. Ability to communicate in Mandarin and English fluently to partner with both local clients and APAC partners.", "preferred_qualifications": "Experience in project management, sales and ability to handle multiple time-sensitive projects. Experience with broadcasting networks, Creators, media service platforms. Understanding of the online business as well as the media industry along with excellent strategic thinking and communication skills. Excellent negotiation and problem-solving skills regarding contractual, technical and financial issues. Passionate about video content and content creators/partners.", "responsibilities": "Manage and cultivate strategic relationships with CSPs and Creators. Develop new business opportunities with partners while building healthy creator ecosystem. Create and deploy YouTube best practices, rooted in a deep understanding of effective communication strategies. Help partners achieve their goals by providing consultative support in close collaboration with cross-functional teams including partner support, marketing, product and communications. Cultivate and manage merchant partners and develop new business opportunities.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/123175535193793222"}