{"title": "Principal Engineer, Foundations API and Runtime", "level": "Director+", "location": "Sunnyvale, CA, USA", "description": "Core Machine Learning (ML) is the central machine learning platform team that provides ML software tools and hardware infrastructure to all the Google product areas...", "key_qualifications": "Bachelor's degree in Computer Science, Mathematics, or other relevant engineering discipline, or equivalent practical experience. 15 years of experience as a Software Engineering leader. Experience with technical innovation within cross-functional engineering environments.", "preferred_qualifications": "15 years of experience as a Software Engineering leader in Infrastructure areas, and experience building ML infrastructure or products with ML usage. Experience building software runtimes or intermediate representations of programs in an ML environment. Experience successfully producing software products and large-scale distributed systems. Understanding of computing, data centers, enterprise software, and hardware infrastructure with technical knowledge to be credible with customers and engineers. Ability to balance detailed, technical guidance with big picture strategy, enabling teams to deliver products that are effective and creating ways to manage data. Excellent organization, prioritization, and written and verbal communication skills.", "responsibilities": "Develop a strategic outlook for the low-level foundations of ML. Lead the design of APIs to support ML development and infrastructure that drives efficient execution and distribution of ML workloads across the ML fleet. Work with partners from ML frameworks (i.e., TensorFlow, JAX), Product Areas (i.e., Ads, Search, YouTube, Android), and hardware (i.e., CPU, GPU, TPU, Edge TPU) to develop APIs which support the full lifecycle of ML. Influence partners and stakeholders within and across the organization to build joint roadmaps and drive adoption of APIs. Influence external ML framework developer roadmaps via direct engagements as well as Operational Support Systems (OSS) strategy.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/123436468845585094"}