{"title": "Country Director, Czechia", "level": "Director+", "location": "Prague, Czechia", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. As a Country Director, you work with customers and market influencers to establish long-term visions for advertisers, publishers and partners. You partner with the Sales leadership team to set strategic objectives and run the country’s day-to-day operations. You deeply understand the context of the market, and set visions that inspire your organization. Within Google, you are the primary advocate of your country. You share the opportunities and challenges of the market, and voice the priorities for our products. Within region, you set transparent objectives, collaborate with your functional counterparts and execute. You are an excellent communicator with a proven ability to train and motivate a large team. You use an analytical approach to sales management to develop and grow some of the most significant agencies and businesses in the market. As Country Director for Large Customer Sales Czechia, you will lead members of the cross-functional leadership team and will represent all aspects of Google to the Czech market. You will represent Google from the perspective of an advertiser, publisher, and government official. Ultimately, you will drive how Czech business, government, and consumers view Google. The regional Large Customer Sales (LCS) teams partner closely with our major advertising clients and agencies to develop digital solutions that build our clients' businesses and brands. We are in a unique and exciting position to shape how marketing and business is conducted in the digital age. We generate revenue from across Google's broad range of solutions, from Google AdWords, to YouTube, to Mobile, that help our customers connect instantly and seamlessly with their audiences and get the most out of the web.", "key_qualifications": "Sales and general management experience in technology, advertising, or internet industries. Experience as a people manager (i.e. Manager of Managers) Ability to communicate in English and Czech fluently to support client relationship management in this region", "preferred_qualifications": "Experience with cross-functional leadership and general management capabilities. Ability to focus and prioritize in a fast growing business environment, with an instinct for business generating activities. Experience as an influencer among Czech media, business, and political channels with relationships within the advertising and technology players and publishers in the region. Analytical acumen and thought leadership, paired with an agile mind set. Acquainted with the internet economy, its business models and future perspectives. Willingness to learn essentials of Google products to understand value proposition and growth potentials.", "responsibilities": "Build an advertising sales operations capability to provide premium service to Google’s top advertisers. Contribute strategically to the growth and direction of Google products and services in region. Ensure new product launches are successfully communicated to your local market. Establish relationships with executive level individuals at advertising agencies and direct advertising clients. Meet and exceed country business targets. Prospect, qualify, negotiate, and assist team in closing these key accounts. Manage Czech operations, including the development and execution of the overall country strategy.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/123438405110375110"}