{"title": "Regional Legal Counsel", "level": "Advanced", "location": "Stockholm, Sweden", "description": "As Corporate Counsel at Google, you work on the most exciting legal issues as disruptive technological innovations require creative and proactive legal guidance. You're part of a whip-smart group of in-house lawyers and the projects and cases you take on challenge you to think big and differently. You are collaborative -- ready to partner in initiatives that influence all aspects of the business and work with Googlers from all over the company. As an integrated part of the team, you proactively assess legal risks and advise on products that will not only move information into the 21st century, but move information law forward as well. In this role, you will work as part of a team managing a wide range of legal matters in the Nordics. You will advise the business on its activities in the Nordics, including key legal risks relevant to various Product Areas, and work closely with team members to roll out new products, and negotiate key agreements. 20th century laws don't always solve 21st century problems, and Google Legal crafts innovative approaches for working with some of the toughest legal challenges of the information age. Whether you're a patent attorney, an intellectual property expert or an engineer headed to law school, Google Legal lets you address unanswered legal quandaries and create new precedents. Our innovative services raise challenging questions that demand creative and practical answers. We provide those answers by working at the crossroads of the law and new technology, helping Google build innovative and important products for users around the world.", "salary": "", "key_qualifications": "Bachelor's of Law, comparable law degree or equivalent practical experience in one of the Nordic countries (Sweden, Denmark, Finland, Norway, Iceland). Experience in law firm or in-house in any of the Nordics countries. Ability to communicate in English fluently to support relationship across the Nordic region.", "preferred_qualifications": "Experience working in regulatory matters, including analyzing and advising on proposed and current content regulation. Experience working with multiple jurisdictions, including outside of primary legal education. Experience working in technology. Ability to manage numerous projects simultaneously under deadline pressure. Excellent business acumen, strategic thinking, communication, and presentation skills.", "responsibilities": "Manage and lead litigation cases with external legal counsel and interact internally with all relevant teams to design and execute the best legal approach and strategy. Engage with regulators and authorities to build up constructive relationships, anticipate, address and solve potential legal issues. Support regulatory investigations. Conduct legal reviews of Google’s product, marketing and business initiatives, and work in consultation with Google’s government affairs representatives to provide solution-oriented practical advice to facilitate launches and innovation. Advise executives, business teams and cross-functional project teams with regard to potential legal risks, ensure compliance with applicable laws across all aspects of Google’s operations. Respond promptly to a wide range of legal requests from sales, engineering, product management, marketing, tax, finance, and other functional groups.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/123455068107088582"}