{"title": "Customer Engineering Manager, AI, Google Cloud", "level": "Advanced", "location": "Gurugram, Haryana, India", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 10 years of experience in technology related sales, with 5 years of experience in managing a quota-carrying team. Experience developing strategy to lead sales engineering teams to meet business objectives. Experience working with IaaS, PaaS, Big Data, SaaS, public cloud, or related industry and technical concepts.", "preferred_qualifications": "Experience creating repeatable processes at scale in a pre-sales engineering organization. Experience with big data and machine learning frameworks such as TensorFlow, PyTorch, or scikit-learn. Knowledge of solution architecture. Ability to inspire and grow teams to their full potential in a business environment, while working across cross-functional teams to achieve common business objectives. Ability to present to both technical and non-technical audiences, engaging executive-level stakeholders in business and technology transformation. Excellent business acumen with distinctive problem-solving and investigative skills.", "responsibilities": "Lead, inspire, and grow a team of Customer Engineers across the region who engage with prospects, providing technical discovery and solutions recommendations while working in partnership with customers. Manage and motivate a diverse collection of engineering professionals. Contribute to building a business that promotes exceptional growth and maintain motivation to work effectively in a dynamic environment. Engage with prospects regarding architecture discussions and best practices. Work cross-functionally with our Product, Support, Engineering, and Sales teams. Make presentations to represent the capabilities and services of Google Cloud. Hire, coach, and drive a team to work towards strategic goals, while prioritizing the delivery of an outstanding customer experience.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/123561221646361286"}