{"title": "Strategy Lead, Pixel Ecosystem", "level": "Mid", "location": "Mountain View, CA, USA", "description": "Product and Business Strategy Leaders bring together teams across Google’s functions to help products execute optimally. Our team pushes Google to scale at key points that refine our products and infrastructure by executing efficiently, bringing solid business sense and sound judgment, and working effectively across organizational lines.\n\nOur roles often include components of strategy (e.g. analyzing and understanding new trends in the industry, building business plans), operations (e.g. running the cadence of organizations, connecting the operating lines between our functions), and communications. Our team partners with senior leadership to run important functions that cross-cut our existing organizations and deliver high impact projects. We help Engineers, PMs, UX, and all of our other functions to build amazing products that delight our users, and then get those products into their hands.\n\nThe Devices and Services Strategy and Business Operations team is looking for entrepreneurially minded individuals with a mix of business expertise, strategy and analytics backgrounds to optimize and scale up Google’s Pixel business. This team is part of the central Platforms and Devices Strategy team, and works closely with the Google 1P Devices leadership team and organization. We are responsible for the Pixel product and business strategy, including our long-range outlook, and leverage deep insights and analytics from our sister team in driving Profit and Loss (P&L) decisions in partnership with Finance and our business counterparts.", "salary": "$139,000-$207,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in management consulting, product management and strategy, or analytics in a technology company. Experience working with and analyzing data, and managing multiple projects.", "preferred_qualifications": "Advanced degree or equivalent practical experience. Experience leading complex operational and strategic initiatives. Experience with tech, hardware, or mobile industry. Familiarity with SQL.", "responsibilities": "Structure complex and ambiguous business issues for Pixel’s device leadership and broader executive team. Gather and analyze large amounts of data and market intelligence quickly and problem solve effectively. Develop compelling, insightful, and actionable recommendations to executive audience. Build consensus among cross-functional teams and influence decision-making within leadership audiences. Work closely with product managers, leadership, and functions to operationalize recommendations.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/123711518993720006"}