{"title": "Technical Program Manager III, Cloud CISO, Compliance and Regulatory Analysis", "level": "Mid", "location": "Reston, VA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.", "key_qualifications": "Bachelor's degree in a technical field, or equivalent practical experience\n5 years of experience in program management\nExperience in compliance, information management, audit, or risk management\nExperience in regulatory analysis, risk analysis, or requirement interpretation", "preferred_qualifications": "5 years of experience managing cross-functional or cross-team projects\nExperience in program management in a cloud environment\nExperience in international program management \nKnowledge of security capabilities of cloud products", "responsibilities": "Create and manage compliance programs across one or multiple Google Cloud regions to define, translate, remediate, and monitor Google Cloud compliance. \nAssess and advise on product and operational compliant solutions by evaluating existing solutions against the applicable compliance requirements and advising on technical configurations needed to achieve compliance.\nConduct compliance analysis, control mapping, and risk assessments in order to identify and address potential compliance gaps.\nFacilitate new control creation and drive program compliance gaps to closure.\nMaintenance and reporting on existing compliance qualifications to ensure Cloud remains compliant with existing commitments.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/123880972096545478"}