{"title": "Strategy and Operations Lead, Go-To-Market, Tools and Workflows", "level": "Mid", "location": "New York, NY, USA", "description": "The Business Strategy & Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward.  We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives. The Go-to-Market Operations (GTM) team ensures Google's complex and ever-evolving Ads business runs smoothly. We are instrumental in setting GTM strategy, and ensuring flawless execution. Americas Business and Strategy Organization is the central team in the Americas guiding strategy, operations, and transformation across Ads products and customer industries in Americas Large Customer Services (our largest Ads customer channel). The Americas Business and Strategy Organization  Tools and Workflows team leads activation of core sales tools as they exist today, lands new feature launches, and identifies future capabilities to deliver an assistive, efficient user workflow. The US base salary range for this full-time position is $142,000-$211,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 6 years of experience in management consulting, sales operations, business strategy, investment banking, venture capital, private equity or corporate advisory, or 4 years of experience with an advanced degree. Experience building go-to-market strategies and launching new product features, programs, and initiatives.", "preferred_qualifications": "Experience launching and managing products (internal or consumer facing). Experience in change management, including delivering training and developing communications. Experience working with Product and Engineering to influence product roadmaps. Experience in both project and product management. Experience working with sales organizations.", "responsibilities": "Draw insights from sophisticated business analyses and advanced modeling. Help organize and facilitate core business planning, operating cadences, and leadership engagement to achieve organizational outcomes. Define comprehensive sales, product or business strategies that solve complex business challenges and address the needs of customers and stakeholders across various functions to drive incremental growth. Perform comprehensive research and analysis on market trends, customer behaviors and engaged positions to identify opportunities to scale operations and drive maximum value for the business. Deliver polished presentations with data-driven insights and a strategic narrative to influence executives to adopt recommended strategies. Define actionable plans and roadmaps, align cross-functional stakeholders and lead successful implementation of large and complex change initiatives.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/123999740827181766"}