{"title": "Treasury Accountant, Investments", "level": "Mid", "location": "Chicago, IL, USA", "description": "Google accountants are a savvy bunch who handle the core accounting responsibilities at Google.", "key_qualifications": "Bachelor's degree in Accounting or Finance, or equivalent practical experience.\n4 years of experience in accounting or a related function, or 1 year with an advanced degree in accounting, business, or finance.\nExperience in GAAP accounting principles related to Investments (ASC320), Fair Value (ASC820) or Foreign Currency Matters (ASC830).", "preferred_qualifications": "Certified Public Accountant (CPA).\nExperience in Consolidations (ASC810), Credit Losses (ASC326), Investment Company Accounting (ASC946), and alternative investments.\nAbility to have a collaborative style and work with cross-functional and international teams.\nProficiency with data analysis tools (e.g., SQL, Python, and Scripting).\nExcellent problem-solving and written and verbal communication skills, with the ability to make well-reasoned and timely decisions.", "responsibilities": "Participate in monthly and quarterly close related activities including debt security investments (AFS), Fair Value, CECL, FX remeasurement and translation, equity security, equity method, and structured investments. Including the associated internal management and external (10Q/K) financial reporting processes.\nParticipate in strategic investment initiatives, including technical accounting research and analysis, drafting adoption memo and documenting accounting conclusions, while solutioning operational accounting and reporting considerations to ensure treasury controllership objectives are met.\nSupport compliance of Internal Controls over Financial Reporting (ICFR) program and Sarbanes-Oxley (SOX) requirements, particularly for manual controls, systems controls, and information produced by entity (IPE) for the treasury accounting team.\nLead special projects and initiatives, planning and execution from time to time focusing on treasury related activities.\nComplete other projects as assigned.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/123932291251479238"}