{"title": "Director, Product Management, Data Governance, Compliance and Security", "level": "Director+", "location": "Sunnyvale, CA, USA; Kirkland, WA, USA; New York, NY, USA", "description": "As the Director of Product Management for Data Governance, Compliance and Security, you will scale the Product Management function to best support our fast-growing business. You will drive the product vision, definition, and thought leadership for our Data Governance, Security and Compliance services in our Dataplex product. This covers all aspects of data management from cataloging, to lineage, to quality, to data access management and specialized, sophisticated AI models to support these tasks. You'll drive our data and analytics strategy centered around BigQuery and build out key capabilities for data management. You will create an innovative product go-to-market strategy for Google Cloud’s Data Analytics business and accelerate growth by working collaboratively with Sales, Marketing, and Product teams to drive product adoption, empowering them with compelling business resources, and incorporating customer feedback to shape the product roadmap. You will also partner closely with our Engineering teams and other GCP product areas to ensure seamless product development. You'll execute across numerous proprietary and open source technologies to solve problems for our customers.", "salary": "$253,000-$363,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science or equivalent practical experience. 15 years of experience in product management leadership providing product vision and roadmaps, building and advocating for Data Governance products, driving go-to-market, positioning, pricing, industry needs, and field enablement. Experience in data analytics, including data management and compliance. Experience with enterprise data management, especially data analytics segments.", "preferred_qualifications": "Experience with the enterprise data and analytics market segment, including expertise in application development, analytics, and AI/ML. Experience leading data management and governance products, including bringing them to market. Experience driving thought leadership with industry analysts and press, including experience working with Gartner. Experience with enterprise data architectures and requirements for data management and data compliance. Experience in strategic thought leadership, with the ability to drive sales excellence and operational/product efficiency while simplifying existing go-to-market models. Ability to influence and drive change across cross-functional partners.", "responsibilities": "Develop a strategic vision and collaborate with customers, partners, the field, and engineering to offer a coherent roadmap for our internal and external customers. Work across product, engineering, and services teams to define, build, and support Data Analytics products that span across a portfolio of product offerings. Drive decisions around prioritization, solutions, functionality, and pricing. Influence and establish best product management practices through solid design decisions, processes, and tools. Build and drive a thought leadership narrative with customers and industry thought leaders around databases and how it fits into the greater data narrative. Define Data and Analytics product go-to-market strategies, identify key market/competitive trends and customer opportunities, plan and manage programs to execute against those strategies by partnering with Sales leadership at a regional and global level.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/123960518380528326"}