{"title": "Formal Verification Engineer, Silicon", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.\n\nIn this role, you will help develop the next generation interconnect and platform solutions that scale across Google's Silicon offerings.\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "salary": "", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Science, or equivalent practical experience.\n3 years of experience with SystemVerilog and SystemVerilog Assertion.\nExperience with formal verification.", "preferred_qualifications": "Master's degree or PhD in Electrical Engineering, Computer Science, or a related field.\nExperience with scripting languages (e.g., Python/Perl, and TCL).\nExperience with formal sign-offs of industry ASIC designs.\nKnowledge of formal verification applications (e.g., sequential equivalence checking, and connectivity checking) and data-path verification.\nKnowledge of formal methodology and formal abstraction techniques.", "responsibilities": "Plan the formal verification strategy, and create the properties and constraints for digital design blocks.\nUtilize formal property verification tools combined with formal verification closure techniques to verify properties.\nContribute improvements to methodologies to enhance formal verification results.\nResolve issues to verify properties.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/124088222119535302"}