{"title": "Data Center Site Negotiator", "level": "Mid", "location": "Sunnyvale, CA, USA; Atlanta, GA, USA", "description": "As Google's products and services grow to serve our billions of users, the Strategic Negotiation team works behind the scenes to secure infrastructure for Google's future. It's a big job that involves everything from operating underwater cables to finding data center space. In this role you combine your deep market knowledge with tech industry savvy to find solutions that support Google's growth. You'll work with specific teams to oversee vendor and partner relationships. Your successful management skills have the potential to impact every part of the business and save Google millions of dollars in operating costs. You'll ensure that we receive contract compliance on our third-party agreements, while identifying the most cost-effective solutions for our needs. You'll take lead on special projects, manage vendors and present your recommendations to Google leadership. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience managing projects or supporting the planning and development of agreements. Experience in real estate development, evaluation, acquisition, construction, and site selection for industrial-scale projects. Experience in financial modeling and implementing clean energy initiatives.", "preferred_qualifications": "Experience with power transmission and distribution, telecommunications infrastructure, data center technology, industrial-class electrical and cooling technology, or other related technical areas. Experience in indirect taxes, economic development policy, infrastructure development, agreement drafting, and presentation development. Experience with data center real estate markets. Experience in financial modeling and implementing clean energy initiatives. Ability to propose commercially and technically creative solutions. Ability to work in ambiguous, collaborative, and fast-paced environments.", "responsibilities": "1. Work with internal and external technical teams to identify, define, and pursue new site expansion projects and initiatives necessary to meet Google's ongoing data center needs, including the procurement of infrastructure for existing and new sites. 2. Lead the development of strategic agreements with vendors, landowners, and key suppliers for space and utility services. 3. Implement strategy to enable ongoing growth at existing sites. 4. Foster an open and inclusive workplace for colleagues in day-to-day interactions and conversations. 5. Develop metrics to map, track, and lead a broad range of portfolio management issues regarding site/infrastructure development.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/124018024637178566"}