{"title": "Director of Engineering, Spanner Data Access", "level": "Director+", "location": "Kirkland, WA, USA; Sunnyvale, CA, USA", "description": "Spanner is Google's planet-scale database system that provides unlimited horizontal scaling, ACID transaction semantic, geographic replication, and automated backup and fast recovery. Furthermore it exposes a rich SQL interface that is familiar to other RDBMS systems.", "key_qualifications": "Bachelor’s degree in Computer Science or equivalent practical experience. 15 years of experience in engineering. Experience building and managing a team of 50+ members. Experience with distributed systems and scale-out systems.", "preferred_qualifications": "Experience building transaction processing systems (OLTP) or larger scale analytics (OLAP). Experience with high availability designs, and parallel/horizontal scale-out database architectures. Experience promoting product excellence and collaboration driving a portfolio of concurrent engineering projects, from short-term critical feature launches to long-term research initiatives. Experience motivating others to act by creating a shared sense of vision, purpose, and creating a compelling strategy for the future through clear communication and a collaborative leadership approach. Ability to think in a strategic manner to develop innovative product solutions, with a global mindset to effectively work across regional boundaries.", "responsibilities": "Lead, manage, and inspire a team of Senior Engineers to solve complex technical challenges in Query Processing and Graph for Spanner. Lead four areas (e.g., Query Experiences, Query Execution, SQL Language, and Graph) to build broad multi-year solutions that address customer and industry requirements. Provide technical leadership, drive projects and define a long-term technical roadmap for the team, including business strategy and technology. Coordinate and lead efforts across organizational and product area boundaries like BigQuery and Core Data. Lead through ambiguity, building consensus among cross-functional teams and influencing decision making within senior-level audiences while leading execution against recommendations with agility.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/124021037154083526"}