{"title": "Principal Engineer, AI Data", "level": "Director+", "location": "Sunnyvale, CA, USA", "description": "As the Principal Engineer, you will drive the deep technical aspects of our ambitious AI Data Strategy. You will focus on architecting and implementing data-driven solutions across key areas, including data governance, responsible AI, human data operations, data acquisition and generation, and ML developer toolkit. You will have a unique opportunity to shape the future of AI at Google, collaborating with diverse teams and driving rapid convergence across high-priority strategic areas. You'll have significant autonomy in technical decision-making, backed by data-driven insights and a commitment to tangible, measurable outcomes.", "key_qualifications": "Bachelor's degree in Computer Science, Software Engineering, similar technical field, or equivalent practical experience. 15 years of professional experience in software development. Experience with large-scale machine learning systems. Experience with large-scale ML infrastructure, ML or AI for products, or related fields.", "preferred_qualifications": "Experience building ML infrastructure or products with heavy use of AI/ML and large groups of stakeholders or users. Experience with Responsible AI. Experience with working with stakeholders to understand their needs and translate them into technical requirements. Experience working across highly horizontal areas requiring a high-degree of cross-organizational collaboration and coordination. Understanding of ML Systems and infrastructure for production with technical knowledge to be credible with customers and engineers.", "responsibilities": "Drive the technical vision and execution of our AI Data Strategy, ensuring alignment with broader company goals. Architect and implement solutions across key areas, including data governance, responsible AI, human data operations, data acquisition, generation, ML developer toolkit, data quality and observability, and content ecosystem development. Define and implement technical architecture for ML data solutions, including tools, technologies, and frameworks. Collaborate effectively with diverse teams across Google, including product areas, research teams, infrastructure teams, and data governance and compliance teams. Influence and persuade stakeholders using technical expertise, judgment, and effective communication.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/124294148151747270"}