{"title": "Technical Program Manager I, Compliance, Google Public Sector", "level": "Mid", "location": "Reston, VA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company. As a Technical Program Manager, you will drive the adoption and successful implementation of cloud technologies for public sector clients. You will act as a trusted advisor to public sector clients such as federal and state government agencies, including the department of defense and intelligence community.", "key_qualifications": "Bachelor's degree in a technical field or equivalent practical experience. 2 years of experience in technical program management regulatory compliance initiatives and risk management. 2 years of experience analyzing regulation and using the insights to inform system development. Active US Government Top Secret/Sensitive Compartmentalized Information (TS/SCI) security clearance with polygraph.", "preferred_qualifications": "Experience in compliance, information security, IT audit, or risk management in the United States Federal Government Assessment and Authorization process. Experience engaging with regulators to shape technical regulatory requirements impacting the compliance of Google Cloud Products and Services. Experience with the Risk Management Framework (RMF) and NIST 800-53 (Rev. 4, Rev. 5). Experience with cloud computing platforms.", "responsibilities": "Partner with Google Public Sector and Google Engineering teams across product life cycles to fulfill regulatory requirements. Manage multiple concurrent complex interactions with geographically disparate teams. Support stakeholders in designing appropriate remediation plans for Cloud products and services to meet regulatory requirements. Cultivate trusted technical and business partnerships across Cloud product teams and stakeholders to identify, assess, and resolve recurring compliance challenges. Engage with engineering directors, product leaders and other technical groups, to simplify and streamline how compliance requirements are incorporated into cloud products and services.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/124326872581317318"}