{"title": "Senior Software Engineer, Video Codec Accelerators, YouTube", "level": "Mid", "location": "Mountain View, CA, USA", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search...", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 5 years of experience with software development in one or more programming languages, and with data structures/algorithms. 3 years of experience testing, maintaining, or launching software products, and 1 year of experience with software design and architecture. Programming experience in C++ and Python. Experience with video codec and compression algorithms.", "preferred_qualifications": "Master's degree or PhD in Computer Science or related technical field. 1 year of experience in a technical leadership role. Experience developing accessible technologies. Experience with High-Level Synthesis (HLS) tools and methodologies, such as Vivado HLS and Catapult, or with architecting digital designs for silicon IPs. Experience with mapping algorithms on GPUs, FPGAs or ASICs, with a focus on compute cost and bandwidth optimization while maintaining quality goals.", "responsibilities": "Write and test product or system development code. Participate in, or lead design reviews with peers and stakeholders to decide amongst available technologies. Review code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency). Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback. Research and invent video processing and compression algorithms powering YouTube and beyond.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/124407561930580678"}