{"title": "Multimedia Machine Learning Architect, Silicon", "level": "Mid", "location": "Mountain View, CA, USA; San Diego, CA, USA", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration. Google's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "salary": "$127,000-$187,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Engineering, Computer Science, a related field, or equivalent practical experience. 3 years of experience with machine learning or multimedia technologies. Experience with architecture or silicon engineering such as computer architecture, DSP circuits, VLSI, or RTL. Experience with Machine Learning frameworks such as TensorFlow and PyTorch.", "preferred_qualifications": "Master's degree or PhD in Computer Science, Electrical Engineering, or a related field. Experience in Machine Learning hardware architecture and computer hardware architecture design. Experience in mobile cameras, computational photography techniques, depth sensing cameras, and others. Experience in machine learning and image/video/display processing algorithms for mobile photography applications.", "responsibilities": "Analyze key Machine Learning workloads and the-related user experience and identify hardware acceleration opportunities. Explore design space and map user experience to hardware and software components on SoC. Design Machine Learning acceleration architecture with comprehensive architectural and quality analyses. Collaborate with algorithm owners to design hardware-friendly networks. Collaborate with cross-functional teams such as research, algorithm, product managers, hardware/software/SoC architecture, and implementation at various design stages. Deliver comprehensive architecture specification and analyses.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/124480970974732998"}