{"title": "Agency Relationship Manager, Large Customer Sales", "level": "Mid", "location": "Singapore", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. As an Agency Relationship Manager, you’ll lead and set the strategic direction of the Agency business within the region, working closely with all internal and external stakeholders. You’ll implement execution processes and systems to operationalize the strategy, advocate new Google products and technologies throughout the agency ecosystem, identify business-development opportunities, and develop and manage relationships with agency influencers and key decision-makers. Your objectives is to develop new business, increase existing business to maximize growth, leverage research, market analysis, and other critical information, while being responsive to all agency needs. You'll also collaborate with Google Direct Sales teams to exchange knowledge regarding client needs in specific industry sectors. Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience with agency, media sales and business development.", "preferred_qualifications": "Experience in advertising agencies (offline and online), or sales/marketing. Knowledge of, and established relationships within, a specific region and/or the display advertising (e.g. interactive marketing) industry, traditional and contemporary/online marketing tactics and strategy. Excellent established relationships and presence within the agency marketplace.", "responsibilities": "Own Google's relationship with Big Networks in Singapore as a business leader by developing and executing quality agency partnership plans, with an eye toward proactively co-developing agency capabilities grounded in Google products and platforms. Negotiate and manage commercial deals to grow or defend Google’s SOW for the portfolio. Accelerate key account growth by leading a One Google Team approach, partnering across internal stakeholders. Build clear plans for ensuring product excellence/adoption across key LCS clients (through workshops, hackathons, etc.) by continuously aligning agency priorities with our products. Lead Agency stakeholders through industry-defining moments (e.g., Privacy, Brand Safety, AI transformation), be a trusted Subject Matter Expert for Agency Leadership and the custodian of business reporting for the portfolio.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/124588756064707270"}