{"title": "Software Developer III, Site Reliability Development, Google Cloud", "level": "Mid", "location": "Waterloo, ON, Canada", "description": "Site Reliability Development combines software and systems development to build and run large-scale, massively distributed, fault-tolerant systems. Site Reliability Development ensures that Google Cloud's services—both our internally critical and our externally-visible systems—have reliability, uptime appropriate to customer's needs and a fast rate of improvement. Additionally Site Reliability Developers will keep an ever-watchful eye on our systems capacity and performance. Much of our software development focuses on optimizing existing systems, building infrastructure and eliminating work through automation. On the Site Reliability Development team, you’ll have the opportunity to manage the complex challenges of scale which are unique to Google Cloud, while using your expertise in coding, algorithms, complexity analysis, and large-scale system design. Site Reliability Development's culture of diversity, intellectual curiosity, problem solving, and openness is key to its success. Our organization brings together people with a wide variety of backgrounds, experiences, and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow. With your technical expertise, you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.", "key_qualifications": "Bachelor’s degree in Computer Science, a related field, or equivalent practical experience. 2 years of experience with data structures/algorithms and software development in one or more programming languages.", "preferred_qualifications": "Master's degree in Computer Science or Engineering. 2 years of experience designing, analyzing, and troubleshooting large-scale distributed systems.", "responsibilities": "Write product or system development code. Review code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency). Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback. Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality. Participate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/124532081622426310"}