{"title": "Manager, Manufacturing Business Management, Google Home", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.", "key_qualifications": "Bachelor's degree in Engineering, Supply Chain, or equivalent practical experience. 5 years of experience in program or project management. 5 years of experience with manufacturing, supply chain management, or business operations. 3 years of experience in leadership roles with direct reports. Experience in managing both Contract Manufacturers (CM) and Original Design Manufacturers (ODM) business models. Experience with finance and analytics, cost modeling, and negotiation.", "preferred_qualifications": "MBA (or equivalent) degree. Experience leading procurement and supply chain functions, including leadership and mentorship skills, and a team focused individual who is comfortable operating in an often ambiguous and dynamic work environment. Familiarity with international business customs, and strong negotiator with a demonstrated track record of establishing successful partnerships. Ability to interpret legal documents, identify and implement negotiation strategies, and work with Legal to complete agreements. Ability to communicate in Mandarin and English fluently to support direct engagements with in-region manufacturing partners and internal executives. Ability to travel 25% of the time.", "responsibilities": "Develop JDM partner strategy and implement supplier management processes with selected partners. Lead the creation and implementation of RFx and program award processes for sourcing needs. Discuss all aspects of commercial engagement including contracting of master service agreements and statements of work, Manufacturing Value Add (MVA), and component BOM costs and development build expenses. Optimize costs by collaborating with manufacturing partners and cross-functional teams to determine manufacturing and technical requirements. Manage manufacturing partners to program requirements in cost, quality, schedule, and technology. Generate cost improvement ideas in terms of design for manufacturing or alternative technology choices. Serve as the point of escalation for strategic issues that cross-functional teams encounter while working with the manufacturing partner.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/124515913419367110"}