{"title": "Workday Product Lead", "level": "Advanced", "location": "Hyderabad, Telangana, India; Bengaluru, Karnataka, India", "description": "At Google, data drives all of our decision-making, and our HR organization is no exception. The People Analytics team acts as an internal innovation lab, using analytical approaches to make sure Google continues to be a great place to work.", "key_qualifications": "Bachelor’s degree or equivalent practical experience. Certification in Workday Human Capital Management (HCM), Absence, or Integrations. 10 years of experience in a technical project management or a customer-facing role.", "preferred_qualifications": "Experience in project management and cross-functional collaboration. Experience managing or consulting in an enterprise SaaS HCM system. Experience with international HR processes.", "responsibilities": "Be responsible for the business management of Google’s Human Capital Management (HCM) system in partnership with People Operations (POps) and engineering which includes software update management, solution design, configuration, training, communications, and feature roadmap prioritization. Own and drive stakeholder engagement across POps teams, raising product awareness, establishing and acting upon feedback from stakeholders. Ensure Workday is aligned to HR best practice. Create and maintain project plans, schedules, and other key documents that keep the project on track for successful execution and on-time delivery. Understand and represent customers in identifying and prioritizing functionality enhancements, including international users. Create detail product requirements documents including process flows, use cases and mock-ups, illustrating new proposed system features in a clear and logical manner while partnering with Engineering, Product Management, and Vendors to translate requirements into reality.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/124560209900118726"}