{"title": "Product Support Engineer, Ads Customer Support, gTech", "level": "Mid", "location": "Hyderabad, Telangana, India; Gurgaon, Haryana, India", "description": "Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Everything we do aims to ensure our customers benefit from the full potential of Google products.", "key_qualifications": "Bachelor’s degree in Engineering, Computer Science, a related field, or equivalent practical experience. 6 years of experience in technical project management, stakeholder management, professional services, solution engineering, or technical consulting. Experience with data/SQL and web technologies.", "preferred_qualifications": "Experience working in technical product, cloud support, quality engineering, or SRE roles. Experience using Google Ads or other online advertising solutions, and knowledge of the media/tech landscape. Experience in technical troubleshooting or customer support in a tech organization, and customer-facing experience translating technical concepts and solutions to non-technical and executive audiences. Experience in business analysis to conduct analytics, develop dashboards, and make recommendations. A customer first and empathetic mindset, and ability to own complete experiences and solutions. Excellent problem-solving skills to develop strategic perspectives on customer-focused solutions.", "responsibilities": "Prioritize and deliver outstanding customer service throughout the customer journey, troubleshooting and resolving issues with Google's advertisers and Sales teams, agencies, and partners. Develop deep knowledge of our AI powered Ads products like Performance Max, our Ads Platforms. Troubleshoot complex technical product issues. Apply deep product expertise to solving complex technical customer issues and escalations and carrying out strategic projects. Develop tools and automation for better diagnostics/data fixes and debugging, either independently or in partnership with Product Engineering teams. Improve product feature offerings by providing partner feedback to internal cross-functional teams, including Product Management, Engineering, and Business Solutions teams. Analyze data and insights to create action plans to solve issues at the root cause for our key customers, focusing on knowledge management, operational improvements, account reviews, and product adoption.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/124686084318601926"}