{"title": "Strategic Partner Development Principal Lead", "level": "Advanced", "location": "Sunnyvale, CA, USA", "description": "gTech's Extended Workforce Solutions (xWS) team empowers Product Areas (PAs) to optimize outsourced operations while reducing risks and driving efficiency through the enforcement of Google best practices and policies. We drive informed decision-making, ensuring our partners find the right talent in the right locations. Our collaboration across Google leads to streamlined processes, minimizing administrative burdens and optimizing the Extended Workforce (xW) experience. We ensure Google's policies and guidelines are consistently adhered to.\n\nThe Partner Engagement team is the advocate for xWS, building essential relationships with PAs, Bets, Functions, and the Global Procurement Office (GPO). Our mission is to facilitate xW success, enforcing compliance, building resilient operations, and promoting durable cost savings. We prioritize understanding user needs to develop solutions that address their specific challenges.\n\nIn this role, you'll directly shape Google's strategy impacting regulatory, commercial, and operational decisions.\n\nGoogle creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.\n\nTo learn more about gTech, check out our video.\n\nThe US base salary range for this full-time position is $162,000-$243,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. \n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "salary": "$162,000-$243,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 11 years of experience in business development, partnerships, management consulting, or investment banking. Experience working with senior executives and cross-functionally across all levels of management.", "preferred_qualifications": "MBA or Master's degree. Experience managing agreements or partnerships. Experience managing contingent workforce strategies and initiatives across functions. Demonstrated ability to cultivate global partnerships, aligning stakeholders towards strategic initiatives with regional/global impact. Track record in working with and managing partners in complex programs.", "responsibilities": "Build trusted relationships with senior decision-makers, gaining a deep understanding of their strategic priorities within Product Areas and Bets. Have expertise in xWS menu of services, support senior decision-makers, and get the right talent responsibility by shaping and enforcing cost effective practices and adherence to xWS policies. Have understanding of senior decision-maker business objectives, op model, structure, demand vs. capacity needs. Support extensive change management within PAs to simultaneously launch multiple large-scale enterprise-wide xWS efforts, consult senior decision-makers on xWS policies, and understand impact of changes. Apply understanding of cost-saving strategies and regulatory compliance requirements to position xWS solutions that drive results while mitigating risk. Collaborate with in-country stakeholders to develop and execute a unified regional approach for xWS policies, balancing global consistency with local market needs.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/124794414600987334"}