{"title": "Technical Solutions Engineer, Infrastructure, Google Kubernetes Engine (English)", "level": "Mid", "location": "Warsaw, Poland", "description": "As a Technical Solutions Engineer, you will manage customer challenges in addition to providing level two support to our other Support teams. You will be a part of a global team that provides support to help customers seamlessly make the switch to Google Cloud.\nIn this role, you will troubleshoot technical challenges for customers with a mix of debugging, networking, system administration, documentation updating, and coding/scripting. You will make our products easier to adopt and to use by making improvements to the product, tools, processes, and documentation. You will help drive business growth of Google Cloud by recognizing and advocating for our customers’ challenges.\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor’s degree in Science, Technology, Engineering, Mathematics, or equivalent practical experience.\n4 years of experience coding in a general purpose coding language or in system design, and troubleshooting and advocating for customers' needs, and triaging technical issues.\n4 years of experience with two or more of the following: Web Tech, Data/Big Data, Systems Admin, Machine Learning, Networking, Kubernetes, Oracle, SAP.\nAbility to communicate in English fluently as this is a customer-facing role that requires interactions in English with local stakeholders.", "preferred_qualifications": "Experience debugging complex workload issues across large-scale, multi-node environments.\nExperience with exploratory kernel debugging and performance analysis of containerized systems.\nExperience working with any public cloud (e.g., Google Cloud Platform) services and infrastructure.\nExperience in Computer Networking (e.g., TCP/IP, Routing, Load balancing, etc.).\nUnderstanding of basic web technologies (e.g., HTTP, HTML, DNS, TCP, etc.).", "responsibilities": "Work with customers on their production GKE/Anthos deployments to resolve issues and achieve product readiness, availability, and scale.\nDevelop an in-depth understanding of Google Cloud's GKE/Anthos product technology and underlying architectures by troubleshooting, reproducing, and determining the root cause for customer-reported issues, building tools, and faster diagnosis.\nAct as consultant and subject matter expert for internal stakeholders in engineering, sales, customer organizations to resolve technical deployment obstacles and improve Google Cloud.\nWork as part of a team of engineers/consultants that globally ensure 24-hour customer support. This will include a need to sometimes work non-standard work hours/shifts, and may include weekend work.\nUnderstand customer issues, advocate for their needs with internal teams, including Product and Engineering teams, to find ways to improve the product, and drive production.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/125242763619771078"}