{"title": "Technical Program Manager, Operational Technology Systems Cyber Security", "level": "Mid", "location": "Addison, TX, USA; Omaha, NE, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nThe Compliance Security and Risk Management (CSRM) team is on a mission to physically protect the people and assets that operate and support Google's Data Centers and global critical infrastructure. As a member of CSRM, you will help develop a culture where safety, security and resiliency are integrated into every facet of Google, including the creative process. You will help us continually identify, evaluate and monitor enterprise risks that could affect business activities and provide business leaders the information they need to make critical decisions. You'll collaborate with cross-functional teams to create innovative strategies and develop industry leading programs that drive sustainable effectiveness.\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$122,000-$178,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in a technical field, or equivalent practical experience.\n2 years of experience managing operational technology projects from evaluation to design and execution.\n2 years of experience in designing or deploying operational technology programs.\nExperience managing Operational Technology projects.", "preferred_qualifications": "Experience with security systems or a related field.\nExperience creating Business and Product Requirements Documents and understanding success metrics.\nExperience influencing cross-functional teams without direct authority, with excellent applied program management skills.\nKnowledge of emerging physical security system technologies and trends.\nTechnical knowledge of information security.", "responsibilities": "Be responsible for security operations, vulnerability management and incident response aspects of the cyber security of DC Operational Technology (OT).\nLead an effective program quantifying and reducing cyber risks to the Data Center systems by leveraging knowledge of Building Management Systems (BMS), Property Management Systems (PMS), data center operations and cyber security basics.\nLiaison across all of Google's 7x24 operations, Advanced Technology Innovation and Data Center Operations to ensure the program elements are in line with the business risk appetite.\nWork with partners to create and deliver a program that develops sustainable programs for vulnerability management and incident response.\nCollaborate with partners to support OT Cyber operations and network security projects.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/125332096792044230"}