{"title": "Epitaxy Hardware Engineer, Augmented Reality", "level": "Mid", "location": "Fremont, CA, USA", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.", "key_qualifications": "Bachelor's degree in Mechanical Engineering, Materials Science, Chemical Engineering, Electrical Engineering, a related field, or equivalent practical experience, 8 years of experience as a Manufacturing, Quality, Reliability, or Product Engineer, 5 years of experience in semiconductor equipment, fabrication, or contract manufacturing environment, 5 years of experience in III-N epitaxy equipment engineering", "preferred_qualifications": "Experience troubleshooting and problem-solving in equipment engineering as well as leading tool installation, Understanding of equipment engineering related to semiconductor and facility support equipment, Ability to work in a fast-paced changing environment, Ability to resolve complex issues and analyze equipment schematics for advanced troubleshooting, Ability to communicate cross-functionally (e.g., verbally, emails, reports, technical documents)", "responsibilities": "Maintain, improve, and optimize epitaxial growth reactors used in the most challenging epitaxial crystal growth process in the world: monolithic InGaN red, green, and blue micro LED displays. Learn about epitaxial growth tools and technology from experienced staff including control equipment, vacuum technology, and leading-edge parts cleaning technology. Working with epi process engineers, optimize maintenance, and tool qualification methodologies as we ramp production. Utilize in-house failure analysis resources to drive improvements in parts cleaning and maintenance cycles. Own and drive maintenance, gaining experience leading a team of experienced technicians.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/125347731345416902"}