{"title": "Director, Databases Manageability and AI-assistance", "level": "Director", "location": "Bengaluru, Karnataka, India", "description": "As the Director, Databases Manageability and AI-assistance you will lead the engineering organization globally for AI-assistance for Databases development. You will lead cross-organizationally and cross-globally and be responsible for building and operating a large scale business or function there-in.", "key_qualifications": "Bachelor's degree in Computer Science or related technical field, or equivalent practical experience. 15 years of experience leading teams of software engineers in cloud-based, or open source projects. Experience in design, data structures, and algorithms. Experience building storage or distributed back end systems.", "preferred_qualifications": "Experience leading an engineering team to successfully build and scale a distributed system. Experience partnering closely with Product Management to achieve business goals. Experience collaborating with multiple product and engineering teams. Experience delivering successfully within tight timelines.", "responsibilities": "Hire and build an exceptional database engineering team including senior technical leadership to drive and execute on Google’s global database charter. Be a senior leader for Google Cloud in India - define culture, hiring, growth, and development of engineers. Shape and deliver Google Cloud database products. Establish and manage your project goals, contribute to product strategy, drive architecture decisions, and design solutions to resolve challenging problems for our customers. Provide technical leadership to your engineering team, be a partner for cross-functional teams including Site Reliability Engineering, Product Management, Go-To-Market, and other partner teams to deliver the best product offering. Manage robust and scalable systems in order to get ahead of the exponential demand. Manage a software engineering team that builds, designs, implements, and maintains front-ends and back-ends for Google’s PaaS/IaaS products and related services.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/125560955728732870"}