{"title": "Early Career Software Engineer, Black Community Inclusion", "level": "Early", "location": "Belo Horizonte, State of Minas Gerais, Brazil; São Paulo, State of São Paulo, Brazil", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nGoogle is an engineering company at heart. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on users around the world. At Google, engineers not only revolutionize search, they routinely work on scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, social to local, Google engineers are changing the world one technological achievement after another.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science or related technical field, or equivalent practical experience. 1 year of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript)", "preferred_qualifications": "Master's degree in Computer Science or other technical field.", "responsibilities": "Establish and follow software development best practices and a robust engineering culture.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/125606299745297094"}