{"title": "Developer Relations Engineer, Google Cloud (Bahasa, English)", "level": "Mid", "location": "Jakarta, Indonesia", "description": "Passionate people are everywhere at Google. In Developer Relations, we get excited to collaborate and connect with the communities that love technology as much as we do. Part community manager and part developer advocate, Developer Programs Engineers collaborate with developers at conferences and online, and advocate for developers interests internally at Google. Not afraid to be hands-on, you write sample code and client libraries as well as participate in developer forums and support queues to troubleshoot and debug coding problems developers encounter. Internally, you work with product engineering teams improve our products by conveying feedback from developers, reviewing API designs and testing new features. Chrome, Android, App Engine, HTML5 as well as our core Google Apps and Ads APIs are just some of the platforms you promote and support.\n\nWith your technical expertise, you drive strategy around fostering a community of developers who work with Google technologies. An ardent advocate for these developers, you represent their voice internally to our Product Managers and serve as their Google support in application development and technology implementation.\n\nAs a Developer Relations Engineer, you’ll join a team of Practitioners that empathize deeply with external technical communities, and advocate on their behalf to the Google Cloud Product and Engineering teams, ensuring that our products are built to meet the community's needs and that they provide the best possible user and developer experiences. You’ll raise awareness of Cloud technologies and methodologies within our technical communities. You’ll use your practitioner knowledge and empathy for community in order to define product strategies and to craft narratives around new products and technologies.", "key_qualifications": "Bachelor's degree in Computer Science, a similar technical field, or equivalent practical experience.  5 years of work experience in a technical role (e.g., software engineering, solutions consultant, etc.) or equivalent technical experience.  Experience as a Software Developer, Architect, Technical Advocate, or Community/Product Manager, working with various platforms.  Experience consulting customers with cloud technologies and engaging with developer communities.  Experience in ML and AI including GenAI and guiding developers on the use of these technologies.  Ability to communicate in Bahasa and English fluently as the role supports the local and global developer community.", "preferred_qualifications": "Experience in a large volume of work in AI/ML and are well respected in the AI/ML community of practice.  Experience speaking at technology conferences, blogging/writing technical articles, creating code samples, or contributing to open source projects.  Ability to collaborate with globally distributed teams and influence technical practitioners and stakeholders.  Ability to grow in ambiguity and prioritize effectively amidst a rapidly changing, high-demand environment.  Ability to travel within APAC and up to 30% of the time.  Excellent written and verbal communication skills.", "responsibilities": "Advocate for the community internally and influence Google Cloud product strategy by working with cross-functional teams. Support an inclusive work environment.  Provoke and synthesize feedback and sentiment in order to drive continuous improvement to Google Cloud Platform products and to the overall experience of the platform had by technical practitioners.  Participate in technical communities as a practitioner having, or developing, deep understanding of that community’s needs. Build and foster an external ‘community ecosystem’ of influencers, meetups, experts that amplify our messages and extend our reach.  Represent the needs of relevant technical communities throughout the entire product lifecycle, including input on design discussions, customer zero testing, launch, post-launch updates.  Work with Product and Engineering teams to define product strategies and to craft narratives around new products and features.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/125729798482731718"}