{"title": "NPI Operations Program Manager, Google Home", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in program or project management. 5 years of experience with manufacturing, supply chain management, or fulfillment planning and execution in a New Product Introduction (NPI) role. Experience across all phases of product development from prototype to mass production.", "preferred_qualifications": "MBA or Master's degree or equivalent practical experience. 8 years of industry experience in one or more of the following fields: new product introduction/supply chain, management/manufacturing, operations/development, or operations engineering. Experience across all phases of a product development from prototype to mass production. Ability to foresee risks and manage it with evaluations and mitigation aligned with the team. Ability to drive solutions across multiple cross-functional teams, and the supply chain. Excellent communication skills and analytical skills.", "responsibilities": "Drive overall ramp readiness with engineering, operations, and Joint Design Manufacturer (JDM) teams. Lead CM operations team in planning and executing development builds and new product ramps. Follow through all engineering development builds and influence product manufacturability, testability, and supply chain responsiveness in pursuit of high quality, low cost, and maximum flexibility. Manage all operations-related communications, upward and downward, throughout the organization. Escalate key issues and present options for resolution to the cross-functional executive teams. Oversee and prioritize risk mitigation strategies (i.e., multi-source tech assessment, new tech application, cost variance, supply chain review, and input).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/125808293774795462"}