{"title": "Senior Program Manager, Global Security Operations Center", "level": "Advanced", "location": "London, UK", "description": "Security is at the core of Google's design and development process: it is built into the DNA of our products. The same is true of our offices. You're an expert who shares our seriousness about security and our commitment to confidentiality.", "key_qualifications": "Bachelor's degree or equivalent practical experience. Experience in a Security Operations Center. Experience in law enforcement, intelligence, or a military role, or equivalent private sector experience.", "preferred_qualifications": "Experience managing security operations and security personnel and delivering high quality, customer-oriented security programs. Experience with security technologies including CCTV, Access Control, and Incident Management Systems. Ability to lead projects by navigating priorities, measurable objectives, dependencies, planning, resourcing, scheduling, budgeting, implementation, and subsequent monitoring. High ethical standards with the ability to handle highly confidential and sensitive information with excellent judgment, discretion, and diplomacy. Excellent communication skills and the ability to take initiative while building cross-functional relationships. Excellent critical thinking, analytical, and decision making skills.", "responsibilities": "Coordinate complex and highly cross-functional projects and strategic initiatives to optimize and scale our ability to detect, assess, and mitigate risk while ensuring alignment with broader security efforts. Guide the three other Global Security Operations Center (GSOC) Program Managers across all their deliverables. Drive operational excellence across all programs through standardized monitoring of key performance indicators. Seek opportunities to align program deliverables where operationally appropriate. Contribute to the GSRS (Global Security & Resilience Services) mission to protect, sustain, and enable Google’s ability to succeed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/125859992833008326"}