{"title": "Lab Operations Lead, Google Pixel", "level": "Mid", "location": "Mountain View, CA, USA", "description": "The Consumer Hardware team at Google is all about building brilliant hardware, inside and out. The Technology Engineering team within Consumer Hardware strives to design, define, and build component technologies that enable our devices to deliver the most intuitive, seamless, and helpful user experiences. Technology innovation in audio, display, sensors, wireless, imaging, power, and battery are at the center of those efforts. Numerous labs support these efforts across the team including Electrical Engineering labs, media labs, and chamber labs for RF, and acoustic isolation. In this role, you will manage cross-functional teams and parallel work streams varying in complexity. You will be responsible for coordinating the planning and execution of new lab buildouts, ensuring safety and compliance standards are met, tracking assets and arranging timely equipment calibration, and assisting with equipment purchases. The Google Pixel team focuses on designing and delivering the world's most helpful mobile experience. The team works on shaping the future of Pixel devices and services through some of the most advanced designs, techniques, products, and experiences in consumer electronics. This includes bringing together the best of Google’s artificial intelligence, software, and hardware to build global smartphones and create transformative experiences for users across the world.", "salary": "$120,000-$178,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in a technical field, or equivalent practical experience. 5 years of experience in Laboratory Safety Protocols, Mechanical Metrology, and Electrical Metrology. 5 years of experience in Vendor Management and Procurements, and PCB and FPCB rework (soldering, desoldering, crimping, etc.). Experience in lab management and working on developing and executing new lab build outs.", "preferred_qualifications": "5 years of experience with Fabrication Techniques used for rapid prototyping: Laser cutting, 3D printing, drill press, band saw, etc. 5 years of experience creating and maintaining technical documentation (Drawings, Schematics, SOPs, etc.). 5 years of experience with integration of complex systems (audio, video, compute, optics, etc.). 5 years of experience with laboratory management and inventory control (Equipment, tools, hardware, etc.). 5 years of experience with leadership and technical mentorship of junior members of a team (Workload balancing, Performance review, etc.). Excellent project management skills.", "responsibilities": "Assist with lab space planning and coordinate build out of new labs including lab layouts, specifications, safety and compliance, electrical, networking, cooling, and construction plans. Organize, audit, and manage a lab environment to ensure high productivity for multiple engineering teams, and identify and recommend creative ways to leverage and/or enhance existing practices. Perform inventory tracking of all electrical lab equipment, and create and maintain all maintenance and calibration tracking for all lab equipment. Manage and drive lab expenses for supplies, equipment and capital expenditures, and enforce lab safety and compliance policies.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/125875685032895174"}