{"title": "Senior Account Strategist, Mid-Market Sales, Google Customer Solutions (English, German)", "level": "Mid", "location": "Dublin, Ireland", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.", "key_qualifications": "Bachelor's degree or equivalent practical experience, 5 years of experience in advertising, consultative sales, business development, online media environment, or marketing role, Experience in sales, media sales, account management, marketing or consulting, and exceeding sales goals, Ability to communicate in English and German fluently to work with clients in this region", "preferred_qualifications": "3 years of experience managing digital marketing and advertising campaigns and relationships with customers or agencies, 2 years of experience in project management working in a complex, matrixed organization, Experience strategically assessing and achieving client success via sales techniques, including effective questioning, objection handling and promoting, Experience in managing digital advertising campaigns with a focus on performance marketing, Knowledge of online marketing strategy and tactics, Ability to own a portfolio in an advertising or media sales context in Germany, and consistently overachieve quotas to drive growth", "responsibilities": "Deliver against quarterly business and product growth goals, Own a portfolio of medium and large size businesses by thoroughly understanding growth drivers, identifying opportunities for growth, managing risks and building multi-quarter plans for achievement, Pitch and consult with customers to support annual digital marketing discussions and budgets, Drive customer growth by delivering outstanding customer sales experience and achieving customer business and marketing objectives, Utilize stakeholder management and build relationships with the end customer or agencies", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/125841187855573702"}