{"title": "Business Analytics Manager", "level": "Mid", "location": "Hyderabad, Telangana, India", "description": "Fast-paced, dynamic, and proactive, YouTube’s Trust & Safety team is dedicated to making YouTube a safe place for users, viewers, and content creators around the world to belong, create, and express themselves. Whether understanding and solving their online content concerns, navigating within global legal frameworks, or writing and enforcing worldwide policy, the Trust & Safety team is on the frontlines of enhancing the YouTube experience, building internet safety, and protecting free speech in our ever-evolving digital world.\nAt YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.", "salary": "", "key_qualifications": "Bachelor's degree in Mathematics, Physics, Statistics, Computer Science, Engineering, Economics, Operations Research, Bioinformatics, Computational Biology, a similar quantitative field, or equivalent practical experience.\n6 years of experience working in data analytics, consulting, data science, engineering, or a technical operations role.\n6 years of experience in statistical problem-solving and analyzing data sets using SQL or comparable coding language (e.g., Python, R, Java, C++).", "preferred_qualifications": "Experience collecting, managing, and synthesizing data sets and information from disparate sources, statistical modelling, data mining, and data analysis.\nExperience with established procedures for responding to potential regulatory violations, investigation protocol, and any mandatory reporting requirements to government agencies.\nExperience in project management with metrics analysis, experiment design, and automation.\nKnowledge of content moderation policies, online safety regulations, and standards.\nExcellent analytical and problem solving skills, with the ability to translate analytical insights into business strategies.", "responsibilities": "Formulate strategies and lead a dedicated analyst team to work with operations, product and Engineering across YouTube Trust and Safety.\nMeasure, analyze, and develop opportunities to enhance operations at scale.\nLead the team to create and deploy scaled solutions ranging from statistical measurements, experimentation and insight platforms, and data and reporting pipelines.\nCollaborate with stakeholders and partners in engineering, product, partnerships, policy and legal to drive anti-abuse solutions involving and impacting various cross-functional areas.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/125920874598408902"}