{"title": "Technical Program Manager, Site Reliability Engineering", "level": "Advanced", "location": "Waterloo, ON, Canada", "description": "Google's projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique developing challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary developing projects using your developing expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You're equally at home explaining your team's analyses and recommendations to executives as you are discussing the technical trade-offs in product development. Using your extensive technical and leadership expertise, you manage various developing-specific programs and teams. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree in a technical field, or equivalent practical experience. 8 years of experience in Technical Program Management, Program Management or a related domain. 8 years of experience managing cross-functional or cross-team projects. 8 years of experience in leadership role(s) with direct reports.", "preferred_qualifications": "Experience with Product Trust, Security, Reliability and Resilience programs, Disaster Recovery. Experience navigating competing technical priorities and programs. Understanding of Machine Learning or Artificial Intelligence concepts. Ability to translate technical program details into executive-level summaries. Ability to influence across a cross-functional organization.", "responsibilities": "Lead a team of Automotive Test Suite (ATS) Technical Program Managers. Guide their career development, coach, mentor and identify opportunities for exciting career challenges. Drive cross-functional programs in large work groups that span multiple teams and proactively manage stakeholders through communication and alignment. Collaborate with leadership in key program decision making including scope definition, requirements gathering, staffing, planning and execution of programs. Demonstrate strategic impact by developing cross-functional tools and processes to transform the operation and effectiveness of the organization. Streamline processes and drive improvements to deliver scale and efficiency. Collaborate and build alliances with Program Manager functions across the organization, sharing knowledge and experience to scale efforts.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/125926559994258118"}