{"title": "Software Engineer III, Performance Modeling, Silicon", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. Google's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, Electrical Engineering, or equivalent practical experience. 2 years of software development experience. Experience with C/C++ programming.", "preferred_qualifications": "Experience in SystemC or RTL. Experience in software-based architecture simulators or FPGA/ASIC-based emulation platforms. Experience with performance evaluation for mobile devices. Familiarity with computer architecture, especially ARM SoC architecture and AMBA protocols.", "responsibilities": "Develop simulation models at different abstraction levels (cycle accurate/TLM /functional). Build models for SoC components like processors, machine learning accelerator, memory subsystem, bus interconnect, and other peripherals. Perform system level modeling for SoC architecture and performance exploration and analysis.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/125946830092411590"}