{"title": "Data Scientist, Search, Real World Journeys (English, Portuguese)", "level": "Mid", "location": "São Paulo, State of São Paulo, Brazil", "description": "In this role, you will work cross-functionally with multiple tech leads from Engineering, Product and UX to advance our metric capabilities. You will apply advanced modeling techniques (e.g., LLM, Gemini models) for ML based metrics, Human Evaluation methods and design research based on user-survey data. Our responsibilities include metric development, product performance investigation, experiment design, and complex user journey analysis.", "key_qualifications": "Master's degree in Statistics, Data Science, Mathematics, Physics, Economics, Operations Research, Engineering, a related quantitative field, or equivalent practical experience. 5 years of work experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis, or 3 years of work experience with a PhD degree. Ability to communicate in English and Portuguese fluently to support client relationship management in this region.", "preferred_qualifications": "8 years of work experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis, or 6 years of work experience with a PhD degree.", "responsibilities": "Partner with Product and Engineering teams of Real World Journeys to provide problem-solving thought leadership, support metrics research and advanced statistical analysis of complex user journeys on search. Work cross-functionally to identify metric improvement areas, design new metrics and evaluation methods. Support teams with advanced experimentation methods, detecting user learning effects and driving actionable user insights from A/B testing metrics analysis. Work with large data sets and solve non-routine investigative issues, use problem-solving and statistical methods to the issues to measure quality, improve consumer products, and understand the behavior of end-users. Make product recommendations with effective presentations of findings at multiple levels of stakeholders, and storytelling with data.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/125952425361056454"}