{"title": "Customer Engineer II, Infrastructure Modernization, Google Cloud", "level": "Mid", "location": "Irvine, CA, USA", "description": "When leading companies choose Google Cloud, it's a huge win for spreading the power of cloud computing globally...", "key_qualifications": "Bachelor's degree or equivalent practical experience. 6 years of experience with cloud native architecture in a customer-facing or support role. Experience engaging with, and presenting to, technical stakeholders and executive leaders.", "preferred_qualifications": "Experience with cloud or on-premises infrastructure engineering. Experience in migrating applications and services to cloud platforms. Experience with virtualization or containerization platforms. Experience with security concepts such as encryption, identity management, access control, attack vectors, and pen testing. Experience with networking concepts such as software-defined networking, routing, virtual private networks, load balancers, and firewalls. Experience prospecting, building, and maintaining customer relationships from scratch, with excitement for building greenfield territories in enterprise accounts.", "responsibilities": "Work with the team to identify and qualify business opportunities, understand key customer technical objections, and develop the strategy to resolve technical blockers. Share in-depth enterprise infrastructure modernization expertise to support the technical relationship with customers including technology advocacy, supporting bid responses, product and solution briefings, proof-of-concept work, and partnering directly with product management to prioritize solutions impacting customer adoption to Google Cloud. Work directly with Google Cloud products to demonstrate and prototype integrations in customer and partner environments. Guide customers through assessments of existing legacy application environment(s) and provide recommendations on a prioritization roadmap for infrastructure and application modernization. Recommend integration strategies, enterprise architectures, platforms, and application infrastructure required to successfully implement a complete solution on Google Cloud.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/125900417065198278"}