{"title": "Technical Account Manager, Google Cloud Consulting (English, Chinese)", "level": "Mid", "location": "Taipei, Taiwan", "description": "The Google Cloud Consulting Professional Services team guides customers through the moments that matter most in their cloud journey to help businesses thrive. As a Technical Account Manager (TAM), you will help customers successfully adopt Google Cloud products.", "key_qualifications": "Bachelor’s degree in Computer Science, Engineering, a related technical field, or equivalent practical experience. 5 years of experience in a customer-facing role working with stakeholders, driving customer technical implementations or transformation programs. Experience supporting customers in cloud operations (e.g., launch or capacity planning, product release management), technical support, escalation management, or IT consulting. Experience in application/workload migration to public cloud providers, leading global projects or teams, and working with customers or partners. Ability to communicate English and Mandarin Chinese fluently to engage with Chinese speaking or English speaking customers.", "preferred_qualifications": "Experience translating business requirements into technological solutions. Experience collaborating with teams, groups, business units, channel partners, systems integrators, and third-party developers to deliver high-impact solutions. Knowledge of IT operations, database systems, networking, IT security, application development, service architecture, cloud-native application development, hosted services, storage systems, or content delivery networks. Ability to communicate in Japanese and Korean to better support North Asia Customers. Excellent communication, presentation, problem-solving, and management skills, with the ability to translate business requirements into technological solutions.", "responsibilities": "Accelerate customer adoption of Google Cloud by leading the implementation journey, provide technical guidance and manage timelines, milestones, migration goals, and business transformation strategies. Advocate for customer needs in order to overcome adoption blockers and drive new feature development. Develop relationships with stakeholders to understand customer’s business, develop strategic roadmaps, and lead quarterly business reviews and executive sessions to better understand business and technical needs. Plan for customer events and launches, partnering with Support, Engineers, and Site Reliability Engineers to ensure customer success, and work with customers and Support to guide issues/escalations to resolution. Develop best practices and assets based on learnings from customer engagements to support initiatives to scale through partners and accelerate Google Cloud adoption.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/126045765939143366"}