{"title": "Technical Program Manager, Data Center Construction (English, German)", "level": "Mid", "location": "Frankfurt, Germany", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nIn this role, you will deliver large-scale, high-value Data Center projects. You will administer and coordinate construction agreements, serving as primary contact between Google and contractor, and coordinate and oversee the extended workforce. You will develop an understanding of the project delivery details, and use experience in the construction space and knowledge of the project to elevate the performance of other project stakeholders through active management.\n\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "salary": "", "key_qualifications": "Bachelor's degree in Electrical, Mechanical, Industrial, Construction Engineering, or equivalent practical experience. 5 years of experience in program management. Experience in commercial contract management, procurement, and managing construction projects. Experience in project and construction management. Ability to communicate in English and German fluently as this is a customer-facing role that requires interactions in English and German with local stakeholders.", "preferred_qualifications": "5 years of experience managing cross-functional or cross-team projects. Experience in managing extended workforce relationships, with an understanding of standard practices in the design and construction industry. Experience in data center equipment and environments, with an understanding of start up and commissioning processes. Knowledge of large-scale facility electrical and mechanical systems. Ability to build excellent relationships and deliver action-oriented tasks. Excellent skills in requirement gathering, resource organization, task prioritization, scheduling, and achieving goals.", "responsibilities": "Manage site-wide data center construction and delivery organization, managing scopes related to construction projects and/or large capital improvement projects. Be responsible for ensuring the development of detailed designs, managing construction (e.g., delivery, schedule, cost, quality and EHS), commissioning, close-out and hand-off to the operations team. Establish and maintain various delivery models and global relationships with multiple vendors. Create a growth plan and be involved in hiring/recruiting of talent in the areas of project management, field engineering, document control, technical writing, etc. Research and implement construction means and methods of data center equipment and facilities. Carry design concepts into mass production and integrate into facilities.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/126172829459587782"}