{"title": "Administrative Business Partner, Large Customer Sales", "level": "Mid", "location": "London, UK", "description": "As an Administrative Business Partner, you're at the heart of your team's business operations and activities and the soul that keeps your team moving forward. You anticipate the needs of your managers and team members and help them stay focused on their projects by resolving operational and administrative issues before they arise. You move quickly with the changing environment and are up to date with the latest Google products and services. You also use that knowledge to strategically support your team's projects. In addition to being organized and analytical, you possess the strong business judgment and communication skills needed to interact with a variety of people and job functions.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 3 years of experience in administrative roles in an international environment working on core administrative tasks (e.g., travel management, expense reports, calendar management, facilities coordination, etc.). Ability to communicate in English fluently to support client relationship management in this region.", "preferred_qualifications": "6 years of experience in administrative roles, supporting executive-level management in a corporate environment, and managing small-scale projects and events from pre-planning to execution. Ability to consistently and positively contribute in a fast-paced, changing work environment, and prioritize multiple functions, tasks, and manage work time efficiently. Ability to lead small to medium sized projects and manage teams. Ability to take initiative and build productive relationships. Excellent attention to detail and organizational skills, with the ability to manage multiple stakeholders and priorities. Excellent communication and teamwork skills.", "responsibilities": "Schedule, maintain, and update calendar events, with minimal guidance. Prepare meetings for the executive or team with minimal guidance. Execute expense management activities with minimal guidance. Assess and advocate for office space needs with minimal guidance. Plan and organize internal and external programs and events and manage event logistics in collaboration with internal partners and external vendors. Complete travel coordination tasks with minimal guidance.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/126236374238929606"}