{"title": "Software Engineer, Edge TPU Developer Tools, Silicon", "level": "Mid", "location": "Mountain View, CA, USA; Bellevue, WA, USA", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. We are the team that builds Google Tensor, Google’s custom System-on-Chip (SoC) that powers the latest Pixel phones. Tensor makes transformative user experiences possible with the help of cutting-edge Machine Learning (ML) running on Tensor TPU. Our team’s work enables Gemini Nano, our efficient AI model for on-device tasks to run on Pixel phones. Our goal is to productize the latest ML innovations and research by delivering computing hardware and software. Google's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "salary": "$161,000-$239,000 + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 5 years of experience with software development in C++, and with data structures/algorithms. 3 years of experience testing, maintaining, or launching software products, and 1 year of experience with software design and architecture. 3 years of experience with machine learning algorithms and tools (e.g., TensorFlow), artificial intelligence, deep learning or natural language processing. Experience with stakeholder management, project alignment/management, or cross-functional collaboration.", "preferred_qualifications": "Master's degree or PhD in Computer Science or related technical field. Experience with domain-specific compilers for machine learning. Experience in power and performance optimizations. Experience with low intrusiveness tooling concepts such as profiling, instrumentation, bug isolation, data race detection, out-of-bounds access detection, performance estimation, and tracking source-level information through compiler transformations. Understanding of hardware, especially hardware that provides a high-degree of parallelism.", "responsibilities": "Design and implement tools for bug detection, isolation, reproducer generation, and correction. Build tools that use and complement the compiler infrastructure to efficiently map ML models to the hardware. Develop parallelization and scheduling algorithms to optimize compute and data movement costs to execute ML workloads on the EdgeTPU. Design and implement new ways to gather useful performance and debugging data and relate them to the ML graph. Collaborate with ML model developers, researchers, and EdgeTPU hardware/software teams to accelerate the transition from research ideas to user experiences running on the EdgeTPU.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/126334580813636294"}