{"title": "Deal Governance Advisor", "level": "Mid", "location": "Chicago, IL, USA", "description": "In this role, you will partner with Business Development, Product, Strategy, Finance, and Legal teams to manage and govern key strategic partnership agreements while managing risk, ensuring compliance, and helping cross-functional teams realize value to Google, our users, and partners. You will work in one of Google’s most dynamic product areas, Platforms and Devices (P&D), covering a diverse group of products including Play, Android, and Chrome ecosystems while being on the forefront of delivering AI capabilities to our users. As part of the Global Deal Governance team, you will be responsible for guiding and advising teams on commercial agreements to ensure efficiency, velocity, and effective governance.", "key_qualifications": "Bachelor's degree in business, economics, information technology, finance, accounting, or equivalent practical experience. 4 years of experience in risk management, compliance, project management, finance, sales operations/go-to-market, or management consulting, or 1 year of experience with an advanced degree.", "preferred_qualifications": "Experience interacting with executives on a regular basis, with excellent communication and collaboration skills. Experience using data to analyze business problems and to spotlight risks and compliance gaps, process improvement/six sigma, and automating business processes. Understanding of partner management, information technology, procure-to-pay, and finance operations. Strong project management and stakeholder management skills, especially in leading cross-functional teams and interfacing with senior leadership on a regular basis.", "responsibilities": "Engage and collaborate closely with Partnerships, Product, Legal, Finance, and other cross-functional teams to ensure appropriate governance and compliance for commercial agreements. Establish, update, and implement processes, policies, procedures, and controls to mitigate risk for Google. Provide guidance, training, and advice to Sales, Finance, and other cross-functional teams on new agreements, feature launches, and the full business agreement lifecycle from ideation to metric tracking. Manage and mitigate risks and the strategic and operational implications associated with commercial agreements. Lead and support business initiatives to help scale, automate, and bring insights to partnership agreements and spend processes, spotlight risks, and improve controls.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/126414305942741702"}