{"title": "UX Designer, Core Data UX", "level": "Mid", "location": "Bangalore, Karnataka, India", "description": "At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" Google’s Interaction Designers take complex tasks and make them intuitive and easy-to-use for billions of people around the globe. Throughout the design process—from creating user flows and wireframes to building user interface mockups and prototypes—you’ll envision how people will experience our products, and bring that vision to life in a way that feels inspired, refined, and even magical. Google User Experience (UX) is made up of multi-disciplinary teams of UX Designers, Researchers, Writers, Content Strategists, Program Managers, and Engineers: we care deeply about the people who use our products. The UX team plays an integral part in gathering insights about the attitudes, emotions, and behaviors of people who use our products to inspire and inform design.", "key_qualifications": "Bachelor's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 5 years of experience in User Experience Design, HCI, Interaction, data visualization, or in a similar industry. Experience using UX tools (e.g., Figma, Sketch, Framer, etc.). Experience collaborating with Engineers, Content Strategists, and Product Managers throughout the design process.", "preferred_qualifications": "Experience working across organizational boundaries and collaborating with cross-functional teams. Experience designing enterprise, data infrastructure, or high complexity software to design robust enterprise applications. Excellent core interaction design skills, knowledge of the user-centered design methodologies, and an understanding of designing for a quality user experience.", "responsibilities": "Present concepts, proposals, and updates to executive stakeholders and translate concepts and interactions into simple, elegant, and coherent designs. Manage designs based on customer feedback, tech constraints, and business demands. Partner with and leverage UX research to inform design decisions and validate concepts. Create storyboards, service blueprints, wireframes, user flows, mocks, designs, and prototypes to guide design and development. Deliver precise, conceptually sound, and visually elegant design specs, working closely with engineers to ensure high quality execution. Collaborate with cross-functional partners to understand, define, and explore the problem space.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/126682999627358918"}