{"title": "Hardware Validation Engineer, Google Pixel", "level": "Mid", "location": "Mountain View, CA, USA", "description": "The Pixel Platform team is responsible for Pixel platform hardware design excellence by leading system-level platform bench validation and performance optimization. You will contribute experience in hardware system design and verification, and knowledge of the overall system architecture of consumer electronics products. Additionally, you will define hardware system quality and validation strategy for new products in high-speed interfaces, signal/power integrity, system integration, user experience, etc.", "key_qualifications": "Bachelor’s degree in Computer Science, Electrical Engineering, Computer Engineering, Physics, or equivalent practical experience. 4 years of experience working in a consumer electronics technical environment with validation experience, or 3 years with an advanced degree.", "preferred_qualifications": "Master's degree or PhD in Electrical Engineering, Computer Engineering, Physics, or a related field. Experience designing high speed digital or analog systems. Experience with design of cell phone baseband. Experience with embedded systems, processor selection... more details available.", "responsibilities": "Be responsible for ensuring the hardware system design integrity and quality optimization of Google Pixel platform designs. Lead cross functional collaboration in executing validation plans, troubleshooting issues, and documenting results to ensure product design quality and ecosystem performance. Lead complete design verification, signal characterization, power delivery and system interoperability testing. Defined comprehensive system level validation plans for the Pixel ecosystem. Lead cross-functional teams and drive issues resolution including those related to hardware architecture, system performance, production quality and overall system integration.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/126700867771343558"}