{"title": "Hardware Engineer, FPGA Design, Quantum AI", "level": "Mid", "location": "Goleta, CA, USA", "description": "The Quantum team's mission is to make state-of-the-art quantum computing tools available to the world to enable humankind to solve problems that would otherwise be impossible. The Quantum electronics team is carrying out a broad range of R&D aimed at implementing the best quantum computers in the world, with a long-term goal of realizing a fault-tolerant quantum computer.\nIn this position, you will contribute to the development of robust and scalable FPGA-based architectures that are essential for realizing the full potential of quantum computing. Your solid grasp of digital design and verification methodologies will be used to ensure the reliability and correctness of FPGA designs. You will ensure functionality of deployed systems. As part of the Quantum Computing team, you will have the opportunity to contribute to transformative projects at the forefront of quantum computing research, pushing the boundaries of computation and unlocking new possibilities in science and technology.", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Engineering, a related field, or equivalent practical experience.\nExperience in FPGA design and development.\nExperience with RTL design using Verilog or System Verilog.", "preferred_qualifications": "Master's degree or PhD in Electrical Engineering, Computer Engineering, or a related field.\nExperience with DACs, ADCs and communication protocols such as Ethernet, PCIe.\nBasic software knowledge in C/C++, Python.\nUnderstanding of FPGA architectures, synthesis, timing analysis, clock domain crossing, and development tools (e.g., Vivado, Quartus).\nDemonstrated ability to solve complex design challenges and debug FPGA systems.", "responsibilities": "Develop efficient microarchitecture, RTL code using Verilog/System Verilog to realize complex digital logic designs on FPGAs. Synthesize and optimize FPGA designs for performance and resource utilization.\nCreate test benches and plans to verify FPGA designs, ensuring functionality and correctness through simulations and testing.\nIdentify and resolve issues in RTL and post-synthesis stages using debugging tools and methodologies.\nMaintain design documentation and communicate progress and findings effectively in meetings and reviews.\nStay updated on FPGA technology and collaborate closely with cross-functional teams to achieve project objectives.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/126815292142559942"}