{"title": "Senior Strategist, Trust and Safety, Search Discovery", "level": "Mid", "location": "Bengaluru, Karnataka, India; Hyderabad, Telangana, India", "description": "Trust is a critical priority for Discover given the high stakes and complexity of serving a personalized feed that operates globally with huge reach and potential.Trust and Safety is a team of user trust experts who cultivate thought leadership, domain knowledge and innovation to help Google stay ahead of abuse and deliver trusted and safe experiences to all users.\n\nYou will work alongside product, engineering, and policy teams to understand risk, detect harm patterns, apply technology like AI, LLMs to novel trust problems, and define industry best practices.\n\nAt Google we work hard to earn our users’ trust every day. Trust & Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience working with investigative tools or data analysis. 4 years of experience in data analytics, Trust and Safety, policy, cybersecurity, or related fields. Experience with SQL, data analytics, and colaboratory.", "preferred_qualifications": "Experience in product policy analysis and identifying policy risks. Experience in working with abuse, spam, fraud or malware. Experience using statistical analysis and hypothesis testing. Experience with AI, LLMs, Trust and Safety, or Cybersecurity. Excellent influencing skills, with the ability to work in a dynamic environment.", "responsibilities": "Lead and manage trust projects (e.g., build critical trust protections to fight abuse in user generated content space, scale user base to key markets while meeting goal trust metrics), analyze and debug escalations, and identify trends that can indicate product risks.\nDrive project delivery, challenge proposals and identify risks, manage multiple projects, and scope against crashed timelines.\nDrive usage and adoption of AI efforts for abuse fighting by identifying opportunities to reduce Operational Expenditure (OPEX), and improve quality of decision making.\nPerform on-call responsibilities on a rotating basis, including weekend coverage as needed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/126986023535026886"}