{"title": "Software Engineering Manager, SysInfra Performance Engineer", "level": "Advanced", "location": "Sunnyvale, CA, USA", "description": "Like Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers. You not only optimize your own code but make sure Engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way. With technical and leadership expertise, you manage engineers across multiple teams and locations, a large product budget and oversee the deployment of large-scale projects across multiple sites internationally. As a Software Engineering Manager, you will have the opportunity to find the perfect blend of software design practices, modeling, and performance analysis works that informs the system architecture and design of Google systems. You will use your software engineering expertise to lead a team to solve complex problems including but not limited to hardware acceleration, performance bottlenecks, system hierarchies, concurrency, computer organization, and whole-stack co-design and optimizations. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$189,000-$284,000 + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). 3 years of experience in a technical leadership role; overseeing projects, with 2 years of experience in a people management, supervision/team leadership role.", "preferred_qualifications": "Master's degree or PhD in Electrical Engineering, Computer Engineering, Computer Science, or a related field. Experience working with Hardware and Software teams developing complex SoC’s. Experience in correlating modeled performance with RTL/Emulation/Silicon. Experience leading project teams and setting technical direction. Knowledge of one or more of the following areas: CPU, Cache, Interconnect, DRAM, or PCIe. Excellent communication skills, with the ability to work across Hardware and Software teams.", "responsibilities": "Utilize system architecture and hardware/software co-design for current and future compute platforms, focusing on Machine Learning and Cloud. Develop engineering driven methodology to inform the system architecture and design of compute platforms deployed in Google data centers. Model and analyze key Google and Cloud workloads to drive server platform architecture design. Participate in performance analysis for deployed platforms to understand and mitigate performance bottlenecks. Collaborate with partner teams up and down the entire stack (e.g., hardware, kernel, networking, CoreML, Google Compute Engine (GCE), Borg) to land impactful results. Characterize system performance from application to infrastructure to hardware.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/127149706349290182"}