{"title": "Principal Architect, Federal Civilian Agencies, Public Sector", "level": "Advanced", "location": "Reston, VA, USA; Washington D.C., DC, USA", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners. As part of the Customer Engineering organization in Google Cloud, you will lead cross-functional teams of experts to help customers design, plan, implement, and govern enterprise cloud strategies. The Google Cloud Principal Architect role is a hybrid technical and business advisor role. In this role, you will embody executive level qualities, lead the conversation, and direct the execution of the sales team by combining both technical vision and business insight. Principal Architects partner heavily with Value Engineering to articulate the true total value of each technical solution and the overall business partnership with Google Cloud. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$142,000-$214,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, a related technical field, or equivalent practical experience. 10 years of experience as an enterprise architect or equivalent experience in a customer-facing role. Experience in cloud market insights and cloud computing across applications, infrastructure, storage, platforms, or data. Experience engaging with, and presenting to, technical stakeholders and executive leaders. Experience in, or supporting, Federal Civilian agencies. Experience in, or supporting, the Healthcare/Biomedical Research industry to include public sector.", "preferred_qualifications": "Experience with structured enterprise architecture practices, hybrid cloud deployments, and on-premise-to-cloud migration deployments and roadmaps. Experience with designing, managing or utilizing biomedical research platforms. Experience in enterprise technology buying and evaluation process paired with a understanding of large scale computing solutions and experience in building, architecting, designing and implementing highly distributed global cloud-based systems. Knowledge of technology solutions and ability to learn and work with new emerging technologies, methodologies, and solutions in the Cloud/IT technology space. Ability to deliver results and work cross-functionally to position and orchestrate a solution consisting of multiple products.", "responsibilities": "Build a trusted advisory relationship with strategic accounts and engage with Architects, Vice President Engineering, C-level, and identify customer priorities, technical objections and design strategies encompassing the entire Google ecosystem to deliver business value and resolve blockers. Provide domain expertise around public cloud and enterprise technology, and effectively promote Google Cloud with customers, at conferences, and online. Make recommendations on integration strategies, enterprise architectures, platforms, and application infrastructure required to successfully implement a complete solution while providing best practices to customers to optimize Google Cloud effectiveness. Manage the holistic enterprise architecture relationship with customers by collaborating with specialists, product management, technical teams, and more. Travel to customer sites up to 50% of the time for conferences and other related events as required.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/127250543792792262"}