{"title": "Product Manager II, Ordering, Google Cloud Business Platforms", "level": "Mid", "location": "Bengaluru, Karnataka, India; Hyderabad, Telangana, India", "description": "At Google, we put our users first. The world is always changing, so we need Product Managers who are continuously adapting and excited to work on products that affect millions of people every day. In this role, you will work cross-functionally to guide products from conception to launch by connecting the technical and business worlds...", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in product management or related technical role. 2 years of experience managing technical products from conception to launch. Experience in building enterprise software products.", "preferred_qualifications": "8 years of experience in product management building enterprise software products. Experience in one or more of the following: cloud infrastructure, SaaS, Big data, security and privacy, development and operations, or artificial intelligence/machine learning. Experience managing day-to-day technical and design direction. Knowledge of multiple functional areas such as Product Management, Engineering, UX/UI, Sales, Customer Support, Finance or Marketing. Ability to influence multiple stakeholders without direct authority.", "responsibilities": "Understand the cloud ecosystem markets and user requirements, define product roadmaps by operationalizing defined strategy. Articulate defined product goals in a way that captures attention and compels others to drive action despite obstacles and priorities. Validate the market size and opportunity (e.g., user-based, strategic opportunity, business). Identify opportunities in the market landscape. Develop solutions to problems by collaborating as needed across regions, product areas, and functions. Facilitate launches, maintenance, and retirement in collaboration with other cross-functional teams and stakeholders. Support Product Requirements Documents (PRDs) by collaborating with partner teams (e.g., Engineers, Program Manager (PgM), UX) during product design and development to implement the requirements.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/127381266558264006"}