{"title": "Senior Software Engineer, Android", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "In this role you will be part of an engineering team responsible for the overall user experience of the Android OS and parts of the operating system itself. The team is responsible for the motion, graphics, and performance of the Android user experience, as well as for building frameworks and tools for the rest of the development community. In this role, you may also build testing and animation frameworks, develop web-based tools for issue analysis and capture, and strive to develop animated user experiences. Android is Google’s open-source mobile operating system powering more than 3 billion devices worldwide.", "salary": "", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 5 years of experience with software development in Kotlin, Android, Java, and with data structures/algorithms. 3 years of experience with Android application development.", "preferred_qualifications": "Master's degree or PhD in Computer Science or related technical field. 3 years of experience with performance, data analysis, visualization tools, or debugging. 1 year of experience in a technical leadership role. Experience in Android Apps, Android Libraries, Web Applications, TypeScript, Angular, Graphics, Motion Design, User Experience, Operating Systems, Mobile, or UI Design.", "responsibilities": "Refine the motion, graphics, and performance of the interactions of users live, and develop tools and frameworks for the rest of the developer community to build a positive user experience. Write and test product or system development code. Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback. Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/127313936771883718"}