{"title": "International Growth Consultant", "level": "Mid", "location": "Dublin, Ireland", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience gathering and presenting technical and financial data to promote products, services and solutions, and working in a customer-facing role. 3 years of experience in strategy consulting, in-house consulting, business development, or consultative sales to drive business.", "preferred_qualifications": "Ability to engage at multiple levels internally and externally, and influence senior stakeholders towards shared objectives. Data driven business acumen, problem identification, and solving through quantitative analysis. Innovative and entrepreneurial mindset, a comfort with acting and advising in ambiguity by collaborating effectively with your colleagues and customers.", "responsibilities": "Consult Google’s largest customers on how to successfully grow their international business by understanding customer objectives, building data-driven business recommendations, and shaping their expansion strategy across markets/verticals. Conceive innovative ideas, approaches, and solutions to identify growth opportunities for customers and scale them. Provide end-to-end support to clients along their export journey, from market identification to in-market expertise, including how to overcome key operational hurdles (e.g., payments, customer experience, logistics, localization). Be a team player, contributing to the positive and inclusive culture of the International Growth team and positively influencing your own development, and the development of those around you.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/127400940998140614"}