{"title": "AI/ML System Performance Architect, Silicon", "level": "Mid", "location": "Mountain View, CA, USA; San Diego, CA, USA", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Engineering, Computer Science, a related field, or equivalent practical experience. 5 years of experience working with Mobile/Embedded SoCs at use cases level power and performance analysis.", "preferred_qualifications": "Master's degree or PhD in Electrical Engineering, Computer Engineering or Computer Science, with an emphasis on computer architecture. Experience with python or other scripting-based languages. Experience driving system architecture decisions. Experience with Android Architecture, Mobile SoC architecture, ML architecture, Computer Architecture, PPA trade-offs. Experience in power and performance modeling and projection. Knowledge of interactions between software and different IP blocks, general and special purpose compute units.", "responsibilities": "Influence Tensor SoC architecture decisions for optimal Power, Performance, and Area (PPA) working cross-functionally with architects, software, and research teams. Conduct use cases power and performance profiling through objective measurements, simulation, or modeling. Provide data analysis/report/projection to identify the inefficiencies across Software/Hardware design on existing and future Hardware platforms. Propose and architect system design solutions through Software/Hardware co-design that meet power, performance, and area goals to deliver advanced use cases experience powered by Google’s AI research.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/127483212170437318"}