{"title": "Senior Intelligence Analyst, Mandiant", "level": "Mid", "location": "Amsterdam, Netherlands", "description": "Mandiant Services provides incident response, assessment, transformation, managed detection and response, and training services with direct tactical support. Mandiant is a recognized leader in dynamic cyber defense, threat intelligence and incident response services.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 7 years of experience in an investigative role involved in the production of threat intelligence for decision-makers/customers and involved in customer support. 7 years of experience in data analytics, Trust and Safety, policy, cybersecurity, or related fields. Experience in an operational role involved in the research and writing of threat intelligence products for decision-makers/customers.", "preferred_qualifications": "Experience in using tools for analysis such as intrusion operations, enterprise security controls, log analysis, network flow and traffic analysis, incident response processes, cyber attack lifecycles and models. Experience working in a government environment and with host and network forensic reports of electronic media, packet capture, log data analysis, malware triage and network. Experience with malware/security, Google products, and working in an investigative or incident response environment. Experience in program management or business. Understanding of core cybersecurity concepts, common enterprise IT infrastructure components, operating system internals and networking.", "responsibilities": "Evaluate current and emerging tools and best practices for tracking advanced persistent threats, Tools, Techniques, and Procedures (TTPs) of attacker’s motivations, and industry and attacker trends. Perform strategic, tactical, and operational research and analysis of adversarial cyber threats. Correlate intelligence, to develop deeper understandings of tracked threat activity. Present tactical and strategic intelligence about threat groups, the methodologies they use, and the motivations behind their activity. Prepare and deliver briefings and reports to the client’s executives, security team, or fellow analysts.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/127462022613738182"}