{"title": "Account Strategist, Google Customer Solutions", "level": "Early", "location": "Tokyo, Japan", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.\n\nGoogle Customer Solutions (GCS) sales teams are trusted advisors who maintain a focus on customer success by bringing the best Google has to offer. The Mid-Market Sales (MMS) team is a critical growth engine for customers in Google Customer Solutions, which looks after the various sized customers with a focused approach with multiple supporting specialist teams.\n\nIn this role, you will be focused on helping our customers elevate their digital maturity and achieve their business goals and marketing objectives by leveraging our Google solutions. Our customers include finance, healthcare, real estate, career, and so on who are developing their digital marketing capabilities. You will play a key role in unlocking growth from these customers by building long-term relationships and orchestrating our Google advertising and digital solutions.\n\nThis is a customer-facing role that requires interactions in Japanese with local stakeholders.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n2 years of experience in account management, sales, or marketing.\nExperience developing and pitching solutions through various channels (i.e., over the telephone, email, in-person meetings) to prospects.\nAbility to communicate in English and Japanese fluently to interact in this customer-facing role.", "preferred_qualifications": "Experience with Google Ads and YouTube account management, managing advertising and/or media campaigns.\nExperience in sales in a technology, advertising, media sales, and/or internet environment.\nExperience in media across a variety of platforms (e.g., TV, Radio, Print, Sponsorship, etc.).\nAbility to multitask, with experience managing multiple accounts simultaneously while paying attention to detail.\nAbility to grow in a rapidly changing environment with excellent problem-solving and creative thinking skills.", "responsibilities": "Manage a portfolio of businesses by understanding growth drivers, identifying opportunities for growth, managing risks, and building quarterly plans for achievements.\nDrive customer growth by delivering outstanding customer sales experience and achieving customer business and marketing objectives.\nOwn business process, by driving customer outreach, business pitches, solution implementation, and performance evaluation.\nWork towards quarterly business and product growth goals.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/127481246283375302"}