{"title": "Research Data Scientist, Ads Insight and Measurement", "level": "Mid", "location": "Bangalore, Karnataka, India", "description": "At Google, data drives all of our decision-making. Quantitative Analysts work all across the organization to help shape Google's business and technical strategies by processing, analyzing and interpreting huge data sets. Using analytical excellence and statistical methods, you mine through data to identify opportunities for Google and our clients to operate more efficiently, from enhancing advertising efficacy to network infrastructure optimization to studying user behavior. As an analyst, you do more than just crunch the numbers. You work with Engineers, Product Managers, Sales Associates and Marketing teams to adjust Google's practices according to your findings. Identifying the problem is only half the job; you also figure out the solution. As a Data Scientist working on Ads Insights and Measurement, you will develop, evaluate and improve the entire range of Google's advertising products including Search, Display, Apps, TV and Video (YouTube). You will collaborate closely with a multi-disciplinary team of engineers, analysts and product managers to develop new science and to translate it into deployed products at scale. You will also play a key role in developing new ideas and methods that drive ad measurement and business generation, including paradigm-shifting ad-measurement science and products for the privacy-preserving future of digital advertising. In doing so, you will be a key part of building and driving impact on large-scale ad-systems both at Google and in the ad-tech and mar-tech industry as a whole, globally.", "salary": "", "key_qualifications": "Master's degree in Statistics, Economics, Engineering, Mathematics, a related quantitative field, or equivalent practical experience. 3 years of experience with statistical data analysis, data mining, and querying (e.g., Python, R, SQL). 1 year of experience managing analytical projects.", "preferred_qualifications": "5 years of experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis, or a PhD degree. 4 years of experience working as a Data Scientist with statistical data analysis such as linear models, multi-variate analysis, stochastic models, sampling methods. Experience with causal inference methods (e.g., split-testing, instrumental variables, difference-in-difference methods, fixed effects regression, panel data models, regression discontinuity, matching estimators). Experience articulating and translating business questions and using techniques to arrive at an answer using available data.", "responsibilities": "Collaborate with stakeholders in cross-projects and team settings to identify and clarify business or product questions to answer. Provide feedback to translate and refine business questions into tractable analysis, evaluation metrics, or mathematical models. Use custom data infrastructure or existing data models as appropriate, using specialized knowledge. Design and evaluate models to mathematically express and solve defined problems with limited precedent. Gather information, business goals, priorities, and organizational context around the questions to answer, as well as the existing and upcoming data infrastructure. Own the process of gathering, extracting, and compiling data across sources via relevant tools (e.g., SQL, R, Python). Independently format, re-structure, and/or validate data to ensure quality, and review the dataset to ensure it is ready for analysis.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/127460971353383622"}