{"title": "Data Center Facilities Technician, Generator", "level": "", "location": "Columbus, OH, USA", "description": "The Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facilities Technicians at Google data centers operate, monitor and support physical facilities conditions...", "key_qualifications": "Associate's degree, trade school certification, or other certified training in a related technical field, or equivalent practical experience. 2 years of Electrical, Mechanical/HVAC, or Controls/Automation experience in an industrial/commercial environment. Ability to lift and move 50 lbs of equipment under raised floors, and the required use of OSHA standard safety equipment such as limited weight bearing work platforms, ladders, step stools and personal protective equipment (PPE) like safety harnesses. Ability to work non-standard hours and differing work rotations/shifts.", "preferred_qualifications": "Experience in data centers, hospitals, or power plants. Knowledge of electrical and mechanical systems used in a data center environment (e.g., Feeders, Transformers, Generators, Switchgear, UPS systems, ATS/STS units, PDU/PMM units, Chillers, Air handling units, and CRAC units). Knowledge of meters, devices, sensors, and troubleshooting utilizing standard hand tools, digital metering, or calibration/diagnostic equipment. Ability to communicate with contractors who perform maintenance or upgrade work on the data center systems.", "responsibilities": "Inspect, maintain, and repair various data center systems such as piping and non-critical electrical or mechanical system components. Provide daily assistance to technicians, read blueprints/schematics, conduct tours of systems, and assess their working order. Manage the uptime and maintenance of water pumps and treatment systems, HVAC, UPS, generators, electrical distribution, and control and monitoring systems. Operate, monitor, maintain, and respond to abnormal conditions in the data center facilities systems and equipment. Support startup, commissioning, and integration of new equipment and systems into facilities infrastructure.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/127574679605912262"}