{"title": "Global Process Manager, Revenue Operations, Finance", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "The Finance Operations team manages Google's cash transactions on a global basis and ensures that Google's incoming and outgoing cash processes are controlled, effective and efficient. As a member of this team, you'll find innovative ways to manage our complex set of transactions. You'll make processes more efficient and scalable, work to ensure the highest level of quality of our operations, and proactively minimize operational risk. Externally, you collaborate with our extended workforce partners and internally, you will collaborate across the multiple areas of the Financial Operations team. The name Google came from 'googol,' a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.", "key_qualifications": "Bachelor's degree in Business, Finance, Engineering, or Operations, or equivalent practical experience. 4 years of experience in management consulting, or an operations-related function; or 2 years of experience with an advanced degree in business, accounting, or finance.", "preferred_qualifications": "Lean Six Sigma (LSS) Green Belt, Project Management Professional (PMP) or similar certifications. Experience designing, implementing, and testing processes and controls for standard systems and custom applications. Experience leading process improvement projects. Experience applying statistical methods, SQL, and dashboard design. Ability to manage multiple tasks in a dynamic environment. Excellent data analysis and project management skills.", "responsibilities": "Plan, organize, and supervise processes and make necessary improvements for growth. Manage projects involving multiple stakeholders, timelines, organizational implications, and changing circumstances. Identify, evaluate, and prioritize risks followed by coordinated and economical application of resources to minimize, monitor, and control the probability or impact of unfortunate events.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/127623308098052806"}