{"title": "Analyst, Marketing Finance", "level": "Early", "location": "Gurgaon, Haryana, India", "description": "Financial Analysts ensure that Google makes sound financial decisions. As a Financial Analyst, your work, whether it's modeling business scenarios or tracking performance metrics, is used by our leaders to make strategic company decisions. While working on multiple projects at a time, you are focused on the details while finding creative ways to solve big picture challenges. The Marketing Finance team creates financial insights to help senior management make informed strategic marketing investments across the company. The team solves business problems to reveal opportunity, manage risk, and steward scarce resources. In this role, you will develop analyses, reporting, and insights to help business partners understand the value of marketing initiatives and provide recommendations to support their investment decisions. You will partner with the Marketing and Finance teams. The name Google came from \"googol,\" a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.", "salary": "", "key_qualifications": "Bachelor's degree in Business, Finance, Economics, Statistics, or another quantitative field, or equivalent practical experience. 2 years of experience in financial planning and analysis, consulting, a related function, or an advanced degree.", "preferred_qualifications": "Experience building financial reporting, producing analysis, and implementing reporting solutions. Ability to work with data to produce analysis, influence decision making with numerical analysis, and generate insights. Excellent organizational skills, with the ability to multitask in a fast-paced, constantly evolving environment.", "responsibilities": "Manage and automate dashboards and ensure that quarterly spend matches forecasts. Develop tools and data infrastructure to explain spending activity and effectiveness across different initiatives. Analyze the effectiveness of marketing campaigns, derive insights, and develop recommendations for the marketing leadership team. Design, implement, and maintain processes for managing expenditures and risk.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/127804099109233350"}