{"title": "Strategy and Operations Lead, Strategic Projects", "level": "Mid", "location": "New York, NY, USA; Atlanta, GA, USA; Chicago, IL, USA; Mountain View, CA, USA; San Francisco, CA, USA; Washington D.C., DC, USA", "description": "The Go-to-Market Operations (GTM) team ensures Google's ever-evolving Ads business runs smoothly. The team sets go-to-market strategy and ensures flawless execution and operations against that strategy. The Business Strategy and Operations organization provides business critical insights using analytics, ensures cross-functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with day-to-day operations, and help evolve early stage ideas into future-growth initiatives.", "salary": "$142,000-$211,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n6 years of experience in management consulting, sales operations, business strategy, investment banking, venture capital, private equity or corporate advisory, or 4 years of experience with an advanced degree.", "preferred_qualifications": "MBA.\n2 years of experience in advertising, consultative sales, business development, or a digital media environment.\n2 years of experience creating data sets, data modeling, and reporting.\nAbility to lead cross-functional stakeholders/partners and influence executive decision making, while navigating organizational dynamics.", "responsibilities": "Help guide Large Customer Solutions ideas and develop annual business plans that prioritize customer success while delivering measurable business growth impact.\nManage executive decision making on priorities, sales motions, initiatives.\nAlign the company priorities with day-to-day operations, and help identify and evolve early stage ideas into future-growth initiatives.\nPartner with Sales, Marketing, Finance, Legal, gTech Cloud, and other functions to ensure go-to-market strategy globally.\nProvide business critical insights using analytics and ensure execution of business plans.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/127879444042785478"}