{"title": "Technical Program Manager I, Platform Safety, Android", "level": "Early", "location": "Kirkland, WA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nThe team designs and builds security and privacy capabilities for Android, partners with engineering teams to ensure features are secure by default, and develops systems to detect security issues across the Android ecosystem and enforce remediation or compliance. The team also works with external partners to secure both current and future Android devices.\n\nYou will collaborate with the platform engineering, offensive security, and security validation engineering teams to drive the delivery of new security capabilities and mitigate platform weaknesses. You will work across various Android organizations and engage with external partners to support Android's security position.", "salary": "102000-150000", "key_qualifications": "Bachelor's degree in a relevant field, or equivalent practical experience. 1 year of experience in technical program management. Experience delivering technical security solutions or cyber security.", "preferred_qualifications": "Experience working with Original equipment manufactures and carriers. Experience working with distributed teams in multiple timezones. Experience managing dynamic technical projects, with competing resources and priorities. Experience managing relationships with internal and external partners. Experience with Android applications, the Android OS, and frameworks, or other mobile operating systems.", "responsibilities": "Plan and lead engineering programs that deliver new security and privacy capabilities within the platform. Coordinate efforts across internal teams including feature engineers, product management, release management, and external parties including OEMs, SoC, vendors. Partner with engineering teams to deliver analysis solutions that ensure the Android ecosystem is protected against known issues and supply chain risks. Manage relationships with key internal and external partners, be an advocate for security programs, and help institutionalize new security practices. Oversee vendor operations for business critical work-stream.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128045299909173958"}