{"title": "Customer and Partner Solutions Engineer II, gTech", "level": "Early", "location": "Boulder, CO, USA; Sunnyvale, CA, USA", "description": "At gTech’s Users and Products team (gUP), our mission is to help users get the most out of Google. We represent Google's users and many of our partners globally, sharing insights with the larger Google organization to enable exceptional customer and product experiences. gUP builds innovative solutions that take user experience and engagement with Google to the next level, supporting users across products, countries, cultures, incomes, and identities. We advocate for users through partnerships with product areas at Google (and some Alphabet businesses), supporting Google’s consumer products ecosystem and enabling numerous launches for Google’s consumer products each year. Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.", "salary": "$94,500-$139,000 + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree in Engineering, Computer Science, a related field, or equivalent practical experience. Experience coding with one or more programming languages (e.g., Java, C/C++, Python). Experience working with client-side web technologies (e.g., HTML, CSS, JavaScript, or HTTP). Experience in technical troubleshooting, and managing internal/external partners or customers.", "preferred_qualifications": "Master’s degree in Engineering, Computer Science, Business, or a related field. 2 years of experience in an analytical role such as business intelligence, data analytics, or statistics. 2 years of experience working with database technologies (e.g., SQL, NoSQL). 2 years of experience working with systems (e.g., Linux, Unix, Windows).", "responsibilities": "Analyze and resolve complex pre and post launch technical problems on partner integrations. Understand operational workflows, identify and define tool needs to enable operational scaling, and drive the development (both new and ongoing) and deployment of these tools internally and with Engineering. Collaborate with Engineering teams to implement tools to improve troubleshooting efficiency and the end user experience. Scale support of partner integrations (both new and ongoing) by providing the necessary documentation and technical guidance and training to our technical scaled operations. Manage stakeholder expectations and communicate with internal teams and external partners to provide technical and business feedback as well as deliver technical solutions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128073253368275654"}