{"title": "Systems Development Engineer, Operations Support", "level": "Mid", "location": "Bangalore, Karnataka, India", "description": "Systems Development Engineering (SDE) at Google is a role where you manage services and systems at scale. SDEs creatively put their engineering discipline to use automating the mundane and reducing toil. We don’t just write code to fix bugs, but emphasize the development of tools and solutions that fix classes of problems. We know it’s hard to control what you can’t measure – so we focus on observability: instrumenting first, then turning data into knowledge, and finally knowledge into action. We know that the operational efficiency of Google systems, services, virtual compute environments and the operating systems that power them impact the environment, not just the bottom line. We know that working together we can do more, and that community matters. Google brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow. Together we engineer and build the infrastructure, tools, access and telemetry for systems that enable orchestration of Google-scale services. Come build things that matter.", "key_qualifications": "5 years of experience in data centers and hardware operations or design.\n5 years of experience in Networking Operations.\n2 years of experience in Scripting/Practical Coding in Shell, Python, or Go.\n2 years of experience with Linux system administration.", "preferred_qualifications": "Experience working with hardware vendors and supply chain.\nExperience with CI/CD tools (e.g., Git, Piper, etc.).\nExperience in Cloud (e.g., Google Cloud, etc.).\nKnowledge of IT infrastructure and security standards, with the ability to troubleshoot issues.", "responsibilities": "Provide support for installation challenges (e.g., GDCE zone setup issues (eg. cabling error, network issue, hardware DOA), edgeOS bootup problems, networking complications, cluster creation hurdles, etc.).\nParticipate in rotating on-call schedules including during weekends and holidays for production operations.\nInterface with external hardware vendors to ensure the requirements and specifications of GDCE servers are implemented, and with the internal labs to ensure the lab deployment reflects the product design.\nManage troubleshooting customer workload migration issues, including script/playbook errors and store-specific configuration discrepancies.\nIdentify issues and design automated remediation solutions in order to reduce toiling.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128089726910374598"}