{"title": "Technical Program Manager III, Cloud Networking, Telecommunications", "level": "Mid", "location": "Addison, TX, USA", "description": "Google's projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You're equally at home explaining your team's analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.", "key_qualifications": "Bachelor's degree in a technical field, or equivalent practical experience. 5 years of experience in program management influencing across a cross-functional organization. Experience in network planning, architecture, or design with a technology or telecommunications company.", "preferred_qualifications": "5 years of experience managing cross-functional and/or cross-team projects. Experience with design and delivery of telecommunications fiber, space/power, capacity infrastructure or data center construction. Experience with fiber network deployments, including constructing new outside and inside plant fiber infrastructure.", "responsibilities": "Understand partner team dependencies, constraints, designs, and forecast mechanisms that impact the business by engaging early and often, collaborating on process improvements and communication. Program manage the delivery of network infrastructure projects from inception through delivery. Collaborate with Cloud and networking technical teams to intake, analyze and develop cost and executable plans for Cloud networking requests. Lead google-wide strategic network initiatives from concept to plan definition and hand-off to execution teams by refining large scale ambiguous projects to well defined problems, processes, and solutions. Work closely with customers to gather requirements, manage stakeholder expectations and provide clear program plans for reliable product delivery. Partner with engineering teams and third party vendors to deliver network engineering and infrastructure design.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128130360327185094"}