{"title": "Product Support Manager, Health and Home", "level": "Mid", "location": "Atlanta, GA, USA; Boulder, CO, USA", "description": "At gTech’s Users and Products team (gUP), our mission is to help users get the most out of Google. We represent Google's users and many of our partners globally, sharing insights with the larger Google organization to enable exceptional customer and product experiences. gUP builds innovative solutions that take user experience and engagement with Google to the next level, supporting users across products, countries, cultures, incomes, and identities. We advocate for users through partnerships with product areas at Google (and some Alphabet businesses), supporting Google’s consumer products ecosystem and enabling numerous launches for Google’s consumer products each year. Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products. To learn more about gTech, check out our video. The US base salary range for this full-time position is $132,000-$196,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "salary": "$132,000-$196,000 + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree in Computer Science, Statistics, Mathematics, Economics, a related field, or equivalent practical experience. 8 years of experience with data analysis and and deriving actionable insights, in a technology or internet-related industry. 8 years of experience delivering customer support improvement projects for consumer products.", "preferred_qualifications": "8 years of experience in consumer electronics and subscription services. Excellent communication and presentation skills, with the ability to present to executive audiences.", "responsibilities": "Analyze churn trends, customer segments, root causes, and actionable recommendations. Plan outlining specific steps to reduce churn and increase customer retention. Implement churn reduction strategies and integrate them into existing processes. Measure the impact of churn reduction initiatives on key metrics such as churn rate, customer lifetime value, and business. Develop and maintain reports and dashboards to monitor trends and communicate key insights.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128119901544948422"}