{"title": "Staff Product Designer", "level": "Advanced", "location": "São Paulo, State of São Paulo, Brazil", "description": "At Google, Visual Designers weave iconography, typography, color, space and texture together to help our users successfully navigate our products. We believe that all of our products should be beautiful and accessible. As a Visual Designer, you’ll delight users with designs that inspire, engage and excite them.  You’ll rely on user-centered design principles to produce high-quality visuals—from concept to execution—across many platforms. Like all of our UX jobs, you’ll collaborate with your fellow designers to constantly refine the Google design language and create innovative, great-looking products that people love to use.", "key_qualifications": "Bachelor's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 8 years of experience in product design or UX. Experience in concept development for design and with design for excellence. Include a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link or access instructions).", "preferred_qualifications": "10 years of experience in digital product design. Experience in system design, prototyping, and motion design to enhance usability, creating unique design language connected to the brand. Experience with visual design, with knowledge of typography, color, prototype, and visual storytelling. Ability to thrive and deliver results in an ambiguous environment and distill processes into simple user interactions. Ability to create great partnerships with UX peers and cross-functional partners communicating recommendations, rationalizing design decisions, and advocating for users’ needs.", "responsibilities": "Prepare presentations, advocate for design strategy, and communicate design approach to partners, analyzing or anticipating user needs as well as identifying defined problems that may have multiple solutions. Create design deliverables and collaborate with engineers to implement designs, help create design solutions based on user insights, business needs, and industry trends creating design concepts for informing product ideation and user research/testing. Create innovative design solutions to user, product, and business problems with improvements based on UX testing and partner/stakeholder input. Apply UX design frameworks and leverage standard tools to visualize ideas and develop mock-ups/prototypes while using key data and metrics to evaluate product impact. Lead prioritization to a holistic design process and design system across teams, products, and projects.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128245679460885190"}