{"title": "Account Manager, Google Workspace, Small Medium Business", "level": "Mid", "location": "Tokyo, Japan", "description": "As a member of the Google Cloud team, you inspire leading companies, schools, and government agencies to work smarter with Google tools like Google Workspace, Search, and Chrome. You advocate for the innovative power of our products to make organizations more productive, collaborative, and mobile. Your guiding light is doing what’s right for the customer, you will meet customers exactly where they are at and provide them the best solutions for innovation. Using your passion for Google products, you help spread the magic of Google to organizations around the world. The Google Workspace team helps customers transform how they work through the use of Google's productivity and collaboration tools including Gmail, Google Drive, and Google Meet. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of how technology is used in the workplace. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree or equivalent practical experience\n4 years of experience in sales/relationship management in the IT industry\nExperience in cloud sales\nAbility to communicate in Japanese, Korean, and Business English fluently to communicate with internal and external stakeholders\n", "preferred_qualifications": "Experience selling with and through resellers\nExperience selling SaaS solutions to Small and Medium Business (SMB) and Mid-Market customers\nExperience managing in both the Japan and South Korean market\nExperience translating analysis and insights into actionable business plans\nExperience executing email campaigns through marketing automation and CRM tools\nAbility to manage multiple tasks with shifting priorities and varying deadlines\n", "responsibilities": "Identify opportunities to offer additional Google Workspace products to existing Workspace customers.\nLeverage customer feedback to drive improvements to the content that we share.\nWork with reseller partners to generate business opportunities through the partner channel.\nCultivate Google Workspace usage, adoption, and customer satisfaction over the phone with customers.\nLiaise with Marketing and Product teams to improve the overall experience.\n", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128337629006439110"}