{"title": "Data Analyst, Core Systems", "location": "Sunnyvale, CA, USA", "level": "", "description": "As a Technical Solutions Consultant, you will be responsible for the technical relationship of our largest advertising clients and/or product partners. You will lead cross-functional teams in Engineering, Sales and Product Management to leverage emerging technologies for our external clients/partners. From concept design and testing to data analysis and support, you will oversee the technical execution and business operations of Google's online advertising platforms and/or product partnerships.", "key_qualifications": "Bachelor’s degree in Engineering, Computer Science, a related field, or equivalent practical experience. 1 year of experience in technical troubleshooting and writing code in one or more programming languages. Experience in technical project management, stakeholder management, professional services, solution engineering, or technical consulting. Experience with SQL, Data Analysis, Data Analytics, Dashboards, and ETL Tools.", "preferred_qualifications": "Bachelor's degree in a quantitative field (Business, Math/Statistics, Economics, Computer Science, Engineering, or similar). 1 year of experience in data analysis or a related field. Experience working with large and complex datasets. Demonstrated experience in using SQL for data extraction, manipulation, and analysis. Experience in building and maintaining data pipelines using tools like Apache Airflow or similar. Experience working with stakeholders to gather requirements and translate them into actionable insights. Proficiency in any one of the data visualization tool (e.g., Looker, Tableau, Data Studio).", "responsibilities": "Develop and execute complex SQL queries to extract, transform, and analyze data from various sources. Design and build interactive dashboards that effectively communicate key insights and trends to stakeholders. Craft data-driven narratives that guide users through dashboards, uncovering meaningful insights and actionable recommendations through user-centric experiences. Design, build, and maintain robust data pipelines to collect, process, and integrate data from disparate sources. Ensure data accuracy and integrity throughout the pipeline, implementing validation and error-handling procedures. Automate data extraction, transformation, and loading (ETL) processes to improve efficiency and reduce manual effort. Collaborate effectively with cross-functional teams, including product managers, engineers, and business leaders, to gather requirements, prioritize projects, and deliver actionable insights.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128311702436356806"}