{"title": "ASIC/SoC System Level Test Engineer", "level": "Mid", "location": "Sunnyvale, CA, USA", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Engineering, a related technical field, or equivalent practical experience. 5 years of experience with hardware testing of systems based on custom ASICs or SoC products. Experience with Linux/Unix, Python programming, or TCP/IP network configuration.", "preferred_qualifications": "Master's degree or PhD in Electrical Engineering, Computer Engineering, Computer Science, or a related field. 10 years of experience with hardware or semiconductor testing. Experience implementing secure ASIC/SoC manufacturing solutions (e.g., provisioning, e-fuse programming, or lifecycle management). Experience in C#, .NET Framework, C/C++, or Perl. Knowledge of ASIC/SoC boot process or CPU performance testing.", "responsibilities": "Develop System Level Test (SLT) solutions for custom ASIC’s and SoC’s by specifying hardware and integration requirements, developing software frameworks and test modules, and integrating test cases from silicon validation and system software and test teams. Partner with data center server and accelerator design teams to realize practical test solutions leveraging system design and test elements. Partner with hardware and software teams to evaluate functional device yield and performance across various operating conditions, characterize hardware/software interaction, and develop effective production screens to reduce Defective Parts per Million (DPPM). Integrate test software and hardware solutions with robotic chip handlers, drive bring-up of the fully integrated solution in internal and partner NPI labs, transfer all collaterals needed for High Volume Manufacturing (HVM) at Offshore Assembly and Test (OSAT) facilities, and provide ongoing HVM support.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128403875991298758"}