{"title": "Director, Product Management, AlloyDB", "level": "Director+", "location": "Sunnyvale, CA, USA; Kirkland, WA, USA; New York, NY, USA", "description": "As Director, you will scale the Product Management organization and its leadership team to best support the fast growing databases business. You will be responsible for providing customer-centric product outlook and definition, building thought leadership in this market segment, and driving go-to-market strategy and execution. You will execute across numerous proprietary and open source technologies to solve the most demanding problems for our customers. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$253,000-$363,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science or equivalent practical experience. 15 years of experience with product management leadership, providing product outlook and roadmaps, creating customer-facing products, leading packaging, positioning, messaging, and pricing. Experience with enterprise databases market segment, and application development, analytics, and AI/ML while driving go-to-market (GTM) execution.", "preferred_qualifications": "Undergraduate degree in Computer Science, Mathematics or other relevant product management discipline or equivalent practical experience. MBA degree or equivalent. Experience with strategic thought leadership, with the ability to drive business excellence and operational/product aptitude while simplifying existing go-to-market models. Experience building and scaling businesses and working with cross-functional teams. Experience as an organizational leader, with the ability to identify priorities, delivering successfully within accelerated timelines and excellent written and verbal communication skills.", "responsibilities": "Develop a strategic outlook and collaborate with customers, partners, the field, and engineering to offer a coherent roadmap for our internal and external customers. Work across product, engineering, and services teams to define, build, and support Database products that span across a portfolio of product offerings. Drive decisions around prioritization, solutions, functionality, and pricing. Build and drive a thought leadership narrative with customers and industry thought leaders around databases and how it fits into the greater data narrative. Define Databases product go-to-market strategies, identify key market/competitive trends and customer opportunities, plan and manage programs to execute against those strategies by partnering with sales leadership at a regional and global level. Drive go-to-market strategy across a variety of industry focused areas and customer segments.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128569413151400646"}