{"title": "Data Engineer", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.", "salary": "", "key_qualifications": "Bachelor's degree in a quantitative field (e.g., Statistics, Computer Science, Math, Physics, Engineering), or equivalent practical experience. 5 years of experience in data engineering or business intelligence roles. Experience with one or more programming languages (e.g., Python, Java, C++, etc.). Experience with relational databases including SQL queries, database definition, and schema design.", "preferred_qualifications": "Master’s degree in a quantitative field (e.g., Computer Science, Engineering, Statistics, Math). Experience with data warehouses, distributed data platforms, and data lakes. Ability to navigate ambiguity and work in a fast-moving environment with multiple stakeholders. Excellent structured thinking skills, with the ability to break down complex, multi-dimensional problems. Excellent business and technical communication, organizational, and problem-solving skills.", "responsibilities": "Conduct requirements gathering and project scoping sessions with subject matter experts, business users, and executive stakeholders to discover and define business data needs. Design, build, and optimize the data architecture and Extract, Transform, and Load (ETL) pipelines to make them accessible for Business Data Analysts, Data Scientists, and business users to enable data-driven decision-making. Work closely with analysts to productionize and scale value-creating capabilities, including data integrations and transformations, model features, and statistical and machine learning models. Drive the highest standards in data reliability, data integrity, and data governance, enabling accurate, consistent, and trustworthy data sets, business intelligence products, and analyses. Engage with the analyst community, communicate with analysts to understand critical user journeys and data sourcing inefficiencies, advocate best practices, and lead analyst trainings.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128529405738656454"}