{"title": "Data Center Facilities Technician, Manufacturing Engineer", "level": "", "location": "Singapore", "description": "The Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facilities Technicians at Google data centers operate, monitor and support physical facilities conditions. Some of these duties will include heating and cooling of air and water, power supply, generators, UPS systems, electrical distribution and control and monitoring systems. You regularly help inspect, maintain and repair various data center systems such as piping and non-critical electrical or mechanical system components). You provide daily assistance to senior technicians as you read blueprints/schematics, conduct tours of systems and assess their working order.\n\nAs an advocate for best practices, you develop creative approaches to reducing operational costs while improving overall data center efficiency. You ensure that environmental and safety standards are consistently met, identifying problems and making repairs quickly. In emergency situations or abnormal conditions, you manage data center performance issues and outages to minimize the recovery time from failures.\n\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "key_qualifications": "Associate's degree, trade school certification, or other certified training in a related technical field, or equivalent practical experience.\n2 years of experience in operating and maintaining mission critical facilities (data centers, hospitals, pharma, refineries, power plants, industrial, etc.).\nCommissioning experience of HVAC and mechanical distribution systems (chillers, air handling units, etc.) to include air and water side systems.", "preferred_qualifications": "Experience with operations in a data center and troubleshooting for mechanical/HVAC systems.\nAbility to learn quickly and address issues as they arise during normal operations or during emergency conditions.\nPerform maintenance on mechanical or MEP systems, and capable of independently resolving common system failures.\nAbility to work non-standard 12 hour shifts including weekends and holidays on-call rotation.\nAbility to work with varying outdoor temperature conditions, perform material handling (lifting/shifting) and work on platforms, ladders, and under raised floors.", "responsibilities": "Be responsible for the uptime, maintenance, and troubleshooting of water pumps and treatment systems, HVAC, and Control and Monitoring Systems.\nOperate, monitor, maintain, and respond to abnormal conditions in the data center facilities systems and equipment. Provide tracking and trending operational characteristics.\nSupport startup, commissioning, and integration of new equipment and systems into facilities infrastructure. Direct the execution of starting-up, commissioning, documentation, and full facilities turnover on assigned projects.\nProvide operational and maintenance insights into the design review process.\nProduce standards and templates for global control/monitoring system analysis, diagnostic, preventive maintenance, and trend logs for data center critical facilities systems.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128517278898496198"}