{"title": "Senior Technical Program Manager I, Security, Google Cloud", "level": "Advanced", "location": "Reston, VA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company. You will partner with the Engineering, Product Management, Sales, Operations, and Leadership across Google Cloud to plan, design, implement, launch and operate GCP Security Threat Intelligence Services. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems. The US base salary range for this full-time position is $168,000-$252,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in program management. 8 years of experience in security. 5 years of experience in Cloud Computing.", "preferred_qualifications": "8 years of experience managing cross-functional or cross-team projects.", "responsibilities": "Implement communications standards across a portfolio of programs including executive and key partner communications. Manage program reviews, decision-making, prioritization, and Resource Stewardship where improvements such as efficiency and utilization gains are measurable. Lead a governance structure that drives executive decision-making and ensure governance structure exposes and mitigates dependencies. Identify change management opportunities that increase program velocity and affect multiple teams. Define/manage a program portfolio solving problems that focus on business impact for the organization and product area.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128695022160618182"}