{"title": "Senior Director, Assurance, Risk, Compliance, and Integrity", "level": "Director+", "location": "New York, NY, USA; Chicago, IL, USA; Mountain View, CA, USA; Washington D.C., DC, USA", "description": "With the widespread impact of AI technologies, the growth and diversification of our products, and the proliferation of new and at times fragmented laws and reporting requirements, we face one of the most exciting and challenging moments as a company. The newly formed Risk, Compliance, and Integrity organization (RCI) brings together critical compliance, assurance, risk and governance functions across Google to help the company meet compliance needs and enable our businesses to innovate. Our goal is to make compliance an advantage for Google by driving scaled, data-driven, and policy-based compliance programs. We manage our operations through risk-based prioritization and governance and consistent and constructive regulator engagement.", "salary": "$288,000-$414,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Accounting, Finance, Information Technology, Engineering, or equivalent practical experience. 18 years of professional experience. 3 years of experience in Audit or Compliance leadership role(s) in industry.", "preferred_qualifications": "One or more professional certifications (e.g., CIA, CISA, CMA, CA/CPA, etc.). Compliance assurance experience in tech-driven organizations. Experience performing risk assessments and identifying associated controls across all areas of the business. Experience leading and transforming a global organization. Knowledge of regulations, compliance testing methodologies, and risk management principles. Excellent problem-solving skills; ability to interpret regulatory requirements and assess their impact on business operations. Experience using analytically-driven testing techniques. Excellent communication skills; ability to articulate compliance testing findings, risk assessments, and recommendations to management and stakeholders. Ability to engage, build, and maintain relationships with regulators and business partners.", "responsibilities": "Set and implement strategy to drive the overall transformation of Risk Assessment, Assurance, and Reporting programs to better leverage automation, data, analytics, and continuous monitoring. Establish quality assurance processes and standards to ensure the accuracy, consistency, and integrity of compliance testing and risk assessment activities, including reviewing testing reports and findings. Lead the identification, assessment, and prioritization of compliance and operational risks, working closely with stakeholders to develop risk mitigation strategies and action plans. Develop strategic relationships with colleagues in the Product Areas, Regions, and our Internal Audit team to facilitate seamless testing and assurance and drive action against remediation plans. Engage and maintain effective relationships with regulators, managing routine business-driven audits, reports, certifications and partnering with Regulatory Affairs colleagues on government and regulator audits and exams.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128696076440871622"}