{"title": "Technical Program Manager, Network Planning Automation and Business Process Transformation", "level": "Advanced", "location": "Atlanta, GA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.", "key_qualifications": "Bachelor's degree in Engineering or equivalent practical experience. 8 years of experience in program management. 8 years of experience in network planning, network automation, process improvement, capacity planning, or networking related business process transformation.", "preferred_qualifications": "Experience in telecommunications at carrier-class scale, with experience of optical networks, DWDM, IP and data services. Experience in management of teams of Technical Program Managers and/or Network Engineers. Experience in large software systems design and integration. Financial skills e.g business or project budget creation and cost-benefit analysis. Demonstrated experience defining system or process requirements, building, integrating, or delivering large-scale layer 1, layer 2 or layer 3 network systems. Demonstrated ability to manage multiple priorities in an ambiguous and busy operations environment, and deliver outstanding results in a timely manner.", "responsibilities": "Drive or co-drive large transformational and cross-functional programs impacting many teams in Global Network Infrastructure. Devise new programs where appropriate and/or expand existing ones; Define cross-functional business processes and business requirements for the software teams to implement (in the form of PRDs). Review and validate high level software designs (HLDs). Define acceptance criteria (test strategy) and coordinate their evaluation (coordination of UAT execution). Create buy-in and support across users of the tools/processes as well as across the beneficiaries of their outcomes.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128680665158689478"}