{"title": "Senior Data Scientist Manager", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, data scientists not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.\n\nAs a Data Scientist, you will evaluate and improve Google's products. You will collaborate with a multi-disciplinary team of engineers and analysts on a wide range of problems. This position will bring scientific excellence and statistical methods to the challenges of product creation, development and improvement with an appreciation for the behaviors of the end user.", "salary": "$221,000-$314,000 + bonus + equity + benefits", "key_qualifications": "Master's degree in Statistics, Data Science, Mathematics, Physics, Economics, Operations Research, Engineering, or a related quantitative field. 10 years of work experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis, or 8 years of work experience with a PhD degree.", "preferred_qualifications": "12 years of work experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis, or 10 years of work experience with a PhD degree. 6 years of experience as a people manager within a technical leadership role.", "responsibilities": "Collaborate with stakeholders in cross-projects and team settings to identify and clarify business or product questions to answer. Provide feedback to translate and refine business questions into tractable analysis, evaluation metrics, or mathematical models.\n\nUse custom data infrastructure or existing data models as appropriate, using specialized knowledge. Design and evaluate models to mathematically express and solve defined problems with limited precedent.\n\nGather information, business goals, priorities, and organizational context around the questions to answer, as well as the existing and upcoming data infrastructure.\n\nOwn the process of gathering, extracting, and compiling data across sources via relevant tools (e.g., SQL, R, Python). Independently format, re-structure, and/or validate data to ensure quality, and review the dataset to ensure it is ready for analysis.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128625516369322694"}