{"title": "Distinguished Engineer, Cloud Networking", "level": "Director+", "location": "Sunnyvale, CA, USA", "description": "In this role, you will own the long-term technical and innovation strategy for Cloud Networking. You will bring in a strong point of view on technology leadership, research, and industry trends. You'll employ a hybrid approach of direct technical guidance, mentorship, high-level consulting, and risk/growth management. You will collaborate closely with the Cloud Networking leadership team and existing Distinguished Engineers and Principal Engineers. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$323,000-$465,000 + bonus + equity + benefits", "key_qualifications": "Master's degree in Computer Science or Electrical Engineering, or equivalent practical experience. 15 years of experience with distributed systems, planet-scale networking, and cloud computing. 10 years of experience in design, data structures and algorithms, and data analysis and debugging, and experience with customer-facing products.", "preferred_qualifications": "PhD in Computer Science or Electrical Engineering. 20 years of experience in networking or other relevant industries/roles. Experience successfully building software and large-scale distributed systems.", "responsibilities": "Develop product and technology strategy for Google Cloud Networking. Collaborate with Google Cloud Leadership to ensure the networking roadmap meets Google’s strategic goals for the business. Collaborate directly with Google Cloud customers to understand industry trends, product requirements, and opportunities for innovation.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128690762083640006"}