{"title": "Insights and Analytics Lead, Extended Workforce Solutions", "level": "Mid", "location": "Hyderabad, Telangana, India", "description": "Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in analytics, insights development, or strategy consulting. Experience designing, developing, and maintaining SQL scripts, tables, dashboards, and data sets.", "preferred_qualifications": "Master's degree in Statistics/Biostatistics, Economy, Operations Research, Physics, Mathematics, Computer Science, a related field, or equivalent practical experience. Experience in publishing data based insights to support a strategic business decision. Ability to collaborate and influence cross-functional teams with excellent communication skills. Ability to craft engaging and compelling narratives in communications for customers.", "responsibilities": "Create data driven solutions to solve open-ended business problems. Manage outsourced vendor operations to deliver solution. Develop automated dashboards and analyses using unstructured data to identify gaps in business processes or strategy. Synthesize data to recommend actionable solution to improve data quality, system feature, or business process. Collaborate across multiple internal stakeholders for clarifying requirements, developing analytics solutions, and driving usage.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128786477583606470"}