{"title": "Application Modernization Engineer, Cloud Edge", "level": "Mid", "location": "Austin, TX, USA; Atlanta, GA, USA; Chicago, IL, USA; Reston, VA, USA; Washington D.C., DC, USA", "description": "As an Application Modernization Engineer, you will work with customers to transform existing enterprise applications into modern, cloud native applications to reduce time to launch, increase release frequency, reduce time to recovery and failure rate. You will propose and execute, including code development, approaches to modernize Google’s customer’s applications and deploy them to Google Cloud Platform. You will work with customers on application re-design and implementation including application scaling, reliability in addition to advising on ongoing operations such as application and feature rollouts, monitoring, and more. Additionally, you will work closely with Product Management and Product Engineering to build and drive excellence in our products. In this role, you are the Google Engineer working with Google's most strategic Cloud customers. Together with the team, you will support customer adoption of Google Cloud products through architecture guidance, best practices, application migration, implementation, troubleshooting, monitoring, and much more. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$142,000-$211,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, a related technical field, or equivalent practical experience. 5 years of experience managing and maintaining a production-ready Kubernetes environment, deploying containerized applications, monitoring cluster health, troubleshooting issues, and ensuring continuous uptime and performance. 3 years of experience in client-facing projects with cross-functional stakeholders. Experience with software development in Java, Python, Go, or .NET including data structures, algorithms, and software design. Experience implementing and managing Google Distributed Cloud. Experience with cloud computing platforms.", "preferred_qualifications": "Experience in running virtual machines on Linux with KVM and QEMU, including configuration, resource allocation. Experience managing and automating Windows OS and applications, configuration, and updates, using tools similar to and including SCCM or Powershell. Experience managing Windows Server environments, including Active Directory, Group Policy, and system security and optimizing Windows infrastructure. Experience architecting, developing software, or internet scale production-grade solutions in virtualized environments. Experience leading application modernization projects or application architecture projects. Experience deploying/operating workloads in non-data center or cloud environments such as retail, and refactoring monolithic applications to microservices, APIs, or serverless models.", "responsibilities": "Architect and implement solutions for virtualizing and migrating edge applications and systems onto Kubernetes environments, ensuring seamless integration, performance optimization, and cost-efficiency. Guide customers through the transformation of their monolithic edge applications to leverage the agility and scalability of container-based technologies. Advise edge customers, such as retail stores, on seamlessly integrating a new Kubernetes-based system with their existing network, computing, and security infrastructure at the edge. Be a trusted technical advisor to customers and solve complex software development challenges. Create and deliver best practices recommendations, tutorials, blog articles, sample code, and technical presentations adapting to different levels of key business and technical stakeholders.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128987873431954118"}