{"title": "Senior Site Reliability Engineer, Cloud Spanner", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Site Reliability Engineering (SRE) combines software and systems engineering to build and run large-scale, massively distributed, fault-tolerant systems. SRE ensures that Google's services—both our internally critical and our externally-visible systems—have reliability,  uptime appropriate to users' needs and a fast rate of improvement.  Additionally SRE’s will keep an ever-watchful eye on our systems capacity and performance. Much of our software development focuses on optimizing existing systems, building infrastructure and eliminating work through automation. On the SRE team, you’ll have the opportunity to manage the complex challenges of scale which are unique to Google, while using your expertise in coding, algorithms, complexity analysis and large-scale system design. SRE's culture of diversity, intellectual curiosity, problem solving and openness is key to its success. Our organization brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow. To learn more: check out our books on Site Reliability Engineering or read a career profile about why a Software Engineer chose to join SRE. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "salary": "", "key_qualifications": "Bachelor’s degree in Computer Science, a related field, or equivalent practical experience. 5 years of experience with scripting/programming in Python, Go, or Shell. 5 years of experience with distributed system design. 3 years of experience designing, analyzing, and troubleshooting distributed systems and working with administration (e.g., filesystems, inodes, system calls) or networking (e.g., TCP/IP, routing, network topologies and hardware, SDN).", "preferred_qualifications": "Experience with debugging/troubleshooting or database internals.", "responsibilities": "Plan and execute projects that improve reliability or efficiency. Work and develop collaboratively with Software Engineering and other partner teams to continually evolve and expand Cloud Spanner capabilities.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/128901061137048262"}