{"title": "Enterprise Customer Engineer, High Performance Computing, Google Cloud", "level": "Advanced", "location": "Atlanta, GA, USA; Austin, TX, USA; Boulder, CO, USA; Nashville, TN, USA; Cambridge, MA, USA; Chandler, AZ, USA; Chicago, IL, USA; Addison, TX, USA; Detroit, MI, USA; Houston, TX, USA; Irvine, CA, USA; Kansas City, MO, USA; Kirkland, WA, USA; Las Vegas, NV, USA; Miami, FL, USA; Madison, WI, USA; Mountain View, CA, USA; New York, NY, USA; Portland, OR, USA; Pittsburgh, PA, USA; Los Angeles, CA, USA; Raleigh, NC, USA; Durham, NC, USA; Reston, VA, USA; San Diego, CA, USA; Seattle, WA, USA; San Francisco, CA, USA; Salt Lake City, UT, USA; Washington D.C., DC, USA", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners. Google Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$159,000-$239,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Mathematics, a related technical field, or equivalent practical experience. 6 years of experience with HPC systems hardware architecture, network interconnect technologies and topologies, and HPC storage file systems. Experience engaging with, and presenting to, technical stakeholders and executive leaders. Experience selling technical products or services. Experience with cloud computing platforms such as Google Cloud Platform. Experience using an AI Platform to build, deploy, and manage machine learning models.", "preferred_qualifications": "Master's degree in Computer Science or a related technical field. Experience as an IT infrastructure consultant or enterprise architect in data center transformation strategies, migrations, and proposals, including organizational alignment and change management. Experience serving as a technical sales engineer in a high-performance computing environment or in a customer-facing role. Experience designing and implementing performant HPC systems, including job schedulers, message passing interface, high-speed interconnects and parallel file systems.", "responsibilities": "Identify and qualify business opportunities and key customer technical issues, developing a strategy to resolve technical issues. Recommend and document migration paths, integration strategies, and application architecture needed to implement a complete solution using Google Cloud best practices. Assist Infrastructure Solutions Management teams, contributing to solution and use case assets. Lead workshops for strategic customers to assess existing application/infrastructure environments and organizational readiness. Identify potential use cases for cloud computing and paths to digital transformation. Develop architectural blueprints to enable infrastructure, High Performance Computing (HPC) and migration opportunities, coordinating with Product and Specialist teams.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/129095902261322438"}