{"title": "Data Scientist, Supply Chain and Operations, Google Cloud", "level": "Mid", "location": "New York, NY, USA; Kirkland, WA, USA", "description": "The mission of Cloud Supply Chain Operations Data Science and Simulation team is to improve efficiency through applied machine learning, statistical and simulation modeling as well as prescriptive insights. Efficiency could come in the form of cost-savings, reduced deployment/maintenance time, and improved supply/demand predictability. Our data science modeling and analytics work also focuses on projects that increase satisfaction of the users, elevate our measurement capabilities and improve key business metrics.", "salary": "$127,000-$187,000 + bonus + equity + benefits", "key_qualifications": "Master's degree in Statistics, Data Science, Mathematics, Physics, Economics, Operations Research, Engineering, or a related quantitative field or equivalent practical experience. 3 years of work experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis, or a PhD degree. 1 year of experience in generative AI and machine learning. Experience with LLMs (large language models).", "preferred_qualifications": "PhD degree. 5 years of work experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis.", "responsibilities": "Own the process of gathering, extracting, and compiling data across sources via relevant tools (e.g., SQL, R, Python). Independently format, re-structure, and/or validate data to ensure quality, and review the dataset to ensure it is ready for analysis. Serve as Large Language Models (LLM)/Generative AI (GenAI) modeling subject-matter-expert across Cloud Supply Chain Operations organization. Research and apply latest GenAI technologies on supply chain and operations use cases and problems. Develop other machine learning, statistical, and optimization models to improve supply chain and operations efficiency. Most of our (non-LLM) modeling needs are on forecasting and classification. Use custom data infrastructure or existing data models as appropriate, using specialized knowledge. Design and evaluate models to mathematically express and solve defined problems with limited precedent.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/129191499442070214"}