{"title": "System Engineering Program Manager", "level": "", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.", "key_qualifications": "Bachelor's degree in a relevant field, or equivalent practical experience. 1 year of experience in program management. 1 year of experience in hardware development.", "preferred_qualifications": "Experience in shipping high volume/high quality products in the consumer electronic domain. Experience in improving processes and plans. Knowledge of product life cycle, tools, processes and operations planning. Ability to work in several tasks simultaneously and deliver results. Ability to lead technical teams, cross-functional groups, and vendors against plans.", "responsibilities": "Lead planning, development and build execution for new product devices from prototype phase through mass production. Partner closely with the engineering and operations teams to ensure all design and build deliverables are met with high quality. Manage production priorities with the factory and make sound judgments about quality and stopping or speeding up production at the right time with high yields. Identify program risks, develop mitigation strategies and facilitate conflict resolution. Synthesize large amounts of data into a clear story and communicate to stakeholders and organizations at all levels.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/129149053555352262"}