{"title": "Firmware Engineer, Embedded Systems, Pixel Power Optimization", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan; Taoyuan, Taoyuan District, Taoyuan City, Taiwan", "description": "As a Firmware Engineer, you will work on a specific project critical to Google’s needs with opportunities to work on additional projects as you and our fast-paced business grow and evolve.\nIn this role, you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\nThe Google Pixel team focuses on designing and delivering the world's most helpful mobile experience. The team works on shaping the future of Pixel devices and services through some of the most advanced designs, techniques, products, and experiences in consumer electronics. This includes bringing together the best of Google’s artificial intelligence, software, and hardware to build global smartphones and create transformative experiences for users across the world.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, a related technical field, or equivalent practical experience. 2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree. Experience with data structures or algorithms in either an academic or industry setting.", "preferred_qualifications": "Master’s degree or PhD in Engineering, Computer Science, or a related technical field. 2 years of experience working with embedded operating systems. Experience with power management of embedded mobile devices. Experience developing accessible technologies.", "responsibilities": "Develop and support software solutions and tools for Pixel power management and power optimization. Lead efforts in design, development, and support for advanced power optimization software/firmware for Pixel (Android) Kernel. Prioritize optimization for power, latency, and system stability. Debug and triage power issues. Develop and support test-suits to detect power regression and system stability during power state transitions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/129459107439485638"}