{"title": "Analytical Consultant", "level": "Mid", "location": "Oslo, Norway", "description": "Being an Analyst at Google is about much more than simply crunching numbers – it’s about finding compelling insights within data and using your exceptional business and communication skills to translate those insights into action. As one of the masterminds behind our strategic planning, forecasting and analysis, you’ll spend your time digging into big, complex data sets. The data will not remain inert in your hands, however, since you’ll use your critical thinking, problem solving and communication skills to influence and drive thoughtful and well-informed decision making with our most senior business leaders within the organization, and potentially some of our biggest clients. Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience with digital advertising, consultative sales, business development, or digital marketing, or 6 years of experience with an advanced degree. Experience working with advertisers, agencies, or clients. Experience working with SQL.", "preferred_qualifications": "Experience with advertising from either the advertiser, agency, or other media owner side. Experience with dashboard technologies such as Tableau and Looker Studio. Experience with the finance function of a company. Experience working across multiple markets.", "responsibilities": "Be the trusted advisor to customers, uncovering their business and marketing objectives and using insights to accelerate their attainment of their objectives. Create bespoke insights analyses for Google’s biggest customers to identify opportunities to better meet their business objectives and help them make better decisions. Scale insight best practices from the biggest customers to the rest of the customer portfolio via training, processes, narratives, and templates. Own at least one area of learning and innovation such as AI for analysts or branding insights.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/129745700547109574"}