{"title": "Vice President and General Manager, Google Design Platform", "level": "Director+", "location": "New York, NY, USA", "description": "The Core team's mission is to make Google better for everyone, and at scale. Within Core, the Core Experience team focuses on foundational user experiences across Google. The Google Design Platform team focuses on enabling developers and designers to build beautiful, useful, and usable products faster and at scale.", "key_qualifications": "Bachelor’s degree in Computer Science, Software Engineering, related technical field, or equivalent practical experience. 20 years of professional experience in product development related roles. 10 years of experience leading global teams, including experience within Product Management, Engineering, and UX. 7 years of experience working cross-functionally with globally dispersed teams.", "preferred_qualifications": "Experience in consumer focused  product development and experience understanding in-depth customer/user requirements. Experience with design platforms. Experience working on large-scale, cross-company product offerings. Experience with ideation and innovation of exceptional products within large, complex, and cross-functional engineering/product environments. Ability to develop a creative vision to articulate the story, shape the strategy, and define a holistic roadmap, in collaboration with peers and with the mission of building beloved products that address real needs of customers. Ability to communicate clearly and persuasively, and establish a strong drive for success in teams and across peers.", "responsibilities": "Lead a large, global, and cross-functional team including software engineering, product management, UX design, UX research, and program management. Create and deliver the vision and strategy for the way we develop and design products across Google and across our third-party ecosystems. Manage relationships with senior internal and external leaders. Balance short- and long-term company level priorities, across different product areas considerations, and optimizing for our users’ long-term experience. Foster fast and high quality execution in a highly complex and cross-functional environment while instilling a user-centric culture. Lead a diverse, equitable, and inclusive organization. Develop and grow talent through effective mentoring, development, coaching, and inspiring with a strong focus on talent management.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/129724752045449926"}