{"title": "Senior Developer Relations Engineer, Android, Passkeys Authentication", "level": "Mid", "location": "Mountain View, CA, USA; Seattle, WA, USA", "description": "Passionate people are everywhere at Google. In Developer Relations, we get excited to collaborate and connect with the communities that love technology as much as we do. Part community manager and part developer advocate, Developer Programs Engineers collaborate with developers at conferences and online, and advocate for developers interests internally at Google. Not afraid to be hands-on, you write sample code and client libraries as well as participate in developer forums and support queues to troubleshoot and debug coding problems developers encounter. Internally, you work with product engineering teams improve our products by conveying feedback from developers, reviewing API designs and testing new features. Chrome, Android, App Engine, HTML5 as well as our core Google Apps and Ads APIs are just some of the platforms you promote and support. With your technical expertise, you drive strategy around fostering a community of developers who work with Google technologies. An ardent advocate for these developers, you represent their voice internally to our Product Managers and serve as their Google support in application development and technology implementation. As a Developer Relations Engineer, you will be the technical source of Android Identity at Google. You will advocate our Passkeys developer products and APIs, driving adoption and shaping the roadmap for future innovations. You will influence the future of secure authentication and identity management for Android and the entire ecosystem. In this role, you will host workshops/speak at conferences with third-party Android developers, create/drive the Identity team's strategy, and present developer sentiment, feedback, pain points, and wins to Google leadership. Android is Google’s open-source mobile operating system powering more than 3 billion devices worldwide. Android is about bringing computing to everyone in the world. We believe computing is a super power for good, enabling access to information, economic opportunity, productivity, connectivity between friends and family and more. We think everyone in the world should have access to the best computing has to offer. We provide the platform for original equipment manufacturers (OEMs) and developers to build compelling computing devices (smartphones, tablets, TVs, wearables, etc) that run the best apps/services for everyone in the world. The US base salary range for this full-time position is $142,000-$211,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "salary": "$142,000-$211,000", "key_qualifications": "Bachelor's degree in Computer Science, a similar technical field, or equivalent practical experience. 5 years of work experience in a technical role (e.g., software engineering, solutions consultant, etc.) or equivalent technical experience. 3 years of experience working cross-functionally with stakeholders. 2 years of experience building Android applications (e.g., Kotlin, Java). Experience in a Developer Relations role or engaging with and educating developers.", "preferred_qualifications": "7 years of experience in a customer-facing role, public speaking (e.g., presentations, keynotes, demos, etc.). Experience working with third-party Developer tools (e.g., documentation, APIs, SDKs, Client Libraries). Experience in Developer Relations or Developer Communities. Experience working with external partners such as app developers, SDK developers or OEMs. Understanding of authentication and identity protocols (e.g., OAuth, OIDC, FIDO). Ability to take ownership of solutions and exert influence without authority.", "responsibilities": "Act as a subject matter expert for Passkeys developer products and APIs, identifying areas for improvement and influencing the roadmap. Propose product changes, review engineering design documents, and shape engineering plans. Partner with Google Identity, Android, and Chrome teams to craft compelling developer narratives and resources. Provide technical leadership in designing, building, launching, and enhancing Credential Manager, Authentication, and Identity solutions for Android. Drive the widespread adoption of Passkeys among developers.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/130033373362954950"}