{"title": "Technical Program Manager II, Privacy Measurement, Ads", "level": "Mid", "location": "Mountain View, CA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company. Google Ads is helping power the open internet with the best technology that connects and creates value for people, publishers, advertisers, and Google. We’re made up of multiple teams, building Google’s Advertising products including search, display, shopping, travel and video advertising, as well as analytics. Our teams create trusted experiences between people and businesses with useful ads. We help grow businesses of all sizes from small businesses, to large brands, to YouTube creators, with effective advertiser tools that deliver measurable results. We also enable Google to engage with customers at scale.", "key_qualifications": "Bachelor's degree in a technical field, or equivalent practical experience. 2 years of experience in program management. Experience with the software development life cycle.", "preferred_qualifications": "2 years of experience managing cross-functional or cross-team projects. Experience with the online advertising business. Ability to manage ambiguous programs with cross-functional teams. Ability to operate in a fast-paced environment. Ability to collaborate across organizational boundaries, and build relationships to achieve broader organizational goals. Excellent written and verbal communication skills, with the ability to influence a diverse set of stakeholders.", "responsibilities": "Collaborate with team members and stakeholders to understand or identify defined work problems and program goals, obtain prioritized deliverables, and discuss program impact. Prioritize program goals, understand and translate other stakeholders’ needs into program goals, and contribute to decisions on prioritizing goals and deliverables. Define the scope of projects and develop, execute, or manage project plans for supported programs. Review key metrics pertaining to a program, monitor potential metric deviations, and define corrective actions for critical deviations. Identify, communicate, and collaborate with stakeholders within one or more teams to drive impact and work toward mutual goals.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/130055596597486278"}