{"title": "Leadership Technical Program Manager I, Payments", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "Google's projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You're equally at home explaining your team's analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.\n\nUsing your extensive technical and leadership expertise, you manage various Engineering-specific programs and teams.\n\nGoogle is an engineering company at heart. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on users around the world. At Google, engineers not only revolutionize search, they routinely work on scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, social to local, Google engineers are changing the world one technological achievement after another.", "salary": "$168,000-$252,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in a relevant field, or equivalent practical experience. 8 years of technical program management work experience. 5 years of experience in leadership role(s) with/without direct reports. 4 years of experience managing projects.", "preferred_qualifications": "8 years of experience managing cross-functional/team projects. 5 years of supervisory experience.", "responsibilities": "Implement communications standards across a portfolio of programs including executive and key partner communications.\nEstablish a reliable and visible cadence for program reviews, decision-making, prioritization, and Resource Stewardship (effective deployment of machine and people resources) whereby improvements such as efficiency and utilization gains are measurable and the impact can be felt organization wide.\nLead a governance structure that drives effective executive decision-making. Ensure governance structure effectively exposes and mitigates dependencies.\nSeek out and identify change management opportunities that increase program velocity and which affect multiple teams. Apply governance over change management to ensure it’s used effectively.\nDefine/manage a program portfolio solving problems that target high business impact for the organization and product area.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/130169833063883462"}