{"title": "Director, Customer Engineering, Southeast Asia", "level": "Director", "location": "Singapore", "description": "As Director, you will serve as a trusted advisor to our customers to help them realize the maximum business potential of Google Cloud. You will set the Customer Engineering strategy for the region and solve key technical issues for our customers while liaising with Sales, Product Engineering, Technical Infrastructure, Marketing, Channels, and other cross-functional teams.", "key_qualifications": "Bachelor's degree in Computer Science or a related technical field or equivalent practical experience. 15 years of experience in a Technical Sales Engineering role in a cloud computing environment or equivalent experience in a customer facing technical/engineering role. Experience managing teams (i.e. manager of managers).", "preferred_qualifications": "MBA or Master's degree in Computer Science. Experience leading a large sales organization across many solutions and technologies. Ability to lead with enthusiasm and flexibility in a fast-paced, constantly evolving team environment. Ability to learn, understand, and work with emerging technologies, methodologies, and solutions in the cloud/IT technology space. Ability to engage and influence both technical and non-technical audiences, and be viewed as a technical thought leader in the region and industry. Ability to influence across subregional and functional teams to deliver quality business outcomes, and relationships with customers to influence key agreements and outcomes.", "responsibilities": "Manage an organization of Customer Engineers to meet bookings objectives for the region. Recruit talent. Drive the Customer Engineering organization to lead technical sales activities and manage customer deployment and operations. Meet with customers and participate in key agreements/accounts. Inject operational aptitude, supporting technical reviews and involving Channels, Google Ads Sales teams, etc. when appropriate. Be responsible for technical aspects of solutions to include such activities as managing product and solution briefings, proof-of-concept work, and the coordination of technical resources. Drive the Customer Engineering organization to enable and grow channel partners for technical sales and customer deployment and operations. Prepare and deliver product messaging to highlight Google Cloud Platform value proposition. Make recommendations on integration strategies, enterprise architectures, platforms, and application infrastructure to implement a solution providing best practice advice to customers.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/130221368913339078"}