{"title": "Senior RTL Design Engineer, Silicon", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "salary": "$177,000-$266,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Engineering, Computer Science, or a related field, or equivalent practical experience. 8 years of experience with digital logic design principles, RTL design concepts, and languages such as Verilog or SystemVerilog. 6 years of experience with IP Development or Integration. Experience with logic synthesis techniques to optimize RTL code, performance and power as well as low-power design techniques. Experience with a scripting language like Perl or Python.", "preferred_qualifications": "Master's degree or PhD in Electrical Engineering, Computer Engineering, or Computer Science. Experience with ASIC design methodologies for clock domain checks, reset checks and low power design. Experience with FPGA and emulation platforms. Experience with high performance and energy efficient design techniques. Experience with ASIC Verification or DFT. Knowledge in Processor Cores, Buses/Fabric/NoC, Debug/Trace, Interrupts, or Clocks/Reset.", "responsibilities": "Manage micro-architecture definition for a subsystem/ASIC. Perform integration of internal or external IP. Perform RTL coding, function/performance simulation debug and Lint/CDC/FV/UPF checks. Participate in synthesis, timing/power closure and FPGA/silicon bring-up. Participate in test plan and coverage analysis of the sub-system and chip-level verification.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/130227634532426438"}