{"title": "Manager, Technical Program Manager, Google Cloud Business Platforms", "level": "Advanced", "location": "Bengaluru, Karnataka, India", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nGoogle Cloud Business Platform (GCBP) is a product and engineering organization responsible for the applications and platforms that drive Cloud Marketing, Sales, Partner, Support, Finance, and other critical functions and help run the Google Cloud business. We operate in a dynamic and fast-paced environment with significant opportunities to create impact, and are looking for you to work on business challenges at scale to drive our continued growth.\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor's degree in a technical field or equivalent practical experience. 8 years of experience in program management. 5 years of experience managing multi-group, multi-disciplinary projects.", "preferred_qualifications": "8 years of experience managing cross-functional or cross-team projects. 5 years of supervisory experience.", "responsibilities": "Implement communications standards across a portfolio of programs including executive and key partner communications.\nEstablish a reliable and visible cadence for program reviews, decision-making, prioritization, and Resource Stewardship (effective deployment of machine and people resources) whereby improvements such as efficiency and utilization gains are measurable and the impact can be felt organization wide.\nLead a governance structure that drives executive decision-making. Ensure governance structure effectively exposes and mitigates dependencies.\nSeek out and identify change management opportunities that increase program velocity and affect multiple teams. Apply governance over change management to ensure it’s used effectively.\nDefine/manage a program portfolio solving problems that target high business impact for the organization and product area.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/130261386532922054"}