{"title": "Account Strategist, Engage, Google Customer Solutions (English, Spanish)", "level": "", "location": "Dublin, Ireland", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow.", "key_qualifications": "Bachelor's degree in Marketing, Advertising, or equivalent practical experience. 2 years of experience in advertising, consultative sales, business development, online media environment, or marketing roles. Ability to communicate in English and Spanish fluently to support client relationship management in this region.", "preferred_qualifications": "Certification in Google Digital Workshop. Familiarity with Google Ads and online advertising. Ability to own a portfolio in an advertising or media sales context in Spain, and consistently overachieve quotas to drive growth. Ability to build compelling narratives and utilize storytelling as a client engagement strategy. Ability to influence stakeholders internally and externally to deliver impact. Ability to multi-task and manage multiple projects at a time while paying attention to detail.", "responsibilities": "Establish relationships via phone calls or e-mail marketing and conduct regular phone consultations and business pitches with clients to advise them on how to get the best return on their Google Ads investment. Own a portfolio of small businesses by thoroughly understanding growth drivers identifying opportunities for growth, managing risks, and building quarterly plans for achievement. Drive customer growth by delivering outstanding customer business experience and achieving customer business and marketing objectives. Deliver against quarterly business and product growth goals.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/130332074379748038"}