{"title": "Software Engineer, Local Search Ads Quality", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience with software development in one or more programming languages, and with data structures/algorithms. Experience designing, analyzing, and troubleshooting large-scale distributed systems. Experience in back-end development.", "preferred_qualifications": "Experience in full-stack development.", "responsibilities": "Lead efforts to uncover new opportunities that fuel the growth for local search ads thus creating strong business impact for Google. Design and develop next generation algorithms, models, and systems improving the quality and coverage of the local search ads. Work on projects spanning a range of technical domains including quality experimentation, extreme low latency, infrastructure, feature engineering, logs analysis, advertiser reporting, and production stability. Engage with stakeholders from several other teams cross-functionally, including Geo Data, Local Search, Ads Serving, Auctions, Ads Quality, etc. Help create documentation, sustainable processes, and principles that allow the team to iterate faster.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/130452912009552582"}