{"title": "Technical Program Manager Lead, Google Pixel", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "Google's projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily.", "key_qualifications": "Bachelor's degree in Electrical Engineering, a related technical field, or equivalent practical experience. 5 years of experience in technical program management. 3 years of experience managing projects. 3 years of experience in leadership role(s) with/without direct reports.", "preferred_qualifications": "10 years of experience with shipping high-volume and high-quality products in consumer electronics or other devices. Experience managing functional engineering teams and working with Original Equipment Manufacturer (OEM) partners. Experience in device/hardware manufacturing, product design, device management, and channel/partner ecosystem. Knowledge of consumer hardware development and manufacturing processes, vendor relations, and working with Contract Manufacturers (CMs). Ability to lead complex, strategic, and operational initiatives. Ability to travel as needed.", "responsibilities": "Manage a team of Electrical Engineering Technical Program Managers to develop and manage hardware development project schedules with Engineering teams and communicate project status to stakeholders. Identify dependencies and collaborate with a cross-functional team to execute, mitigate risks and issues, and meet system build milestones, cost, quality, and manufacturability. Understand consumer hardware development and manufacturing processes, vendor relations, and work with Contract Manufacturers (CMs). Identify risks, develop mitigation strategies, and facilitate conflict resolution among a cross-functional team of engineers. Generate the ideas required to solve the technical subjects. Develop playbooks, tools, and processes to collaborate engineering productivity and own technical relationships with cross-functional vendors and partners.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/130417440411525830"}