{"title": "Senior Staff Quantitative UX Researcher, Core", "level": "Advanced", "location": "Austin, TX, USA; New York, NY, USA; Seattle, WA, USA; Sunnyvale, CA, USA; Remote eligible", "description": "At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" Quantitative User Experience Researchers make this possible. Google User Experience (UX) is made up of multi-disciplinary teams of UX Designers, Researchers, Writers, Content Strategists, Program Managers, and Engineers: we care deeply about the people who use our products. The UX team plays an integral part in gathering insights about the attitudes, emotions, needs, and behaviors of people who use our products to inspire and inform design. We collaborate closely with each other and with engineering and product management to create industry-leading products that deliver value for the people who use them, and for Google’s businesses. As a Quantitative User Experience Researcher (Quant UXR), you’ll help inform your team of UXers, product managers, and engineers about user needs. You’ll play a critical role in creating useful, usable, and delightful products. You’ll work with stakeholders across functions and levels and have impact at all stages of product development. You will investigate user behavior and user needs using empirical research methods such as logs analysis, survey research, path modeling, and regression analysis. Quant UXRs vary in background and use skills from computer science, quantitative social science, econometrics, data science, survey research, psychology, human-computer interaction, and other fields. You’ll combine skills in behavioral research design, statistical methods, and general programming to improve user experience. The Quantitative UXR community at Google will help you do your best work. You’ll have the opportunity to work with and learn from UXRs across Google through regular meetups, mentor programs, and access to internal research tools. The Core team builds the technical foundation behind Google’s flagship products. We are owners and advocates for the underlying design elements, developer platforms, product components, and infrastructure at Google. These are the essential building blocks for excellent, safe, and coherent experiences for our users and drive the pace of innovation for every developer. We look across Google’s products to build central solutions, break down technical barriers and strengthen existing systems.", "salary": "$214,000-$305,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, related field, or equivalent practical experience. 8 years of experience in an applied research setting, or similar. Experience in programming languages used for data manipulation and computational statistics (Python, R, MATLAB, C++, Java, Go), and with SQL. Include a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link and/or access instructions).", "preferred_qualifications": "Master's or PhD degree in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, or related field. 8 years of experience managing projects, and working in a large, matrixed organization. 10 years of experience conducting UX research on products and working with executive leadership (e.g., Director level and above).", "responsibilities": "Influence stakeholders across organizations to gain support for research-based, user-centric solutions. Own project priorities in alignment with larger product goals, and oversee allocation of resources within the project. Drive ideas to improve products and services through research-driven insights and recommendations. Lead teams to define and evaluate product, service, ecosystem impact. Own vision and strategy discussions through research by analyzing, consolidating, or synthesizing what is known about user, product, service, or business needs.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/130563502250042054"}