{"title": "Messaging Abuse Analyst, Messages Trust and Safety", "level": "Mid", "location": "Hyderabad, Telangana, India; Bengaluru, Karnataka, India", "description": "The Trust and Safety team has the critical responsibility of protecting Google's users by ensuring online safety by fighting fraud and abuse across Google products like Ads, Maps, Chrome, Play, Gmail, and Search.", "key_qualifications": "Bachelor's degree or equivalent practical experience, 8 years of experience working on signal development, data analysis, cyber security, or anti-abuse, Experience with data analysis, tools and processes, and building customer reputation models", "preferred_qualifications": "Experience with fraud/abuse investigations, fraud risk management, security and threat analysis in the context of internet, telephony, or communication-related products, Knowledge of SMS/MMS/RCS or SIM/Phone Number fraud and abuse, Ability to navigate and influence cross-team stakeholders, Ability to program in one or more languages (e.g., Python, Golang), Excellent written and verbal communication and presentation skills to deliver findings to cross-functional partners, and ability to influence cross-functionally at various levels", "responsibilities": "Analyze emerging trends, conduct complex data analyses, and identify new signals to develop solutions for scaled enforcement. Develop an understanding of abuse in messaging, current cross-product workflows, and available intelligence. Translate abuse protection requirements into data modeling initiatives and build prototypes. Lead projects to prevent Google's infrastructure from being abused to harm users or commit financial fraud resulting in losses to users and/or Google. Collaborate with Engineering, Product Managers, and Program Manager groups to develop requirements documents based on robust data analysis and granular product understanding. Perform active threat monitoring, identify gaps in abuse detection, and constantly update abuse rules based on evolving patterns. Create real-time awareness of threats and educate clients to reduce the problem upstream. Collaborate with the carrier ecosystem to block bad actors (e.g., corrective/preemptive measures, fraud investigations)", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/130543099007902406"}