{"title": "Regional Operations Manager, Global Security Operations Center (GSOC)", "level": "Advanced", "location": "Boulder, CO, USA", "description": "Security is at the core of Google's design and development process: it is built into the DNA of our products. The same is true of our offices. You're an expert who shares our seriousness about security and our commitment to confidentiality. You'll collaborate with our Facilities Management team to create innovative security strategies, investigate breaches and create risk assessment plans for the future. You believe that providing effective security doesn't come at the expense of customer service - you will be our bodyguard (and our long lost pal).", "key_qualifications": "Bachelor's degree or equivalent practical experience. 10 years of experience in law enforcement, intelligence or a military role or equivalent private sector experience. Experience working in a Security Operations Center.", "preferred_qualifications": "Deep knowledge and experience with security technologies including CCTV, Access Control, and Incident Management Systems. Proven track record in managing security operations and security personnel and delivering high quality, customer-oriented security programs. Ability to lead projects by navigating priorities, measurable objectives, dependencies, planning, resourcing, scheduling, budgeting, implementation and subsequent monitoring. High ethical standards with proven ability to handle highly confidential and sensitive information; excellent judgment, discretion and diplomacy. A strong understanding of global geopolitical trends and emerging threats and risks.", "responsibilities": "Lead a team of GSOC employees and oversight of GSOC vendors. Lead GSOC operations during crisis and incident response and coordinate with other parts of GSRS and the GSOC ecosystem as required. Oversee all GSOC deliverables on a given shift. Analyze, develop, and strengthen GSOC processes and procedures; spearhead development and integration across the GSOC ecosystem. Empower the team to utilize the resources and knowledge necessary to manage incidents and escalations. Manage GSOC support requests and field requests from stakeholders. Manage the GSOC AO's & KR’s assigned to them. Communicate and collaborate effectively with leadership and cross-functional colleagues, both inside and outside of Global Security & Resilience Services (GSRS).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/130625394138063558"}