{"title": "Network Engineer, Google Global Networking", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Google is proud to boast a network that provides service to millions of Internet users around the world. The Network Engineering team is responsible for operating that network reliably and at scale. As a member of the team, you have a direct impact on design and feature enhancements to keep our systems running smoothly. You also ensure that network operations are safe and efficient by monitoring network performance, coordinating planned maintenance, adjusting hardware components and responding to network connectivity issues. Google's complex network generates a constant stream of challenges which require you to continually be innovative with an evolving set of technologies. Keeping the network reliable ensures that our users stay connected with our suite of applications, products and services. Google's network engineers develop the next-generation technologies that change users connect, explore, and interact with information and one another. Google Network Infrastructure team works on the systems to deliver compute and storage not available anywhere else through tightly-coupled, highly available network infrastructure. Our Google Wide Area Network (gWAN) Build and Safety team plans, designs and builds Google's global private WAN network. In this role, you will deliver the networking that enables all Google’s technical infrastructure. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent practical experience. 3 years of experience with TCP/IP foundations and routing protocols (e.g., EIGRP, OSPF, BGP, IS-IS, MPLS). Experience coding in Python.", "preferred_qualifications": "Experience with networking technologies/concepts such as Software Defined Networking (SDN) and OpenFlow. Experience with system design. Experience building software applications in the networking domain. Experience with network automation and bootstrapping processes.", "responsibilities": "Analyze the short and long-term growth needs, plan for the future, and demand and ensure system scales to needed growth envelopes. Engage in inception, design, qualification, and validation of new technologies, and ensure new technologies fit the need and demand of the users, are deployable at scale, and are safely operable. Scale network systems sustainably through automation, and evolve them by pushing for changes that improve reliability and velocity. Drive process improvements and automated turn-up and service delivery. Participate in on-call rotation for escalated issues. Write workflow automation to improve the customer experience.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/130687836721423046"}