{"title": "Strategy and Operations Lead, Seller Success", "level": "Mid", "location": "New York, NY, USA; Ann Arbor, MI, USA; Los Angeles, CA, USA; Redwood City, CA, USA", "description": "Our mission is to fuel Google Customer Solution (GCS) growth by enabling customers to achieve the most with our products today and shaping our products for tomorrow. We are the product and business experts behind the GCS sales teams responsible for driving sustainable business growth and product adoption. Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow. Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.", "salary": "$142,000-$211,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 6 years of experience in Product Strategy, Marketing Strategy, Ad Agency, Research Agency, Product Marketing, Product Management, Management Consulting, or similar roles.", "preferred_qualifications": "MBA or other Graduate degree. Experience in SQL and working with large data sets to deliver actionable insights and recommendations. Ability to identify opportunity areas for the business, formulate hypotheses and use problem-solving techniques and project management to design and deliver solutions. Excellent communication skills, with the ability to influence cross-functional groups and executive leadership. Passion for sales enablement and promoting.", "responsibilities": "Develop strategies for the Seller Success team that solve complex business issues, address the needs of GCS sellers and drive impact. Diagnose and identify sales enablement opportunity areas for the business by understanding seller workflows and the customer landscape scope impact, develop solutioning and build out a plan for execution. Collaborate cross-functionally across a wide range of stakeholders including Sales leadership, Sales managers, Sales Mastery, Product and Sales Activation Strategy and Operations, and Business Strategy and Operations to shape, launch and land cross-program priorities. Track the progress and impact of key initiatives using quantitative analysis and qualitative feedback to continuously improve seller enablement. Communicate findings to leadership and key stakeholders with compelling presentations that synthesize context, insights and recommendations.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/130835081622102726"}