{"title": "Facilities Operations Manager, Data Center Operations", "level": "Mid", "location": "Hamina, Finland", "description": "The Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facility Technicians at Google data centers operate, monitor and support physical facilities conditions. Some duties will include heating and cooling of air and water, power supply, generators, UPS systems, electrical distribution and control and monitoring systems. You regularly help inspect, maintain and repair various data center systems such as piping and non-critical electrical or mechanical system components). You'll provide daily assistance to senior technicians as you read blueprints/schematics, conduct tours of systems and assess their working order.", "key_qualifications": "Bachelor's degree in Mechanical Engineering, Electrical Engineering, Industrial Engineering, or equivalent practical experience. Experience as a Facilities Manager or Chief Engineer within a critical facility. Experience managing a mission critical facilities portfolio.", "preferred_qualifications": "Master's degree in Engineering or a related field. Experience collaborating with other business units to meet company goals and standards. Understanding of the operations and maintenance of electrical systems in a data center environment. Excellent people management and leadership skills, with the ability to influence at all levels.", "responsibilities": "Set and communicate individual and team priorities that support organizational goals. Meet regularly to discuss performance and development, and provide feedback and coaching. Ensure team members are following work processes and complying with guidelines and all sites are following facility, maintenance, and standard programs, while making recommendations for data center improvements. Monitor data center systems operation, control site activities to minimize risk, and respond effectively to any excursions or emergency procedures. Develop strategies to improve efficiency, minimize cost, and reduce environmental impact, validate and improve processes and procedures for equipment operations, and perform and analyze compliance checks for data centers globally. Collaborate with partner teams and project leads to set and implement short and long-term strategies.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/131089313621254854"}