{"title": "Technical Program Manager, Matter Lifecycle Management", "level": "Mid", "location": "São Paulo, State of São Paulo, Brazil", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\nAs a Technical Program Manager focused on machine learning, you will drive innovation that enables Google’s products to understand users.\nAt Corp Eng, we build world-leading business solutions that scale a more helpful Google for everyone. As Google’s IT organization, we provide end-to-end solutions for organizations across Google. With an inclusive mindset, we deliver the right tools, platforms, and experiences for all Googlers as they create more helpful products and services for everyone. In the simplest terms, we are Google for Googlers.", "key_qualifications": "Bachelor's degree in a relevant field, or equivalent practical experience. 2 years of experience managing projects. Experience in Machine Learning or Artificial Intelligence.", "preferred_qualifications": "4 years of experience in program management on technical cross-functional projects, including planning, execution, estimation, risk management, and stakeholder management. 3 years of experience engaging with a software development team developing and reviewing technical requirements, design documents, bug triage, setting technical goals, and negotiating technical tradeoffs between teams. Experience helping teams measure and improve operations, products, equity, and accessibility. Excellent leadership and communication skills, with the ability to interact with both technical and non-technical groups.", "responsibilities": "Manage technology programs, define milestones, success criteria, resource allocation, and successful on-time delivery. Work with cross-functional teams. Develop tools and processes to improve software engineering productivity. Communicate schedules, priorities, and status to the company. Analyze processes, identify opportunities for improvement, define requirements, and collaborate cross-functionally and cross-product area to improve processes and tools.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/131295406083449542"}