{"title": "Data Engineer, Overhead Imagery", "level": "Early", "location": "Hyderabad, Telangana, India", "description": "The Geo team is focused on building the most accurate, comprehensive, and useful maps for our users, through products like Maps, Earth, Street View, Google Maps Platform, and more. Every month, more than a billion people rely on Maps services to explore the world and navigate their daily lives.The Geo team also enables developers to use the power of Google Maps platforms to enhance their apps and websites. As they plot a course for the future of mapping, they are solving complex computer science problems, designing beautiful and intuitive product experiences, and improving our understanding of the real world.", "salary": "", "key_qualifications": "Bachelor’s degree in Engineering, Computer Science, a related field, or equivalent practical experience; 3 years of experience coding in one or more programming languages.", "preferred_qualifications": "Experience with data processing frameworks (e.g., Apache Spark, Apache Beam). Experienced in designing data pipelines (ETL) tools (e.g., DataFlow, Spark) for synchronous and asynchronous system integration. Understanding of core data and role-related knowledge, relevant Google-wide technologies, and processes. Knowledge of Big Data and Machine Learning principles and techniques. Familiarity with data visualization tools (e.g., Tableau, Looker).", "responsibilities": "Develop and maintain data pipelines that extract, transform, and load data from various sources. Design and implement data models that support efficient data storage, retrieval, and analysis. Ensure the accuracy, completeness, and consistency of data throughout the data lifecycle. Continue to monitor and optimize data pipelines for performance and scalability. Work closely with Data Scientists, Software Engineers, and Product Managers to understand data requirements and deliver data solutions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/131268865198826182"}