{"title": "Business Intelligence Analyst, YouTube", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "The YouTube Strategy team focuses on our highest priorities, solving complex, ambiguous problems that span early stage growth initiatives, investing in our largest product or business areas, making major operational or organizational changes, and assessing strategic rationale for YouTube external investment opportunities. Throughout, we provide analytics-based insights, ensure cross-functional alignment of goals and execution, help YouTube teams drive our most important strategic initiatives, and advise our senior leadership on the best path forward. At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience with analytics and analytics development. Experience with relational databases including SQL queries, database definition, and schema design. Experience with business intelligence and data visualization tools including Looker, Tableau, or PowerBI.", "preferred_qualifications": "Master's degree or equivalent practical experience. 6 years of experience creating dashboards, manipulating datasets, and performing data analysis using SQL and data visualization tools (e.g., Looker, Tableau, PowerBI, Data Studio, etc.). Experience converting business requests into technical requirements for insightful data products. Experience deploying data products and working cross-functionally to deliver products and communications to drive adoption. Experience with one or more programming languages (e.g., Python, Java, C++, etc.) to deliver or manage data pipelines.", "responsibilities": "Lead development and deployment of centralized reports, dashboards, models, and tools to analyze, report, and present partnerships and operations related data. Work with User Support teams to determine key business questions and pain points in existing processes. Deliver and contribute to a prioritized roadmap, working cross-functionally with Data Infrastructure (DI) to release product features. Deliver data products to User Support teams which drive better decision-making, and help create KPIs and key results for your business domain. Own strategy for shared analyst infrastructure, and innovate on infrastructure for the analyst community to utilize.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/131355669843321542"}