{"title": "Senior Director, Regulatory Affairs, Content Advisory Global Lead", "level": "Director+", "location": "Dublin, Ireland", "description": "Regulatory Affairs helps the company innovate responsibly and comply with laws around the world. We partner with teams across Global Affairs, Product Areas, and the rest of the company to ensure constructive engagement with governments and regulators while mitigating risk.", "key_qualifications": "JD or equivalent degree \nExperience in legal, compliance, and regulatory risk.\nAdmitted to the bar and in good standing or otherwise authorized to practice law (e.g. have registered in-house status) in the state in which the position is located.", "preferred_qualifications": "Experience developing, evaluating, and maintaining programs that ensure products comply with laws, regulations, and external commitments.\nExperience with managing projects and partnering effectively with cross-functional teams.\nExperience managing global teams and other managers.\nExperience working with technology companies and ability to understand complex technical issues.\nExcellent written and verbal communication, time management, and investigative skills, and attention to detail with the ability to be action-oriented.", "responsibilities": "Translate legislation, regulations, and other obligations into requirements that will be utilized by Compliance, Product, Business, and Engineering teams to ensure compliance.\nProvide legal advice and subject area insights to Public Policy as they engage with Governments and Regulators on draft legislation. Review proposed designs and advise teams on risks that arise during designing and implementing enhancements.\nEngage with governments and regulators to provide briefings, participate in negotiations, and submit disclosures regarding our readiness efforts on critical compliance obligations and readiness efforts.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/131511867334894278"}