{"title": "Technical Program Manager, Anti Financial Crime, Payment Platform", "level": "Mid", "location": "Hyderabad, Telangana, India", "description": "Google's projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You're equally at home explaining your team's analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers. Using your extensive technical and leadership expertise, you manage projects of various size and scope, identifying future opportunities, improving processes and driving the technical directions of your programs. The Payments Anti-Financial Crime (AFC) team focuses on keeping Google compliant with low-effort and low-risk to enable first-party product and business growth through a configurable, scalable AFC Platform. As a Technical Program Manager, you will drive infrastructure projects for Payments Platform. In this role, you will have the opportunity to work across engineering, product management, compliance, legal, and other cross-functional partners. Whether it is paying online with Autofill, using tap and pay in stores, or using the Google Pay app, the Payments team at Google is focused on making payments simple, seamless, and secure. In addition to consumer payment technologies, the Payments team also powers the money movement between Google and its consumers and businesses.", "key_qualifications": "Bachelor's degree in Computer Science, Engineering, or equivalent practical experience. 2 years of program management experience working on cross-functional programs. 2 years of experience in managing software development programs.", "preferred_qualifications": "Master's degree in Computer Science or a related technical field. Experience in commerce, payments, platform products. Excellent problem solving and analytical skills.", "responsibilities": "Manage cross-functional/technical projects and drive them to launch, work with Engineering, Product Management, and cross-functional partners to define requirements, scope, schedule, resourcing, and milestones/tasks. Manage relationships with key internal stakeholders and vendors, support team discussions, drive issues to resolution, and help identify and implement risk mitigation. Provide technical comprehension and thought leadership to run projects more efficiently. Identify, develop and implement process improvements to help teams scale, communicate project status to various audiences, as well as cross-functional and executive audience", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/131674025435767494"}