{"title": "Senior Motion Designer, Search", "level": "Mid", "location": "Mountain View, CA, USA", "description": "At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" Google’s Motion Designers collaborate with cross-functional partners to create desirable and relevant product experiences that consistently elevate the Google brand. They help people make sense of their world by choreographing experiences that feel fluid, natural, and informative.", "key_qualifications": "Bachelor's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 6 years of experience in product design or UX. Motion design experience related to physics, patterns, and visual design elements. Include a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link and/or access instructions).", "preferred_qualifications": "Master's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 8 years of experience in product design or UX. 3 years of experience working in a complex, cross-functional organization. 2 years of experience leading design projects. 1 year of experience working with executive leaders. Experience using motion to reduce perceived latency. Understanding of basic principles of animation, and experience with using animation tools (e.g., After Effects or similar). Ability to fuse creativity and code to deliver cutting edge interactions, using motion to a narrative effect and understanding the future of interactive motion.", "responsibilities": "Define and implement the look and feel of Google products through motion design. Provide patterns, best practices and guidance on animation and transitions for different devices (such as TV, tablets, wearables, mobile, etc.) and platforms (such as web, Android, iOS, etc.). Create high quality design proposals and drive projects from concept to iterations and implementation.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/131864397713679046"}