{"title": "Data Center Systems and Integration Engineer", "level": "Mid", "location": "Sunnyvale, CA, USA", "description": "Our thirst for technology is a part of everything we do. The Data Center Engineering team takes the physical design of our data centers into the future. Our lab mirrors a research and development department -- cutting-edge strategies are born, tested and tested again. Along with a team of great minds, you take on complex topics like how we use power or how to run state-of-the-art, environmentally-friendly facilities. You're a visionary who optimizes for efficiencies and never stops seeking improvements -- even small changes that can make a huge impact. You generate ideas, communicate recommendations to senior-level executives and drive implementation alongside facilities technicians. With your technical expertise, you ensure compliance with codes and standards, develop infrastructure improvements and serve as an expert in your specialty (e.g., cooling, electrical).", "key_qualifications": "Bachelor's degree in Mechanical or Industrial Engineering, related discipline, or equivalent practical experience. 3 years of experience in design, 3D CAD systems, or 3D modeling systems. 3 years of experience in data center architecture or system architecture.", "preferred_qualifications": "5 years of experience with 3D CAD and modeling systems. Experience designing rugged systems and performing full stack integration analysis using a modular design approach. Experience with IT and DC infrastructure. Knowledge of Creo, Revit, Solidworks, and CATIA. Ability to deliver designs in a tight schedule and support your product during each phase of its life such as prototype, pilot production, production, and decommission. Excellent problem solving, communication and organizational skills, coupled with attention to detail, and ability to work under minimal supervision.", "responsibilities": "Design of IT and DC infrastructure, evaluate IT platforms, integration into data centers, and execute designs for complex systems through engineering analysis. Develop and perform qualification tests (vibration/structural, shock loading, thermal/environmental, EMI, etc.). Collaborate with IT design team on establishing interfaces and influencing design from conceptual to production stage to maximize design synergy and deployment efficiency in data centers. Be a technical support/lead for DC system level design and product development during each of its deployment phases. Identify cross functionalities and modular design your system to be reusable in as many products as possible.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/131899615036220102"}