{"title": "Digital Strategy Lead, Accelerated Growth, Google Customer Solutions", "level": "Mid", "location": "Tokyo, Japan", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.\n\nThe Accelerated Growth Team (AGT) is a strategic team designed to help small and medium-sized businesses (SMBs) with growth potential. AGT specializes in building full-funnel digital marketing strategies to accelerate customer growth. As a Digital Strategy Lead within AGT, you will identify and grow customer prospects within a segment of the Google Customer Solutions ecosystem, to set them up for accelerated and sustainable growth on our platforms.Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow.  Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n5 years of experience in account management, sales, or marketing.\nExperience developing and pitching solutions through various channels (e.g., over the telephone, email, in-person meetings) to prospective customers.\nAbility to communicate fluently in Japanese and English to engage with external and internal local stakeholders in Japan.", "preferred_qualifications": "Experience in sales in a technology, advertising, media sales, and/or internet environment.\nExperience with Google Ads and YouTube account management, managing advertising and/or media campaigns.\nExperience in media across a variety of platforms (e.g., TV, Radio, Print, Sponsorship, etc.).\nExperience managing multiple accounts simultaneously while paying attention to detail.\nAbility to succeed in a rapidly changing environment, with excellent problem-solving, creative thinking, and analytical skills.", "responsibilities": "Manage a portfolio of businesses by understanding growth drivers, identifying opportunities for growth, managing risks, and building quarterly plans for achievements.\nDrive customer growth by delivering an outstanding customer experience and achieving customer business/marketing goals.\nOwn the full cycle business process by driving customer outreach, business proposals, solution implementation, and performance evaluation.\nEngage, support, and build relationships with customers.\nPartner closely with the internal SMB Account Manager team to promote and accelerate business growth.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/131964522259718854"}