{"title": "NPI Technical Operations Manager, Networking and Optics", "level": "Advanced", "location": "Sunnyvale, CA, USA", "description": "Google's custom-designed equipment makes up one of the largest and most powerful computing infrastructures in the world. The Manufacturing Operations team is responsible for providing the manufacturing capability to deliver this state-of-the-art physical infrastructure.", "key_qualifications": "Bachelor's degree in Electrical, Process, or Manufacturing Engineering, or equivalent practical experience. 12 years of experience developing supply chain manufacturing, testing, and advanced technologies. 10 years of experience in people management. Experience with designing, manufacturing, and deployment of hardware. Experience working with Original Device Manufacturers (ODMs), contract manufacturers, and component suppliers for data center class products.", "preferred_qualifications": "Master's degree in Electrical Engineering or a related field. Experience with designing, manufacturing, and deployment of Networking and optical hardware. Experience in bring-up or bench testing hardware in a lab environment. Knowledge of SQL queries and scripting in Python or Bash.", "responsibilities": "Foster a high-performing engineering team through effective leadership, mentorship, and collaboration by driving cross-functional alignment and addressing organizational challenges. Serve as a recognized technical authority, guiding the resolution of complex issues and aligning solutions with product and strategic goals. Make decisive choices that reduce costs, mitigate risks, and accelerate project timelines. Lead failure analysis, risk management, and continuous improvement efforts. Oversee advanced manufacturing solutions for Google products, defining and implementing comprehensive test strategies, ensuring yield, quality, and factory readiness. Drive vendor selection, qualification, and management. Stay at the forefront of manufacturing advancements and assess their potential for adoption.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/131915961480422086"}