{"title": "Technical Solutions Consultant, Payments Partner Engineering", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "As a Technical Solutions Consultant, you will be responsible for the technical relationship of our largest advertising clients and/or product partners.", "key_qualifications": "Bachelor's degree in Computer Science, Information Systems, a related technical field, or equivalent practical experience. 7 years of experience in systems design or coding in a general purpose programming language and working with web technologies (i.e., HTML, CSS, JavaScript and HTTP). Experience communicating technical concepts to external partners/customers.", "preferred_qualifications": "Experience in software architecture and engineering roles. Experience in Software development with Java and other languages like JavaScript, Python, Node.js, and other API related technologies. Experience with web services related standards such as HTTP, REST, SOAP, and OAuth. Experience of working with external partners on integration design, API design and implementation. Strong communication and project management skills, with the ability to manage multiple customers and streams of work.", "responsibilities": "Architect, Build, Test and Launch Partner integration solutions across Consumer Payments, Merchant Payments, Bill payments, and Financial Services. Work collaboratively and effectively with GPay cross functional teams and Partner cross functional teams to contribute to product launches, feature prioritization, and other strategic Go-To-Market initiatives. Drive partner initiatives and projects through the entire project lifecycle - including managing project schedules, gaining visibility into partner development  times, finding ways to accelerate their schedules, identifying risks and clearly communicating them to project stakeholders. Own the technical aspects of a partner’s integration by providing the necessary documentation and technical guidance; Develop and operate appropriate technology infrastructure for on-boarding partners on to the platform, deliver blueprints and accelerator methodologies, developer and operations support tools, etc.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/132051600574161606"}