{"title": "Customer Engineer, Startups, Google Cloud", "level": "Mid", "location": "Atlanta, GA, USA", "description": "As a Customer Engineer, you will work with the Sales team to introduce Google Cloud to our customers. In this role, you will help prospective, existing customers, and partners understand the power of Google Cloud, develop creative cloud solutions and architectures to solve their business challenges, and problem-solve any potential technical roadblocks.", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 6 years of experience in a sales engineering or customer-facing role. Experience with cloud-native architectures including compute, network, storage, security, or modern application development practices.", "preferred_qualifications": "Experience with modern application and infrastructure development practices including DevOps, CI/CD, and infrastructure as code. Experience with containers and associated technologies including Docker, Kubernetes, serverless architectures, and microservices. Experience with data analytics, machine learning, and AI. Experience in various database and data warehouse technologies including RDBMS, NoSQL, and Big Data. Experience with cloud-native networking (VPCs), security practices, and Linux-based operating systems. Ability to understand Google Cloud Platform or other cloud computing platforms", "responsibilities": "Inspire customers and peers to solve difficult problems with novel solutions leveraging a set of technical competences. Work with the team to identify and qualify business opportunities, identify key customer technical objections, and develop a strategy to resolve technical blockers. Manage the technical relationship with customers, including managing product and solution briefings, proof-of-concept work, and the coordination of additional technical resources. Work with customers to demonstrate and prototype Google Cloud product integrations in customer/partner environments. Recommend migration strategies, enterprise architectures, migration tools and cloud infrastructure required to successfully implement a complete solution using best practices on Google Cloud and travel to customer sites, conferences, and other related events, as needed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/132167633343521478"}