{"title": "Cloud Technical Solutions Engineer, Infrastructure Compute (Mandarin, English)", "level": "Mid", "location": "Dublin, Ireland", "description": "In this role, you will be a part of a global team that provides 24x7 support to help customers seamlessly make the switch to Google Cloud. You will ensure we have the necessary tools and processes to resolve the issue. You will troubleshoot technical problems for customers with a mix of debugging, networking, system administration, updating documentation, and when needed, coding/scripting. You will identify the root problem and improve supportability by working with a team of engineers and product managers. You will make our products easier to adopt and use by making improvements to the product, tools, processes and documentation. You will help drive the success of Google Cloud by understanding and advocating for our customers’ issues.\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor’s degree in Science, Technology, Engineering, Mathematics, or equivalent practical experience.\n4 years of experience with two or more of the following: Web Tech, Data/Big Data, Systems Admin, Machine Learning, Networking, Kubernetes, Oracle, SAP.\nExperience in reading or debugging code (e.g., Java, C, C++, .NET, Python, Shell, Perl, or JavaScript).\nAbility to communicate in English and Mandarin (Chinese) fluently to interact with different regional customers and stakeholders.", "preferred_qualifications": "Experience with any of the following IaaS solutions: Kubernetes, system virtualization, on-premise or hybrid cloud computing, cloud identity and security system, cloud monitoring and logging, or local and cloud storage.\nExperience with any of the following cloud storage solutions: SQL database administration, Google App Engine, open source software communities, cloud networking solutions, or distributed computing technology.\nKnowledge of basic web technologies (HTTP, HTTPS, HTML, DNS, etc.).\nKnowledge of system/network administrators in level Linux/Unix or Windows systems.\nExcellent troubleshooting, attention to detail, and written and verbal communication skills.", "responsibilities": "Manage customer’s problem through effective diagnosis, resolution, or implementation of new investigation tools to increase productivity for customer issues on Google Cloud Platform products.\nDevelop an understanding of Google's product technology and underlying architectures by troubleshooting, reproducing, determining the root cause for customer reported issues, and building tools for faster diagnosis.\nAct as a consultant and subject matter expert for internal stakeholders in engineering, sales, and customer organizations to resolve technical deployment obstacles and improve Google Cloud.\nWork closely with multiple product and engineering teams to find ways to improve the product, and interact with our Site Reliability Engineering (SRE) teams to drive high-quality production. Understand customer issues and advocate for their needs with cross-functional teams.\nBe available for non-standard work hours or shifts which may include weekend.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/132238049869210310"}