{"title": "Home Strategy Lead", "level": "Mid", "location": "Mountain View, CA, USA; San Francisco, CA, USA", "description": "Product and Business Strategy Leaders bring together teams across Google’s functions to help products execute optimally. Our team pushes Google to scale at key points that refine our products and infrastructure by executing efficiently, bringing solid business sense and sound judgment, and working effectively across organizational lines. Our roles often include components of strategy (e.g. analyzing and understanding new trends in the industry, building business plans), operations (e.g. running the cadence of organizations, connecting the operating lines between our functions), and communications. Our team partners with senior leadership to run important functions that cross-cut our existing organizations and deliver high impact projects. We help Engineers, PMs, UX, and all of our other functions to build amazing products that delight our users, and then get those products into their hands. The Home Strategy and Operations team is part of the central Platforms and Devices Product Area Strategy and Operations team, and works with the Home Product and go-to-market organization. The team is responsible for the Home product and business strategy, market and competitive analyses, and any analytics driving Profit and Loss decisions.", "salary": "$117,000-$172,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience in management consulting, product management and strategy, or analytics in a technology company. Experience working with and analyzing data.", "preferred_qualifications": "MBA, Master's degree, or PhD in a Management, Technical, or Engineering field. 5 years of experience in consulting, software, or consumer electronics, within the Internet or media industries. Experience leading operational and strategic initiatives. Ability to present to executives and communicate with a technical management team. Excellent problem-solving and analysis skills.", "responsibilities": "Work with the Home product and business leadership to define product and business strategic direction, launch, and drive strategic initiatives. Structure and execute strategic initiatives by developing work plans, gathering and synthesizing data, leading analyses, and developing recommendations. Lead cross-functional global teams to provide direction on the execution of tasks. Develop insightful recommendations, and communicate findings to management and to the broader organization. Drive recommendations through to implementation and results, build consensus among cross-functional teams, and influence decision-making within leadership audiences.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/132271818848248518"}