{"title": "Technical Program Manager I, Software Engineering, Android Auto", "level": "Early", "location": "Kirkland, WA, USA", "description": "Google's projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You're equally at home explaining your team's analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.\n\nUsing your extensive technical and leadership expertise, you manage projects of various size and scope, identifying future opportunities, improving processes and driving the technical directions of your programs.\n\nAs a Technical Program Manager (TPM) in Google Play Apps, you will own and lead the delivery of our mission across a broad set of initiatives. You will work on complex, large-scale technical and software development issues driving value for both consumers and developers. You will positively impact our end-user’s experience by diving deep into the tech stack to understand quality and performance measurement tools and driving improvements.\n\nAutomotive industry executives say there will be more change in their business in the next 5 years than they have seen in the last 50 years.\n\nThe Android Auto team collaborate with vehicle manufacturers to develop and deliver on this massive opportunity, building on a proven embedded platform to create a leading Assistant-powered, navigation, entertainment, and communication vehicle system, which will be delivered to specialized people-moving devices.", "salary": "$102,000-$150,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in a relevant field, or equivalent practical experience. 1 year of experience in program management. Experience working with telemetry, statistical analysis or driving analytic projects.", "preferred_qualifications": "Experience with the Android software and framework, ecosystem, and software development. Experience in automotive infotainment software development and project management. Ability to be an influential member of a integrated team composed of both technical and non-technical members.", "responsibilities": "Coordinate and deliver program communications in close collaboration with program stakeholders, including metrics progress, meeting notes, meeting AIs, decision/escalation logs, newsletters, and websites. Collect data relating to program progress from program stakeholders. Maintain project trackers and status reports in close collaboration with program stakeholders. Author program charter that addresses scope and timeline of basic program, specify program objectives and key results, and explain resource requirements/dependencies, in close collaboration with program stakeholders. Author stakeholder map that specifies who is impacted by, and who influences, program outcome in close collaboration with program stakeholders. Triage technical bugs and feature requests alongside engineering stakeholders for purposes of prioritization, resourcing, and tracking execution.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/132459351615906502"}