{"title": "Software Engineering Manager, Google Cloud", "level": "Advanced", "location": "Tel Aviv, Israel", "description": "Like Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers. You not only optimize your own code but make sure Engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way. With technical and leadership expertise, you manage engineers across multiple teams and locations, a large product budget and oversee the deployment of large-scale projects across multiple sites internationally. Google Cloud is assisting the world's largest enterprises in their transition to the cloud. This journey encompasses all of their applications and infrastructure, which, in many cases, includes their mainframe footprint. Google Cloud offers a variety of modernization solutions in the mainframe domain, ranging from data analytics and lift-and-shift to full-blown application modernization using Generative AI (GenAI). Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience with software development in one or more programming languages (e.g., Go, Python, C, C++, Java). 3 years of experience in a technical leadership role; overseeing projects, with 2 years of experience in a people management, group/team leadership role.", "preferred_qualifications": "Master's degree or PhD in Computer Science or a related technical field. Experience designing and working with Enterprise Mainframe applications and technology which includes: Mainframe and iSeries architecture, COBOL, JCL, Cics, RPG, DB2, IMS, and other MF technologies. Experience with GenAI and Large Language Models (LLMs). Understanding of enterprise customers including extended actual experience working with them. Ability to present and explain complex ideas/solutions to different audiences. Excellent people management skills.", "responsibilities": "Set and communicate team priorities that support the broader organization's goals. Align strategy, processes, and decision-making across teams. Set clear expectations with individuals based on their level and role and aligned to the broader organization's goals. Meet regularly with individuals to discuss performance and development and provide feedback and coaching. Develop the mid-term technical direction and roadmap within the scope of the team. Evolve the roadmap to meet anticipated future requirements and infrastructure needs. Review code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency). Design, guide, and vet systems designs within the scope of the broader area, and write product or system development code to solve ambiguous problems.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/132610691231032006"}