{"title": "Tax Systems Analyst, Financial Systems and Transformation", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "The Finance Business Process Re-engineering (FinBPR) team is responsible for providing thought leadership, best practices, and expertise for business-led transformation initiatives supporting process improvement and automation. You will be on a team of architects who envision better processes, build them, reliably operate them, and then continually improve upon them. You will work with stakeholders at all levels to identify opportunities for process improvement and automation, develop and implement new processes and systems, and train employees on new processes and systems. You will also be responsible for monitoring and measuring the performance of new processes and systems, and partnering with functional leaders to develop multi-year architectural roadmaps.", "key_qualifications": "Bachelor's degree in Accounting, Finance, Business, or equivalent practical experience. 5 years of experience managing cross-functional transformation projects (e.g., operating model, process, business case and technology-enabled transformations) or related processes. Experience in blueprinting, design, and implementing finance systems, as well as tax systems (e.g., Vertex, Ryan, etc.)", "preferred_qualifications": "Experience in driving process decomposition, modeling and driving transformation roadmap. Experience implementing SAP source-to-pay and order to cash (O2C), as well as reporting solution and processes. Ability to shift between business-focused conversations with a financial leader to a technology-focused conversation with a technology team.", "responsibilities": "Develop relationships with Finance, Engineering, and other cross-functional partners to develop the transformation roadmap. Drive key design decisions among both business and functional stakeholders by partnering with business leaders, as well as functional and technology leaders. Identify areas of improvement, research best practices, and offer guidance and recommendations for process changes and potential solutions. Support transformation activities including current state and future state process maps and integration across finance functions. Translate, communicate, and work in partnership with Engineering organizations on how to deliver on requirements, in terms of process, data, and technology.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/132626229617402566"}