{"title": "Product Specialist, Product and Sales Activation (English, Japanese)", "level": "Mid", "location": "Tokyo, Japan", "description": "As a Product Specialist, you will help to scale measurement product adoption across the APAC region by directly working with Google Customer Solutions (GCS) sellers and customers.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience in business related areas like Marketing, Strategy, Sales, Consulting, or other related fields. Ability to communicate in English and Japanese fluently to interact in this customer-facing role.", "preferred_qualifications": "Experience pitching and activating measurement solutions across a business organization and how to activate sellers on products. Experience influencing executives, managers, and sellers internally and externally. Ability to set objectives and key results, and prioritize and allocate resources to highest impact initiatives and projects. Excellent thought leadership and structured problem solving skills, with the ability to work on complex operational and strategic initiatives. Excellent business acumen, with the ability to grow in a fast moving and ambiguous business environment. Excellent written and verbal communication skills.", "responsibilities": "Partner with GCS Sales teams, Google advertisers and agencies to increase adoption and usage of Google’s first-party data measurement solutions (e.g., Enhanced Conversions (EC), EC for Leads, Customer Match, Conversion Lift, etc.). Work with Sales teams based on a quarterly client list via co-pitches and pre-pitch support. Collate information regarding common objections, successful strategies, and product knowledge gaps, and facilitate internal and external product training. Develop a deep understanding of our GCS advertisers’ measurement opportunities and challenges in the privacy first world, in order to create activation strategies to drive current and future measurement products across APAC and help evolve the future strategy and Go-to-Market approach. Monitor and report on key drivers/metrics. Work with team leads to ensure effective narratives are developed. Leverage those resources to equip promoters with product knowledge and expertise.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/132761084007195334"}