{"title": "Social Escalation Communications Manager, YouTube", "level": "Mid", "location": "London, UK", "description": "As a Social Escalation Communications Manager, you will join a global team enabling 24x7 scaled communication and escalation coverage. You will publish timely communications across social media platforms, community forums, and YouTube channels. You will work across several teams including Public Relations (PR), Marketing, Trust and Safety, Legal, Product, and Engineering to resolve public support issues and escalation incidents. You'll manage sensitive priority incidents, which will involve real-time problem-solving, managing executive stakeholders, and driving decision making with minimal supervision. In addition to core escalation coverage responsibilities, you will also drive continuous improvement of social communications, engagement strategies, and internal escalation protocols, such as improving the reactive communication experience for an assigned product area, or developing preventative solutions to mitigate future escalations and high-profile events.  In this role, you will monitor and respond to critical escalations from social media platforms, working closely with Legal, PR, Trust and Safety, Product, and Engineering teams to craft external communications and resolve issues promptly. You'll triage incidents efficiently and publish proactive communications across social media platforms, community forums, and YouTube channels, adhering to service level agreements and ensuring timely.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n4 years of experience in journalism, public relations, internal or executive communications, or a related field.\nExperience managing external communications, including public platforms and social media.\nExperience in crisis response or escalation management.\nExperience with internal communications up to executive level.\n", "preferred_qualifications": "Knowledge of YouTube product and policy, YouTube creators and their communities, Internet culture, and an avid user of social media.\nUnderstanding of editorial and creative content development, storytelling techniques, and external communications trends and best practices.\nAbility to influence momentum of incident response across multiple teams.\nAbility to analyze data, identify trends, and present key findings to improve future programs and strategies.\nAbility to act as a working incident manager in on-call rotations, over weekends, and adapt to rapidly changing priorities in the YouTube ecosystem.\nExcellent written and verbal communication skills.\n", "responsibilities": "Manage a wide range of escalations including platform outages, technical issues, creator support requests, high-profile social media complaints, and executive concerns.\nEnable our social and community vendor operation by providing urgent guidance to agent teams, developing new processes to address emerging online conversation trends, and managing consults from agents.\nBe a subject matter expert on trending YouTube topics and related social media conversations, contributing valuable insights to weekly internal reports.\nCollaborate with cross-functional teams to align on communication strategies and stay ahead of escalation trends. Drive improvement by identifying opportunities for enhancing the user experience, external communications, and internal escalation protocols.\nParticipate in an on-call rotation, acting as an Incident Manager during weekends and select holidays. Ensure proper staffing and coverage planning throughout the year.\n", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/132995727197381318"}