{"title": "Technical Program Manager II, Generative AI Detection, YouTube", "level": "Mid", "location": "Mountain View, CA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nThe Generative AI Detection team's mission is to develop tools that detect altered/synthetic content and enable YouTube to evaluate potentially deceptive content about sensitive topics. The goal is to protect YouTube from manipulations created by Generative AI and build classifiers for detecting sensitive content.\n\nAt YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.", "salary": "$122,000-$178,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in a technical field, or equivalent practical experience. 2 years of experience in program management. 2 years of experience in machine learning and infrastructure development.", "preferred_qualifications": "2 years of experience managing cross-functional or cross-team projects. Experience in applied machine learning, infrastructure, and language related issues. Experience with generative AI capabilities and knowledge of Large Language Models. Experience with Data Analysis and Data mining.", "responsibilities": "Collaborate with team members and stakeholders to understand or identify defined work problems and program goals, obtain prioritized deliverables, and discuss program impact. Prioritize program goals, understand and translate other stakeholders’ needs into program goals, and contribute to decisions on prioritizing goals and deliverables. Define the scope of projects and develop, execute, or manage project plans for supported programs. Review key metrics pertaining to a program, monitor potential metric deviations, and define corrective actions for critical deviations. Identify, communicate, and collaborate with stakeholders within one or more teams to drive impact and work toward mutual goals.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/132957312808559302"}