{"title": "Developer Relations Engineer, Android DevRel, Health and Connectivity", "level": "Mid", "location": "London, UK", "description": "Passionate people are everywhere at Google. In Developer Relations, we are excited to collaborate and connect with the communities that love technology as much as we do. Part community manager and part developer advocate, Developer Programs Engineers collaborate with developers at conferences and online, and advocate for developers interests internally at Google. Not afraid to be hands-on, you write sample code and client libraries as well as participate in developer forums and support queues to troubleshoot and debug coding problems developers encounter. Internally, you work with product engineering teams to improve our products by conveying feedback from developers, reviewing API designs, and testing new features. Chrome, Android, App Engine, HTML5, and our core Google Workspace and Ads APIs are just some of the platforms you promote and support. The Platforms and Ecosystems product area encompasses Google's various computing software platforms across environments (desktop, mobile, applications). The products provide enterprises, and ultimately end users, the ability to utilize and manage their services at scale. We build innovative and compelling software products—from apps to TVs, from laptops to phones—that have an impact on people’s lives across the world.", "key_qualifications": "Bachelor's degree in Computer Science, a similar technical field, or equivalent practical experience. 3 years of work experience in a technical role (e.g., software engineering, solutions consultant, etc.) or equivalent technical experience.", "preferred_qualifications": "3 years of experience as a technical practitioner in a developer community. Experience working with engineers outside your organization. Experience building for Android. Experience working with developers/developer communities.", "responsibilities": "Provide engineering direction and assistance to design, build, launch, and improve developer products. Be a subject matter expert in the relevant Android Health, Connectivity and Android developer products and APIs, and identify opportunities for Google and developers to create better products for users. Propose product changes, review engineering design docs and influence engineering plans. Collaborate with Android Health and connectivity product and engineering teams to deliver the most relevant developer narrative to Android Developers. Advocate the Android developer internally at Google.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/132975657888948934"}