{"title": "Technical Program Manager, Leadership Support Services", "level": "Mid", "location": "Sunnyvale, CA, USA", "description": "Security is at the core of Google's design and development process: it is built into the DNA of our products. The same is true of our offices. You're an expert who shares our seriousness about security and our commitment to confidentiality. ...", "key_qualifications": "Bachelor's degree in Engineering, Technology or equivalent practical experience. 3 years of experience developing technical strategy and managing security in areas including Physical Access Control, Intrusion Detection, Video Management, PSIM, IT Networking, or Construction/Architecture.", "preferred_qualifications": "Certification in PSP, CPP, CompTIA Security+, CompTIA Network+ or Cisco CCNA. 2 years of experience deploying, designing, or supporting common IP networking infrastructure. Experience in technology strategy development, design and execution within physical/cybersecurity industries. Ability to lead projects by navigating priorities, measurable objectives, dependencies, planning, resourcing, scheduling, budgeting, implementation and subsequent monitoring, through informal authority. Excellent planning skills including attention to detail, information organization, timeline tracking, and communication across teams and organizational levels.", "responsibilities": "Work with a team of employees and contractors through collaborative stakeholder solution delivery, communicating effectively to all levels of leadership with various technological backgrounds and comprehension. Perform mission critical technical support and solution delivery by supporting the key customers on-site and remotely, with occasional non-standard working hours and travel as needed. Work with internal clients, cross-functional partners, and engineering teams to deliver technology against physical security strategies with a focus on scalable growth, automation, risk management, and business process improvement. Identify and track changing business conditions in Google and relevant industries to evolve security strategies and related products for stakeholders.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/133035416990163654"}