{"title": "Senior Data Center Facilities Technician, Electrical", "level": "Mid", "location": "Saint-Ghislain, Belgium", "description": "The Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facilities Technicians at Google data centers operate, monitor and support physical facilities conditions. Some of these duties will include heating and cooling of air and water, power supply, generators, UPS systems, electrical distribution and control and monitoring systems...", "key_qualifications": "Bachelor's degree or equivalent practical experience. Trade school qualification or certification in a related field. 4 years of experience in a HVAC, electrical, controls, water chemistry, generators, mechanical, or other similar technical domain. Experience troubleshooting for electrical distribution systems and in high voltage switching operations.", "preferred_qualifications": "Experience planning and executing installation, commissioning, and equipment startup following industry best practices and protocols. Experience working in the control room for critical operations. Knowledge of electrical distribution systems (e.g., high voltage, low voltage, protection and controls, power quality). Understanding of electrical and mechanical systems in data center environments and controls/monitoring systems. Excellent written and verbal communication and people skills, with the ability to prioritize work efficiently.", "responsibilities": "Monitor multiple information streams in the control room and make accurate mission-critical decisions. Be responsible for the uptime, maintenance, and troubleshooting of electrical distribution systems and power monitoring. Operate, monitor, maintain, and respond to abnormal conditions in the data center facilities systems and equipment. Follow the site’s environmental health and safety policies. Direct the execution of complex controls system programming, start-up, commissioning, documentation, and full facilities turnover on assigned projects.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/133116759711326918"}