{"title": "Data Center Security Manager", "level": "Early", "location": "Austin, TX, USA", "description": "Security is at the core of Google's design and development process: it is built into the DNA of our products. The same is true of our offices. You're an expert who shares our seriousness about security and our commitment to confidentiality. You'll collaborate with our Facilities Management team to create innovative security strategies, investigate breaches and create risk assessment plans for the future. You believe that providing effective security doesn't come at the expense of customer service - you will be our bodyguard (and our long lost pal). Google’s Data Center Compliance, Safety, and Risk Management (CSRM) team is a dedicated organization chartered with protecting the people and assets of Google’s global critical infrastructure. CSRM consists of industry leading professionals who leverage advanced security systems, dedicated guarding forces, and risk management and compliance framework programs to support the entirety of Google Data Centers. As a Data Center Security Manager, you will deliver full pieces of a project and make significant contributions with minimal guidance. You will use your knowledge of security technology, data analysis, and data visualization to plan efforts of a team responsible for small to medium sized initiatives by delivering value-added perspectives and influencing project direction. You will contribute to cross-team collaborations, identify and recommend multiple creative ways to solve defined problems. You will also demonstrate the behaviors expected of all Googlers as captured in Google's cultural pillars, and you will engage in community contributions to improve and sustain our culture and operations. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$79,000-$117,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 3 years of experience managing, sourcing, or procuring business resources and vendors. 3 years of experience coordinating or managing resources for data center locations, and leading operational or project based work and tasks.", "preferred_qualifications": "Critical Infrastructure Protection Certification. Experience in managing a workforce. Knowledge of physical security, investigations, compliance, or risk management. Knowledge of current security technology including access control and CCTV.", "responsibilities": "Be responsible for the compliance, security and risk management program at the Data Center campus or related infrastructure which includes managing site security incidents, escalations, guard contract management, and all other physical security related issues. Provide after-hours on-call management support and act as primary point of contact in emergent, large scale event response, or crisis management when needed. Execute investigations related to Code of Conduct and other business violations including worker injuries and security incident investigations. Perform straightforward Threat, Vulnerability and Risk Assessments (TVRA). Implement established compliance processes aligned with CSRM policies, standards, guidelines, and relevant legal or regulatory requirements. Manage the security-related costs through budget, forecasting and invoice control for the assigned campus, and assist management with financial analysis and input to financial decisions for security requirements.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/133166256726385350"}