{"title": "Technical Infrastructure Accountant, International Controllership (English)", "level": "Early", "location": "Taipei, Taiwan", "description": "Google accountants are a savvy bunch who handle the core accounting responsibilities at Google. You know your accounting principles and the full accounting process end to end. You'll advise on financial reports required by governmental regulations, and review, analyze, and interpret financial and budgetary reports. Every day is a new challenge, and you're continually looking for ways to help our team become more efficient and effective. A team player at heart, you collaborate with our global team, advocate best practices and pitch in where needed. You move fast while keeping your attention to detail, and you tap into your problem-solving skills to support business objectives. In this role, you will have the opportunity to work with a global team, advocating for best practices and contributing your expertise whenever needed. You will work closely with internal and external partners to navigate the ever changing global landscape and ensure regulatory compliance. The name Google came from \"googol,\" a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.", "salary": "", "key_qualifications": "Bachelor's degree in Accounting, Finance, a related field, or equivalent practical experience. 2 years of experience working in an accounting firm or multinational companies. Experience with tax or audit filing within the Asia Pacific region. Ability to communicate in English fluently to support the APAC region.", "preferred_qualifications": "Professional qualification in CPA (Certified public Accountant), or equivalent qualification. Experience in SQL, including spreadsheets and scripting. Experience using SAP S4 HANA and an understanding of accounting principles, including US GAAP and International Financial Reporting Standards (IFRS). Ability to evaluate large, complex datasets and synthesize these to identify gaps and summarize core issues to assist in decision making. Ability to work in a cross-functional, fast-paced environment, and interact with people at all levels of a company.", "responsibilities": "Ensure compliance with local accounting standards, statutory reporting requirements for several APAC subsidiaries, identifying any gaps and resolving between global processes and local compliance requirements. Perform regular analysis on financials, ensuring the integrity and financial accuracy of our books and records. Prepare for and support local statutory audits, financial statement preparation, tax filings and other local filings, with support from internal stakeholders and external advisors. Identify and investigate issues, propose solutions and own resolution of issues, keeping manager/management informed in a timely manner. Coordinate with internal and external business partners, including sourcing with service provider to improve processes, as well as work collaboratively on accounting and compliance issues with regional and global teams.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/133113857387176646"}