{"title": "Program Manager, Logistics Operations Specialist", "level": "Mid", "location": "Saint-Ghislain, Belgium", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.As a Program Manager for Server Operations Logistics, you will lead and manage all logistics operations required within the Google data center campuses including receiving, shipping, quality control, rack movements, rack placement, tray assembly, cabling, spare parts management, decommissions, and returns at our data center facilities.Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "salary": "", "key_qualifications": "Bachelor's degree in Business, Operations, Engineering, a related field, or equivalent practical experience. Experience managing warehousing, manufacturing, or supply chain operations. Experience managing operations in multiple locations. Experience managing third-party vendors,with programs, change management, and budget. Ability to travel up to 30% of the time as required.", "preferred_qualifications": "Master's degree in Business. Certification in Project Management or CSCMP. Experience in quality control, inventory accuracy, safety, and security. Ability to apply structured thinking and logic to work and provide innovative solutions to issues.", "responsibilities": "Manage third-party logistic partners and work on various projects including account management, spend controls, Quarterly Business Reviews (QBRs), metrics management, escalation management, and facilitation. Manage and monitor Key Performance Indicators (KPIs), vendor performance scorecards, and develop business cases to support logistics changes and/or improvements. Create and manage significant services spend budgets. Drive alignment and prioritization of initiatives in a fast-paced and large-scale environment with many priorities. Create, manage, and support cross-functional company initiatives.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/133148728964850374"}