{"title": "Head of Corporate Services Category Management", "level": "Advanced", "location": "Chicago, IL, USA; Atlanta, GA, USA; Austin, TX, USA", "description": "In the Google Procurement Organization (GPO), our aim is to unlock value for Google to reinvest in what matters most. We do this by bringing velocity, efficiency, and security to buying at Google, while partnering deeply across Google to deliver solutions fit for purpose. As a centralized organization operating in a high complexity environment, we bring 'one voice' to stakeholders and suppliers to ensure the best outcomes. Our organization fosters a culture of collaboration and innovation while providing opportunities for ongoing career growth and development. Within the Google Procurement Organization, the Category Management team partners closely with key stakeholders to help shape and implement procurement strategies. The Category Team is responsible for developing and driving holistic category strategies, managing stakeholder relationships, and bringing excellence to Google-wide sourcing, supplier, and contract management. You will be responsible for pioneering innovative category and sourcing strategies, cultivating strategic supplier relationships, and optimizing spend categories through data-driven insights to unlock value for Google.", "salary": "$202,000-$287,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Business Administration, Supply Chain Management, Operations Management, Finance, related field, or equivalent practical experience. 14 years of experience in multi-disciplined procurement, leading strategy development, execution and sourcing, or a related function, or 12 years of experience with an advanced degree. 8 years of experience managing category strategy and sourcing teams within corporate services teams (i.e., Finance, IT, HR, Consulting firms, Corporate Services, Legal, etc.) or related areas. Experience managing people/teams.", "preferred_qualifications": "Master's degree or MBA. Experience working in the Technology Industry. Experience leading teams through multi-year organizational transformation. Experience leading complex initiatives from strategy to execution and delivering results, while managing multiple tasks. Managerial experience leading and facilitating cross-functional or global teams, managing and influencing teams of executive professionals and managers, and establishing performance expectations. Excellent analytical, problem-solving, and communication skills.", "responsibilities": "Lead and own multi-year global category plans and strategies, including defining buying channels, supply base profiles, purchasing policies, SRM program, etc. Drive maximum value for the Corporate Services category through a deep understanding of cost drivers and oversee close alignment of category plans and strategies to business priorities and functional objectives. Establish and foster partnership with key budget owners, product area/functional stakeholders, and strategic suppliers, acting as a business partner and liaison to drive innovation and category transformation. Lead and develop multiple cross-functional teams in the execution of major category initiatives to ensure delivery across end-to-end procurement process, lead and own the development and compliance tracking of category specific policies and performance metrics, and lead the translation of rapidly evolving category market trends and leading practices into opportunities for Google.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/133371716150665926"}