{"title": "Technical Sourcing Manager, Analog and Physical Layer IP", "level": "Advanced", "location": "Bengaluru, Karnataka, India", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration. Google's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "key_qualifications": "Bachelor's degree in Computer Science or a related technical field, or equivalent practical experience. 8 years of experience in analog mixed-signal and physical layer IP. Experience in working or managing IP vendors such as Synopsys, Cadence, Silicon Creations, Analog bits, etc. Experience in architecting or designing physical layer Interface IP and analog mixed-signal IP.", "preferred_qualifications": "Experience in cross-functional collaboration with domain experts from architecture, design, and power. Knowledge of PCIe, USB, UFS, CSI DSI, LPDDR protocols. Knowledge of PLL, SerDes, clock receivers, GPIO, sensors. Excellent project management, verbal and written communication, and status reporting skills.", "responsibilities": "Map the IP ecosystem, plan and anticipate future Analog Mixed Signal (AMS) IP product requirements. Work with Architecture, Product Management, Design, and SoC IP integration and IP Quality Assurance (QA) leads. Work closely with IP vendors to identify new features, negotiate schedules, influence vendor IP portfolios to maximize Google product differentiation. Drive Statement of Work (SOW) and Engineering Change Order (ECO), change and version controls, develop IP QA checklists and guidelines. Ensure that the IPs are meeting our Design for Excellence (DFX), Domain Validation (DV), software, testing, and characterization requirements by defining and specifying deliverable requirements for analog IP.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/133572721693860550"}