{"title": "Technical Program Manager, Payment Platforms", "level": "Mid", "location": "Hyderabad, Telangana, India", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nWhether it is paying online with Autofill, using tap and pay in stores, or using the Google Pay app, the Payments team at Google is focused on making payments simple, seamless, and secure. In addition to consumer payment technologies, the Payments team also powers the money movement between Google and its consumers and businesses.", "key_qualifications": "Bachelor's degree in Engineering, or equivalent practical experience. 2 years of experience in program management. Experience in project planning, stakeholder management, communication, risk management, project execution.", "preferred_qualifications": "2 years of experience managing cross-functional or cross-team projects. Experience managing software development projects. Experience in commerce, payments, or platform products. Ability to take ownership and collaborate well with others. Excellent problem-solving, written/verbal communication, investigative, and organizational skills.", "responsibilities": "Build and manage cross-functional/technical projects and drive them to launch. Work with Engineers, Program Managers, cross-functional partners to define requirements, scope, schedule, resourcing, and milestones/tasks. Manage relationships with key internal and external stakeholders (e.g., third-party vendors, regulators etc.). Support team discussions, drive issues to resolution, help identify and implement risk mitigation, communicate project status to various audiences, and cross-functional and executive audiences. Provide technical knowledge and thought leadership to manage projects efficiently.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/133678825438356166"}