{"title": "Senior Engineer Manager, Pixel Software Test", "level": "Advanced", "location": "Shanghai, China", "description": "Pixel Software Test Engineer plays a key role in ensuring the overall quality and user experience of Google Pixel and related devices. The team collaborates with cross-functional teams across multiple sites, including Taiwan, the US, Shanghai, and London. Their scope encompasses infrastructure and tooling development, integration, field and carrier testing, pre-certification testing, quality analysis, and more. In this role, you will design and develop full-stack tools and infrastructure from scratch, while also leveraging existing solutions when appropriate. The Google Pixel team focuses on designing and delivering the world's most helpful mobile experience. The team works on shaping the future of Pixel devices and services through some of the most advanced designs, techniques, products, and experiences in consumer electronics. This includes bringing together the best of Google’s software and hardware to build global smartphones and create transformative experiences for users across the world.", "salary": "", "key_qualifications": "Bachelor’s degree, or equivalent practical experience.8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).5 years of experience in a technical leadership role; overseeing projects, with 5 years of experience in a people management, supervision/team leadership role.Experience engaging with, and presenting to, technical stakeholders and executive leadersExperience in designing and leading Test automation solutions, monitor systems, or testing effectiveness", "preferred_qualifications": "Experience in leading, influencing and engaging with cross-functional teams to shape design and project direction.Experience in building test automation to scale and improving efficiency.Experience in managing projects and teams.Experience in Android system components, interfaces, and protocols on mobile devices.Knowledge of Mobile development.", "responsibilities": "Contribute to, or lead software test engineering efforts from planning, execution and delivery that solves our business objectives.Empower team's ability to identify defects and make actionable, develop or adapt the infra/tools for productivity.Lead or develop scalable and reliable automation systems. Guide, analyze and decompose complex systems to surface root causes, identify patterns that lead to general solutions for broader applications.Lead effective collaborations with teams across Google, working with diverse cultures, job functions, and backgrounds.Define goal and guide teams to align with the organization directions, lead through examples, mentor and grow the team.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/133649185332175558"}