{"title": "Accountant, Platforms and Ecosystems", "level": "Mid", "location": "Hyderabad, Telangana, India", "description": "Google accountants are a savvy bunch who handle the core accounting responsibilities at Google. You know your accounting principles and the full accounting process end to end. You'll advise on financial reports required by governmental regulations, and review, analyze, and interpret financial and budgetary reports. Every day is a new challenge, and you're continually looking for ways to help our team become more efficient and effective. A team player at heart, you collaborate with our global team, advocate best practices and pitch in where needed. You move fast while keeping your attention to detail, and you tap into your problem-solving skills to support business objectives. You'll lead an accounting process from end-to-end. Other responsibilities include reconciling balance sheets and P&L accounts, and providing supplementary financial information for internal and external reports. The Platforms and Ecosystems product area encompasses Google's various computing software platforms across environments (desktop, mobile, applications). The products provide enterprises, and ultimately end users, the ability to utilize and manage their services at scale. We build innovative and compelling software products—from apps to TVs, from laptops to phones—that have an impact on people’s lives across the world.", "key_qualifications": "Bachelor's degree in Accounting or Finance, or equivalent practical experience. Certified Public Accountant (CPA) or Chartered Accountant (CA). 4 years of experience in accounting or relevant public accounting or a tech environment.", "preferred_qualifications": "Experience with Enterprise Resource Planning (ERP) SAP or data analysis tools and techniques. Experience with SOX compliance. Knowledge of United States GAAP (Generally Accepted Accounting Principles). Ability to have a collaborative style and work with cross-functional and international teams. Ability to have strong attention to detail, organizational skills and focus on continuous improvement. Excellent problem solving skills, with the ability to communicate effectively with executive management.", "responsibilities": "Design, implement, and manage global processes for the accounting of product area through the performance of business, cost of sale and opex (operational expenditure) accounting analyses during monthly close. Perform ad-hoc accounting projects as needed to support the accounting of the business and cost of sales in accordance with United States GAAP. Prepare and present financials for our product area related to month-end close as well any ad hoc requests from Financial Planning and Analysis (FP&A) and the Business and Product teams. Partner with internal teams to support product area global expansion and operations. Be responsible for ensuring financial reporting accuracy for the product area. Own month-end close process and SOX compliance, including implementation of a strong control environment.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/133741401501246150"}