{"title": "Principal Engineer, Trust and Safety, AI Data", "level": "Director+", "location": "Sunnyvale, CA, USA", "description": "We are looking for a Principal Engineer to join our AI Data Trust and Safety organization...", "key_qualifications": "Bachelor's degree in Computer Science, Software Engineering, similar technical field, or equivalent practical experience, 15 years of professional experience in software development, Experience with large-scale ML Infrastructure, ML or AI for products, or related fields, Experience growing and scaling teams", "preferred_qualifications": "Experience building ML infrastructure or products with heavy use of AI/ML and large groups of stakeholders or users, Experience with Responsible AI, Understanding of ML Systems and Infrastructure for production with technical knowledge to be credible with customers and engineers, Experience with working with stakeholders to understand their needs and translate them into technical requirements, Experience in working across highly horizontal areas requiring a high-degree of cross-organizational collaboration and coordination, Experience with working with stakeholders to understand their needs and translate them into technical requirements", "responsibilities": "Lead the technical design across the team as needed to build comprehensive, automated, and robust ML lineage and governance infrastructure and tooling, as well as safety, fairness, & privacy infrastructure and tooling. Work with partners from Google DeepMind and product areas (Ads, Search, YouTube, Cloud, etc) to drive lineage coverage in a seamless manner without compromising developer velocity. Influence partners and stakeholders within and across the organizations to build joint roadmaps and drive outcomes for AI governance, and translating evolving safety research to production use cases.  Lead, design, and develop the ML lineage and governance strategy and safety, fairness, and privacy strategy in alignment with the AI Data strategy. Mentor and train other team members on system design and best practices relevant to the Generative AI space", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/133753914083156678"}