{"title": "Senior Strategist, Modern Creators and Formats", "level": "Mid", "location": "Bengaluru, Karnataka, India; Hyderabad, Telangana, India", "description": "Trust & Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you're a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety. The Modern Creators and Formats (MCF) mission is to empower users to connect and contribute directly to Search. If Search is going to continue to meet the diverse needs of our users, we need to ensure that the web continues to grow with the right content. Trust and Safety (T&S) is a team of user trust experts who think big and aim high to earn every user’s trust. We cultivate thought leadership, domain expertise, innovation and a cross-product perspective to help Google stay ahead of abuse and deliver trusted and safe experiences to all users.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience working with investigative tools or data analysis. 4 years of experience in data analytics, Trust and Safety, policy, cybersecurity, or related fields. Experience with SQL, data analytics, and colaboratory.", "preferred_qualifications": "Experience in product policy analysis and identifying policy risks. Experience in working with abuse, spam, fraud or malware. Experience using statistical analysis and hypothesis testing. Experience with AI, LLMs, Trust and Safety, or Cybersecurity. Excellent influencing skills, with the ability to work in a dynamic environment.", "responsibilities": "Lead and manage multi- quarter, high-visibility trust projects (e.g., build critical trust protections to fight abuse in user generated content space, scale user base to key markets while meeting goal trust metrics). Analyze and debug escalations and identify trends that can indicate bigger product risks. Use technical acumen to drive project delivery, challenge proposals and identify risks. Manage multiple projects of moderate to high complexity and scope against crashed timelines. Collaborate with other teams and functions (e.g., Engineer, Program Manager, Legal, Policy). Drive usage and adoption of AI efforts for effective abuse fighting by identifying opportunities to reduce Operational Expenditure (OPEX), catch abuse faster or improve quality of decision making. Perform on-call responsibilities on a rotating basis, including weekend coverage as needed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/133881780359832262"}