{"title": "Optics Designer, Augmented Reality", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration. Our team works with an ecosystem of partners to ensure that their products can support immersive AR and VR experiences.", "key_qualifications": "Master's degree in Electrical Engineering, Computer Engineering, Physics, a related field, or equivalent practical experience. 6 years of experience working in a hardware engineering technical environment, or 5 years of experience with an advanced degree. 5 years of experience with display optics. 5 years of experience related to optical design, metrology, and integration. Experience with power integrity frequency domain and time domain modeling, simulation, optimization and correlation.", "preferred_qualifications": "PhD in Electrical Engineering, Computer Engineering, Physics, or a related field. Experience with all phases of the design process (e.g., trend research, design strategy, concept development, and manufacturing execution). Experience in visual display systems design. Experience with Zemax optical design system. Experience in polarization optics, stray light analysis and mitigation, and display system calibration.", "responsibilities": "Own end-to-end optical display systems specifications of head mounted displays. Design, optimize, and tolerate analysis of optical display systems. Work with key stakeholders to iterate design, review manufacturing process, follow through as-built performance and metrology. Work with the multi-functional team, establishing clear goals and priorities throughout the product development process. Communicate the results and tradeoffs across the cross-functional groups. Lead efforts for the documentation of the hardware design, its implementation, or test/validation results throughout the product life cycle. Travel to support build at component, module, and system factories.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/133847861929353926"}