{"title": "Business Development Manager, New Business Sales, Gaming", "level": "", "location": "Shenzhen, Guangdong Province, China", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. Google Ads is helping power the open internet with the best technology that connects and creates value for people, publishers, advertisers, and Google. We’re made up of multiple teams, building Google’s Advertising products including search, display, shopping, travel and video advertising, as well as analytics. Our teams create trusted experiences between people and businesses with useful ads. We help grow businesses of all sizes from small businesses, to large brands, to YouTube creators, with effective advertiser tools that deliver measurable results. We also enable Google to engage with customers at scale.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience working in sales or business development. Ability to communicate in Chinese and English fluently to support client relationship management in this region.", "preferred_qualifications": "Experience recruiting and managing mobile gaming app developers at a tech company or helping mobile apps achieve ecosystem success. Experience meeting and exceeding sales goals. Ability to collaborate with cross-functional teams to develop a working strategy. Ability to build personal networking in the ecosystem to drive collaborations. Ability to operate and succeed in a fast-paced, fast-changing environment.", "responsibilities": "Prospect, manage, and forecast new business pipeline and opportunities. Engage with customers to identify needs and challenges, and design compelling Google solutions to resolve their problems and satisfy their needs. Work with the onboarding team and other support teams to deliver an outstanding customer experience. Collaborate with cross-functional teams and external partners to identify new market trends and take appropriate actions to acquire those opportunities.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/133926633441501894"}