{"title": "Data Center Technician II", "level": "Early", "location": "Milan, Metropolitan City of Milan, Italy", "description": "Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. Experience diagnosing and troubleshooting one of the following: operating systems and computer/server hardware or networking protocols and experience performing component-level repairs on IT equipment. Ability to travel up to 20% of the time internationally. Ability to lift/move 50lb (23kg) of equipment and ability to exert yourself physically over extended periods of time, including frequent bending, kneeling, climbing, pushing/pulling and lifting.", "preferred_qualifications": "Completion of the online Google IT Support Professional Certificate program. Experience working within a data center or network operation center environment. Ability to collaborate and partner with teams to overcome challenges. Ability to adapt to changes in a dynamic work environment.", "responsibilities": "Deploy and operate new data center infrastructure across projects or functions. Report issues and follow data center procedures to troubleshoot and diagnose straightforward issues with equipment or infrastructure as they arise, and applying the resources needed to resolve identified issues. Maintain the security and integrity of data, track various forms of media to check for standard data security issues (e.g., data was not properly erased) handled in accordance with Google security standards. Disassemble specific equipment that has reached its end-of-life via part replacement or maintenance, in a team setting. Repair, fix, and perform preventative maintenance on equipment, servers, machines, or infrastructure based on identified issues with defined solutions and limited guidance.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/133968399112774342"}