{"title": "Treasury Cash Management Analyst", "level": "", "location": "Bengaluru, Karnataka, India", "description": "Google's Treasury team is on a mission to optimize the return on Google's financial assets. As a member of this team, you're always looking for innovative ways to help Google invest for the future while limiting volatility and material surprises. In addition to risk busting and asset management, you work collaboratively to administer business insurance programs and stock programs, and provide financial analysis support to our internal teams. You make creative yet calculated decisions that are backed by both experience and your extensive knowledge of the economy and financial industry.", "key_qualifications": "Bachelor's degree in Accounting or Finance, or equivalent practical experience. 2 years of experience in finance or treasury.", "preferred_qualifications": "MBA or financial modeling experience. Understanding of treasury systems and how they support business processes. Ability to discuss in cross-functional groups to identify issues/resolutions, using business acumen. Excellent written and verbal communication skills.", "responsibilities": "Provide daily operational support for global cash management activities, including cash forecasting and positioning activities and supporting international investment of working capital. Support monthly inter-company settlement processes including configuration setup and testing. Provide query triage and follow up action in response to stakeholder requests. Support operational excellence enhancements to improve cash management processes. Identify tactical improvements for aligning Treasury with Finance/Business processes. Support enhancements to our reporting framework designed to assess and evaluate operational excellence and make recommendations to improve processes. Partner with external and internal stakeholders including banking partners and other Finance teams.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/133970646051758790"}