{"title": "Principal Engineer, AI Data Sourcing, Generation and Value", "level": "Director+", "location": "Mountain View, CA, USA; Sunnyvale, CA, USA", "description": "AI is evolving rapidly; the caliber and diversity of training and evaluation data and the ability to respond quickly to emerging trends to enable product impact are differentiating factors against the competition. Google's unique advantage and differentiating edge lie in its vast repository of data to which it has access. The transformative potential of generative AI is contingent upon the availability and quality of data used for training, tuning, evaluating, and Google's ability to iterate quickly for market responsiveness and innovation speed. In this role, you will be responsible for strategic and technical leadership for the critical area of acquiring high-quality data for training GenAI models. You'll focus on design and development of systems for catering to different stages of GenAI data - pre-training, SFT/RLHF, production data flywheel – optimizing for high-quality data that results in differentiated model capabilities. You will work closely with GDM, Research, and other infrastructure teams, in addition to cross-functional collaboration with different product teams. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems. The US base salary range for this full-time position is $278,000-$399,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "key_qualifications": "Bachelor's degree in Computer Science, Mathematics, other relevant Engineering field, or equivalent practical experience. 15 years of experience as a Software Engineering leader in ML Infrastructure, ML or AI for products, or related fields. Experience with large-scale machine learning systems.", "preferred_qualifications": "Experience working with stakeholders to understand their needs and translate them into technical requirements. Experience with developing/innovating technology at scale, and passion for development and use of cross-platform shared code. Understanding of GenAI model development from pre-training to product fine-tuning, use-case specific definition of high-quality data, and pragmatically balancing trade-offs for research, privacy, and product usage. Understanding of ML systems and infrastructure for production, with technical knowledge to be credible with customers and engineers. Ability to balance detailed, technical guidance with big picture strategy, enabling teams to deliver effective products and creating ways to manage data.", "responsibilities": "Lead technical design for sourcing and generating data across different phases of model development creating a data flywheel from foundational model to products. Work with partners from Google DeepMind and Google Research (e.g. for latest techniques for synthetic data creation), product areas (e.g., Ads, Search, YouTube, Cloud, etc.), and other infrastructure teams (e.g., GDM data teams, Core Data, Core PSS) to develop joint roadmaps and drive outcomes. Work with various cross-functional teams including Data Science, Data Operations, and Product Managers/Customer Leads in defining quality/value attributes for data assets in a scalable way. Mentor and train other Technical Leads on the team working in this space. Keep the team current with state-of-the-art knowledge across the company and industry to help prioritize technical innovation accordingly.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134120722543846086"}