{"title": "People Partner, YouTube Shopping", "level": "Advanced", "location": "San Bruno, CA, USA", "description": "In this role, you will partner closely with Engineering, Vice Presidents (VPs) in Living Room/Infra and Data Science, as well as with the VP, General Manager (GM) for YouTube Shopping...", "key_qualifications": "Bachelor's degree or equivalent practical experience. 12 years of experience as a HR business partner or generalist supporting leaders at global companies. Experience with managing organization transformations across multiple regions and talent pools. Experience in areas such as Organizational design, succession planning, performance management, diversity and inclusion, business consulting, compensation and rewards, recognition programs, culture keeper, employee engagement, coaching and development, talent management, conflict resolution, talent acquisition, data analysis, and employee relations.", "preferred_qualifications": "MBA or Master's degree. Ability to analyze data, understand trends, and develop recommendations for action based on the analysis. Ability to be comfortable with ambiguity and being a part of strategy discussions. Ability to work within constraints as well as to test the status quo. Excellent problem-solving skills.", "responsibilities": "Offer thought leadership regarding organizational and people-related strategy and execution. Provide insightful data to guide decision making and provide proactive solutions. Partner with leaders on the define, design, launch, landing of change initiatives. Consult with Google's leaders to create a comprehensive people plan to influence lasting change over large functions at Google. Solve problems and get to the root cause of any issue, no matter how complex, and design and quickly implement solutions that cut across multiple disciplines, even those beyond people and organizational solutions. Provide expertise in areas such as talent and performance management, change management, leadership coaching, data analysis and insights, employee relations and strategic development.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134246902508987078"}