{"title": "Product Manager, P2020 Rollouts", "level": "Mid", "location": "London, UK", "description": "At Google, we put our users first. The world is always changing, so we need Product Managers who are continuously adapting and excited to work on products that affect millions of people every day. In this role, you will work cross-functionally to guide products from conception to launch by connecting the technical and business worlds. You can break down complex problems into steps that drive product development.One of the many reasons Google consistently brings innovative, world-changing products to market is because of the collaborative work we do in Product Management. Our team works closely with creative engineers, designers, marketers, etc. to help design and develop technologies that improve access to the world's information.  We're responsible for guiding products throughout the execution cycle, focusing specifically on analyzing, positioning, packaging, promoting, and tailoring our solutions to our users.P2020 develops solutions for production service management that are widely used across all Google’s Product Areas (PAs). Through latest best practices, P2020 helps reduce outages, complexity, and improve engineers’ productivity and resource efficiency.Rollouts is one of the four suites that comprises P2020, Rollouts tooling is the centralized standard for making production changes at Google. Rollouts help engineers deploy changes to production, launching new features and fixes, changing configuration or data, or adjusting serving capacity to match demand. These capabilities are critical to innovation and reliability of services with millions of users every day.Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in product management or a related technical role. 2 years of experience taking technical products from conception to launch.", "preferred_qualifications": "Master's degree in a technology or business related field. 3 years of experience in a business function or role (e.g., strategic marketing, business operations, consulting). 3 years of experience in a role preparing and delivering technical presentations to executive leadership. 2 years of experience in software development or engineering. Experience developing platform wide solutions at global scale. Experience with cloud, developer platform, or infrastructure product.", "responsibilities": "Work with partner teams (e.g., Engineers, Program Managers, UX) during product design and development to implement the requirements to turn Product Requirements Documents (PRDs) into Objectives and Key Results (OKRs) for one or more teams. Develop and secure buy-in for a product outlook that identifies, defines, and supports the overall product narrative and direction, achieving an outcome that is greater than the sum of its parts. Validate the market size and opportunity (e.g., user-based, strategic opportunity, business). Drive launches, maintenance, and retirement in collaboration with other cross-functional teams and stakeholders. Collaborate across functions and get things done. Lead work across Engineering and Design teams to launch, land and iterate.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134224001743364806"}