{"title": "Data Center Technician, Third-Party Data Center (Thai, English)", "level": "", "location": "Bangkok, Thailand", "description": "Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 3 years of experience in Hardware, Networking, Operating Systems, Linux, or Project Planning. Ability to communicate in Thai and English fluently to support client relationship management in this region.", "preferred_qualifications": "Experience working within a data center or network operation center environment. Experience in Linux/Unix desktop support, including installation, systems administration and troubleshooting. Experience in project management, leadership, collaborating and partnering with teams. Experience with troubleshooting, diagnosing, maintenance and monitoring of computer hardware and server hardware, operating systems and networking protocols. Ability to manage and accomplish tasks with minimal supervision and travel when needed.", "responsibilities": "Install, configure, test, troubleshoot and maintain hardware (e.g., servers and its components) and server software such as Google's Linux cluster. Take on the configuration of complex components such as networks, routers, hubs, bridges, switches and networking protocols. Participate in or lead small project teams on larger installations and develop project contingency plans. Work with infrastructure that is at the cutting-edge of computer technology.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134265529245278918"}