{"title": "Field Solutions Developer III, Generative AI, Google Cloud", "level": "Advanced", "location": "Toronto, ON, Canada", "description": "As a Generative AI Field Solutions Developer, you will play a pivotal role in supporting our Google Cloud business organization. Your primary responsibility will be to construct rapid prototype Generative AI applications tailored to Google Cloud customers, catering to a diverse clientele ranging from early stage startups to prominent Fortune 500 companies. You will leverage the Generative AI technologies to develop innovative solutions and validate their efficacy. You will be tasked with swiftly showcasing the latest Generative AI capabilities through direct collaboration with customers. You will be instrumental in materializing functional solutions on the Google Cloud platform. You will have close collaboration with our product team to eliminate obstacles and shape the future trajectory of our offerings. Google Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree in Science, Technology, Engineering, Math, or equivalent practical experience. 7 years of experience in AI applications (e.g., deep learning, NLP, computer vision, or pattern recognition). Experience in statistical programming language (e.g., Python), applied machine learning techniques, and using OSS frameworks (e.g., TensorFlow, PyTorch). Experience delivering technical presentations and leading business value sessions.", "preferred_qualifications": "Master's degree in Computer Science, Engineering, or a related technical field. Experience designing and deploying with one or more from the following ML frameworks: TensorFlow, PyTorch, JAX, Spark ML, etc. Experience training and fine tuning models in large scale environments (e.g., image, language, recommendation) with accelerators. Experience with distributed training and optimizing performance versus costs. Experience with CI/CD solutions in the context of MLOps and LLMOps including automation with IaC (e.g., using terraform). Experience in systems design with the ability to design and explain data pipelines, ML pipelines, and ML training and serving approaches.", "responsibilities": "Be a trusted advisor to our customers by understanding the customer’s business process and objectives. Design AI-drive, spanning Data, AI, and Infrastructure, and work with peers to include the full cloud stack into overall architecture. Demonstrate how Google Cloud is differentiated by working with customers on POCs, demonstrating features, tuning models, optimizing model performance, profiling, and benchmarking. Troubleshoot and find solutions to issues training/serving models in a large-scale environment. Build repeatable technical assets such as scripts, templates, reference architectures, etc. to enable other customers and internal teams. Work cross-functionally to influence Google Cloud strategy and product direction at the intersection of infrastructure and AI/ML by advocating for enterprise customer requirements. Coordinate regional field enablement with leadership and work closely with product and partner organizations on external enablement activities. Travel as needed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134490933082104518"}