{"title": "Director of Product Management, Cloud Runtimes and Serverless", "level": "Director+", "location": "Sunnyvale, CA, USA", "description": "As the Director of Product Management for Google Cloud Runtimes and Serverlerss, you will lead a team of Product Managers responsible for everything from growing our Serverless portfolio, influencing inbound product strategy, crafting partnerships and direction with the OSS community, creating effective GTM strategies, to driving Google Cloud’s growth in the rapidly growing AI/ML market.", "key_qualifications": "Bachelor's degree in Computer Science, Mathematics, or equivalent practical experience. 15 years of experience managing and leading product management and marketing teams. 10 years of experience as a people manager in Product Management. Experience building software and distributed systems or developer tools. Experience operating in a global role or on a global scale.", "preferred_qualifications": "Experience launching complex and innovative software products that meet the needs of enterprise and global scale customers. Experience leading in an enterprise technology setting, including expertise in SaaS around unified communications, content and collaboration, and meetings, and nuanced understanding of the cloud market and competitive dynamics/customer adoption behavior. Experience with private and public cloud design considerations in the areas of developer and operator productivity, virtualization, containers, high performance computing, data, security, and config/policy automation. Outstanding narrative and storytelling skills that propel usage, adoption, and market momentum.", "responsibilities": "Lead a team of high-performing Product Managers in a geographically dispersed team to set the GTM and product strategy for new workloads, in partnership with teams spanning Google Cloud. Develop a strategic vision for the Google Cloud Runtimes organization to constantly innovate,  implement, and launch novel solutions, which will put us on a path to providing exceptional serverless, next-generation container solutions and AI/ML. Work jointly across all Google Cloud teams on unified messaging and GTM plans to help accelerate cloud growth with containers. Accelerate business growth by partnering with Account, Customer Development, Marketing, and Solution teams. Collaborate with peer Development Directors and Product Managers in Google Cloud to develop a strategic roadmap to make Google Cloud Runtimes a leading container offering for new workloads and innovative development.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134410276890911430"}