{"title": "Data and AI Architect, Google Cloud", "level": "Advanced", "location": "Munich, Germany", "description": "The Google Cloud team helps companies, schools, and government seamlessly make the switch to Google products and supports them along the way. You listen to the customer and swiftly problem-solve technical issues to show how our products can make businesses more productive, collaborative, and innovative.", "key_qualifications": "Bachelor’s degree in Engineering, Computer Science, a related field, or equivalent practical experience. Candidates will typically have 9 years of experience working with client-side web technologies (e.g., HTML, CSS, JavaScript, or HTTP). Typically 9 years of experience coding with one or more programming languages (e.g., Java, Python). Experience in technical troubleshooting, and managing internal/external partners or customers. Experience with Data analytics and AI Cloud solutions (GCP). Experience in designing and deploying distributed data processing systems such as Oracle, SQL Server, MySQL, PostgreSQL, MongoDB, Cassandra, Redis, Hadoop, Spark, HBase, Vertica, Teradata, Tableau.", "preferred_qualifications": "Experience in enterprise architecture, systems design, and architecting/explaining systems interactions in Data and cloud landscape for consulting. Excellent communication, presentation, and problem-solving skills. Ability to communicate in English and German fluently to communicate in this customer-facing sales role.", "responsibilities": "Help the customer define their data transformation strategy linked to Google Cloud. Drive customers through a review of required data capabilities to define the goal architecture. Understand key data services such as BigQuery, Dataflow, Dataplex, etc. Leverage Google Cloud/Professional Services Organization (PSO) available solution accelerators and frameworks, while problem-solving and acting as the bridge to product teams and specialists. Manage key stakeholders and multiple partners.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134584659274015430"}