{"title": "Technical Specialist, AI Infrastructure and Machine Learning Operations", "level": "Advanced", "location": "Hong Kong; Beijing, China; Shanghai, China", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners. In this role, you will guide customers with platform architecture, migration strategy, and analyze cost/performance benchmarks to help them train and serve Machine Learning (ML) models at scale. You will work closely with cross-functional AI teams, Product and Engineering, Infrastructure, and Kubernetes specialists to remove roadblocks and shape the future solutions for customers. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, Mathematics, a related technical field, or equivalent practical experience. 5 years of experience with cloud infrastructure. Experience building and operationalizing machine learning models.", "preferred_qualifications": "Experience training and fine-tuning large models (i.e., image, language, segmentation, recommendation, genomics) with accelerators. Experience with performance profiling tools (i.e., Tensorflow profiler, PyTorch profiler, Tensorboard). Experience designing/architecting large-scale infrastructure farms for specialist AI use cases. Experience with running MLPerf benchmarks, distributed training and optimizing performance versus costs. Familiarity with libraries and frameworks such as HuggingFace Transformers, CUDA, Pytorch, Pytorch/XLA, etc. Ability to engage with C-level or executive business leaders and influence decisions.", "responsibilities": "Be a trusted advisor to customers, helping them understand and incorporate AI accelerators into their overall cloud strategy by recommending migration paths, integration strategies, and application architecture that incorporate Google Cloud AI optimized infrastructure. Demonstrate how Google Cloud is differentiated, highlighting the power of accelerators by working with customers on proof-of-concepts, demonstrating features, optimizing model performance, profiling, and bench-marking. Build repeatable assets to enable other customers and internal teams. Influence Google Cloud strategy at the intersection of infrastructure and AI/ML by advocating for enterprise customer requirements. Travel to customer sites and events as needed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134529119978169030"}