{"title": "Senior Data Scientist, Product, Education (English, Spanish)", "level": "Mid", "location": "Mexico City, CDMX, Mexico", "description": "Google is an engineering company at heart. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on users around the world. At Google, engineers not only revolutionize search, they routinely work on scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, social to local, Google engineers are changing the world one technological achievement after another.", "key_qualifications": "Master's degree in Statistics, Economics, Engineering, Mathematics, a related quantitative field, or equivalent practical experience. 5 years of experience with statistical data analysis, data mining, and querying (e.g., SQL). 3 years of experience managing analytical projects. Ability to communicate in English and Spanish fluently to support client relationship management in this region.", "preferred_qualifications": "Experience working with Finance, Sales and Go-To-Market, especially around business generation efforts, and identifying business challenges and opportunities. Experience solving unstructured business problems with data science, translating results into impactful business recommendations, and measuring the success of those initiatives. Excellent programming skills in SQL, Python or R. Excellent communication and presentation skills to deliver findings of analysis.", "responsibilities": "Define, own and refine business success metrics. Work with Product Manager, UX and Engineer to develop a comprehensive metric framework that ties to business uplift. Report, track and rationalize key metrics and make recommendations to improve them. Collaborate with Engineering teams to identify and address instrumentation gaps, ensuring accurate data collection for key functionalities, with a focus on business-generating customer journeys. Deliver effective presentations of data-driven insights and recommendations to multiple levels of stakeholders.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134664607070331590"}