{"title": "Senior Security Manager, Google Data Centers", "level": "Mid", "location": "Pryor Creek, OK, USA", "description": "Security is at the core of Google's design and development process: it is built into the DNA of our products. The same is true of our offices. You're an expert who shares our seriousness about security and our commitment to confidentiality. You'll collaborate with our Facilities Management team to create innovative security strategies, investigate breaches and create risk assessment plans for the future. You believe that providing effective security doesn't come at the expense of customer service - you will be our bodyguard (and our long lost pal). Google’s Data Center Compliance, Safety, and Risk Management (CSRM) team is a dedicated organization chartered with protecting the people and assets of Google’s global critical infrastructure. CSRM consists of industry leading professionals who leverage advanced security systems, dedicated guarding forces, as well as risk management and compliance framework programs to support the entirety of Google Data Centers. Their measured approach allows Google Cloud to reach a broader audience and inspires trust in their users. As a Data Center Area Security Manager, you will drive the outcomes of key data center infrastructure through technical contributions. You will use knowledge of data center security designs, operations, and local laws to develop and lead programs that align with regional or global strategy to gain site efficiency. You will partner with external industry leaders and collaborate with upper management and cross-functional teams to discuss project prioritization, and resource allocation. You will demonstrate the behaviors expected of all Googlers as captured in Google's cultural pillars, and engage in community contributions to improve and sustain our culture, making Google a better place to work. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 7 years of experience managing, sourcing, or procuring business resources and vendors. 7 years of experience developing and deploying processes to mitigate risk, and leading operational or project-based work and tasks. 7 years of experience coordinating or managing resources for data center locations.", "preferred_qualifications": "5 years of experience coordinating or leading security, and experience planning security operations or strategy for security programs. 4 years of experience managing incidents and crises. 2 years of experience with physical security system architecture, components, installation methods, administration, and troubleshooting. 2 years of experience with data center technologies, infrastructure, and methodologies.", "responsibilities": "Identify, evaluate, and monitor risks that could affect business activities and provide business leaders the information to make decisions. Develop, maintain, and execute protocols and practices to assess and mitigate threats to company assets, and recommend security solutions/tools to help mitigate vulnerabilities and automate tasks. Design and implement security operations programs and manage daily operations, ensuring multiple technical infrastructure locations are in compliance with all regional governmental and regulatory compliance requirements. Conduct, assist, or provide guidance in investigations related to security/Code of Conduct risk and violations. Manage the daily operations of vendors providing services including security, training, and risk management for one or multiple cross-functional technical infrastructure locations.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134763284480828102"}