{"title": "Account Manager, Home Products and Consumer Goods (English, Japanese)", "level": "Early", "location": "Tokyo, Japan", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.\n\nOur Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n2 years of experience in advertising, consultative sales, business development, online media environment, or marketing role.\nAbility to communicate in English and Japanese fluently in order to interact with internal and external stakeholders.", "preferred_qualifications": "Experience in online ad sales, business development, marketing, or consulting sales.\nExperience in Google Ads account management.\nAbility to deliver results under pressure and show dedication to client services.\nExcellent leadership, organization, investigative, problem-solving, communication, people management, and teamwork skills.", "responsibilities": "Develop and manage relationships directly with advertisers in Japan.\nGrow existing business, develop and win new business with global and domestic clients, and support the team with account and market knowledge and other collateral.\nBe an advisor and consultant, as well as an advocate for clients within Google.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134703157958582982"}