{"title": "Account Executive, Mid-Market Sales, Google Customer Solutions (English, French)", "level": "Mid", "location": "Dublin, Ireland", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow.  Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.", "key_qualifications": "Bachelor's degree or equivalent practical experience. \n5 years of experience in sales, media sales, account management, marketing or consulting.\nAbility to communicate in English and French fluently to communicate with clients in the region.", "preferred_qualifications": "Experience strategically assessing and achieving client success via sales techniques, including effective questioning, objection handling, and competitive selling.\nExperience managing digital advertising campaigns with a focus on performance marketing.\nKnowledge of online marketing strategy and tactics.\nAbility to own a portfolio in an advertising or media sales context in France, and consistently overachieve quotas to drive growth.\nAbility to build compelling narratives and utilize storytelling as a client engagement strategy.\nDemonstrated thought leadership and high executive functioning within the digital marketing space.", "responsibilities": "Deliver against ambitious quarterly business growth and product growth targets.\nOwn a portfolio of medium and large size businesses by thoroughly understanding growth drivers, identifying opportunities for growth, managing risks, and building multi-quarter plans for achievement.\nPitch and consult with customers proactively to support annual digital marketing discussions and budgets.\nDrive customer growth by delivering outstanding customer sales experience and achieving customer business and marketing objectives.\nEstablish credibility with executives and serve as a trusted partner to optimise and expand their advertising investment.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134896473027289798"}