{"title": "Sourcing Operations Lead", "level": "Advanced", "location": "Dublin, Ireland", "description": "At Google we spend hundreds of millions of dollars with vendors every year. The Supplier Sourcing team gets things done for Google, from tasks like buying hardware, software and professional services to managing facilities and various technology services globally. Through the strong and unique relationships we have with internal stakeholders and the right vendors, our team ensures that Google gets the best value for our purchases. As a member of a larger team, you drive a number of procurement-related activities such as guiding vendors through our shifting needs and supplying internal clients with sound purchasing advice. You craft and lead a multi-step sourcing process and innovative e-auctions to finalize high-dollar, high-risk proposals and contract negotiations. In some cases, you secure competitive rates for Google by translating our business needs into familiar \"commodity\" terms for the marketplace.", "key_qualifications": "Bachelor's degree in Supply Chain Management, Business Administration, related field, or equivalent practical experience. 10 years of experience in multi-disciplined procurement, leading strategy development, execution and sourcing, or a related function. 5 years of experience managing category strategies and sourcing teams across multiple categories for both goods and services in the indirect category space.", "preferred_qualifications": "Master's degree or certifications in Supply Chain Management, Procurement, or related field. Experience in ensuring compliance with these requirements in sourcing activities. Experience in managing outsourced sourcing functions or tasks, and overseeing and managing the performance of outsourced functions, ensuring alignment with organizational goals and quality standards. Knowledge of legal and regulatory requirements related to sourcing operations. Familiarity with industry best practices and emerging trends in strategic sourcing, and ability to implement these practices to optimize sourcing operations. Proficiency in using sourcing tools and software, such as eSourcing platforms, contract management systems, and spend analysis tools.", "responsibilities": "Collaborate with internal stakeholders to understand sourcing requirements and strategies. Manage sourcing processes for goods or services, including supplier identification, RFx creation, discussions, and contract execution. Identify and engage with external vendors or service providers to handle specific sourcing functions or tasks. Oversee and manage the performance of outsourced functions, ensuring alignment with organizational goals and quality standards. Manage relationships with suppliers including performance evaluations, contract compliance, and issue resolution. Oversee identification of cost-saving opportunities and discussion strategies in collaboration with outsourced partners, and support discussions with suppliers to achieve favorable terms and pricing.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134806609963426502"}