{"title": "Vice President, Capacity and Demand", "level": "", "location": "Atlanta, GA, USA", "description": "Powering all of Google is challenging enough. Doing it optimally, so that capacity and servers and network arrive just where and when they’re needed, is far more difficult. When a 1% improvement in efficiency translates into several hundred million dollars, the value of extraordinary performance is clear. As Vice President of Capacity and Demand, you will lead Google’s capacity planning function, from demand forecasting and reconciliation, to supply planning and supply/demand matching, to portfolio management of many billions of dollars of data center and machine capacity. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems. The US base salary for this full-time position is $550,000 + bonus + equity + benefits. Individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits.", "key_qualifications": "Bachelor’s degree in Computer Science or similar engineering discipline, or equivalent practical experience. 15 years of experience in executive management for a team of 300+ across multiple time zones. Experience in systems product management, design, implementation, and operations, including high-availability shared infrastructure and large-scale distributed systems. Experience in infrastructure demand modeling, capacity planning, and supply chain operations. Experience in finance or analytical roles, including in modeling and portfolio assessment.", "preferred_qualifications": "Master’s degree or PhD in Engineering. Experience managing large, collaborative, high-stakes programs which span multiple independent teams and multiple years. Ability to travel 25% of the time between Mountain View, Seattle, and Atlanta.", "responsibilities": "Develop an accurate statistical demand forecast for Google’s worldwide data center, server, storage, and AI needs on a regular cadence. Translate that forecast into supply orders, at multiple lead times, to procure a statistically-optimal portfolio of capacity inventory while managing bounded demand uncertainty and financial constraints. Match demand and supply to deliver capacity to internal and external customers congruent with delivery SLOs and modeled stockout and holding costs. Manage specification and requirements for first-party and third-party software systems used to forecast, plan, procure, and manage capacity across many products and locations. Work closely with all of Google’s major consumer products, enterprise products, ML teams, and Sales teams to both intake demand forecasts and needs, produce an in-spec delivery outcome for each stakeholder, and make efficient use of Google’s capital and OpEx.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134815493029536454"}