{"title": "Delivery Business Operations Lead, Google Enterprise Network", "level": "Advanced", "location": "Austin, TX, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines.\n\nOur goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.\n\nGoogle Enterprise Network's (GEN) mission is to enable Google’s ambitions through secure, reliable, and efficient network services.\n\nAs a Delivery Business Operations Lead, you'll utilize data analysis to support the development and execution of business strategies. You will work with key business partners and other internal teams to understand business challenges and data needs, conduct data analysis to investigate hypotheses, and design and manage programs to implement insights. You will work closely with the leadership team to define and represent the operational performance of the business across a number of areas including strategy, OKRs, finance, team development.\n\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "salary": "$165,000-$248,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in a business operations, program management, or similar role within a technical or engineering environment. 8 years of experience managing multiple stakeholders and working on cross-functional or cross-team projects and programs. 8 years of experience driving operational efficiency (e.g., data analysis, metrics, process improvements, financial acumen).", "preferred_qualifications": "MBA or Master's degree in Computer science, Networking or Engineering, or related technical environment. Experience working in dynamic and ambiguous environments. Experience in developing strategic recommendations and influencing key decisions across business leadership. Knowledge and experience with organizational effectiveness, organizational design, and change management best practices. Ability to translate business needs into intuitive and readable dashboards or other visual representations.", "responsibilities": "Lead strategic initiatives to solve business challenges across the organization. Translate ambiguous business goals into clear and measurable objectives and actionable processes/programs.\nOwn and drive the Objectives and Key Results (OKR) planning process, ensuring alignment with all stakeholders.\nDefine and measure performance on key processes and success criteria, and establish necessary program governance, to enable business execution and efficiency. Analyze organizational and operational data to identify opportunities for improvement and to increase cross-functional alignment.\nIdentify and collect data required to produce actionable business insights and recommendations for senior leadership. Drive change, influence decision making, and lead adoption of key business processes across all levels of the organization.\nLead annual budget planning processes, including workforce and location strategy, in partnership with other Business Operations Program Managers.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134849071956271814"}