{"title": "Contact Center AI Sales Specialist III, Google Cloud", "level": "Advanced", "location": "Sunnyvale, CA, USA; Atlanta, GA, USA", "description": "As a CCAI Sales Specialist, you will be responsible for growing our Contact Center AI (CCAI) and Contact Center as a Service (CCaaS) business by building and expanding relationships with new and existing customers. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 10 years of experience in a sales role in the enterprise software, cloud, or AI space. Experience identifying Contact Center as a Service (CCaaS) use cases to solve customer challenges or selling Customer Experience (CX) technology to clients. Experience engaging with, presenting to, and building relationships with executive leaders.", "preferred_qualifications": "Experience promoting the Contact Center AI (CCAI), Generative AI and AI technology stack. Experience working with cross-functional teams, including Product, Field Sales, Customer Engineering, Solution Architects to build business cases for transformation and accompanying plans for implementation. Experience with contact center technologies and platforms (e.g., Avaya, Genesys, Cisco, Mitel, Twilio, etc.). Experience working with and managing partners in complex implementation projects, including global system integrators and packaged software vendors. Understanding of regional, local, and industry data privacy and security rules and regulations. Ability to engage and influence executive stakeholders as a business advisor and thought leader in AI.", "responsibilities": "Build and maintain executive relationships with customers as the Contact Center AI (CCAI) Subject Matter Expert, manage complex business cycles, identify suitable use cases for Google Cloud solutions, and influence the long-term strategic direction of your accounts. Manage objectives and key results to deliver against quota and achieve or exceed strategic business and growth goals while accurately forecasting and reporting the state of the business for the assigned territory. Work with Google accounts and cross-functional teams (e.g., Customer Engineering, Marketing, Customer Success, Product, Engineering, and Channels) to develop go-to-market strategies, drive pipeline, understand the customer, and provide excellence prospect and customer experience. Assist customers in identifying CCAI and AI/GenAI use cases suitable for Google Cloud AI products and solutions. Articulate key solution differentiators and the measurable business impact.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134963853011100358"}