{"title": "Software Engineering Manager, Server Management, Google Cloud", "level": "Manager", "location": "Taipei, Taiwan", "description": "Like Google's own ambitions, the work of a Software Engineer goes way beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of engineers. You not only optimize your own code but make sure engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way.\n\nWith technical and leadership expertise, you manage engineers across multiple teams and locations, a large product budget and oversee the deployment of large-scale projects across multiple sites internationally.\n\nThe Machine Management and Monitoring team builds the software and infrastructure that provides telemetry and control of Google data center hardware. As a Software Engineering Manager, you'll provide leadership to a group of software engineers in an innovative environment, with a combination of a horizontal (e.g., server management and control) and vertical (e.g., project, product development) responsibilities.\n\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "key_qualifications": "Bachelor's degree in Computer Science or equivalent practical experience.\n7 years of experience in system software design and development in C/C++.\n5 years of experience in technical leadership and people management.\nExperience with software engineering practices including release management, test automation, and quality assurance.", "preferred_qualifications": "Experience in software/hardware integration, system bring-up, and diagnostics.\nExperience in large-scale and secure fleet management of servers and components.\nExperience with developer operations, release management, integration testing, and server management protocols: DMTF, PLDM, IPMI.\nExperience in Python/Go and scripting languages (e.g. Shell).\nExperience with hyper scale data center software management.\nKnowledge of one or more of the following: ARM and x86 assembly servers architects, system BIOS, hardware/software integration.", "responsibilities": "Lead a team of software engineers in accomplishing roadmap goals.\nCollaborate with executive developers and the team to gather requirements, define architecture, and review detailed designs.\nWork with stakeholders to provide status updates, facilitate iterative releases, and make design decisions throughout the development process.\nDrive the evaluation and implementation of new server management and control technologies, health monitors, and supporting tools for data center needs.\nEstablish and maintain a team for sustaining Google data center server management software.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134909408730587846"}