{"title": "Technical Program Manager, Payments", "level": "Mid", "location": "Hyderabad, Telangana, India", "description": "Google's projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You're equally at home explaining your team's analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.\n\nUsing your extensive technical and leadership expertise, you manage projects of various size and scope, identifying future opportunities, improving processes and driving the technical directions of your programs.\n\nAs the Technical Program Manager, you will drive large and complex infrastructure projects for Payments Platform. You will navigate seamlessly across organizational complexities and bring order out of chaos. You'll work across engineering, product management, compliance, legal, and other cross-functional partners.\n\nWhether it is paying online with Autofill, using tap and pay in stores, or using the Google Pay app, the Payments team at Google is focused on making payments simple, seamless, and secure. In addition to consumer payment technologies, the Payments team also powers the money movement between Google and its consumers and businesses.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience; 5 years of experience in program management; 5 years of experience with software development and managing execution of programs", "preferred_qualifications": "Master's degree in Computer Science or a related technical field; Experience in commerce/payments/platform products; Excellent technical judgment, problem-solving, and analytical skills", "responsibilities": "Facilitate and manage cross-functional/technical projects and drive them to launch. Work closely with engineering, product management, and cross-functional partners to define requirements, scope, schedule, resourcing, and milestones/tasks.\nManage relationships with key internal stakeholders and third-party vendors. Facilitate team discussions, drive issues to resolution, help identify and implement risk mitigations.\nDemonstrate solid technical comprehension and thought leadership which helps run projects more efficiently.\nIdentify, develop, and implement process improvements to help teams scale. Communicate project status to various audiences, including cross-functional and executive audiences.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/134970518062146246"}