{"title": "Financial Analyst", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Financial Analysts ensure that Google makes sound financial decisions.  As a Financial Analyst, your work, whether it's modeling business scenarios or tracking performance metrics, is used by our leaders to make strategic company decisions. Working on multiple projects at a time, you are focused on the details while finding creative ways to take on big picture challenges.\n\nAs someone who knows the workings of the core Finance team inside and out, you'll lead individual projects to transform planning, tracking and control processes. You'll provide senior level management with insightful recommendations, planning and reporting support.\n\nThe name Google came from \"googol,\" a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.", "key_qualifications": "Bachelor's degree in Business, Finance, Economics, Statistics, or another quantitative field, or equivalent practical experience.\n4 years of experience in financial planning and analysis, consulting, or a related function, or an advanced degree.", "preferred_qualifications": "Experience with building data infrastructure (e.g., designing architecture, building data pipelines, implementing scalable monitoring) and implementing reporting solutions.\nExperience in developing strategies in fast-paced environments.\nAbility to work with data to produce analysis, influencing decision making with numerical analysis and generating insights.\nAbility to take ownership, interact with all levels, set objectives, drive results, and work as part of a team.\nExcellent communication skills with the ability to work with a wide variety of departments.", "responsibilities": "Perform analysis of datasets to extract information, identify trends, and generate insights for the business. Manage projects involving multiple stakeholders, timelines, organizational implications, and changing circumstances.\nOwn and enhance recurring financial planning and analysis processes including month end close, forecasting, financial planning, reporting, business reviews, and planning initiatives.\nSupport long range plan and annual operating plan process for the efficiency and Compute, Storage, and Networking (CS&N) product work streams based on analytics and simulations.\nPartner with cross-functional teams such as IaaS Product Finance, PaaS Product Finance, Capacity Planning, Product Engineering, Program Manager, Technical Infrastructure Software Engineering and the Cloud StratOps.\nOwn key deliverables of Infrastructure cost compute, storage, and networking in the product and charge back/internal pricing work stream.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/135061647872926406"}