{"title": "Software Engineering Manager, Google Data Center Networking", "level": "Advanced", "location": "Sunnyvale, CA, USA", "description": "Like Google's own ambitions, the work of a Software Engineer goes way beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of engineers. You not only optimize your own code but make sure engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way.\n\nWith technical and leadership expertise, you manage engineers across multiple teams and locations, a large product budget and oversee the deployment of large-scale projects across multiple sites internationally.\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$189,000-$284,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java). 3 years of experience in a technical leadership role; overseeing projects, with 2 years of experience in a people management, supervision/team leadership role. Experience in project management, networking, software development, and network virtualization.", "preferred_qualifications": "Master’s degree or PhD in Engineering, Computer Science, or a related technical field. 5 years of experience working in a complex, matrixed organization. 3 years of experience working in Datacenter Networking, Network Design, Network Infrastructure, and Software Development.", "responsibilities": "Manage the projects from strategy to delivery, feedback, and iteration. Identify high-impact work, coach, and help to develop their careers and participate/lead in design, architecture discussions. Collaborate with our team to determine our priorities, strategies and team culture, and deliver an enhanced networking experience for our internal and external customers.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/135037255411475142"}