{"title": "Data Analyst", "level": "Early", "location": "Hyderabad, Telangana, India", "description": "Trust & Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you're a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.\n\nWithin Trust and Safety, the Service Delivery team is responsible for the strategy, governance, and operations across the Temp, Vendor, and Contractor (TVC) population. Partnering with teams across Legal, Security, Extended Workforce Solutions (xWS), REWS, Trust and Safety (T&S), Engineering, and external Vendor partners to bring innovation and technology in building operations and protecting users. Service Delivery (SD) team members have the opportunity to create, develop, and implement some of the most complex operations.At Google we work hard to earn our users’ trust every day. Trust & Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in data analytics, Trust & Safety, policy, cybersecurity, or related fields. Experience in SQL, building dashboards, data collection and transformation, statistical modeling, visualization and dashboards, or a scripting or programming language (e.g., Python, Java, C++). Experience in writing and maintaining ETLs (Extract, Transform, Load) that operate on a range of structured and unstructured sources. Experience in leveraging data to derive meaningful insights and actionable recommendations.", "preferred_qualifications": "Education in, or experience with, machine learning. Experience in SQL, building dashboards, data collection/transformation, visualization/dashboards, or in a scripting/programming language (e.g., Python). Excellent communication and presentation skills (written and verbal) and the ability to influence cross-functionally at various levels. Excellent problem-solving and critical thinking skills with attention to detail in an ever-changing environment.", "responsibilities": "Design, develop, and maintain Trust and Safety access and security systems, ensuring that security objectives are fully achieved without compromising operational efficiency. Design and implement seamless integrations between business goals and security systems, including the development and execution of strategies that support the effectiveness of these systems. Manage projects that involve multiple stakeholders, have stringent deadlines, hold significant implications for the organization, and require adaptability to changing circumstances. Demonstrate an understanding of the process area, encompassing domain expertise in data sources, access and authentication methods, and relevant products.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/135169036483732166"}