{"title": "Systems Development Engineer, OmniLab", "level": "", "location": "Bengaluru, Karnataka, India", "description": "Systems Development Engineering (SDE) at Google is a role where you manage services and systems at scale. SDEs creatively put their engineering discipline to use automating the mundane and reducing toil. We don’t just write code to fix bugs, but emphasize the development of tools and solutions that fix classes of problems. We know it’s hard to control what you can’t measure – so we focus on observability: instrumenting first, then turning data into knowledge, and finally knowledge into action. We know that the operational efficiency of Google systems, services, virtual compute environments and the operating systems that power them impact the environment, not just the bottom line. We know that working together we can do more, and that community matters. Google brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow. Together we engineer and build the infrastructure, tools, access and telemetry for systems that enable orchestration of Google-scale services. Come build things that matter. The Core team builds the technical foundation behind Google’s flagship products. We are owners and advocates for the underlying design elements, developer platforms, product components, and infrastructure at Google. These are the essential building blocks for excellent, safe, and coherent experiences for our users and drive the pace of innovation for every developer. We look across Google’s products to build central solutions, break down technical barriers and strengthen existing systems. As the Core team, we have a mandate and a unique opportunity to impact important technical decisions across the company.", "key_qualifications": "Bachelor's degree in Information Security, Information Systems, Computer Science, Information Technology, a related field, or equivalent practical experience. 2 years of experience with systems automation and working with technical infrastructure (e.g., deployment, maintenance, troubleshooting). Experience working with one or more from the following: cloud-native application development, container orchestration, Unix/Linux environments, site reliability engineering, developing software systems, or software security.", "preferred_qualifications": "Experience programming in one or more of the following languages: C, C++, Java, Python, Go, Perl, or Ruby and in troubleshooting and debugging of distributed systems. Experience in algorithms, data structure analysis, and software design or in Unix/Linux systems, IP networking, performance and application issues. Experience in designing, building, and maintaining distributed, reliable and high-volume transaction systems. Experience in assuring system availability, scalability, and performance management. Experience in troubleshooting, and supporting applications such as web services, data storage, databases, data pipelines, high-performance computing, commerce engines, with Linux/Unix or similar operating systems.", "responsibilities": "Automate and orchestrate environments, pick up new platforms, and new technologies. Operate fleet of servers and consumer devices in racks in production environment. Design, guide, and vet systems designs within the scope of the broader area, and write product or system development code to solve ambiguous problems.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/135278959192351430"}