{"title": "UX Designer, Google Play Games Loyalty", "level": "Mid", "location": "London, UK", "description": "At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" Google’s Interaction Designers take complex tasks and make them intuitive and easy-to-use for billions of people around the globe. Throughout the design process—from creating user flows and wireframes to building user interface mockups and prototypes—you’ll envision how people will experience our products, and bring that vision to life in a way that feels inspired, refined, and even magical. Google User Experience (UX) is made up of multi-disciplinary teams of UX Designers, Researchers, Writers, Content Strategists, Program Managers, and Engineers: we care deeply about the people who use our products...", "key_qualifications": "Bachelor's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 4 years of experience in consumer-facing product design or UX, working on gaming, loyalty, behavioral psychology or equivalent problem spaces. Include a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link or access instructions).", "preferred_qualifications": "Master's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 2 years of experience working in a complex, cross-functional organization, with 1 year of experience leading design projects. Experience in the gaming industry. Experience with loyalty programs or gamified experiences.", "responsibilities": "Collaborate cross-functionally and cross-team to support multidimensional pieces of work across games experiences. Deliver on a high standard for craft and excellence through the use of user-centered principles, methods, and tools—paying close attention to the tapestry of design systems and patterns across the broader games product landscape. Prioritize work while managing stakeholder relationships and expectations across a range of work streams on a range of trajectories and velocities. Contribute to an environment where every team member feels supported and comfortable being their authentic self. Build strong relationships with peers and leaders inside and outside of the team to drive user experiences that are cohesive, inclusive, and well-informed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/135214499316540102"}