{"title": "Strategic Field Sales Representative, Google Cloud", "level": "Advanced", "location": "San Francisco, CA, USA", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 10 years of sales experience in the technology industry with SaaS, PaaS or IaaS products and platforms. Experience engaging with accounts, selling a portfolio of products at C-level.", "preferred_qualifications": "Experience with commercial and legal negotiations, and working with procurement, legal, and business teams. Experience promoting Google Cloud computing technologies to organizations across geographies. Ability to influence decisions at the executive level. Ability to collaborate across organizational boundaries, build relationships, and import and export talent/ideas to achieve a broader organizational goal. Ability to present analyses and break down technical concepts into simple terms to present to diverse, technical, and non-technical audiences.", "responsibilities": "Build executive relationships with enterprise customers, influence strategic direction, and serve as a business partner. Discuss and manage business cycles, and present to executives in corporate and global customers. Lead account strategy in generating and developing business growth opportunities, work collaboratively with Customer Engineers and Google partners to maximize business results in territory and open up opportunities with enterprise customers. Understand each customer's technology footprint, strategic growth plans and business drivers, technology strategy, and engaged landscape. Drive business development, forecast accurately, and achieve strategic goals by leading customers through the business cycle.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/135226657026777798"}