{"title": "Global Product Senior Associate", "level": "Mid", "location": "Mountain View, CA, USA; San Francisco, CA, USA", "description": "The Go-To-Market organization provides business critical insights using analytics, ensures cross-functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience in management consulting, sales operations, business strategy, investment banking, venture capital, private equity, or corporate advisory, or 2 years of experience with an advanced degree.", "preferred_qualifications": "Experience with Sales, Analyst, or Strategy and Operations. Ability to work with data and pull insights from data. Ability to track multiple projects and timelines, meet deadlines, and deliver outputs across several work-streams. Ability to identify user needs and translate them into a broader strategy for tools and processes. Ability to communicate to various audiences, including technical stakeholders, Sales leaders, and business stakeholders. Excellent problem solving and analytical skills.", "responsibilities": "Represent end users, build and execute against tools roadmap, set the strategy for audiences across Connect Sales. Prioritize based on quantified business cases (e.g., business growth, productivity savings) and qualitative inputs (e.g., interviews, feedback) and articulate these use cases to partners. Document business requirements and partner with product managers, UX, and Engineering on the design and development of user facing feature launches. Plan, execute, and drive global launch strategy, including developing a deployment plan, trainings, and support materials to drive product and feature adoption. Estimate and measure the business impact of new features, processes, and training.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/135440721954906822"}