{"title": "Customer Growth Associate, Google Customer Solutions (German), Early Careers", "level": "", "location": "Dublin, Ireland", "description": "The Scaled team is a sales team designed to grow small-sized companies in Germany with significant expansion potential. The team specializes in delivering the most effective solutions to high potential small businesses from all verticals and business models in the most efficient way for the business. Customer Growth Associates are the promoters who serve as the advocate of Google. In this role, you will establish relationships by conducting regular phone consultations and sales pitches with a large portfolio of clients. You’ll operate in a fast-paced environment, reaching for business growth and productivity goals. In addition, you will provide Google-calibre solution promoting, partnership management, and analysis to deliver successful business outcomes. You'll uncover the business needs of Google's clients and achieve their marketing objectives, while driving incremental agreements through our industry-leading advertising solutions. Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow. Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.", "key_qualifications": "Bachelor's degree or equivalent practical experience. Experience in digital sales, client management, customer service, business development, customer outreach, marketing, consulting, digital advertising, or related field. Ability to communicate in English and German fluently to support client relationship management in this region.", "preferred_qualifications": "Experience with Google Ads and online advertising, or Google Ads certified. Familiarity with managing a portfolio or working against assigned customer goals (e.g., business growth, customer success metrics, outreach goals, etc.). Ability to think strategically. Excellent communication and problem-solving skills. Interest in sales and technology with a passion for helping businesses grow online. Available to start between August and September 2024.", "responsibilities": "Serve as a trusted advisor to clients by building relationships with key customer decision-makers and business owners to understand their business goals and digital marketing plans, and help empower their business with Google advertising. Manage large and diverse accounts and identify opportunities where Google Ads can impact growth, while tracking account growth and product adoption quarterly goals. Conduct frequent phone consultations to evaluate campaign performance, make account recommendations, and mentor/influence business owners on digital marketing strategy. Engage in essential activities to drive customer relationship growth (e.g., proactive engagement, campaign performance review, client meetings, pitches, research, internal strategy building/execution, etc.). Participate in continuous training throughout the program.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/135616011918287558"}