{"title": "Senior CPU CAD Methodology Engineer, Silicon", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.\nIn this role, you will be responsible for developing design methodology and CAD flows for the next generation CPU. You will contribute to the implementation flows leveraging industry tools. You will collaborate with infrastructure, physical design, technology and Electronic Design Automation (EDA) partners closely to implement the next generation processor flows to achieve Performance, Power and Area (PPA) metrics.\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, Electrical Engineering, Computer Engineering, a related technical field, or equivalent practical experience.\n8 years of experience in developing high-performance, low-power design methodology or CAD flows in synthesis and implementation areas.\nExperience in writing production scripts for implementation and sign-off tools.", "preferred_qualifications": "Experience in evaluating multiple vendor solutions and driving tool decisions.\nExperience in advanced technology nodes.\nKnowledge of computer architecture and technology nodes across foundries.\nAbility to deliver metric driven Performance, Power, Area (PPA) flow development and support.", "responsibilities": "Develop industry leading high-performance and low-power complex design flows for advanced CPUs.\nCollaborate with the cross-functional teams to develop efficient flows, tools and features.\nPerform technical evaluations of vendors, process nodes and IP, and provide recommendations.\nCreate flow specification and documentation. Support and train execution teams based on developed tools and flows.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/135724787333767878"}