{"title": "Senior Embedded Engineer, Security/Privacy, Pixel", "level": "Mid", "location": "Warsaw, Poland", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. With your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions. The Google Pixel team focuses on designing and delivering the world's most helpful mobile experience. The team works on shaping the future of Pixel devices and services through some of the most advanced designs, techniques, products, and experiences in consumer electronics. This includes bringing together the best of Google’s artificial intelligence, software, and hardware to build global smartphones and create transformative experiences for users across the world.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience with software development in one or more programming languages, and data structures/algorithms. 3 years of experience building software for data privacy or security (e.g., identity and access management). Experience in cryptography, application/network/systems security, or malware analysis, and in embedded systems development.", "preferred_qualifications": "Master's degree or PhD in Computer Science or a related technical field. Experience in platform-level vulnerability hardening or testing in Linux. Experience with security auditing and risk assessments. Experience in security engineering, computer and network security, authentication, security protocols, and applied cryptography.", "responsibilities": "Participate in or lead design reviews with peers and stakeholders to decide amongst available technologies. Design and build scalable, secure, and reliable infrastructure to facilitate the entire software development processes and secure manufacturing for Pixel devices. Research, design, and develop security features for future Pixel devices. Improve infrastructures for fuzzing, testing, and CI. Harden low-level system software components critical to Pixel security.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/135819134880359110"}