{"title": "Operations Manager, Trust and Safety Compute", "level": "Mid", "location": "Hyderabad, Telangana, India; Bengaluru, Karnataka, India", "description": "Trust & Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you're a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety. At Google we work hard to earn our users’ trust every day. Trust & Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in building scaled operations, workflow design, operations management, process documentation or similar. Experience in policy, policy compliance, content analysis or moderation, customer support, policy creation, or Trust and Safety.", "preferred_qualifications": "Experience in content policy and reviewing online content. Experience in scaled operations, workflow design, and process documentation. Experience in content analysis, fraud Investigation, or data analytics. Knowledge of data analytics, with the ability to execute efficiently. Ability to work well in a cross-functional team environment with a focus on knowledge sharing and collaboration. Excellent problem-solving, critical thinking, communication and presentation skills, with attention to detail in an ever-changing environment.", "responsibilities": "Improve workflows and operational workstreams. Implement, execute, and iteratively improve enforcement operations. Lead projects involving multiple-stakeholders. Partner closely with stakeholders across Trust and Safety and other cross-functional teams such as Product, Engineering, Business Development, and Legal.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/135859098141762246"}