{"title": "Financial Analyst", "level": "Early", "location": "Austin, TX, USA", "description": "Financial Analysts ensure that Google makes sound financial decisions. As a Financial Analyst, your work, whether it's modeling business scenarios or tracking performance metrics, is used by our leaders to make strategic company decisions. While working on multiple projects at a time, you are focused on the details while finding creative ways to solve big picture challenges. The name Google came from \"googol,\" a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.", "salary": "$87,000-$128,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Business, Finance, Economics, Statistics, or another quantitative field, or equivalent practical experience. 2 years of experience in financial planning and analysis, consulting, a related function, or an advanced degree.", "preferred_qualifications": "Experience in spend management and budget planning cycles. Experience in financial modeling, financial planning and analysis, consulting, or a related function. Knowledge of the Cloud/Software industry, different roles, and incentives. Ability to self-direct work in an unstructured environment and work with ambiguity. Excellent analytical and technical skills. Excellent communication skills.", "responsibilities": "Own key deliverables for go-to-market teams. Own and enhance recurring processes including forecasting, financial planning, reporting, business reviews, and planning initiatives. Develop and present business insights to Finance and Business leaders on spend performance. Act as a trusted financial and strategic advisor to Sales leaders, manage product offerings, investments, and go-to-market initiatives to drive growth and profitability. Drive long range plan(LRP) and annual operating plan(AOP) process based on analytics and simulations, play a critical role in setting plans and engage with Cloud senior leadership, consulting, or a related function.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/136038114526143174"}