{"title": "Program Manager III, Contract Solutions Enablement, Global Affairs", "level": "Mid", "location": "Austin, TX, USA; Chicago, IL, USA; Miami, FL, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.", "salary": "$139,000-$207,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in program or project management. 3 years of experience with enterprise contracting technology and processes, enterprise CLM or other legal technology implementations, including driving onboarding of a new technology or managing existing technology. Experience working within a legal department at an operating company, a legal technology company, or a law firm.", "preferred_qualifications": "Experience leading change initiatives and driving adoption. Experience creating and delivering presentations at the executive level with stakeholders. Experience working with both technical (Product and Engineering) and business stakeholders and users. Ability to adapt quickly and work in a fast-changing environment. Ability to build trust, influence others, resolve conflicts, and foster and maintain key relationships over time. Ability to adapt communication style to bridge the gap between technical and non-technical stakeholders.", "responsibilities": "Partner with stakeholders to understand key business and user needs, identify innovative and strategic solutions, and execute the goal and strategy for Global Affairs scaled solutions and tools. Lead multiple cross-functional programs that improve agreement processes, data, and technologies across Google, delivering measurable improvements in efficiency and effectiveness. Cultivate effective program teams with diverse stakeholders and partners, and facilitate communication and ensure alignment on timelines, goals, and deliverables across related teams and projects. Help prioritize business needs, articulate them, and work effectively with Product teams and engineers to influence product roadmaps to address stakeholder needs and enable business strategy. Identify, assess, and advise stakeholders, partners, and customers on contracting processes and technologies, best practices, industry standards, and emerging trends, and demonstrate a grasp of the technical aspects of contracting systems and tools.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/136099304723882694"}