{"title": "Market Responsibility Specialist, YouTube Trust and Safety (Japanese)", "level": "Mid", "location": "Singapore", "description": "Fast-paced, dynamic, and proactive, YouTube’s Trust & Safety team is dedicated to making YouTube a safe place for users, viewers, and content creators around the world to belong, create, and express themselves. Whether understanding and solving their online content concerns, navigating within global legal frameworks, or writing and enforcing worldwide policy, the Trust & Safety team is on the frontlines of enhancing the YouTube experience, building internet safety, and protecting free speech in our ever-evolving digital world. As a Market Responsibility Specialist supporting the local Japan market, you will be responsible for ensuring that we are constantly growing our understanding of regional and local trends and risks on YouTube. You will monitor trends and intelligence sources, help to launch new product features with market and language knowledge and ensure our enforcement guidelines are informed by your market knowledge. In this role, you will help implement and enforce our policies across content videos, as well as define and implement operational plans globally, liaising and working with stakeholders in areas such as Product Management, Engineering, Vendor Operations, Analytics, Public Policy, PR, Partnerships and Legal. You will review graphic, controversial, and offensive video content during team escalations in line with YouTube’s Community Guidelines.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience in data analytics, Trust and Safety, policy, cybersecurity, or related fields. Ability to communicate in Japanese fluently to identify abuse trends and communicate with in-market stakeholders.", "preferred_qualifications": "Experience working with Product Management and Engineers to drive progress on key programs. Experience with the history, local politics, media landscape, culture, and context of the Japan market. Experience with SQL and spreadsheet software. Ability to build effective relationships with cross-functional partners across geographies. Excellent organizational, people management, and project management skills with excellent attention to detail. Excellent problem-solving skills and the ability to use data to drive strategy and business action.", "responsibilities": "Monitor intel sources, work with cross-functional teams, and leverage native market expertise to identify key abuse trends in the Japan market, monitor emerging sensitive events, and highlight risks to the YouTube ecosystem and Trust and Safety. Speak Japanese and English fluently in order to effectively identify and propose policy improvements based on market nuances, and support language detection, automation, language quality improvements, and local product launches. Support identification and vetting of external partners. Triage threats, prepare risk assessments, and action plans based on market knowledge, including regional events and escalations, and act as the main point of contact. Drive and support the launch of news related product features for the Japan market.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/136178433255187142"}