{"title": "Business System Analyst, Planning and Forecasting", "level": "Mid", "location": "Hyderabad, Telangana, India", "description": "At Google, we work at lightning speed. So when things get in the way of progress, the Business Systems Integration team steps in to remove those roadblocks. The team identifies time-consuming internal processes and then builds solutions that are reliable and scalable enough to work within the size and scope of the company. You listen to and translate Googler needs into high-level technical specifications, design and develop recommended systems and consult with Google executives to ensure smooth implementation. Whether battling large system processes or leveraging our homegrown suite of Google products for Googlers themselves, you help Googlers work faster and more efficiently. At Corp Eng, we build world-leading business solutions that scale a more helpful Google for everyone. As Google’s IT organization, we provide end-to-end solutions for organizations across Google. With an inclusive mindset, we deliver the right tools, platforms, and experiences for all Googlers as they create more helpful products and services for everyone. In the simplest terms, we are Google for Googlers.", "key_qualifications": "6 years of experience working with sensitive data and Sarbanes-Oxley Act (SOX) controls and change management processes. Experience in Financial Planning and Analysis implementing planning tools (such as Anaplan, SAP Analytics Cloud). Experience with ERP systems (such as SAP BPC, Oracle/Hyperion) and data.", "preferred_qualifications": "Experience working on cross-functional team projects spanning multiple locations. Ability to work through ambiguity in a rapidly changing business environment. Excellent collaboration, communication, and problem-solving skills.", "responsibilities": "Partner with internal business teams and stakeholders in developing delivery roadmaps and associated system requirements for Financial Planning and Analysis (FP&A). Plan, prioritize, deliver, and support systems solutions related to Anaplan and/or other FP&A planning and forecasting tools. Execute on system implementation projects which involves requirements documentation, systems design, model building/configuration, testing, issue identification, and bug resolution. Organize and manage work through comprehensive documentation to drive project delivery. Architect innovative solutions to automate and scale business systems. Identify constraints and dependencies for technical solutions and effectively manage/communicate to the stakeholders. Develop solution rollout, business continuity, and contingency plans as needed. Perform data analysis and reconciliations, identifying opportunities for process and technical improvement.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/136179253661049542"}