{"title": "Staff Data Scientist, Product Support Platform", "level": "Advanced", "location": "Hyderabad, Telangana, India", "description": "Help serve Google's worldwide user base of more than a billion people. Data Scientists provide quantitative support, market understanding and a strategic perspective to our partners throughout the organization. As a data-loving member of the team, you serve as an analytics expert for your partners, using numbers to help them make better decisions. You will weave stories with meaningful insight from data. You'll make critical recommendations for your fellow Googlers in Engineering and Product Management. You relish tallying up the numbers one minute and communicating your findings to a team leader the next.", "key_qualifications": "Bachelor's degree in Statistics, Computer Science, Engineering, Mathematics, Economics, Physics, or equivalent practical experience. 10 years of experience with statistical data analysis, modeling, experimentation, causal inference, data mining, querying, and managing analytical projects with programming in SQL, Python, or R. 5 years of experience developing and managing metrics or evaluating programs/products. 3 years of experience as a people manager within a technical leadership role.", "preferred_qualifications": "Experience solving unstructured business problems with data science, translating results into business recommendations, and measuring the success of those initiatives. Experience working with Engineers, Product Managers, and UX teams around providing product-centric insights. Experience developing new models, methods, analysis techniques, and model evaluation. Excellent communication and presentation skills, with the ability to deliver findings of analysis.", "responsibilities": "Lead and grow a team of Data Scientists that cover problem definition, metrics development, data extraction and manipulation, visualization, creation, implementation of analytical/statistical models, and presenting to stakeholders. Build an understanding of the data sets used by Customer Engagement Support and its partner teams. Review analysis and business cases conducted by others to provide feedback, address analytical challenges, and conduct problem-solving, including analysis and business cases. Collaborate with Engineering teams to identify and address instrumentation gaps, ensuring accurate data collection for key functionalities.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/136230295857701574"}