{"title": "Senior Manager, Central Cloud Strategic Insights", "level": "Advanced", "location": "Austin, TX, USA", "description": "Financial Analysts ensure that Google makes sound financial decisions. As a Financial Analyst, your work, whether it's modeling business scenarios or tracking performance metrics, is used by our leaders to make strategic company decisions. Excellent at working on multiple projects at a time, you are focused on the details while finding creative ways to address big picture challenges.", "key_qualifications": "Bachelor's degree in Business, Finance, Economics, Statistics, or another quantitative field, or equivalent practical experience. 14 years of experience in financial planning and analysis (FP&A), consulting, or a related function, or an advanced degree. Experience building, developing and leading a team. Experience managing stakeholders", "preferred_qualifications": "Advanced degree in a quantitative discipline (e.g., Statistics, Computer Science, Math, Engineering). Knowledge of advanced analytics techniques and capabilities. Experience pushing the boundaries of data and developing novel approaches to shed new light on difficult questions. Experience successfully scaling an analytic or Strategic Finance function in the Enterprise or B2B, at a fast-paced/high growth technology company. Ability to partner with executive stakeholders to define analysis requirements and priorities, develop and execute strategy, and balance short vs long-term deliverables. Strong business acumen with an understanding of business drivers and value-creation", "responsibilities": "Deliver insights to management on major competitive dynamics and landscape shifts; Perform ad hoc analysis including, but not limited to, competitive strategy reaction, competitive external statements tracking and strategic implications. Incorporate competitive insights into Google Cloud’s long-range planning and influence M&A roadmap development; Collaborate with Strategy & Operations teams to define and quantify the addressable market. Develop a governance model and tracking mechanism to manage data and process for disclosing metrics externally; Establish statistical framework/analyses and surface insights to enable exec-level resource allocation decision making. Drive automation and scale across long-range analytical solutions working with Google Cloud Finance Optimization Office and Corporation partners to deliver best in class solutions. Own the delivery of highly sensitive financial information to regulators including working with alphabet regulatory finance, legal teams and outside counsel", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/136492551593960134"}