{"title": "Market Responsibility Specialist, Trust and Safety, YouTube", "level": "", "location": "Hyderabad, Telangana, India", "description": "Fast-paced, dynamic, and proactive, YouTube’s Trust & Safety team is dedicated to making YouTube a safe place for users, viewers, and content creators around the world to belong, create, and express themselves. Whether understanding and solving their online content concerns, navigating within global legal frameworks, or writing and enforcing worldwide policy, the Trust & Safety team is on the frontlines of enhancing the YouTube experience, building internet safety, and protecting free speech in our ever-evolving digital world.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in data analytics, Trust & Safety, policy, cyber security, or related fields.", "preferred_qualifications": "Experience working with Product Management and Engineers to drive progress on key programs. Experience with SQL and spreadsheet software. Excellent organizational, people management, and project management skills with excellent attention to detail. Effective problem-solving skills and the ability to use data to drive strategy and business action. Ability to build effective relationships with cross-functional partners across geographies. Ability to communicate in one or more additional local languages spoken in India to be able to identify abuse trends.", "responsibilities": "Monitor intel sources, work with cross-functional teams, and leverage deep native market expertise to identify key abuse trends in the India market, monitor emerging sensitive events, and highlight risks to the YouTube ecosystem and Trust and Safety. Identify and propose policy improvements based on market nuances, and support language detection, automation, language quality improvements, and local product launches. Support identification and vetting of external partners. Triage threats, prepare risk assessments, and action plans based on market knowledge, including regional events and escalations, and act as the main point of contact. Drive and support the launch of news related product features in the region.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/136449007806227142"}