{"title": "Technical Program Manager, Google Enterprise Networking", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company. Google Enterprise Networking delivers an internal Enterprise network that provides service to users around the world. The Enterprise Network Engineering team is responsible for making the network reliable and scalable, ensuring Google employees stay connected and productive. We do that by creating designs, developing software tool-chains, and deploying hardware to keep systems running smoothly. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google's cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "- Bachelor's degree in a relevant field, or equivalent practical experience.\n- 2 years of experience managing projects.\n- 2 years of experience with data infrastructure (e.g., copper, fiber optic systems, low voltage telecom/security) in corporate real estate or data center environments.\n- 2 years of experience in developing requests for proposals (RFPs), scheduling projects, cost engineering, budgeting and forecasting costs, reporting project status and costs.", "preferred_qualifications": "- Experience managing vendor relationships with knowledge of standard practices in the design and construction industry.\n- Experience capturing process details and delivering processes.\n- Ability to work with and lead internal/external cross-functional and partner teams to develop scope, project plan, budgets, and schedules.\n- Excellent requirements gathering, resource organization, task prioritization, and scheduling skills.", "responsibilities": "- Define, manage, and drive the delivery of programs by coordinating with global teams to deploy network services in new and existing buildings/spaces. Design, plan, and implement data infrastructure such as fibre, cabling, power, and cooling for server rooms.\n- Partner with network engineers and project managers to deliver technical networking projects, communicate and represent network design and engineering standards on behalf of network engineers in meetings.\n- Develop and maintain regional schedules of building deployments, assist in resource allocation, conflict resolution, communication, and setting customer expectations.\n- Identify and develop opportunities to scale enterprise network delivery using vendor services, manage process mapping, engineering and optimization efforts for segments of the deployment life-cycle, identify pain points.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/136577414309257926"}