{"title": "Product Manager, Machine Learning Infrastructure", "level": "Mid", "location": "Sunnyvale, CA, USA", "description": "At Google, we put our users first. The world is always changing, so we need Product Managers who are continuously adapting and excited to work on products that affect millions of people every day.", "key_qualifications": "- Bachelor's degree or equivalent practical experience.\n- 5 years of experience in product management or a related technical role.\n- 3 years of experience building and shipping technical products.\n- 2 years of experience developing or launching products or technologies within software as a service (SaaS), or a related area.\n- Experience within Cloud Infrastructure, particularly Machine Learning Infrastructure, with compute, networking and storage.", "preferred_qualifications": "- MBA or advanced technical degree.\n- Experience managing products with one of the targeted workloads, such as Machine Learning, training and deploying large machine learning models, or HPC, deploying hardware and software needed to run large batch compute jobs.\n- Experience leading complex strategic and operational initiatives, working through technical, operational, legal/policy, and business issues.\n- Understanding of the AI/ML software stack and Machine Learning frameworks such as PyTorch, TensorFlow, JAX, etc.\n- Excellent communication and presentation skills.", "responsibilities": "- Understand workflows of internal and external experts for workloads, specifically large-scale AI/ML training, and inference.\n- Understand where internal and external experts are running into limits, know how our products can best meet their needs, and shape our product roadmap by building new offerings to best drive growth to Google Cloud Platform (GCP).\n- Work with directors and executives across Google to ensure effective product launches and experience.\n- Drive product strategy and set product priorities, teaming closely with Engineering and cross-functional teams to define and deliver on the next generation of cloud infrastructure services.\n- Understand the cloud Machine Learning infrastructure customer, their unique requirements, and are well versed with foundational Large Language Machine Learning models, their infrastructure and toolkit dependencies, and technical challenges to elastically scaling them.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/136686433397023430"}