{"title": "Display Silicon Validation Lead, Devices and Services", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Engineering, Computer Science, a related field, or equivalent practical experience. 8 years of experience with validation content development using C/C++, IP/Soc characterization, debug infrastructure and automation using scripting languages such as Python. Experience with multimedia IP basics such as DPU, DSI, DP, GPU, ISP.", "preferred_qualifications": "Master's degree or PhD in Electrical Engineering, Computer Engineering or Computer Science, with an emphasis on computer architecture, or a related field. Experience with debug tools like protocol analyzers, oscilloscope, and JTAG debugger. Experience with emulation platforms, FPGAs, or silicon bring up. Familiarity with power or performance measurement of SoCs. Familiarity with display concepts and interfaces.", "responsibilities": "Understand Product Requirements Documents (PRDs), micro architecture document, create validation plan, develop content and execute to validate Display IP and integration at the system level on emulation, FPGA’s, and the post-silicon environment. Work with pre and post-silicon teams to develop, simulate, and validate targeted tests and provide documentation of the pre and post-silicon validation tests and ensure it is easy to use. Get in-depth knowledge of IP and its integration into SoC to debug using lab tools like display analyzers, oscilloscope and logic analyzers and silicon debug tools. Collaborate with cross-functional teams to debug failures (e.g., Architecture, Design, Design Validation, boards, software, manufacturing, thermal issues). Work with internal cross-functional teams, external silicon partners, and intellectual property (IP) vendors to functionally validate and parametrically characterize the silicon, including bare-metal, kernel, drivers, and real-time operating system (RTOS).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/136748983757218502"}