{"title": "Program Manager III, Software Development, Geo Automotive", "level": "Mid", "location": "Seattle, WA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in program or project management. 5 years of experience managing Software Development Life Cycle or Enterprise Applications programs.", "preferred_qualifications": "5 years of experience managing cross-functional or cross-team projects. Experience in building frameworks, improving execution methodology and data-driven approach to relentless continuous improvement. Experience communicating and driving critical outcomes with various stakeholders, internal executives and teams, and external enterprise customers. Experience with program management in software programs, leading distributed engineering teams through the entire life-cycle to customers with hard deadlines and milestones. Experience interacting with diverse technical and non-technical audiences, spanning organizational levels, and overseeing life-cycle of project deliverables.", "responsibilities": "Design and deliver optimized program communication plans including executive and key partner communications. Determine phasing and metrics associated with program life-cycle that address improvement including Resource Stewardship. Determine and collect data required to govern programs and drive stakeholder decision-making. Anticipate change management requirements for program stakeholders. Build trusted relationships with program stakeholders, including managing expectations of senior cross-functional leads and ensuring they have the insights they need to make decisions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/136845101836968646"}