{"title": "Forecast Operations Manager, Google Cloud (English, Spanish)", "level": "Mid", "location": "Mexico City, CDMX, Mexico", "description": "The Forecast Operations Manager is a pivotal role within the Google Cloud Strategy and Operations team, responsible for managing the forecast operations that inform critical business decisions and foster alignment across key stakeholders. This role requires a combination of technical acumen, business understanding, and exceptional stakeholder management skills to translate complex data into actionable insights that drive Google Cloud's growth. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree in Business Administration, Computer Science, Economics, Finance, Mathematics, Statistics, a related field, or equivalent practical experience. 5 years of experience in forecasting, financial analysis, consulting, or a related field. Experience building and maintaining relationships with stakeholders, including executive leadership. Experience in SQL, building dashboards, data collection/transformation, visualization/dashboards, or experience in a scripting/programming language (e.g., Python). Ability to communicate in English and Spanish fluently to engage with local stakeholders.", "preferred_qualifications": "Master’s degree in Business Administration (MBA) or equivalent practical experience. Familiarity with machine learning and other advanced forecasting techniques. Knowledge of and experience with cloud computing technologies. Ability to influence decision-making through data-driven insights and effective communication. Excellent analytical and problem-solving and communication skills with demonstrated attention to detail.", "responsibilities": "Build and nurture relationships with key stakeholders across Sales, Marketing, Finance, Product, and Executive leadership. Proactively communicate forecast updates, gather feedback, and ensure alignment on assumptions and methodologies. Analyze large datasets to identify trends, patterns, and anomalies impacting forecasting accuracy. Distill these insights into clear, actionable recommendations that resonate with different stakeholders. Track forecast accuracy against actual results, identify root causes of variances, and collaborate with stakeholders to implement corrective actions. Identify opportunities to streamline forecasting processes, leverage automation, and improve efficiency, while considering stakeholder feedback and ensuring minimal disruption. Design, develop, and maintain forecasting models that accurately predict Google Cloud's business performance, incorporating feedback and input from diverse stakeholders.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/136895824662536902"}