{"title": "Data Center Equipment Manufacturing Engineer", "level": "Advanced", "location": "Seattle, WA, USA", "description": "Google's custom-designed equipment makes up one of the largest and most powerful computing infrastructures in the world. The Manufacturing Operations team is responsible for providing the manufacturing capability to deliver this state-of-the-art physical infrastructure. As a Manufacturing Engineer, you evaluate the product designs and create the processes, tools and procedures behind Google’s powerful search technology. When vendors build parts for our infrastructure, you’re right there alongside ensuring manufacturing processes are repeatable and controlled. You collaborate with Commodity Managers and Design Engineers to determine Google’s infrastructure needs and product specifications. Your work ensures the various pieces of Google’s infrastructure fit together perfectly and keep our systems humming along smoothly for a seamless user experience.", "key_qualifications": "Bachelor's degree in Electrical Engineering, Process Engineering, Manufacturing Engineering, or equivalent practical experience. 10 years of experience as a Manufacturing, Quality, Reliability, or Product Engineer. 6 years of experience in Product Lifecycle Management (PLM). 5 years of experience with design and implementation of municipal high-voltage applications in data center construction.", "preferred_qualifications": "Master's degree in Engineering or a related field. Experience overseeing yields improvements and cycle time reductions for high-volume and high-complexity parts. Experience with LEAN Manufacturing/5S/8D practices. Experience in commissioning data centers. Ability to influence the product electrical design and manufacturing process. Ability to travel up to 30% of the time.", "responsibilities": "Design, develop, and manage the implementation of scalable manufacturing processes and systems for modular data center products. Optimize for cost, quality, and flexibility. Collaborate with Design, Product Management, and Operations teams to identify and address potential manufacturing roadblocks in early development phases. Analyze and interpret complex production data to drive informed manufacturing strategies. Identify and implement solutions to optimize performance and efficiency across the supply chain. Lead the evaluation, qualification, and strategic development of contract manufacturers with a focus on future capabilities and innovation. Use Product Data Management (PDM) systems to create Bills of Materials (BOM), Approved Vendor Lists (AVL), and manage Engineering Change Notifications/Orders (ECN/O). Lead the Product Lifecycle Management (PLM) team to align forecast and BOM structures.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/137369154217747142"}