{"title": "Software Engineer, Native Development Kit Translation, ChromeOS", "level": "Mid", "location": "Kraków, Poland", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\nA large number of top Android apps use native ARM code. The Native Development Kit (NDK) Translation team is working on a just-in-time binary translator that enables running such code on x86 devices. The team is actively working on translation optimizations and providing compatibility in Android releases.\nChrome OS delivers quality computing at scale to provide universal and unfettered access to information, entertainment, and tools. Our mission is to empower anyone to create and access information freely through fast, secure, simple, and intelligent computing.", "salary": "", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 2 years of experience with software development in one or more programming languages such as C or C++. 2 years of experience with data structures or algorithms. Experience testing, maintaining, or launching software products. Experience with compilers or system programming.", "preferred_qualifications": "Master's degree or PhD in Computer Science or a related technical field. Experience with one or more of the following: Assembly Language, ARM ARM Assembly, X86/Assembly, Android NDK. Experience in embedded system or low-level software development. Experience working with embedded operating systems. Knowledge of Linux or other operating systems.", "responsibilities": "Ensure the correctness of the translation by implementing and maintaining the emulation of ARM instruction sets, Android’s Native APIs and Operating System behavior. Maintain the translation in functioning state within the most recent Android codebase, including emulation of new features introduced to Android. Ensure appropriate applications performance by developing compiler and just-in-time engine optimizations, including performance analysis activities. Maintain translator integration with various Android implementations, including monitoring production metrics and triaging bugs that are specific to apps’ target platforms.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/137327607925351110"}