{"title": "Market HR Country Lead (Japanese)", "level": "Advanced", "location": "Tokyo, Japan", "description": "People Operations strives to revolutionize human resources the same way that Google has revolutionized search. We are helping to find, grow and keep the remarkable assemblage of talent who are our Googlers. You'll be an advocate of Google's culture and values, partnering with our business leaders to help them build their organizations and make sure all people decisions are based on data. Whether coaching our clients on how to lead their teams, navigating and resolving employee relations issues or managing programs that help develop our Googlers, you are exceptionally focused on putting them first, and being as clear and transparent as possible to help Googlers understand how people decisions get made. As the Market HR Country Lead, you will set the market-specific HR strategy for Japan's location to identify and mitigate legal and regulatory risks. You will drive a “One Google” experience and work with counterparts across APAC and the Market HR team. In this role, you will build and own strong relationships within People Operations and across country leadership to develop and execute the Japan country plan. You'll balance strategic and tactical work when needed, working in-depth on risk identification and resolution, and surfacing those themes to inform and drive the local Market HR plan. Great just isn't good enough for our People Operations team (you probably know us better as \"Human Resources\"). Made up of equal parts HR professionals, former consultants, and analysts, we're the advocates of Google's colorful culture. In People Ops, we \"find them, grow them, and keep them\". We bring the world's most innovative people to Google and provide the programs that help them thrive. Whether recruiting the next Googler, refining our core programs, developing talent, or simply looking for ways to inject some more fun into the lives of our Googlers, we bring a data-driven approach that is reinventing the human resources field.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 15 years of experience in HR business partnership roles, at regional or country level. Experience with employment laws, labor relations, and compliance in Japan. Ability to communicate in Japanese fluently to support local relationship management.", "preferred_qualifications": "Experience as an HR Business Partner with expertise in talent, performance, and development initiatives, change management, and employee relations. Experience leading and implementing global, large-scale HR operational projects including system applications, associated risk management/mitigation, and supporting change management, business readiness, communications, and training activities. Ability to influence and partner with all levels of leadership to drive continuous improvement and organizational change. Excellent communication skills, with ability to communicate large, complex changes across multiple stakeholder groups.", "responsibilities": "Identify local employment, labor relations, and compliance risks and partner with critical stakeholders such as Employee Relations, Labor Relations, Legal, and Compliance to create forward looking solutions and resolve issues in a timely manner. Lead People Operations related audits and regulatory reviews initiated by local governments and external entities to ensure compliance. Represent Google in external associations and establish strong relationships with industry forums, networks, governments, and labor councils. Act as point of contact for Center of Excellence (COE) to provide input to new solutions and services, and support COE in driving change in Japan. Work with country and regional Market HR counterparts and community to drive consistency in the delivery of Market HR services.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/137480521109119686"}