{"title": "Strategy and Operations Lead, Global Affairs", "level": "Mid", "location": "Austin, TX, USA; Chicago, IL, USA", "description": "The mission of Global Affairs (GA) is to help people around the world by promoting responsible innovation and building trust in the potential of technology. GA operates at the forefront of many of Google's biggest issues and includes the organizations that are responsible for the company’s public policy, legal, trust and safety, compliance, and charitable functions.", "key_qualifications": "6  years of experience in a management consulting, operations, business strategy, investment banking, venture capital or private equity role, or 4 years of experience with an advanced degree. 3 years of experience working with executive stakeholders. 2 years of experience developing business strategies or managing cross-functional initiatives.", "preferred_qualifications": "MBA or Master's degree in a management, technical, or engineering field. 8 years of experience in strategy consulting, software, internet, or early stage technology companies. Experience in structuring and executing complex analyses to support strategy in a fast-paced, constantly evolving environment. Proven leader with excellent project management, problem solving/analysis, written/verbal communication, and people skills.", "responsibilities": "Work with executive leadership to define, launch, and drive strategic and operational initiatives. Work with cross-functional stakeholders and leaders to gather relevant data and conduct business analysis with effective project communication and management. Resolve issues to deliver strategic insights and recommendations based on business analyses to leadership. Structure and implement operational and strategic initiatives by developing work plans, gathering and synthesizing relevant data, leading analyses, and developing final recommendations. Develop recommendations through implementation and results.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/137554903164691142"}