{"title": "Technical Program Manager, Safety Compliance", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "Google's projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You're equally at home explaining your team's analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers. Using your extensive technical and leadership expertise, you manage projects of various size and scope, identifying future opportunities, improving processes and driving the technical directions of your programs. Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "key_qualifications": "Bachelor's degree in engineering or a relevant field, or equivalent practical experience. 2 years of experience managing projects with consumer electronics. 4 years of experience in safety certification (e.g., IEC 62368-1, IEEE 1725, UL 1642, UL 2054).", "preferred_qualifications": "Experience of safety hazard identification and risk analysis, including means for mitigation. Experience with product safety analysis and investigation and product recall. Experience working within safety testing, test lab quality management systems, in compliance with ISO 17025. Experience with international certification schemes for information technology equipment (e.g., CE marking, CB scheme, GS, RCM, BIS, PSE, BSMI). Ability to perform safety testing.", "responsibilities": "Drive safety and certification requirements across development teams, testing labs, suppliers, and manufacturing partners. Troubleshoot compliance issues, coordinating solutions with internal and external engineering teams and partners/suppliers. Define/oversee hardware certification test requirements and validate testing reports for accuracy, completeness, and ensure all mandatory requirements are accounted for in filing packages. Communicate certification status and issues in a clear and timely manner to all impacted teams. Prepare hardware samples and submit them to test labs for product safety certification testing.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/137598816856482502"}