{"title": "Machine Learning Analyst, Trust and Safety, Google Cloud", "level": "Mid", "location": "Bengaluru, Karnataka, India; Hyderabad, Telangana, India", "description": "Trust & Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you're a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety. At Google we work hard to earn our users’ trust every day. Trust and Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions to stop abuse and provide safe and trusted experiences for our users. As a member of the Google Cloud Platform (GCP) Protection Analytics team, you’ll help deliver trusted experiences for Google Cloud users by building products that prevent abuse while ensuring Google Cloud customers are able to seamlessly grow on Cloud. We are a small team with a big outlook and we leverage our user trust expertise, and a cross-product perspective to build and deliver enterprise-ready, industry-leading solutions. At Google we work hard to earn our users’ trust every day. Trust & Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.", "salary": "", "key_qualifications": "Bachelor’s degree or equivalent practical experience.\n4 years of experience analyzing, extracting, and visualizing valuable insights from datasets.\nExperience building machine learning solutions (e.g., data exploration, feature engineering, modeling) that were integrated into production systems.", "preferred_qualifications": "Experience delivering problem solving recommendations that are adopted by an organization and drive real-world business impact.\nAbility to effectively collaborate with teammates as well as independently drive work streams forward and overcome any obstacles that arise.\nExcellent communication skills, with the ability to effectively and concisely convey the results of your work both verbally and in short write-ups.", "responsibilities": "Develop an understanding of the business problems our team works on in order to lead the ideation, design, and development of analytical solutions to solve them.\nPerform data analysis to drive decision-making for our team, such as monitoring the rollout of new models, analyzing the impact of machine learning model changes, or investigating the root cause of unanticipated changes in key metrics.\nEvaluate new features and data sources to use in modeling, both to improve existing model performance and to adapt new potential model use cases.\nIdentify the right metrics needed to evaluate model changes and launches, including coming up with new metrics where needed and use those metrics to drive decision making.\nProduce dashboards, short write-ups, and data visualizations to convey your findings and recommendations to our team and cross-functional stakeholders.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/137536604993397446"}