{"title": "Technical Program Manager III, Regulatory Risk and Compliance", "level": "Mid", "location": "Reston, VA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.", "key_qualifications": "Bachelor's degree in a technical field, or equivalent practical experience. 5 years of experience in program management. 5 years of experience supporting regulatory compliance initiatives. 5 years of experience analyzing regulation and using the insights to inform product development. Experience with risk management or compliance in regulated industries (e.g., financial services, public sector, healthcare).", "preferred_qualifications": "5 years of experience managing cross-functional or cross-team projects. Experience with Infrastructure systems, security assessments, and security processes. Experience in communicating technical concepts to non-technical audiences. Experience with cloud engineering practices. Experience in problem-solving within fast-paced and constantly changing environments. Ability to work non-standard hours and engage with a globally distributed team.", "responsibilities": "Support stakeholders in designing appropriate remediation plans for Cloud products and services to meet regulatory requirements. Engage with engineering directors, product leaders and other Technical Program Manager (TPM) groups, to simplify and streamline how compliance requirements are incorporated into cloud products and services. Cultivate trusted technical and business partnerships across Cloud product teams and stakeholders to identify, assess, and resolve recurring compliance issues. Manage multiple cross-functional programs simultaneously with engaged priorities. Apply investigative, problem-solving, negotiation, and organizational skills to disambiguate regulatory requirements and act as a bridge to our Product and Engineering teams.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/137774553496462022"}