{"title": "Strategy and Operations Associate, Go-to-Market", "level": "Mid", "location": "Tokyo, Japan", "description": "The Go-to-Market Operations (GTM) team ensures that Google's ads business runs smoothly. We are instrumental in setting the go-to-market strategy and guiding flawless execution and operations against the strategy. We stay focused on aligning the company priorities with strong day-to-day operations, while also helping to evolve early stage ideas into future-growth initiatives. We have teams embedded in each of the major Ads business areas, and global teams that work across the business areas. As a Sales Strategy and Operations Associate, you will provide business critical insights and recommendations that support decision making, cross functional alignment of goals and expectations, and drive/help teams to execute plans and operate. By closely working with Sales Strategy and Operations Managers, you will be running the business cadence, helping the organization navigate the complexities of systems and tools, as well as collaborating with cross-functional teams to solve problems, design, manage and successfully deliver projects against operational standards. As a GTM team member, you help to set the focus, pace and direction of our business across teams to deliver on Google’s most important business opportunities by championing, challenging and enabling our sales organization. The Go-to-Market Operations (GtM) team ensures Google's complex and ever-evolving Ads business runs smoothly. We are instrumental in setting go-to-market strategy, and ensuring flawless execution and operations against the strategy. We have teams embedded in each of the major Ads business areas as well as global teams that work across the business areas. Team members are analytical and strategic, with a pragmatic sense of how to get things done.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience in management consulting, sales operations, business strategy, investment banking roles, or digital ads sales. Ability to communicate in English and Japanese fluently to interact with internal and external stakeholders.", "preferred_qualifications": "Knowledge of digital ads and Google’s business. Ability to be a collaborator with ideas, energy, determination, and a passion for the Internet who can work with people from a broad range of backgrounds and experience. Ability to thrive and exercise judgment in a ambiguous environment. Ability to be comfortable using business intelligence and dashboards and analysing large data sets. Excellent communication, people management, and presentation skills, as well as the ability to write well and convey complex issues clearly.", "responsibilities": "Provide strategic, analytical, and day-to-day operational activities for large Customer sales team. Perform data analysis and modeling to identify trends and efficiency opportunities. Build and maintain tools and dashboards to help with reporting and needs of the team and key stakeholders. Engage in ad-hoc analyses to understand business performance, user metrics, KPI’s and provide concise summaries and recommendations to management. Identify process gaps and opportunities for process improvement. Define and solve problems/opportunities that impact the business organization.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/137747772429214406"}