{"title": "Staff Software Engineer, Mobile (Android), YouTube", "level": "Advanced", "location": "San Bruno, CA, USA", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.", "salary": "$189,000-$284,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in software development, and with data structures/algorithms. 5 years of experience testing, and launching software products, and 3 years of experience with software design and architecture. 5 years of experience with Android application development.", "preferred_qualifications": "Master’s degree or PhD in Engineering, Computer Science, or a related technical field. 3 years of experience in a technical leadership role leading project teams and setting technical direction. 3 years of experience working in a complex, matrixed organization involving cross-functional, and/or cross-business projects.", "responsibilities": "Provide technical leadership on high-impact projects. Influence and coach a distributed team of engineers. Facilitate alignment and clarity across teams on goals, outcomes, and timelines. Manage project priorities, deadlines, and deliverables. Design, develop, test, deploy, maintain, and enhance large scale software solutions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/137829248831234758"}