{"title": "Software Engineering Manager, Play Search Getaway", "level": "Advanced", "location": "Mountain View, CA, USA", "description": "Like Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). 3 years of experience in a technical leadership role; overseeing projects, with 2 years of experience in a people management, supervision/team leadership role. 3 years of experience with machine learning algorithms and tools, or applied machine learning (e.g., LLM's, Generative AI, NLP, recommendations). 3 years of experience with recommendations or ranking systems.", "preferred_qualifications": "Master's degree or PhD in Computer Science or related technical field. 3 years of experience working in a changing organization.", "responsibilities": "Lead a team to develop query recommendation frameworks to serve content to users, align strategy, processes, and decision-making across teams. Set clear expectations with individuals based on their level and role and align to the broader organization's goals, meet regularly with individuals to discuss performance and development, and provide feedback and coaching. Use data-driven insights to optimize search entry point performance and identify growth opportunities. Design, guide, and vet system designs within the scope of the broader area, and write product or system development code to solve ambiguous problems. Lead a team to design, build, and launch machine learning models to improve user engagement and contempt quality in search entry points.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/137979219425534662"}