{"title": "Lease Operational and Systems Accountant, Technical Infrastructure", "level": "Mid", "location": "Chicago, IL, USA", "description": "Google accountants are a savvy bunch who handle the core accounting responsibilities at Google. You know your accounting principles and the full accounting process end to end. You'll advise on financial reports required by governmental regulations, and review, analyze, and interpret financial and budgetary reports. Every day is a new challenge, and you're continually looking for ways to help our team become more efficient and effective. A team player at heart, you collaborate with our global team, advocate best practices and pitch in where needed. You move fast while keeping your attention to detail, and you tap into your problem-solving skills to support business objectives. You'll lead an accounting process from end-to-end. Other responsibilities include reconciling balance sheets and P&L accounts, and providing supplementary financial information for internal and external reports. As an Accountant, you will handle the core accounting responsibilities at Google. You will support the global accounting operations and systems for the Technical Infrastructure (TI) lease accounting tower. TI leases include third-party data centers, co-located facilities, and dark fiber. This infrastructure is at the foundation of Google, the global data centers, networks and integrating hardware and software that powers both our unique customer products and services and our internal operations. As a member of this team, you know your accounting principles and understand the full accounting process. Every day is a new challenge, and you're continually looking for ways to help our team get better at what we do, in the most efficient way possible. The name Google came from 'googol,' a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.", "salary": "$99,000-$145,000", "key_qualifications": "Bachelor's degree in Accounting or Finance, or equivalent practical experience. 4 years of experience in accounting or a related function, or 1 year of experience with an advanced degree in Accounting, Business, or Finance.", "preferred_qualifications": "Certification in CPA/CA, or equivalent. Experience with specialized areas of accounting including ASC 842 or IFRS 16 lease accounting standards and fixed asset/construction accounting. Experience with spreadsheets and presentation software, SQL, and SAP. Ability to work in a cross-functional, fast-paced environment, and to support complex operational initiatives. Excellent problem solving skills, with the ability to communicate effectively with executive management.", "responsibilities": "Manage operational accounting for Technical Infrastructure (TI) lease population including month-end close and quarter-end 10Q/10K reporting support for lease disclosures. Manage the Technical Infrastructure lease accounting system gLATO (Google Lease Accounting Tool) and related workflows and working with various teams on any necessary changes/updates. Review significant agreements and work with the Technical Infrastructure lease accounting advisory team for proper accounting treatment. Work cross-functionally with business advisors, United States GAAP Accounting teams, entity leads, and International Controllership. Identify opportunities for process improvements, system improvements, and drive implementation of the solutions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/137969745465877190"}