{"title": "Data Center System Architect", "level": "Mid", "location": "Seattle, WA, USA", "description": "Our thirst for technology is a part of everything we do. The Data Center Engineering team takes the physical design of our data centers into the future. Our lab mirrors a research and development department -- cutting-edge strategies are born, tested and tested again. Along with a team of great minds, you take on complex topics like how we use power or how to run state-of-the-art, environmentally-friendly facilities.", "key_qualifications": "Bachelor's degree in Electrical Engineering, Mechanical Engineering, Computer Science, or equivalent practical experience. 5 years of experience in the design of Data Center Systems Engineering, system architecture, design and integration. 5 years of experience coordinating work with outside design consultants on new Data Center designs from layout construction documents. 4 years of experience with designing reconfigurable modular interfaces for Data Centers.", "preferred_qualifications": "Master's degree or PhD in Electrical Engineering, Industrial Engineering, or Mechanical Engineering. 10 years of experience in data center design, development and construction. Experience in reading civil drawings produced by vendors and flagging coordination items that deviate from a standard civil configuration (e.g., skeleton model). Knowledge of civil construction methodologies and timelines, and ability to provide impact assessments based on deviations.", "responsibilities": "Ensure designs and installations meet requirements (e.g., predicted cooling, structural, operational concerns, etc.). Lead investigations and innovations in flexible building layouts that balance minimizing day one impact, while maximizing scalability in incremental phases and efficiency of overall space utilization for master planning. Define, implement, and maintain critical data center system architecture and interfaces between and within product areas to enable modular introduction and incremental phasing of new technologies into the data center fleet. Drive development of solutions with our partners and play a key role in driving, influencing, and evolving the strategy to adapt to a modular, multidisciplinary product development approach.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/137990890999161542"}