{"title": "UX Design Manager, Gemini", "level": "Advanced", "location": "New York, NY, USA", "description": "At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" Google’s UX leaders help define and drive the future of Google design. They create and clarify product strategy, conceptualize UX ecosystems in ways that mitigate complexity, and inspire teams to push the boundaries of what’s possible. They possess a clear vision of the future of user experience and have the courage to pursue forward-thinking design. Google User Experience (UX) is made up of multi-disciplinary teams of UX Designers, Researchers, Writers, Content Strategists, Program Managers, and Engineers: we care deeply about the people who use our products. You are a thoughtful team leader, manager, systems-level design thinker, and visionary - with strong instincts and outstanding intuition informed by user needs and insights. You'll be responsible for guiding the careers of your team members, working closely with each of them to help them realize their full potential. UX Design Managers are fierce advocates for the people who use our products as well as the members of their teams. They have a practiced eye for effective design, and are committed to creating elegantly simple user experiences from otherwise complex workflows. In this role, you’ll take the time to understand not just the execution side of UX, but also the business aspects of the products we build. You’ll collaborate with leaders of other UX, Engineering, and Product Management teams to create innovative experiences across all of Google’s products, leveraging your passion for brand, craft, and design quality. A conversational AI tool that enables users to collaborate with generative AI and help augment their imagination, expand their curiosity, and enhance their productivity.", "salary": "$168,000-$252,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 8 years of experience in product design or UX. 3 years of experience leading design projects and managing people or teams.", "preferred_qualifications": "Master's degree in Design, Human-Computer Interaction, Computer Science, or a related field. 5 years of experience working in a complex, cross-functional organization. 3 years of work experience working with executive leaders.", "responsibilities": "Influence stakeholders across functions to gain support for design strategies.  Drive the development of innovative design solutions to user, product, and business problems.  Drive a holistic design process, design system, or design language across teams or products.  Deliver improvements in design based on UX testing and stakeholder input, and provide guidance and expertise to effectively engage stakeholders on product design to achieve product goals.  Drive project priorities in alignment with larger project goals, coordinate allocation of resources within the design project, and guide team members to develop individual OKRs.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/138042605626630854"}