{"title": "Systems Development Engineer, Google Distributed Cloud", "level": "Mid", "location": "Seattle, WA, USA; Sunnyvale, CA, USA", "description": "The Operations Suite Experience (OSE) team is responsible for selecting, curating, integrating, and configuring tools and products that are able to take the business objective of operating and translate them into service specific workflows and configuration. OSE works with the Operations Suite Automation team, which is responsible for the automation of deployment and upgrades to all operator tools. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$122,000-$178,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 3 years of experience with technical infrastructure (e.g., deployment, maintenance, troubleshooting), and with reliability of technical infrastructure. 3 years of experience in data center operations, hardware, or design.", "preferred_qualifications": "Experience with Linux system administration, scripting, and cloud platforms. Experience with systems design, automation, and troubleshooting IT issues.", "responsibilities": "Troubleshoot GDCE installation problems, customer workload migration errors, and machine repair tasks. Act as the primary contact for field deployers facing challenges, ensuring timely issue resolution, and meeting SLAs. Participate in on-call rotations, identify recurring issues, develop automated solutions, and collaborate with hardware vendors and internal labs to maintain product quality and alignment.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/138165014610485958"}