{"title": "Health Enterprise Product Planning Lead", "level": "Mid", "location": "San Francisco, CA, USA; Mountain View, CA, USA", "description": "Product and Business Strategy Leaders bring together teams across Google’s functions to help products execute optimally. Our team pushes Google to scale at key points that refine our products and infrastructure by executing efficiently, bringing solid business sense and sound judgment, and working effectively across organizational lines. Our roles often include components of strategy (e.g. analyzing and understanding new trends in the industry, building business plans), operations (e.g. running the cadence of organizations, connecting the operating lines between our functions), and communications. Our team partners with senior leadership to run important functions that cross-cut our existing organizations and deliver high impact projects. We help Engineers, PMs, UX, and all of our other functions to build amazing products that delight our users, and then get those products into their hands. The Health Business Management team is responsible for business outcomes for Health. We manage the core Health Business and incubate and accelerate new initiatives to drive long-term success for the business.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in management consulting, product management and strategy, or analytics in a technology company. Experience working with and analyzing data, and managing multiple projects.", "preferred_qualifications": "Advanced degree or equivalent practical experience. Experience working with Product and Engineering teams. Experience with a tech/healthcare company. Excellent problem-solving and modeling skills (e.g., in strategy consulting or investment banking).", "responsibilities": "Deliver business outcomes for Health's Enterprise business, including Fitbit Health Solutions, business and gross profit goals. Develop strategies to grow the business long-term by structuring complex business questions, gathering and analyzing large amounts of information, and developing compelling, insightful recommendations. Drive consensus and decisions among Health's Enterprise Sales team, Business Development team, and other cross-functional stakeholders. Work closely with Sales, Business Development, Product Managers, and executive leaders to operationalize recommendations. Own Health's overall long-range device forecast. Create and update Health's overall device forecast model (direct, retail, and enterprise). Develop and model scenarios to continually improve Health's long-range business outlook. Partner with Strategy, Finance, Sales, and executive leadership to develop and author Health's long-range strategic and financial plan.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/138131860617077446"}