{"title": "Enterprise Architect, Google Cloud Professional Services", "level": "Advanced", "location": "Singapore", "description": "As an Enterprise Architect, you will work on transformational projects with customers to design cloud-ready infrastructure and application architectures, develop solutions in migrating, building, modernizing and maintaining applications in Google Cloud Platform, troubleshoot potential platform challenges, and more. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree in Computer Science, Math, a related technical field, or equivalent practical experience. 7 years of experience performing customer-facing services focused on translating enterprise customer needs into cloud architectures and approaches. Experience writing software in one or more languages (e.g., Java, Python, Go, etc.)", "preferred_qualifications": "Experience developing software or internet Infrastructure/migration solutions in virtual environments. Experience working with channel partners, systems integrators, and third-party developers to deliver successful solutions. Experience designing and deploying distributed data processing systems with one or more technologies (e.g., Oracle, SQL Server, MongoDB, Hadoop, etc.). Experience with cloud architectural capabilities with enterprise use cases. Experience with standard IT security practices (e.g., identity and access management, data protection, encryption, certificate and key management). Knowledge of containerization and orchestration technologies, with experience automating infrastructure provisioning, DevOps, or continuous integration/delivery.", "responsibilities": "Provide leadership on enterprise-wide cloud architecture and migration planning for both scoping and delivery. Document migration paths, integration strategies, and application architectures to implement solutions using best practices on Google Cloud. Engage at executive stakeholder level with customers providing a single point of technical contact for the customer into the consulting delivery team. Provide technical architecture and enterprise-wide Google Cloud subject matter expertise, oversee technical delivery excellence, exceptional customer satisfaction, and accurate estimation of customer outcomes in partnership with the delivery teams. Drive the capturing, developing, and sharing of best practices internally and externally to accelerate implementation.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/138270820324516550"}