{"title": "Senior Software Engineer, Android, Google Pixel", "level": "Mid", "location": "Warsaw, Poland", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 5 years of experience with software development in one or more programming languages, and with data structures/algorithms. 3 years of experience testing, maintaining, or launching software products, and 1 year of experience with software design and architecture. Experience with mobile application development or Android framework development. Experience working on Java or Kotlin.", "preferred_qualifications": "Master's degree or PhD in Computer Science or related technical field. Experience developing accessible technologies. Experience on Swift or C++. Background or engineering experience in Android.", "responsibilities": "Design, develop, and maintain software solutions that improve the user's Pixel experience. Define and implement Pixel-specific capabilities that make Pixel stand out amongst all Android devices. Ensure seamless integration of AI capabilities into Pixel's software and hardware components. Work closely with UX designers to advocate user-centric, intuitive design principles and advocate for user delight and accessibility. Collaborate with hardware, product management, and other teams to bring Pixel's unique features and experiences to market. Explore and experiment with new mobile and AI technologies, pushing the boundaries of what’s possible on mobile devices. Guide junior engineers in technical feature development. Review technical designs from the team and guide technical discussions. Review experiments and guide project direction based on empirical data.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/138331193606054598"}