{"title": "Tech Lead, Software Engineering, People with Disabilities", "level": "Advanced", "location": "São Paulo, State of São Paulo, Brazil; Belo Horizonte, State of Minas Gerais, Brazil", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nGoogle is an engineering company at heart. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on users around the world. At Google, engineers not only revolutionize search, they routinely work on scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, social to local, Google engineers are changing the world one technological achievement after another.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, related field, or equivalent practical experience. 8 years of experience in software development, and with data structures/algorithms. 5 years of experience testing, and launching software products, and 3 years of experience with software design and architecture. Ability to communicate in English and Portuguese fluently.", "preferred_qualifications": "4 years of experience in a technical leadership role. 2 years of experience managing teams of software engineers. Experience designing and implementing any of the following: large-scale distributed systems, APIs used by other developers, Search Ranking systems, ML (Machine Learning) systems.", "responsibilities": "Design, develop, test, deploy, maintain, and improve software. Research, conceive, and develop software applications to extend and improve on Google's product offering. Collaborate on scalability issues involving access to data and information. Manage individual and team priorities, deadlines, and deliverables.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/138428581010121414"}