{"title": "UX Interaction Designer", "level": "Mid", "location": "Bengaluru, Karnataka, India; Hyderabad, Telangana, India", "description": "At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" Google’s Interaction Designers take complex tasks and make them intuitive and easy-to-use for billions of people around the globe. Throughout the design process—from creating user flows and wireframes to building user interface mockups and prototypes—you’ll envision how people will experience our products, and bring that vision to life in a way that feels inspired, refined, and even magical.\nGoogle User Experience (UX) is made up of multi-disciplinary teams of UX Designers, Researchers, Writers, Content Strategists, Program Managers, and Engineers: we care deeply about the people who use our products. The UX team plays an integral part in gathering insights about the attitudes, emotions, and behaviors of people who use our products to inspire and inform design. We collaborate closely with each other and with engineering and product management to create industry-leading products that deliver value for the people who use them, and for Google’s businesses.\nAs an Interaction Designer, you’ll rely on user-centered design methods to craft industry-leading user experiences—from concept to execution. Like all of our UX jobs, you’ll collaborate with your design partners to leverage and evolve the Google design language to build beautiful, innovative, inspired products that people love to use.\nAt Corp Eng, we build world-leading business solutions that scale a more helpful Google for everyone. As Google’s IT organization, we provide end-to-end solutions for organizations across Google. With an inclusive mindset, we deliver the right tools, platforms, and experiences for all Googlers as they create more helpful products and services for everyone. In the simplest terms, we are Google for Googlers.", "key_qualifications": "Bachelor's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 4 years of interaction design experience in product design or UX design. Include a portfolio highlighting multiple projects that demonstrates experience designing user experiences.", "preferred_qualifications": "Experience designing across multiple platforms, and working with technical/design teams to create user flows, wireframes, and building user interface mockups and prototypes. Experience collaborating with Engineers, Content Strategists, and Product Managers throughout the design process. Experience working in a cross-functional organization and leading design projects.", "responsibilities": "Create new designs, user flows, wire-frames, mocks, and prototypes, and communicate design intent to both internal and external teams. Collaborate with cross-functional partners to understand, define, and explore the problem space. Partner with and leverage UX research to inform design decisions and validate concepts. Deliver design specs and work with engineers to ensure quality execution.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/138495877147697862"}