{"title": "Business Analyst, Google Workspace Growth Marketing", "level": "Mid", "location": "San Francisco, CA, USA; New York, NY, USA; Sunnyvale, CA, USA", "description": "As a Marketing Insights Manager at Google, you develop and implement research studies that provide foundational learning to inform business/product strategy, product development, as well as insights/measurement to inform and measure GTM (go-to-market) strategy and campaigns. You understand consumers, and have the ability to link insights to strategy and translate complex ideas into simple and intuitive communications. You are also a thought leader who is curious and passionate about data. You know how to get the best out of vendors/agencies and you manage workload by balancing future logistical and strategic needs. As the Business Analyst for Google Workspace, you will be responsible for deeply understanding the customer lifecycle (onboarding, upgrades, churn, etc.). You will define, track, and drive analysis on key success metrics, deriving insights that drive business and inform our growth strategy.", "salary": "$130,000-$194,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in a business analytics, data science, management consulting, business intelligence, or corporate strategy role. Experience using SQL.", "preferred_qualifications": "Experience in marketing analytics focused on the customer lifecycle (engagement, upsell, retention, etc.). Experience defining and tracking North Star/success metrics at a regular cadence. Demonstrated ability to work independently, solve ambiguous problems, and collaborate cross-functionally with engineering and product. Effective communication skills and ability to drive discussions and presentations at all levels of the organization. Excellent project management skills.", "responsibilities": "Prioritize and execute sophisticated quantitative analyses and advanced modeling that deliver actionable insights to improve performance. Drive operating cadence, goal setting, and tracking of success metrics and key drivers of business for the Lifecycle and Activation marketing team (onboarding, upgrades, etc.). Be the expert on the core metrics, and drive cross-functional alignment on success metrics and tracking methodologies. Help Marketers understand their impact on topline business metrics and find points of leverage for re-prioritization. Forecast impact of proposed marketing campaigns, along with channel attribution. Partner with PM, Engineering, and Business leadership to define and communicate the strategic narrative in a way that can be shared with a variety of audiences (senior leadership to new employees).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/138570218937950918"}