{"title": "Software Engineer, Embedded Systems and Firmware, PhD University Graduate", "level": "Mid", "location": "Mountain View, CA, USA; Madison, WI, USA; Raleigh, NC, USA; Durham, NC, USA; Seattle, WA, USA; San Francisco, CA, USA; Sunnyvale, CA, USA", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "salary": "$136,000-$200,000 + bonus + equity + benefits", "key_qualifications": "PhD degree in Computer Science, Electrical Engineering, Mathematics, or Information Technology, or equivalent practical experience. Development experience in embedded systems/firmware design. Experience coding in C or C++.", "preferred_qualifications": "Knowledge of Unix/Linux environments, and kernel development. Knowledge of one or more of the following: Microcontrollers, SoC, device drivers, hardware bringup, power management, ARM processors, performance optimization, file systems, bootloading, firmware, x86 assembly, system BIOS or hardware/software integration. Ability to start in 2024.", "responsibilities": "Specific responsibilities vary by project area. Write server-side code for web-based applications. Develop prototypes quickly and create robust high-volume production applications. Develop for specialist domains (i.e., client application development for Windows/Mac (Chrome, Toolbar, etc.), embedded systems and mobile apps (Android), developer tools (IDEs, large-scale build systems, compilers), infrastructure, internationalization, networking, and more). Develop low-level Operating Systems code (Linux kernel, device drivers, etc.) and low-level networking.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/138682657283154630"}