{"title": "Metro Network Deployment Engineer, Prod Edge Field Deployment", "level": "Early", "location": "Singapore", "description": "The Network Delivery Implementation team is responsible for operating networks reliably and at scale. The team owns the full life-cycle of all space, power, and network assets in Google’s data centers and metro points of presence globally. The team is involved from site acquisition to construction and is accountable for what space and power is delivered. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience with Network Installation, Network Configuration, Network Infrastructure, Network Operations, Optical Engineering and Operations, IP, Project Management, or Influencing.", "preferred_qualifications": "Experience in directing field operation technicians, engineers, or vendors in a telecommunication environment. Experience collaborating across multiple levels and functions. Knowledge of ISP/OSP Network Architecture, Data Center Architecture. Ability to engage/influence tactical and strategic decision-making.", "responsibilities": "Manage oversight and Quality Assurance (QA) of installation technicians for rack, stack, and installation of networking equipment. Test and commission routers, optical transport equipment, and other network devices in new and existing network nodes across Google global networks. Generate implementation plans and provide technical leadership and guidance during deployment activities. Work with project management, network engineering, and other engineering teams to identify problems in network installations, and in facility power (AC/DC), cooling, security/access, rack layout, and cable management. Own network documentation, update, and maintain network drawings and plans.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/138624264658920134"}