{"title": "Country Operations Manager (Fixed-Term Contract) (English, Polish)", "level": "Mid", "location": "Warsaw, Poland", "description": "The Business Strategy & Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. As a Manager for Country Strategy and Operations, you will navigate and partner with cross-functional leads beyond Ads, along with business critical key priorities.", "key_qualifications": "Experience in consulting or similar work requiring program or project management.\nAbility to communicate in English and Polish fluently as this role requires interactions with local stakeholders.", "preferred_qualifications": "Experience in working within organizations that navigate external change (e.g., engagement with institutional stakeholders, regulations, reputation).\nAbility to grow in ambiguity and work in a fast-changing environment, with an entrepreneurial approach.\nExcellent people management skills to work across various functions and influence stakeholders.\nExcellent communication skills with strong executive presence and demonstrated influencing skills.\nExcellent data analysis and problem-solving skills coupled with strong business acumen.", "responsibilities": "Partner with the executive leads in Central Eastern Europe (CEE), especially Poland, and other CEE countries to set and drive cross-functional priorities beyond Google Ads.\nManage projects with an operating rhythm and governance framework that ensure priorities are being managed effectively towards success, and decisions are being taken in an efficient manner.\nServe as an advisor to the executive stakeholders in respective projects and provide them with insights, analysis and proposals that support decision-making processes.\nDrive best-practice sharing across similar markets and EMEA.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/138643382430769862"}