{"title": "UX Researcher, Corp Eng", "level": "Mid", "location": "Hyderabad, Telangana, India; Bengaluru, Karnataka, India", "description": "At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" User Experience Researchers (UXRs) make this possible. Google User Experience (UX) is made up of multi-disciplinary teams of UX Designers, Researchers, Writers, Content Strategists, Program Managers, and Engineers: we care deeply about the people who use our products.  The UX team plays an integral part in gathering insights about the needs, attitudes, emotions, and behaviors of people who use our products to inspire and inform design. We collaborate closely with each other and with engineering and product management to create industry-leading products that deliver value for the people who use them, and for Google’s businesses. As a User Experience Researcher (UXR), you’ll help your team of UXers, product managers, and engineers understand user needs.   You’ll work with stakeholders across functions and levels and have impact at all stages of product development. You’ll play a  critical role in creating useful, usable, and delightful products.  You’ll explore user behaviors and motivations by conducting primary research such as field studies, interviews, diary studies, participatory workshops, ethnography, surveys, usability testing, and logs analysis. The UXR community at Google is unique and will help you do your best work. You’ll have the opportunity to work with and learn from UXRs across Google through regular meetups, mentor programs, and access to internal research tools. At Corp Eng, we build world-leading business solutions that scale a more helpful Google for everyone. As Google’s IT organization, we provide end-to-end solutions for organizations across Google. With an inclusive mindset, we deliver the right tools, platforms, and experiences for all Googlers as they create more helpful products and services for everyone. In the simplest terms, we are Google for Googlers.", "salary": "", "key_qualifications": "Bachelor's degree in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, related field, or equivalent practical experience. 4 years of experience in an applied research setting, or similar. Experience with research design utilizing various methods (e.g., usability studies, contextual inquiry, surveys, etc.). Include a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link and/or access instructions).", "preferred_qualifications": "Master's degree or PhD in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, or related field. 3 years of experience working with executive leadership (e.g., Director level and above). 2 years of experience conducting UX research on products, managing projects, and working in a large, matrixed organization. Experience in a variety of product spaces, applied research or academic settings. Experience in communicating user research findings with cross-functional partners to drive impact. Understanding of the strengths and shortcomings of different research methods, including when and how to apply them during the product development process.", "responsibilities": "Conduct separate research on multiple aspects of products and experiences. Collect and analyze user behavior through lab studies, field visits, ethnography, surveys, benchmark studies, server logs and online experiments (A/B testing). Work with Designers, Product Managers, Engineers and other UXRs to prioritize research opportunities in a fast-paced, rapidly changing environment. Understand and incorporate complex technical and business requirements into research. Advocate research findings to diverse audiences through written reports and in-person presentations.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/138671349915624134"}