{"title": "Global Commodity Manager, Thermal", "level": "Mid", "location": "Taipei, Taiwan", "description": "As a Global Commodity Manager, you will be responsible for all aspects of supplier development and ongoing performance management regarding Google's technology and business needs. You will help to develop and execute Google's material acquisition strategy and reduce total cost of ownership for servers, storage, and networking hardware, in support of our infrastructure deployment that powers all of Google's services.", "key_qualifications": "Bachelor's degree in Engineering, Supply Chain Management, or equivalent practical experience. 5 years of experience in commodity management or supply chain management. Experience with global thermal supply base and technologies for server and storage infrastructure.", "preferred_qualifications": "Master's degree in Mechanical Engineering or a related field. Experience in thermal management from infrastructure to chip including next generation cooling technologies, materials, components, and solutions. Ability to work in ambiguous situations, and resolve conflicts while working cross-functionally with internal/external partners. Ability to drive change with a long-term perspective across multiple functions and transform the business. Excellent leadership, management, business acumen, decision-making, and analytical skills.", "responsibilities": "Conduct high-level discussions and secure comprehensive agreements with supplier executives. Manage supplier performance in cost, quality, delivery, and technology alignment through weekly meetings and scorecard reviews. Be able to quarter quoting and cost reductions. Implement supply chain improvements and work with suppliers on material escalations. Develop and execute commodity strategies. Lead cross-functional teams through robust supplier selection for new platforms.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/138752960669590214"}