{"title": "EMC Design Engineer, Google Cloud", "level": "Mid", "location": "Sunnyvale, CA, USA", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.", "key_qualifications": "Bachelor’s degree in Electrical Engineering, Computer Engineering, Physics, a related field, or equivalent practical experience. 4 years of experience working in EMC Design, or 3 years of experience with an advanced degree. Experience working with cross-functional teams.", "preferred_qualifications": "Master’s degree or PhD in Electrical Engineering, Computer Engineering, Physics, or a related field. Experience with EMC and RF test equipment such as spectrum analyzers, oscilloscopes, network analyzer, and EMC debug techniques, radiated emissions, immunity and ESD testing. Experience with EM simulation tools, international EMC, RF regulations, standards and test methods. Experience in PCB and system level EMC design, connector/cables, and enclosure design. Knowledge of factors influencing EMC emissions/immunity, RF, Electrostatic discharge (ESD), desense, and mitigating techniques. Knowledge of 3D simulation tools and applicable EMC/ESD standards.", "responsibilities": "Collaborate closely with the Hardware Product Design teams to develop, review and approve designs. Ensure that the global hardware Electromagnetic Capability (EMC) regulatory compliance requirements can be met. Work closely with the cross-functional teams to ensure high quality products, fast deployment and specification compliance. Engage with various disciplines (e.g., Electrical, Mechanical, Thermal, Power, and Data Center Engineers and others) early in the product life cycle to ensure compliance by design to avoid retrofit at a later time. Be involved in concept and design stages of product development, identify and assess EMC design risks, develop mitigation strategies and guide teams with EMC design principles, including schematics, Printed Circuit Board (PCB) layout design and simulations. Review and tailor EMC/Radio Frequency (RF) requirements to meet specified product performance, control plans, and guidelines.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/138741729665655494"}