{"title": "Senior Analyst, Strategic Intelligence and Government", "level": "Mid", "location": "Taiwan", "description": "Advanced Intelligence Access (AIA) is Mandiant’s premium cyber threat intelligence subscription, offering customers access to a wide range of Mandiant data, tooling, and expertise via a dedicated Mandiant employee, onsite at the customer’s premises. AIA is tailored to the needs of each customer, allowing for improved integration and outcomes. Part of Google Cloud, Mandiant is a recognized leader in dynamic cyber defense, threat intelligence and incident response services. By scaling decades of frontline experience, Mandiant helps organizations to be confident in their readiness to defend against and respond to cyber threats.", "key_qualifications": "- Bachelor's degree or equivalent practical experience.\n- 7 years of experience in an investigative role (e.g., network forensics analyst, intelligence threat analyst, or security engineer/consultant, etc.) in a consulting or customer-facing environment.\n- Experience in threat intelligence analysis, application, and reporting outcomes to executive audiences.\n- Experience with an operating system (e.g. Linux) and scripting in Python or Bash.", "preferred_qualifications": "- 7 years of experience in an intelligence practitioner role.\n- Experience with CTI methodologies and applications within cyber security organizations.\n- Experience in stakeholder management (i.e., leading, presenting, reporting) to numerous audiences including executives.\n- Experience in the analysis of CTI, support monitoring, detection, and response capabilities.\n- Ability to work on tight deadlines, with occasional same-day turnaround.\n- Excellent report writing skills, with the ability to service strategic, operational, and tactical audiences.", "responsibilities": "- Manage all facets of Mandiant Threat Intelligence products delivery, organization, and sharing at the customer.\n- Convey both verbally and in writing the importance of findings for a variety of audiences.\n- Correlate raw intelligence from sensors, incident response engagements, tools, and numerous other sources into reports and briefings.\n- Understand CTI methodologies and application concepts.\n- Map threat actor capabilities to organizational defense and develop cyber threat profiles based on industry, geo location, critical assets, etc.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/138732749962781382"}