{"title": "Global Process Manager, Revenue to Cash Operations", "level": "", "location": "Bengaluru, Karnataka, India", "description": "The Revenue to Cash Operations (RCO) team manages Google's incoming cash transactions on a global basis and ensures that Google's incoming cash processes are controlled, effective, and efficient. The Revenue Operations team manages global invoicing for Google’s entire product suite, the intake of new product and form of payment launches, expansions, acquisitions, and regulatory change that impact order-to-cash processes, management of tax operations including onboarding, withholding, and reporting, and billing modifications, refunds and disbursements, payments optimization, and abandoned and unclaimed property.", "key_qualifications": "Bachelor's degree in Business, Finance, Engineering, Operations, or equivalent practical experience. 2 years of experience in finance, operations management, management consulting, corporate strategy, or a similar environment, as well as with finance operations, project management, and system transformation.", "preferred_qualifications": "MBA or Master’s degree. Experience managing cross-functional projects, identifying, assessing, and controlling risks on the business growth and payment operations side. Experience with SAP. Knowledge of Six Sigma, Lean or other process improvement methodology. Ability to communicate clearly and influence leadership teams in Google’s product areas and finance. Excellent problem-solving, leadership, project management, and process design skills.", "responsibilities": "Define process requirements for business growth and cash operations, design for new products and systems implementation in collaboration with cross-functional teams. Lead the operational integration for business growth and cash operations of newly acquired companies in conjunction with external partners. Consult with Google product areas and global counterparts to understand the operational environment and impacts of changes and issues, and drive proactive resolution of identified gaps. Analyze data sets to test hypotheses and provide insights to influence decision making. Ensure tax, local entity compliance, and readiness on supporting new and existing functionality.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/138855694475371206"}