{"title": "Managing Director, Measurement, Data, and Privacy, Go-To-Market", "level": "Director+", "location": "Mountain View, CA, USA", "description": "The Go-to-Market Operations (GtM) team ensures Google's complex and ever-evolving Ads business pursues strategic growth and operates effectively. We are instrumental in setting go-to-market strategy, and ensuring flawless execution and operations against the strategy. We have teams embedded in each of the major Ads business areas as well as global teams that work across the business areas. Team members are analytical and strategic, with a pragmatic sense of how to get things done.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 15 years of experience in sales, product go-to-market, or sales go-to-market functions, or related areas. Experience executing strategic and operational initiatives.", "preferred_qualifications": "Experience leading large teams and growing and developing talent. Experience in thought leadership and ability to lead complex operational and strategic initiatives by being mindful of front-line realities and operational pragmatism. Knowledge of Google’s Ads products and business teams as well as the customer and competitive contexts in which they operate, with particular focus on digital ads measurement and privacy landscape. Ability to operate with a high degree of integrity. Excellent influencing, project management, problem-solving, and analytical skills, combined with effective business judgment and communication skills.", "responsibilities": "Develop a clear holistic vision and go-to-market strategy to support customer success via clear and effective product solutions and business enablement. Support execution at scale of the product solutions required to for effective business and customer outcomes, working cross-functionally across Sales, Service, and Product teams. Influence internal leadership cross-functionally (e.g., Product, Engineering, Sales, etc.) on product strategy and commercialization. Work closely with the leadership team of Americas Large Customers Sales to deploy in-market product initiatives.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/139040572617695942"}