{"title": "Senior UX Researcher, YouTube", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" User Experience Researchers (UXRs) make this possible.\n\nGoogle User Experience (UX) is made up of multi-disciplinary teams of UX Designers, Researchers, Writers, Content Strategists, Program Managers, and Engineers: we care deeply about  the people who use our products.  The UX team plays an integral part in gathering insights about the needs, attitudes, emotions, and behaviors of people who use our products to inspire and inform design. We collaborate closely with each other and with engineering and product management to create industry-leading products that deliver value for the people who use them, and for Google’s businesses.\n\nAs a User Experience Researcher (UXR), you’ll help your team of UXers, product managers, and engineers understand user needs.   You’ll work with stakeholders across functions and levels and have impact at all stages of product development. You’ll play a  critical role in creating useful, usable, and delightful products.  You’ll explore user behaviors and motivations by conducting primary research such as field studies, interviews, diary studies, participatory workshops, ethnography, surveys, usability testing, and logs analysis. \n\nThe UXR community at Google is unique and will help you do your best work. You’ll have the opportunity to work with and learn from UXRs across Google through regular meetups, mentor programs, and access to internal research tools.\n\nThe Creator Support team designs and builds products to support creators at scale through authoritative data, internal tools, creator facing products, and advanced technologies like Generative-AI virtual help assistants. The team strives to make interactions easy, helpful, and empowering.\n\nAt YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.", "salary": "", "key_qualifications": "Bachelor's degree in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, related field, or equivalent practical experience.\n5 years of experience in an applied research setting, or similar.\nExperience with research design utilizing various methods (e.g., usability studies, contextual inquiry, surveys, etc.).\nExperience with product research in a usability or generative setting.\nInclude a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link or access instructions).", "preferred_qualifications": "Master's or PhD degree in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, or related field.\n5 years of experience conducting UX research on products and working with executive leadership.\n3 years of experience managing projects in an organization.\nExperience in a variety of product spaces, applied research, or academic settings.\nExperience communicating user research findings with cross-functional partners to drive impact.\nKnowledge of different research methods, including when and how to apply them during the product development process.", "responsibilities": "Conduct independent research on multiple aspects of products and experiences.\nCollect and analyze user behavior through lab studies, field visits, ethnography, surveys, benchmark studies, server logs and online experiments (e.g., A/B testing).\nWork with Designers, Product Managers, Engineers and other UX Researchers to prioritize research opportunities in a fast-paced changing environment.\nUnderstand and incorporate technical and business requirements into research.\nAdvocate research findings to diverse audiences through written reports and in-person presentations.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/139063622096560838"}