{"title": "Director, Global Strategic Initiatives", "level": "Director+", "location": "Beijing, China; Shanghai, China", "description": "The Google Cloud team reports directly to the President of Google Cloud  and carries responsibility for winning Google Cloud customers. The team partners with companies and brings the best of Google to these customers through strategic go-to-market partnerships. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree in an analytical field (e.g., Engineering, Finance, Business) or equivalent practical experience. 15 years of experience in a sales role or equivalent experience in a customer facing technical/engineering or consulting role", "preferred_qualifications": "Experience leading large-scale programs. Ability to rapidly learn, understand, and work with complex customer environments. Ability to influence C-level executives (e.g., Board, CEO, CFO). Excellent verbal and written communication skills", "responsibilities": "Serve as the business executive responsible for leading and winning complex Google Cloud-led accounts. Establish a multi-year partnership roadmap with the customer for industry disruption through digital transformation and trusted relationships with and influence Boards and CEOs. Establish executive management team with large enterprise organizations. Establish trusted relationships within Google in different Google business units (i.e., Google Health, Android, Search, Maps, Ads, etc.). Establish alignment between Google Leadership, the customer Board, and executive team. Develop the win strategy and Google differentiators, at the CEO/Board level, and gain buy-in from the customer. Work with the regional account team to build and execution plan aligned with the win strategy, develop a comprehensive pricing strategy and agreement financial across Google, and validate the technology and customer risk reduction strategy.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/139219629663756998"}