{"title": "Networking Engineer, Cloud VMware", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Google is proud to boast a network that provides service to millions of Internet users around the world. The Network Engineering team is responsible for operating that network reliably and at scale. As a member of the team, you have a direct impact on design and feature enhancements to keep our systems running smoothly. You also ensure that network operations are safe and efficient by monitoring network performance, coordinating planned maintenance, adjusting hardware components and responding to network connectivity issues. Google's complex network generates a constant stream of challenges which require you to continually be innovative with an evolving set of technologies. Keeping the network reliable ensures that our users stay connected with our suite of applications, products and services. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 3 years of experience in Network Administration, Network Architecture, Network Troubleshooting, Network Design, Routing Protocols, MPLS VPN, Network Diagnostics, Cisco Routers, VMware, Firewalls. Experience in programming languages (e.g., Python or Go). Experience with network architecture, management, troubleshooting and operation of enterprise networks.", "preferred_qualifications": "Certifications in VMware network (VCP-NV/VCIX-NV/VCDX-NV). Experience with Linux networking functionalities. Experience in Cisco Networking Technologies (i.e., Firewall, Switch, Routing) and relevant private networking technology (e.g., IPSec, SD-WAN, MPLS). Experience with the architecture, management, security and optimization of cloud and hypervisors including VMware and Google Compute Engine. Knowledge of as many of the following Cloud networking technologies/protocols: IS-IS, VXLAN, BGP, EVPN, Network Virtualization. Knowledge of VPN technologies (e.g., Palo Alto, VyOS, pfSense, Cisco ASR).", "responsibilities": "Plan and execute cloud capacity additions, streamline the process working across cloud teams in google. Monitor and manage google cloud networking capacity in partnership with Google cloud networking teams. Implement new google cloud capabilities and changes in partnership with the Developer teams. Troubleshoot and resolve customer networking issues across the google cloud interconnects, customer on-premises networks and our DC deployments. Plan and implement change management across the fleet while maintaining availability. Participate in rotating on call schedule for customer escalation support for Google Cloud Customers. Design and implement processes for the efficient operation of networks and VMWare stack, resolve network service issues in VMware Engine. Scale systems sustainably through Google tools and automation, and evolve systems by driving change that improves reliability and velocity.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/139315663729500870"}