{"title": "Strategic Partner Development Manager, Games, Google Play", "level": "Advanced", "location": "Singapore", "description": "Google's line of products and services to our clients never stops growing. The Partnerships Development team is responsible for seeking and exploring new opportunities with Google's partners. Equipped with your business acumen and extensive product knowledge, you are right on the front line of interacting with our partners, and helping them find ways to grow using Google's newest product offerings. Your knowledge of relevant verticals and relationships with key industry players will help shape our great applications and content for products such as YouTube, Google TV and Commerce.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 11 years of experience in business development, partnerships, management consulting, or investment banking, in the Consumer Electronics, Auto, OEMs, Telecom, E-Commerce/Retail, Apps, Ads, Gaming, or Technology industries. Experience working with C-level executives and cross-functionally across all levels of management. Experience managing agreements or partnerships.", "preferred_qualifications": "Experience in leading successful and strategic partnerships with mobile games/apps developers. Experience leading and executing successful initiatives with cross-functional teams (e.g., product management, legal, finance, marketing), influence executive stakeholders, and lead internal/external communications and discussions. Experience with the broader gaming industry in Asia Pacific and Oceania, including Australia and New Zealand. Ability to negotiate and structure agreements, including complex first of kind agreements, interpret legal documents, and work with legal to sign and close agreements.", "responsibilities": "Own and lead partnership strategy and relationship management with key game developers in Southeast Asia, India, Australia, and New Zealand. Identify emerging opportunities, market developments, and challenges in the gaming ecosystem and develop strategic recommendations and plans. Develop and execute plans to accelerate the local games ecosystem focusing on building exceptional game experience and quality, platform innovation, and partners' business successes. Provide consultations to key partners' game business based on analysis of partner metrics, performance, best practices, and strategic priorities. Provide actionable insights to shape product and commercial big bets, and drive impactful collaboration with cross-functional teams to grow the Google Play ecosystem.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/139565955029050054"}