{"title": "New Business Account Executive, Google Customer Solutions", "level": "", "location": "San Francisco, CA, USA", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you'll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow. Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in full life-cycle sales. Experience in developing relationships with new customers and serving as a consultant.", "preferred_qualifications": "Experience in building a book of business, ensuring the management and fulfillment of strategic goals, and in developing associated agreements. Experience exceeding quota attainment. Experience in educating new advertisers on the benefits of transitioning from traditional media to digital marketing strategies. Knowledge of the online advertising industry. Ability to grow in an ambiguous team environment. Effective communication skills, with the ability to provide comprehensive advertising solutions to prospective clients.", "responsibilities": "Manage the business pipeline and develop a strategy for long-term sustained success. Secure new Google Ads clients by presenting marketing solutions, and create relevant ad campaigns that maximize their returns. Develop business strategies that optimize the market potential. Understand customer needs and requirements.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/139549137346405062"}