{"title": "BSP Engineer, Google Cloud", "level": "Mid", "location": "Haifa, Israel; Tel Aviv, Israel", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "salary": "", "key_qualifications": "Bachelor's degree in Electrical Engineering, Computer Engineering, Computer Science, a related field, or equivalent practical experience. 5 years of experience in silicon bring-up, functional validation over emulators, FPGAs, and silicon. Experience in ramping a software environment from scratch over an ARM based (v7/v8) co-processors and with co-processors benchmarking. Experience in functional tests for silicon validation (e.g., C, C++, or Python), or developing firmware and embedded software.", "preferred_qualifications": "Experience with hardware prototyping, including hardware/software integration (e.g., pre-silicon use of emulation, software-based test, and diagnostics development). Experience with scripting (e.g. Python) for automation development. Knowledge of System on a Chip (SoC) architecture, including boot flows.", "responsibilities": "Develop from scratch boot code and overall software infrastructure for post-silicon purposes, support hardware emulators, FPGAs, and overall readiness for actual silicon. Be a focal point during chip bring-up. Contribute in multiple post silicon validation aspects such as caching, memory management, interrupt handling, performance, power states transition, multi-core aspects, and more. Assist in operating and maintaining the hardware emulation platform for pre-silicon integration and validation. Ensure validation provides functional coverage for a design.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/139505409479058118"}