{"title": "Software Engineer II, Full Stack, Subscription Services", "level": "", "location": "Bengaluru, Karnataka, India", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. Direct Channels & Memberships’ mission is to transform the way devices and services come together, to offer our users a frictionless experience. That means building trusted subscription products and first-party retail channels that enable our users to find and engage with our devices, as well as help them stay connected, adapt to their needs and unlock more value over time.", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 1 year of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).", "preferred_qualifications": "Master's degree or PhD in Computer Science or a related technical field. Experience building machine models. Experience developing accessible technologies. Experience building software modules for content management and publishing systems.", "responsibilities": "Design and develop modules for Content Management System (gCMS). Deliver innovative content publishing and launch management features. Work closely with software engineering leads, business leaders, and cross-functional stakeholders to define the goal and architecture for new capabilities and build enterprise grade systems. Manage Google Store content and updates, build merchandising pages, set up promotions, experiments and schedule product releases. Use standard Google infrastructure (e.g., Boq, BoqWeb, Spanner) to build scalable, low latency, resilient web applications and backend systems. Manage works on gCMS, including localization, content authoring tools, leak identification and detection system, launch management and publishing engine.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/139555145737216710"}