{"title": "Account Manager, Mid Market, K-12 Education", "level": "Mid", "location": "Austin, TX, USA", "description": "As a member of the Google for Education team, you’ll help us drive adoption and promote success with Google tools like Google Workspace for Education and Chrome with K-12 educational institutions, individually and at scale, helping them make learning more equitable, collaborative, and personalized. You will help us with Google products and transforming education. Chrome OS delivers quality computing at scale to provide universal and unfettered access to information, entertainment, and tools. Our mission is to empower anyone to create and access information freely through fast, secure, simple, and intelligent computing.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 3 years of experience in technology sales or working with customers in a sales role. Sales experience in the Education space.", "preferred_qualifications": "3 years of experience promoting cloud computing technologies to organizations across geographies and functions. Experience managing a large number of accounts at scale and leveraging channel relationships to increase business achievement. Ability to understand and work with new emerging technologies, methodologies, and solutions in the cloud/IT technology space.", "responsibilities": "Analyze data and leverage existing tools/resources, and collaborate with cross-functional project teams to prepare data, structure, and execute analysis. Execute developed business strategies for specific markets or customers, in collaboration with internal partners based on research and understanding of the customer and leverage products to deliver goals. Build and maintain customer relationships to work towards mutual business objectives, advise customers on best strategic and business practices, and share updates on opportunities and activities with accounts. Manage a book of accounts promoting Google for Education solutions to K-12 institutions in North America, and drive continued adoption of Google technologies among existing customers.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/139579174737060550"}