{"title": "Systems Engineer III, Site Reliability Engineering", "level": "Mid", "location": "Warsaw, Poland", "description": "Site Reliability Engineering (SRE) combines software and systems engineering to build and run large-scale, massively distributed, fault-tolerant systems...", "key_qualifications": "Bachelor’s degree in Computer Science, a related field, or equivalent practical experience. Candidates will typically have 2 years of experience with programming in one or more programming languages. Typically 2 years of experience working with Unix/Linux systems internals and administration (e.g. filesystems, inodes, system calls) or networking (e.g. TCP/IP, routing, network topologies and hardware, SDN).", "preferred_qualifications": "Experience working in computing, distributed systems, storage, or networking. Expertise in designing, analyzing, and troubleshooting large-scale distributed systems. Ability to debug, optimize code, and to automate routine tasks. Systematic problem-solving approach, coupled with effective verbal and written communication skills.", "responsibilities": "Improve the whole lifecycle of services from inception and design, through deployment, operation, and refinement. Manage support services before they go live through activities such as system design consulting, developing software platforms and frameworks, capacity planning, and launch reviews. Provide guidance to other team members on managing availability and performance of mission critical services, on building automation to prevent problem recurrence, and on building automated responses for non-exceptional service conditions. Maintain services once they are live by measuring and monitoring availability, latency, and overall system health. Lead sustainable incident response and blameless postmortems. Scale systems sustainably through mechanisms like automation and evolve systems by driving changes that improve reliability and velocity.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/139545337508307654"}