{"title": "Technical Account Manager, Google Cloud Consulting", "level": "Mid", "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia", "description": "The Google Cloud Consulting Professional Services team guides customers through the moments that matter most in their cloud journey to help businesses thrive. We help customers transform and evolve their business through the use of Google’s global network, web-scale data centers, and software infrastructure. As part of an innovative team in this rapidly growing business, you will help shape the future of businesses of all sizes and use technology to connect with customers, employees, and partners. As a Technical Account Manager (TAM), you will help customers adopt Google Cloud products. You will lead the successful adoption of Google Cloud at organizations, guiding them through the strategic and technical facets of their Cloud transformation journey. You will manage the delivery of Professional Services engagements to drive customer adoption of Google Cloud services such as Google Compute Engine, Google Cloud Machine Learning, Google Kubernetes Engine, BigQuery, Google Suite, Google Chrome, and more. In this role, you will engage with diverse stakeholder groups, including executives of large enterprises and a cross-functional and geographically dispersed team. You will utilize relationship management skills and technical credibility to effectively communicate at all levels of the organization. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 8 years of experience in a technical project management or a customer-facing role. 2 years of experience supporting customers in one of the following: cloud migration, cloud operations (e.g., launch/capacity planning, product release management), technical support, escalation management, IT consulting.", "preferred_qualifications": "Experience in application/workload migration to public cloud providers. Experience supporting customers in one of the following: cloud operations (e.g., launch and capacity planning, product release management), technical support, escalation management, IT consulting. Understanding of one of the following: IT operations, database systems, networking, IT security, application development, service architecture, cloud-native application development, hosted services, storage systems, or content delivery networks. Ability to communicate in Mandarin/Bahasa Indonesia/Bahasa Melayu fluently as it is a customer-facing role that requires interactions in Mandarin/Bahasa Indonesia/Bahasa Melayu. Ability to travel domestically and internationally 25% of the time as needed.", "responsibilities": "Accelerate customer adoption of Google Cloud by leading the implementation journey. Provide technical guidance and manage timelines, milestones, migration goals, and business transformation strategies. Advocate for customers needs to overcome adoption blockers and drive new feature development. Lead across multiple workstreams and teams to maintain customer momentum. Develop strategic relationships with stakeholders to understand a customer’s business and develop strategic roadmaps. Lead quarterly business reviews and executive sessions to understand business and technical needs. Plan for customer events and launches, partnering with Support, Engineering, and Site Reliability Engineering to ensure customer success during critical moments. Work with customers and Support to guide issues/escalations to resolution. Develop best practices and assets based on learnings from customer engagements to support initiatives to scale through partners and accelerate cloud adoption.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/139539003371070150"}