{"title": "Associate Product Operations Manager, Trust Strategy", "level": "Mid", "location": "London, UK", "description": "Product and Business Strategy Leaders bring together teams across Google’s functions to help products execute optimally. Our team pushes Google to scale at key points that refine our products and infrastructure by executing efficiently, bringing solid business sense and sound judgment, and working effectively across organizational lines. Our roles often include components of strategy (e.g. analyzing and understanding new trends in the industry, building business plans), operations (e.g. running the cadence of organizations, connecting the operating lines between our functions), and communications. Our team partners with senior leadership to run important functions that cross-cut our existing organizations and deliver high impact projects. We help Engineers, PMs, UX, and all of our other functions to build amazing products that delight our users, and then get those products into their hands. The Trust team brings together experts in privacy, competition, information quality, AI, and policy to empower our partner teams with the right insights and solutions to build user trust. Partnering closely with Engineering and Product Management across key product areas (e.g., Search, Assistant, Maps, Commerce, Ads) to support their ability to deliver trusted experiences for users. In this role, you will work with a user focus, valuing collaboration, principled decision making, and purpose.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience in strategy or advocacy. Experience partnering with and advising executives. Experience managing advocacy campaigns for organizations with cross-functional engagement. Experience synthesizing multiple information sources into a coherent framework for addressing business opportunities/challenges.", "preferred_qualifications": "Experience in a Tech, Media, or Telecom company. Ability to bring disparate perspectives and personalities together. Excellent business judgment, problem-solving, and analytical skills. Excellent written and verbal communication skills.", "responsibilities": "Provide insightful, data-driven strategic recommendations to leadership based on analysis, technical acumen, experience, and judgment on key AI regulatory and industry trends. Facilitate the creation and ongoing refreshes of a long term, portfolio wide Trust Strategy and drive recommendations. Lead high-impact strategic projects in collaboration with leadership to develop perspectives on their top strategic questions. Support ongoing strategy forums and conversations with leadership while building strategy capabilities and frameworks for Trust (e.g., data driven processes, strategic frameworks, etc.). Build relationships and ensure tight alignment on strategic Trust strategies across key product areas and cross-functional stakeholders (e.g., Policy, Legal, Marketing, Communications, Finance) while navigating interdependencies and trade-offs.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/139724722790113990"}