{"title": "Google AI External Communications Manager", "level": "Advanced", "location": "Mountain View, CA, USA; Atlanta, GA, USA; Austin, TX, USA; New York, NY, USA; Seattle, WA, USA; San Francisco, CA, USA; Washington D.C., DC, USA", "description": "As a member of the Global Communications & Public Affairs team, you will work cross-functionally to help communicate with journalists and other thought leaders; devise specific communications materials and campaigns; engage in face-to-face meetings with commentators and other opinion formers; and develop print and web-based material supporting these campaigns. We're looking for great communicators who can understand complex issues and explain them in person and also via well written, simple blog posts, FAQs, video scripts and more.\nIt's our job to help inform and educate users, advertisers, partners, opinion leaders--and our own employees--about the benefits of Google's products, our distinctive company culture/values, and our approach to the big public policy issues of the day. To succeed here, you'll combine creativity with organizational skills to manage multiple projects with tight deadlines simultaneously, as well as enjoy pitching to journalists, bloggers and commentators, or producing internal communications and events for our employees. Things happen quickly at Google and to get stuff done here you need to be an enthusiastic team player who can work cross-functionally and isn't hesitant to take risks or try new things.", "salary": "$159,000-$239,000", "key_qualifications": "Bachelor's degree or equivalent practical experience. 10 years of experience in public relations, media relations, or communications. Experience in the AI industry with AI models and AI developer ecosystems.", "preferred_qualifications": "Ability to maintain media relationships with journalists on the AI beat. Ability to be creative and think strategically. Ability to manage projects or programs. Excellent thought leadership and problem solving skills. Excellent verbal and written communication skills.", "responsibilities": "Use your expert technical understanding of the AI industry and of Google’s AI tools to engage with media, to increase the public's knowledge of our products and services. Create and execute sustained AI campaigns that support our key objectives throughout the year. Create a bold and ambitious external communications plan that tells the cross-Google AI story. Work with AI reporters, news and editorial teams to facilitate meaningful engagements with our key executives to increase knowledge of Google’s AI efforts. Work across Google and partner with relevant teams to discover great stories around AI and tell those stories effectively using all available channels. Work with teams across Global Communications and Public Affairs (GCPA) to handle reactive media enquiries that span multiple product or issue areas, and maintain good hygiene around tracking and measuring the coverage.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/139870251314488006"}