{"title": "Strategy and Operations Learning Lead, Global Curriculum Team", "level": "Mid", "location": "Chicago, IL, USA; Atlanta, GA, USA; Mountain View, CA, USA; New York, NY, USA; Los Angeles, CA, USA; San Francisco, CA, USA; Washington D.C., DC, USA", "description": "The Business Strategy & Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward.  We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives. The Mastery Team develops and delivers product and skills training to Google Sales and Services teams, and external client and agency partners. We use our knowledge of learning best practices and Google’s business priorities to build effective learning experiences for our key audiences. Our team is made up of passionate learning professionals, Sales and Marketing leaders, and former consultants and analysts who launch and iterate learning programs while balancing key pillars of knowledge, skill, and disciplined practice to help our audiences succeed in a world of increasing complexity. As the Learning Strategy Lead, you will identify and execute a learning strategy transformation that helps our Sales team identify and capture business opportunities and help drive product adoption for Google advertisers across GBO. You will design and implement processes and oversee internal business enablement functions, including training, documentation, and design assurance. You will work directly with a myriad of stakeholders, such as Sales, GTM, Global Marketing, Engineering, and Global Product Leads to design, develop, and launch solutions that effectively organize our curriculum for internal audiences. You will look for opportunities to continuously evolve our internal learning efforts, including target learners, processes, and enablement initiatives. You will oversee strategy and operations to ensure proper landing.", "salary": "$142,000-$211,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 6 years of experience developing business strategies or managing cross-functional initiatives. 5 years of experience in management consulting or other business strategy role. 4 years of experience working with executive stakeholders.", "preferred_qualifications": "MBA or graduate degree in management, technical, or engineering field. Experience in strategy and operations in higher education, EdTech, or corporate learning spaces. Knowledge of Google Ads product solutions and seller workflows with a deep focus to help shape the future of Google’s sales and partner teams. Ability to succeed and exercise judgment in a fast-moving environment. Excellent problem-solving skills, working cross-functionally on cross-product initiatives. Strong business judgment to inform curriculum development cycles with appropriate scope, anticipate resource needs, and adjust plans in real-time as new information becomes available.", "responsibilities": "Partner with leadership to define, prioritize, structure, and execute strategic and operational learning initiatives, developing work plans, gathering and synthesizing data, leading analyses, and developing and implementing recommendations. Lead complex learning initiatives that help the Mastery team achieve its learning and business goals (e.g., transformation strategy, skills architecture, learner journeys, etc.). Analyze learning processes to identify potential issues and uncover/prioritize levers for improvement; implement suggested improvements across the Mastery organization. Ensure global learning strategy is well understood and actionable for all cross-functional teams. Partner with cross-functional teams to drive support on strategic and operational initiatives that enable learning partnerships goals across multiple product areas. Facilitate well-run operations through regular cross-functional meetings to align on recommendations, execute experimentation plans, and manage change, focusing on the right set of metrics and identifying ongoing opportunities for improvement.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/139930059270955718"}