{"title": "Senior Lead Engineer, Google Cloud", "level": "Advanced", "location": "Bengaluru, Karnataka, India", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration. In this role, you will help deliver products that have a substantive impact on the Technical Infrastructure. You will provide leadership in an innovative and fast-paced environment with a focus on infrastructure for chip design. You will also lead complex technical projects from the concept/planning stage through execution and closure. You will enable the wider team to deliver designs of different application areas including ML/AI acceleration by developing tools relying on AI/ML techniques. You will lead chip design process improvement projects.", "salary": "", "key_qualifications": "Bachelor’s degree in Electrical Engineering, Computer Science, or equivalent practical experience. 10 years of experience in the ASIC Chip Design team. 8 years of experience with hardware electronic design automation tools. Experience programming in Python/C++. Experience in writing code and design practices.", "preferred_qualifications": "Experience planning and deploying new tools and flows to users. Experience in AI/ML methods for ASIC development. Knowledge of chip design processes such as verification, design, and implementation. Ability to present and explain novel methods to users. Excellent programming skills such as C/C++/Python.", "responsibilities": "Partner with Google Deepmind team to incorporate AI/ML techniques in chip design methodology and integrate into development flow. Partner with Chip Project teams to influence and standardize methodology across projects and functional areas (e.g., Design, Verification, Emulation and other front-end domain). Propose, design, and implement software automation that addresses bottlenecks in ASIC and SoC EDA flow. Perform, guide technical evaluations of tools and their AI capabilities and drive planning for possible deployment. Collaborate to identify and create strategic opportunities for improved chip design across Google. Lead the development of internal software tools and automation efforts. Participate in design reviews and engage in influencing technical and schedule trade-off discussions. Work with a hardware team on projects, prototype and deploy tools to make a positive impact on Google's chip hardware development.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/140007363850445510"}