{"title": "SAP Applications Engineer", "level": "Early", "location": "Hyderabad, Telangana, India", "description": "At Google, we work at lightning speed. So when things get in the way of progress, the Business Systems Integration team steps in to remove those roadblocks. The team identifies time-consuming internal processes and then builds solutions that are reliable and scalable enough to work within the size and scope of the company. You listen to and translate Googler needs into high-level technical specifications, design and develop recommended systems and consult with Google executives to ensure smooth implementation. Whether battling large system processes or leveraging our homegrown suite of Google products for Googlers themselves, you help Googlers work faster and more efficiently.\nAt Corp Eng, we build world-leading business solutions that scale a more helpful Google for everyone. As Google’s IT organization, we provide end-to-end solutions for organizations across Google. With an inclusive mindset, we deliver the right tools, platforms, and experiences for all Googlers as they create more helpful products and services for everyone. In the simplest terms, we are Google for Googlers.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, a similar technical field,  or equivalent practical experience. 3 years of experience working in the SAP domain. Experience working with SAP FIORI, SAP financials, SAP S4/HANA applications, or SAP MDG. Experience with software development in ABAP, OO ABAP programming languages.", "preferred_qualifications": "Experience with on-premise and Cloud SAP implementations.", "responsibilities": "Interface with multiple teams to assess business objectives and present technical solutions. Work with business analysts and application engineers to define a functional specification that meets business requirements. Design data models for the business domain, implement resource oriented web services for both read and write operations, unit tests, integration tests, and performance tests. Build design documents and present design reviews.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/140096470658228934"}