{"title": "Policy Escalations Specialist, Trust and Safety, YouTube (Burmese, English)", "level": "Mid", "location": "Singapore", "description": "Fast-paced, dynamic, and proactive, YouTube’s Trust & Safety team is dedicated to making YouTube a safe place for users, viewers, and content creators around the world to belong, create, and express themselves. Whether understanding and solving their online content concerns, navigating within global legal frameworks, or writing and enforcing worldwide policy, the Trust & Safety team is on the frontlines of enhancing the YouTube experience, building internet safety, and protecting free speech in our ever-evolving digital world. At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience in data analytics, Trust and Safety, content policy, content review, cybersecurity, anti-abuse, or a related field. Ability to work non-standard, on-call rotation work hours, including weekends. Ability to communicate in Burmese and English fluently in order to review content and manage escalations in these languages.", "preferred_qualifications": "Experience with SQL or spreadsheet software, and using data to drive strategy and business action. Experience with complex, cross-functional project management and quality and training processes. Ability to build relationships with cross-functional partners across geographies. Ability to work through ambiguity and grow in a rapidly changing environment. Excellent problem-solving skills.", "responsibilities": "Manage escalations as part of the APAC Headquarters team in the Trust and Safety organization. Ensure all escalations are triaged, tracked, investigated, resolved, and communicated accurately using internal tools and systems. Manage or assist in conducting reviews to capture lessons-learned and ensure regular follow-up for any items identified. Analyze, identify, prioritize, and deliver operational improvement opportunities. Identify, articulate, and quantify the impact of required tools changes to deliver on these opportunities. Partner with Policy, Engineering, Vendor Operations, and Analytics teams to define the plan and implement fast. Review and manage escalations from graphic and controversial video content in line with YouTube’s Community Guidelines and this role will be exposed to graphic, controversial, or upsetting content.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/140151153785479878"}