{"title": "Business Data Scientist, Finance", "level": "Mid", "location": "Bangalore, Karnataka, India", "description": "As a Quantitative Analyst, you will be responsible for analyzing large data sets and building expert systems that improve our understanding of the Web and improve the performance of our products. This effort includes performing complex statistical analysis on non-routine problems and working with engineers to embed models into production systems. You will manage fast changing business priorities and interface with product managers and engineers.\nThe Finance Data and Analytics (DnA) team combines business acumen, technology and innovation to organize data, enable insights and create data driven and efficient Finance organization in Google. At Google, data drives all of our decision-making. You will be part of a growing Data Science team for Data Scientists and Machine Learning Engineers. You will work on strategic business challenges across multiple business areas (e.g. Ads, YouTube, Search, Play, etc.) through the lens of business generation. You will collaborate with Data Scientists, Data Engineers, and Project Managers to create data products to enable our finance partners to make informed decisions, manage risks and opportunities.", "key_qualifications": "Bachelor's degree Statistics, Economics, Mathematics, in a quantitative discipline, or equivalent practical experience.\n5 years of experience in the Industry in a Data Analyst or Data Science role, analyzing data sets to solve business problems through statistical methods and predictive analytics.", "preferred_qualifications": "Experience in data analysis, especially for time series data, to solve business problems in complex, fast-moving, and ambiguous business environments with strong data intuition and business acumen.\nExperience in stakeholder-facing or client-facing roles (e.g. previous consulting role).\nExperience with statistical softwares (e.g., Python), database languages (e.g., SQL), and data visualization tools (e.g., Tableau).\nExcellent communication skills (written and verbal) to translate technical solutions and methodologies to leadership.", "responsibilities": "Partner with Finance leadership and their teams to understand business context, ideate, and deliver insights and prototypes.\nWork with Machine Learning Scientists and Engineers to improve usability of the Machine Learning models through the design of appropriate metrics.\nCollaborate with Machine Learning Scientists to develop and improve models (e.g. identifying new data sources, hypothesis testing, feature engineering, model prototyping, analyzing model output and model explainability).\nProvide analyses through advanced analytics/statistical methods that tell a “story” focused on business insights.\nDevelop reusable and robust analytic frameworks to ensure consistent results across business areas.\nContribute to a culture of learning, sharing and making Machine Learning accessible across the broader team and our stakeholders.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/140270731507180230"}