{"title": "Principal Engineer, Google Production Platform Solutions", "level": "Director+", "location": "New York, NY, USA", "description": "Today, server developers at Google entrust the production platform organization with their most critical workloads – from the internal compute, networking, and storage infrastructure to flagship Google products with billions of users. As the Principal Engineer, you will lead the technical strategy of the software engineering organization that delivers foundational Google Production Platform Solutions for continuous delivery, observability, debugging, monitoring, and incident management stages in the service lifecycle. In this role, you will create and drive a holistic strategy for industry and tooling integrations across Production Platform products balancing reliability, risk reduction, safety, compliance, development velocity, and platform benefits with the speed of innovation, ultimately delivering an exceptional experience to Googlers. You will lead the Technical Lead community with a focus on end-to-end platform Critical User Journeys (CUJs), developing technical criteria, guidance, and processes to drive the API-first culture, open to integrations with industry solutions. You will define technical best practices, design patterns, and systemic platform features to enable and drive build vs buy decision-making. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible. The US base salary range for this full-time position is $278,000-$399,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "key_qualifications": "15 years of experience in software development or 10 years with an advanced degree. Expertise in leading API-first infrastructure software development efforts, from design to troubleshooting. Experience leading technical teams and implementing engineering products at an executive level within multinational organizations.", "preferred_qualifications": "Experience landing outcomes across a broad range of products and technologies, walking the line between necessary product heterogeneity and platform centralization. Experience defining system and/or process requirements for large-scale systems. Experience leading large, fast-paced, and dynamic engineering teams across multiple organizations. Experience growing team capabilities through role modeling and mentoring. Ability to perform technical deep-dives into code, networking, operating systems, and compute infrastructure. Ability to make well-supported tradeoffs in complex situations.", "responsibilities": "Lead the technical strategy for product portfolios with an API-first approach, enabling integrations with the leading external industry solutions while allowing Googlers to build local extensions. Act as an innovation and unbiasing advocate, challenging the internal products’ tendency to follow the evolutionary path. Partner with product leads across multiple areas, on technologies up and down Google's stack to set the technical direction for the team and to drive platform-wide initiatives delivering exceptional production platform solutions to Googlers. Partner across functions to enable industry integrations and advocate for industry solutions where they offer a more efficient path to exceptional solutions for Googlers. Work in tandem with Directors and VPs to define and execute technical strategy and arbitrate technical processes and decisions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/140284774238298822"}