{"title": "Design Director, UX, Payments Platform", "level": "Director+", "location": "Mountain View, CA, USA", "description": "As the Director of UX, you will lead a global team of UX designers and writers to create the next-generation of payment experiences for first-party Google products. You'll drive collaboration, transparency, and clarity between multiple product areas and functions, while fostering a culture of user-centric design. You will create simple, elegant, and reusable payment patterns that scale across numerous design languages, products, and surfaces.", "key_qualifications": "Bachelor’s degree in Design (e.g., graphic, interaction, industrial, architecture, etc.) or equivalent practical experience. 15 years of experience leading multi-disciplinary UX teams. Portfolio of product design work with evidence of impact at scale.", "preferred_qualifications": "PhD in Human-Computer Interaction, Visual Design, Interaction Design, UX, Cognitive Science, Experimental Psychology, Anthropology, Information Science, or a related field. Experience in enterprise roles in the commerce/payments space. Experience leading multi-disciplinary UX teams. Outstanding leadership skills, and ability to lead UX in an ambiguous and technical space, working to define methods and approaches.", "responsibilities": "Lead, grow, and manage a team of User Experience Designers and Content Writers developing design and product solutions for payments-related products. Partner with Engineering, Product Management, and cross-functional leadership to develop strategy, perspective, and narrative around user needs that is high craft, consistent, and user friendly. Develop strategies for communicating user insights and design solutions that build conviction and influence decision making at the executive level. Prioritize UX in conjunction with our partners, and raise the quality bar for design methods/communication within the team and across Google. Partner with UX and cross-functional teams across Google to develop consistent and insights-informed best practices, and build communities of UX practice. Plan, allocate, and advocate for resources across the team’s primary areas of responsibility, working with leadership to ensure prioritization and alignment across the wider Payments team.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/140402867987980998"}