{"title": "Software Engineering Manager, ChromeOS Commercial (English)", "level": "Advanced", "location": "Kraków, Poland", "description": "Like Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers...", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). 3 years of experience in a technical leadership role; overseeing projects, with 2 years of experience in a people management, supervision/team leadership role. Ability to communicate in English fluently, to work with the web community, partners, and developers.", "preferred_qualifications": "Master's degree or PhD in Computer Science, or a related technical field. 5 years of experience working in a complex, matrixed organization. Experience with web development and underlying web platform implementation. Experience with app development for other platforms (e.g., desktop apps). Ability to oversee strategic and cross-organization projects. Excellent communication skills to help you coordinate with our stakeholders and industry-wide partners.", "responsibilities": "Set and communicate team priorities that support the broader organization's goals. Align strategy, processes, and decision-making across teams and drive cross-functional projects from conception to successful delivery. Collaborate with recruiting teams to attract, identify and hire engineers. Once hired, set role and level-appropriate expectations with individuals, aligned with organizational goals, meet regularly to discuss performance and provide feedback and coaching. Develop the long-term technical direction and roadmap within, and beyond the scope of your teams. Evolve the roadmap to meet future requirements and infrastructure needs. Oversee software designs within the scope of the broader area, review code, and provide feedback to ensure best practices. Interact with partners and developers to understand requirements, receive and incorporate feedback. Be a trusted advisor to cross-functional counterparts, engage with privacy and security stakeholders to balance new capabilities with security.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/140819422242579142"}