{"title": "Interaction Designer, Core", "level": "", "location": "Bengaluru, Karnataka, India; Hyderabad, Telangana, India", "description": "At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" Google’s Interaction Designers take complex tasks and make them intuitive and easy-to-use for billions of people around the globe. Throughout the design process—from creating user flows and wireframes to building user interface mockups and prototypes—you’ll envision how people will experience our products, and bring that vision to life in a way that feels inspired, refined, and even magical.", "key_qualifications": "- Bachelor's degree in Design (e.g., Interaction, Graphic, Visual Communications, Product, Industrial), Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience.\n- 2 years of experience with design software (e.g., Figma)\n- Portfolio highlighting design principles for web or mobile platforms.", "preferred_qualifications": "- Certification in UX Design or similar.\n- 2 years of experience working with designers, researchers, engineers, content strategists, and product managers throughout the design process (e.g., creating user flows, wireframes, and building user interface mockups/prototypes).\n- Experience designing across multiple platforms (e.g., Android, iOS, and Web).\n- Excellent leadership, communication and collaboration skills.", "responsibilities": "- Help to define the user model and user interface for Google products and features.\n- Develop detailed storyboards, mockups, and prototypes to communicate interaction and design ideas.\n- Collaborate with product managers, engineers, researchers, writers, and cross-functional stakeholders to understand requirements, and provide creative solutions.\n- Evaluate the usability of new and existing products and make constructive suggestions for change.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/140815477516444358"}