{"title": "Account Manager, Retail, Large Customer Sales (English, Portuguese)", "level": "", "location": "São Paulo, State of São Paulo, Brazil", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of advertising, consultative sales, business development, online media environment, or marketing role. Ability to communicate in English and Portuguese fluently to engage with local stakeholders.", "preferred_qualifications": "Experience with data analysis and insights creation. Ability to work on tasks within optimizing specific campaigns according to customer KPIs in order to promote growth. Ability to work towards goals in a fast-paced environment. Ability to troubleshoot defined problems raised by customers and escalate challenges to senior team members or managers. Excellent leadership, influencing, organizational, communication, and teamwork skills. Excellent analytical, problem-solving, and communication skills.", "responsibilities": "Build and manage relationships with clients, and develop an understanding of their business challenges, marketing objectives, and success metrics. Work with internal and external stakeholders to ensure workflows and projects are completed on time. Plan and achieve business growth goals through the presentation of Google advertising products/solutions that will help clients meet their marketing objectives. Develop forward thinking, data-driven analyses, and consultative recommendations that align with customer goals, and quantify opportunities with clear recommendations to present to customers. Build knowledge of how Google Advertising products work and can be used to help meet a wide range of marketing objectives.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/140920575164850886"}