{"title": "Numerical Modeling Research Scientist, Quantum AI", "level": "Mid", "location": "Goleta, CA, USA; Los Angeles, CA, USA", "description": "The Numerical Modeling team's mission is to develop and leverage numerical physical models to comprehensively and accurately predict device performance. We simulate our quantum computers at multiple levels of granularity (from the level of gates up to large distance error correction experiments). The comprehensive physical models are used to inform many aspects of our hardware effort, ranging from circuit and gate design, error correction protocols, to error mitigation techniques. As a Research Scientist, you will setup large-scale tests and deploy promising ideas, managing deadlines and deliverables while applying the latest theories to develop new and improved products, processes, or technologies. You will also actively contribute to the wider research community by sharing and publishing the findings with research programs at partner universities and technical institutes all over the world. The full potential of quantum computing will be unlocked with a large-scale computer capable of complex, error-corrected computations. Google Quantum AI's mission is to build this computer and unlock solutions to classically intractable problems. Our roadmap is focused on advancing the capabilities of quantum computing and enabling meaningful applications.", "salary": "$161,000-$239,000 + bonus + equity + benefits", "key_qualifications": "PhD degree in quantum information related field, Physics, Electrical Engineering, a related field, or equivalent practical experience. Experience in theoretical condensed matter physics and related approximation methods. Experience in numerical simulations of quantum systems.", "preferred_qualifications": "Experience in superconductivity (e.g., BCS theory, cooper pairs, etc.). Experience in electromagnetic modeling/microwave engineering. Experience with modeling or simulating superconducting qubits. Experience in software engineering best practices, including design and testing. Experience in high-performance scientific computing, C++ or other compiled languages.", "responsibilities": "Develop numerical physical models for device decoherence such as Purcell effect, quasiparticles, two-level systems, electronics noise, etc. Collaborate with experimentalists to validate numerical models and adapt them towards useful applications such as device design. Identify approximations and develop numerical approaches to enable simulation of non-trivial (e.g., non-Markovian) noise sources. Expand existing simulation infrastructure to include new architectures and error models.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/141052470926156486"}