{"title": "Global Process Manager, Tax Operations", "level": "Mid", "location": "Dublin, Ireland", "description": "The Revenue to Cash Operations team manages Google's incoming cash transactions on a global basis and ensures that Google's incoming cash processes are controlled, effective, and efficient. As a member of this organization, you'll find innovative ways to manage our complex set of transactions. You will make processes more efficient and scalable, work to ensure the highest level of quality of our operations, and proactively minimize operational risk. You'll collaborate with our partners and Google product, sales, and engineering teams in addition to greater Finance.", "key_qualifications": "Bachelor's degree in accounting or taxation, or equivalent practical experience. 7 years of experience in Tax Operations, Accounting, or other indirect tax experience in a public accounting firm or industry. Experience managing the end-to-end project/product lifecycle (e.g., process developments, implementation, and improvement).", "preferred_qualifications": "Experience leading complex process improvement projects and influencing and managing stakeholder relationships. Experience working in a cross-functional, fast-paced environment and to lead and drive complex operational initiatives, with excellent data analysis and operations management skills. Proficiency using tax tools and communication taxes (e.g., mapping, customization rules, etc.). Excellent problem-solving and investigative skills combined with the ability to navigate through ambiguity in a fast-paced, dynamic environment. Excellent written and verbal communication skills.", "responsibilities": "Provide tax operations through leadership and expertise, partner with key stakeholders, payments engineering and vendors to improve complex tax operational processes, perform effective escalation management, and provide solutions. Identify and assist with the implementation of system and process improvements (e.g., implement tax automation tools to improve reporting efficiency and accuracy), while responding accurately and timely to inquiries from internal and external stakeholders. Provide operational monitoring, troubleshooting and error resolution to prevent inaccuracies, maintain compliance, and drive process excellence. Monitor business and legislative changes impacting tax positions, compliance and business initiatives, analyze potential impact on the tax operations. Maintain records, documentation, and develop processes and procedures with a focus on continuous improvement and automation. Ensure tax, Sarbanes Oxley local entity compliance, and readiness on supporting new and existing functionality.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/141196927520645830"}