{"title": "Creative Technologist, Creative Lab", "level": "Mid", "location": "New York, NY, USA", "description": "The Creative Lab is a small team of designers, writers, programmers, filmmakers, producers and business thinkers whose mission is to remind the world what it is they love about Google. Our job is to make Google’s magic more magical, help advance and invent Google’s future, and to communicate Google’s innovations, intentions and ideals in ways that makes us all immensely proud.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience working in a creative discipline, with experience programming in JavaScript or TypeScript, and with modern front-end frameworks (e.g., React, Vue.js, Svelte). Experience with applied AI/ML frameworks, libraries, and tooling (e.g., TensorFlow, Vertex AI, Colab), related languages and systems (e.g., Python, Node.js, Google Cloud Platform), and with rapid prototyping tools (e.g. Google AI Studio). Experience with version control systems (e.g. Git) and collaborative workflows. Portfolio of creative work demonstrating creative and technical skills in prototyping and building original interactive experiences.", "preferred_qualifications": "Exposure to and knowledge of UI/UX best practices. Familiarity and comfort with techniques such as prompt engineering, LoRA and model fine-tuning, multimodal prompting, and diffusion models. Ability to succeed in a fast-paced environment, working on multiple projects in a start-up atmosphere. Interest in hardware hacking, tangible interfaces, and experimental UI. Interest and curiosity in gadgets, inventions, and world-changing leaps in technology, along with a healthy disregard for the impossible.", "responsibilities": "Prototype interactive demos using Google’s developer APIs, libraries, and tools. Perform rapid evaluation and exploration of emerging interfaces, services, and platforms, including AI, front-end, and back-end technologies. Contribute to deployment, publication, and management of internal prototypes. Collaborate with teams around Google to apply and prototype using early-stage research. Work with an exceptional team of designers, writers, filmmakers, programmers, and creative tinkerers. When needed, help drive prototypes all the way to production by collaborating with various teams across Google and vendor partners.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/141230011452400326"}