{"title": "Operational Support Team, Global Security Operations Center (GSOC)", "level": "Early", "location": "Boulder, CO, USA", "description": "Security is at the core of Google's design and development process: it is built into the DNA of our products. The same is true of our offices. You're an expert who shares our seriousness about security and our commitment to confidentiality. You'll collaborate with our Facilities Management team to create innovative security strategies, investigate breaches and create risk assessment plans for the future. You believe that providing effective security doesn't come at the expense of customer service - you will be our bodyguard (and our long lost pal).", "salary": "$81,000-$119,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 3 years of experience in law enforcement, intelligence or a military role or equivalent private sector experience.", "preferred_qualifications": "Experience with security technologies including CCTV, Access Control, and Incident Management Systems. Proven experience of critical thinking, analytical and decision making skills. High ethical standards with proven ability to handle highly confidential and sensitive information; excellent judgment, discretion and diplomacy. Strong analytical, communication, and interpersonal skills. Excellent written and verbal communication skills. A strong understanding of global geopolitical trends and emerging threats and risks.", "responsibilities": "Be responsible for incident management, response and support. Manage sensitive, escalated, higher priority tasks. Provide escalation support for GSOC vendor operators. Provide escalation support to the network of Global Security Service Centers. Manage email monitoring, response and assignment. Manage ticket monitoring and assignment. Collect, evaluate, escalate and disseminate intelligence to support action plans based on credibility and likelihood. Provide intelligence support to the Global Security Operations Center (GSOC) in incident response, crisis management and global travel management. Create GSOC incident report writing in line with existing GSOC processes (higher risk incidents). Provide pan regional coverage when needed. Provide supervisor backup coverage (when no supervisor is on shift / available) when needed. Provide phone line coverage.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/141309623503069894"}