{"title": "Principal Engineer, Foundations Performance", "level": "Director+", "location": "Sunnyvale, CA, USA", "description": "Core Machine Learning (ML) is the central machine learning platform team that provides ML software tools and hardware infrastructure to all the Google product areas including Search, Ads, Youtube, Google Cloud, Maps, etc. Core ML is focused on Driving ML excellence for Google. Our aim is to simplify and make it easier to perform ML experimentation, development, and productionization. We work closely with Google Research to bring new software and hardware research innovations to market. This enables us to better meet the challenge of the rapidly evolving hardware and software space around ML.  Foundations specifically focuses on enabling users with high performance, scalable, and portable infrastructure for a diverse set of hardware and ML frameworks. As the Principal Engineer, Foundations Performance, you will lead the silicon design and influence the hardware architecture to create the largest scale and most versatile ML systems. You will be a technical lead who works across business units at Google, as well as with Google DeepMind researchers to assess the needs and constraints for very large-scale ML systems, and then translate these insights into a high performance hardware architecture system design. This is a highly impactful and strategic position requiring significant technical expertise in distributed systems, software hardware co-design, and ML accelerators. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "$278,000-$399,000 + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree in Computer Science, or similar technical field of study or equivalent; 15 years of professional experience as a software engineer or 13 years with an advanced degree; Experience with technical innovation in Frameworks, Libraries, Tools, APIs, or related fields.", "preferred_qualifications": "20 years of professional experience; Experience with hardware software co-design or experience with the chip design process; Experience with maximizing the performance of ML accelerators (e.g., CPU/GPU/TPU/XLA); Technical expertise in systems and software with the leadership skills needed to influence technical leaders across the company; Understanding of the needs of advanced ML developers; Ability to quickly ramp up in new subject areas with short notice to guide a few weeks of mission-critical research into large potential risks related to infrastructure usage.", "responsibilities": "Work cross-functionally with Google product teams to assess needs and constraints to design the appropriate systems; Develop a structure of other technical leads in the area, both by defining technical goals and orienting teams around technical decisions they can make, and by providing development support to engineers in the area; Develop flexible machine learning (ML) infrastructure for various processor types (i.e., CPU/GPU/TPU/XLA); Set the technical outlook and roadmap of the silicon design space for future ML hardware; Collaborate with research teams to understand future workload requirements and support hardware engineering teams in translating them into potential chip architectures.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/141411655813604038"}