{"title": "Senior Data Center Facilities Maintenance Technician, Electrical", "level": "Early", "location": "Saint-Ghislain, Belgium", "description": "The Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facilities Technicians at Google data centers operate, monitor and support physical facilities conditions. Some of these duties will include heating and cooling of air and water, power supply, generators, UPS systems, electrical distribution and control and monitoring systems. You regularly help inspect, maintain and repair various data center systems such as piping and non-critical electrical or mechanical system components). You provide daily assistance to senior technicians as you read blueprints/schematics, conduct tours of systems and assess their working order.\n\nAs an advocate for best practices, you develop creative approaches to reducing operational costs while improving overall data center efficiency. You ensure that environmental and safety standards are consistently met, identifying problems and making repairs quickly. In emergency situations or abnormal conditions, you manage data center performance issues and outages to minimize the recovery time from failures. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "salary": "", "key_qualifications": "Associate's degree, trade school certification, or other verifiable training in a relevant technical field, or equivalent practical experience. Experience working in mission critical facility maintenance and operations. Experience in troubleshooting electrical distribution systems (e.g., HV, LV, Protection and Controls, Power Quality). Ability to work non-standard hours, including weekends and holidays on shift based schedules.", "preferred_qualifications": "Experience planning and executing installation, commissioning, and equipment startup, following industry best practices and protocols. Knowledge of meters, devices, sensors and troubleshooting, utilizing standard hand tools, digital metering, or calibration/diagnostic equipment. Understanding of mechanical systems in data center environments and controls/monitoring systems. Valid driver's license.", "responsibilities": "Inspect, maintain and repair various data center systems. Operate, monitor, maintain and respond to abnormal conditions in the data center facilities systems and equipment. Monitor multiple information streams in the control room and make accurate mission-critical decisions. Be responsible for the uptime, maintenance, and troubleshooting of electrical distribution systems and power monitoring. Develop creative approaches to reduce operational costs, improving efficiencies. Follow the site’s environmental health and safety policies.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/141405631685763782"}