{"title": "Competition and Consumer Protection Policy Analyst", "level": "Advanced", "location": "London, UK", "description": "With the widespread impact of AI technologies, the growth and diversification of our products, and the proliferation of new and at times fragmented laws and reporting requirements, we face one of the most exciting and challenging moments as a company. The newly formed Risk, Compliance and Integrity (RCI) organization brings together critical compliance, assurance, risk, and governance functions across Google to help the company meet compliance needs and enable our businesses to innovate. Our goal is to make compliance a competitive advantage for Google by driving scaled, data-driven, and policy-based compliance programs. We manage our operations through risk-based prioritization and governance, and consistent and constructive regulator engagement.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 7 years of experience working in compliance, policy, risk management, or a related field.", "preferred_qualifications": "Master's degree in Public Policy, Business, Engineering, Law, or relevant field. Knowledge of the competition and consumer protection regulatory landscape, and adjacent risk areas. Understanding of compliance program management principles, risk assessment methodologies, and internal control frameworks. Proven ability to collaborate and build effective working relationships with cross-functional teams, senior management, regulators, and external stakeholders. Effective communication skills, both verbal and written, with the ability to articulate complex compliance concepts and requirements to diverse audiences. Analytical mindset with excellent problem-solving skills, attention to detail, and the ability to interpret regulatory requirements and assess their impact on business operations.", "responsibilities": "Develop, shape, and maintain Google’s compliance policies leveraging legal interpretation, stakeholder input, and research. Collaborate with product areas and functions to design controls that are adequate to ensure compliance with policy requirements. Participate in risk reviews to approve exceptions to policy. Help develop training programs and awareness initiatives for employees to enhance their understanding of compliance requirements, standards, and regulatory obligations. Review issues and incidents to assess risk and ensure remediation plans are adequate. Identify risk trends through external research and monitoring of regulatory priorities and consumer sentiment.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/141494481042973382"}