{"title": "Senior Financial Analyst, Google Cloud", "level": "Mid", "location": "Austin, TX, USA", "description": "Financial Analysts ensure that Google makes sound financial decisions. As a Financial Analyst, your work, whether it's modeling business scenarios or tracking performance metrics, is used by our leaders to make strategic company decisions. While working on multiple projects at a time, you are focused on the details while finding creative ways to solve big picture challenges.", "key_qualifications": "Bachelor's degree in Business, Finance, Economics, Statistics, or another quantitative field, or equivalent practical experience. 7 years of experience in financial planning and analysis (FP&A), consulting, or a related function, or an advanced degree. Experience with SQL.", "preferred_qualifications": "Experience in management consulting, sales operations, business strategy, investment banking, venture capital, private equity, or corporate advisory. Experience with financial analysis and accounting. Experience working with, and communicating with executives. Excellent verbal and written communication skills, with the ability to interact with technical and non-technical groups. Excellent advanced financial modeling skills.", "responsibilities": "Partner with Cloud internal and Alphabet capacity, Product and Finance teams to manage capex liability for their AI infrastructure demand signals. Collaborate with the DC and power planning finance and capacity teams to forecast, and influence AI/ML power allocation. Additionally, drive financial planning and initiatives to improve power availability for AI. Partner with Product, Capacity, and Strategy teams on infrastructure utilization efficiency goals and actuals. Partner cross-functionally to drive projects for utilization improvement. Manage AI portfolio margin analysis, including bridging GPU/TPU and Vertex to develop a comprehensive story for the Executive team. Support Cloud fungibility program with the Engineering organization and develop pricing model for internal Product Area chargeback.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/141561917062685382"}