{"title": "Strategy and Operations Senior Associate", "level": "Mid", "location": "New York, NY, USA", "description": "The GCS Sales and Strategy teams provide business critical insights using analytics, ensure cross-functional alignment of goals and execution, help teams drive strategic partnerships and new initiatives forward, and drive sustainable business growth and product adoption. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives. Team members are experienced in business strategy and operations, analytical and strategic, yet highly pragmatic and results-oriented. When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the 'human face' of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 4 years of experience in management consulting, sales operations, business strategy, investment banking, venture capital, private equity or corporate advisory, or 2 years of experience with an advanced degree. 2 years of experience working with executive stakeholders. 2 years of experience developing business strategies or managing cross-functional initiatives.", "preferred_qualifications": "2 years of experience generating insights from analysis on large data sets to drive business decisions. Experience collaborating with multiple stakeholders across organizational boundaries. Experience in advertising, consultative sales, business development, or a digital media environment for a complex organization. Structured problem solving skills, combined with strong business acumen. Excellent communication and presentation skills with the ability to take complex, ambiguous topics and turn them into compelling narratives for different audiences.", "responsibilities": "Draw interpretable insights from sophisticated business analyses and advanced modeling. Design processes, tools, and operating cadences to achieve organizational outcomes. Develop comprehensive sales, product or business strategies that solve complex business challenges and address the needs of customers and stakeholders across various functions to drive incremental growth. Communicate data-driven recommendations to leadership and to the broader organization by preparing polished presentations and identifying key takeaways. Define actionable plans and roadmaps and align cross-functional stakeholders to drive successful implementation of change initiatives.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/141674711286194886"}