{"title": "Technical Delivery Infrastructure Engineer, Google Public Sector", "level": "Mid", "location": "Reston, VA, USA", "description": "As a Technical Solutions Consultant, you will be responsible for the technical relationship of our largest advertising clients and/or product partners. You will lead cross-functional teams in Engineering, Sales and Product Management to leverage emerging technologies for our external clients/partners. From concept design and testing to data analysis and support, you will oversee the technical execution and business operations of Google's online advertising platforms and/or product partnerships.\n\nYou will be able to balance business and partner needs with technical constraints, develop innovative, cutting-edge solutions and act as a partner and consultant to those you are working with. You will also be able to build tools and automate products, oversee the technical execution and business operations of Google's partnerships, as well as develop product strategy and prioritize projects and resources.\n\nAs a Technical Delivery Infrastructure Engineer, you will work directly with Google’s strategic customers on critical application development and modernization projects to help them transform their businesses. You will provide consulting, program management, and technical expertise to customers while working with client executives and key technical leaders to drive adoption of modern applications and cloud-native products on Google Cloud Platform.\n\nIn this role, you will ensure quality for customer engagements, developing relationships with key stakeholders internally/externally that will help the team deliver on the customer’s technical requirements and business goals.\n\nMust be a US Citizen to meet customer and compliance requirements, including potential access to classified information.\n\nGoogle Public Sector brings the magic of Google to the mission of government and education with solutions purpose-built for enterprises. We focus on helping United States public sector institutions accelerate their digital transformations, and we continue to make significant investments and grow our team to meet the complex needs of local, state, and federal government and educational institutions.", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n5 years of experience project managing and delivering technical solutions.\nExperience with architecting, developing, and maintaining technical solutions by leveraging virtual machines, containers (e.g., Kubernetes/GKE), serverless computing, or software-defined networking (SDN).\nExperience working in a cloud computing environment (i.e., infrastructure, storage, platforms, or data).\nExperience with Infrastructure as Code (IaC).\nActive US Government Top Secret/Sensitive Compartmentalized Information (TS/SCI) security clearance with polygraph.", "preferred_qualifications": "Experience with customer-facing migrations, including service discovery, assessment, planning, execution, and operations.\nExperience reading software code in one or more languages (e.g., Java, JavaScript, or Python).\nExperience in systems design with an ability to architect or explain complex systems interactions including data flows, common interfaces, APIs, and methods available.\nExperience working with Cloud Platforms (e.g., GCP).\nUnderstanding of API Management space and Apigee technologies.", "responsibilities": "Work with customer development leads, client executives, and partners to manage and deliver successful, modern cloud applications. Become a trusted advisor to decision-makers throughout the engagement.\nPropose solution architectures and manage the deployment of cloud-native application development solutions according to complex customer requirements and implementation best practices.\nWork with internal specialists, Product, and Engineering teams to package approaches, best practices, and lessons learned into thought leadership, methodologies, and published assets.\nInteract with Sales, Partners, and customer technical stakeholders to manage project scope, priorities, deliverables, risks and issues, and timelines for successful client outcomes.\nTravel approximately 30% of the time for client engagements.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/141687570424570566"}