{"title": "Senior Software Development Manager, Chrome Metrics", "level": "Advanced", "location": "Montreal, QC, Canada", "description": "Like Google's own ambitions, the work of a Software Developer goes way beyond just Search. Software Development Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of software developers. You not only optimize your own code but make sure software developers are able to optimize theirs. As a Software Development Manager you manage your project goals, contribute to product strategy and help develop your team. Software Development teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software developers are just getting started -- and as a manager, you guide the way. As the Chrome Metrics Senior Software Developing Manager, you will manage a team of developers in Montréal and Warsaw that supports all of Chrome Browser's experimentation and metrics infrastructure/tooling. You will be responsible for team direction, priorities, culture, and hiring. You'll partner with developing leads across Chrome to understand their teams' needs. In addition, you will manage the existing Montréal team and help hire and grow the Warsaw office. Chrome Metrics offers a large area of responsibility, collaboration opportunities across Chrome, and variety in the type of work we do (a full-stack tech environment). Chrome is dedicated to building a better, more open web. We’re focused on making a better browser (on both desktop and mobile) to help users take advantage of all the web has to offer in a safe and secure way.Chrome is available across all major platforms — iOS, Android, Windows, Mac, Linux and Chrome OS. We also built Chrome as an open source project so the entire web ecosystem could benefit from the latest innovations in speed, simplicity and security.", "salary": "", "key_qualifications": "Bachelor’s degree, or equivalent practical experience. 8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). 5 years of experience in a technical leadership role; overseeing projects, with 5 years of experience in a people management, supervision/team leadership role.", "preferred_qualifications": "Master's degree or PhD in Computer Science or related technical field. 5 years of experience working in a complex, matrixed organization.", "responsibilities": "Work with stakeholders to identify organizational priorities and customer needs. Set and communicate team priorities and align strategy, processes, and decision-making across teams. Manage a team and set clear expectations based on level and role. Meet regularly with individuals to discuss performance and development, and define and nurture the team culture. Develop the long-term technical vision and roadmap within your teams. Anticipate future requirements and infrastructure needs. Partner with the team's TL and the Data Science team lead on priorities and technical decision making. Oversee systems designs within the scope of the broader area, and review product or system development code to solve ambiguous problems. Review code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/141757403371578054"}