{"title": "Strategic Partner Manager, Apps and Gaming (English, Spanish)", "level": "Early", "location": "Dublin, Ireland", "description": "The Online Partnerships Group (OPG) uses our portfolio of product solutions, including AdSense and Google Marketing Platform tools, to help online publishers grow their businesses. You'll provide creative, industry-leading online advertising solutions for publishers and developers and identify new opportunities. Some of the largest publishers on the web rely on our products and we're always trying to exceed their expectations and strengthen our long-term partner relationships. We help grow Google's business with the largest online publishers and provide account management for users of AdSense, Google Ad Manager and more. In this role, you will provide excellent client service, research, and market analysis, you will also problem-solve, using relevant Google and third-party data to develop a strategic, forward looking perspective on customer focused insights and solutions. You will anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and showcase how our range of product offerings can grow their business. Working with them, you will set the direction and strategy for how their advertising can reach users. You will work with developers and be a trusted partner who will help them grow their businesses to the next level. You will show engagement style across a variety of customers and cross-functional peers to set shared objectives, create open communication, build partnerships, and balance your own interests to drive an impact while sharing best practices. The Global Partnerships organization is responsible for exploring new opportunities with Google's partners. Google’s Global Partnerships team works with a wide range of partners to bring the best of Google to power their business. The Global Partnerships team supports Google’s own Product teams with essential partnerships to help Google’s user experiences in advertising, Search, Assistant, Maps, Travel, Shopping, Payments and more. Teams create product-enabling partnerships, go-to-market strategies and incubate business growth for a variety of products.", "salary": "", "key_qualifications": "Experience in publisher yield management, ad operations, or sales/account management. Experience in stakeholder management. Ability to communicate in English and Spanish fluently to support client relationship management in this region.", "preferred_qualifications": "Bachelor's degree or equivalent practical experience. Ability to structure, analyze, and solve complex business challenges as well as to deliver impact against business goals. Ability to prioritize and solve complex problems, with effective attention to detail. Ability to identify and pursue strategic opportunities.", "responsibilities": "Manage and grow a portfolio of app developers across markets by identifying growth solutions while leveraging the value of the Google platform for app developers. Build trusted relationships with partners and develop an extensive understanding of their business challenges. Empower app developers by utilizing Google’s latest technologies to scale, distribute their apps, drive user engagement, and optimize their investment return. Develop or participate in scalable and innovative cross-functional projects that help fuel application developers' growth. Be part of a team focused on driving the Apps and gaming business in EMEA. Advocate for Google products to app developers in EMEA.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/141867228571017926"}