{"title": "User Experience Designer, Early Career", "level": "Early Career", "location": "Mountain View, CA, USA; San Francisco, CA, USA", "description": "At Google, we follow a simple but vital premise: 'Focus on the user and all else will follow.' Google’s Interaction Designers take complex tasks and make them intuitive and easy-to-use for billions of people around the globe. Throughout the design process—from creating user flows and wireframes to building user interface mockups and prototypes—you’ll envision how people will experience our products, and bring that vision to life in a way that feels inspired, refined, and even magical.", "key_qualifications": "Bachelor's degree in Design (e.g., Interaction, Graphic, Visual Communications, Product, Industrial), Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience.", "preferred_qualifications": "Certification in Grow with Google, UX Design, or similar. 1 year of experience working with designers, researchers, engineers, content strategists, and product managers throughout the design process (e.g., creating user flows, wireframes, and building user interface mockups/prototypes). Experience with consumer mobile design. Excellent leadership, communication and collaboration skills. Portfolio demonstrating command of visual design, with an understanding of typography, color theory, and visual storytelling.", "responsibilities": "Help to define the user model and user interface for Google products and features. Develop detailed storyboards, mockups, and prototypes to communicate interaction and design ideas. Collaborate with product managers, engineers, researchers, writers, and cross-functional stakeholders to understand requirements, and provide creative solutions. Evaluate the usability of new and existing products and make constructive suggestions for change.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142022721218192070"}