{"title": "Customer Engineer, Federal Civilian Agencies, Google Public Sector", "level": "Advanced", "location": "Reston, VA, USA; Washington D. C., DC, USA", "description": "When leading companies choose Google Cloud, it's a huge win for spreading the power of cloud computing globally. Once educational institutions, government agencies, and other businesses sign on to use Google Cloud products, you come in to facilitate making their work more productive, mobile, and collaborative. You listen and deliver what is most helpful for the customer. You assist fellow sales Googlers by problem-solving key technical issues for our customers. You liaise with the product marketing management and engineering teams to stay on top of industry trends and devise enhancements to Google Cloud products. As a Customer Engineer, you will work with Technical Sales teams to differentiate and communicate the growth of Google Cloud to our clients. You will help prospective customers and partners understand the power of Google Cloud explaining technical features, helping customers design architectures, engaging in proof-of-concepts, and troubleshooting potential roadblocks. Must be a US Citizen to meet customer and compliance requirements, including potential access to classified information.", "salary": "$142,000-$214,000 + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or equivalent practical experience. 10 years of experience with cloud native architecture in a customer-facing or support role. Experience engaging with, and presenting to, technical stakeholders and executive leaders.", "preferred_qualifications": "Experience promoting technology solutions to the US Department of State. Experience developing scalable architectures and mission solutions using API management, microservice frameworks, PaaS, and container orchestration systems, or other applicable platforms. Experience with Big Data technologies or concepts, such as analytics warehousing, data processing, data transformation, data governance, and data migrations, and leveraging AI/ML solutions to solve customer issues. Knowledge of regulatory and compliance frameworks, especially FedRAMP or FISMA. Ability to learn, understand, and work within solutions in the Google Cloud/IT technology space. Active US Government Top Secret Security Clearance.", "responsibilities": "Identify business and technical requirements, conduct full technical discovery, and architect client solutions to meet gathered requirements. Lead technical projects, technology advocacy, support bid responses, product and solution briefings, proof-of-concept work, and the coordination of supporting technical resources. Deliver product messaging for the Google Cloud Platform by using whiteboard and slide presentations, product demonstrations, white papers, trial management, and Request for Information (RFI) response documents. Drive recommendations on integration strategies, enterprise architectures, platforms, and application infrastructure to implement a complete solution providing best practice advice to customers to optimize Google Cloud platform effectiveness. Travel to customer sites, conferences, and other events as needed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142045669228454598"}