{"title": "Technical Program Manager III, Retail Systems, Google Stores", "level": "Mid", "location": "Mountain View, CA, USA; San Francisco, CA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish.", "key_qualifications": "Bachelor's degree in a technical field, or equivalent practical experience with consumer electronics. 5 years of experience in program management. Experience managing technology projects from initiation to completion. Experience in systems management and managing execution programs. Experience with User Acceptance Testing or Quality Assurance Testing.", "preferred_qualifications": "5 years of experience managing cross-functional or cross-team projects. Experience planning and leading software release cycles, prioritizing features, coordinating schedules, user testing, and communication with stakeholders on roadmaps, delivery status, and change management details. Experience with retail systems, inventory management systems, e-commerce platforms, and omni-channel systems. Experience delivering global enterprise employee/consumer facing mobile and web applications, and with user experience and interactive design best practices. Ability to work with stakeholders to clarify business problems, identify process/user experience improvement opportunities, and represent business interests during the design and development of technology solutions.", "responsibilities": "Represent the business in the design and development of retail systems, such as point-of sale (POS) systems, inventory management systems, and scheduling systems. Ownership of release management of all new technology and system enhancements to the end user. Partner with business stakeholders to document system requirements, validate and test system changes, and craft documentation related to systems enhancements. Leverage system, user interface, and business process knowledge to collaborate with engineering and design teams to develop and implement new technology solutions. Ensure clear communication to all stakeholders and thorough documentation of each incident for future reference and knowledge base improvement.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142011860319642310"}