{"title": "Senior Business Intelligence Analyst, YouTube", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "YouTube Analytics and Data Science (ADS) powers sound business decisions through analytics, data, and insights generation. Partnerships ADS improves the experience for YouTube’s Content and Product Partnerships by helping drive proactive management across relationships with creators, brands, media companies, and distributors through the development of scaled data products and cogent insights for partner facing engagement and GTM (go-to-market) strategy. At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.", "key_qualifications": "Bachelor's degree or equivalent practical experience.\n8 years of experience in analytics and analytics development.\nExperience with relational databases including SQL queries, database definition, and schema design.", "preferred_qualifications": "Master’s degree in a quantitative field or equivalent practical experience.\nExperience converting business requests into technical requirements for insightful data products.\nExperience deploying data products, and working cross-functionally to deliver products and tailored communications to drive adoption.\nExperience creating dashboards, manipulating datasets, and performing data analysis using SQL and data visualization tools (e.g., Looker, Tableau, PowerBI, Data Studio, etc.).\nExperience with one or more programming languages (e.g., Python, Java, C++, etc.) to deliver or manage data pipelines.", "responsibilities": "Lead development and deployment of centralized reports, dashboards, models and tools to analyze, report, and present partnerships and operations related data that is associated with the organization.\nWork with Partnerships and GTM teams to determine key business questions and pain points in existing processes where ADS data products can improve support outcomes.\nDeliver and contribute to a prioritized roadmap, work cross-functionally with Data Infrastructure to release product features.\nDeliver data products to User Support teams which drive better decision-making, create KPIs and key results for the business domain, and make strategic and operational recommendations to achieve goals.\nSupport technical practices within the analyst community on pipelines, dashboards, code review practices, and data concepts, and lead technical training for business analysts.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142196102873916102"}