{"title": "New Business Account Executive (English, Portuguese)", "level": "", "location": "São Paulo, State of São Paulo, Brazil", "description": "As a member of the New Business Development team, you develop new product initiatives with our Product, Engineering, Marketing and Partnerships teams. You're a true thought leader who can find, digest and share industry trends and key influencers. You open doors with potential partners, chat with them about their businesses and present these opportunities to our senior leaders. In doing so, you help discover and shape some of Google's boldest ventures. At Google, we set ourselves goals we know we can't reach yet. Our New Business Development team works on game-changing ideas, from technological experiments to the expansion of existing businesses into new territories. We're a team of technologists, entrepreneurs and leaders with an eye for what's next, working across Google to develop products and ideas that revolutionize the way people connect with information.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 2 years of experience in full life-cycle sales. Experience in developing relationships with new customers and serving as a consultant. Ability to communicate in English and Portuguese fluently to engage with local stakeholders.", "preferred_qualifications": "Experience in building a book of business, ensuring the management and fulfillment of strategic goals, and developing associated agreements. Experience in educating new advertisers on the benefits of transitioning from traditional media to digital marketing strategies. Experience in the internet advertising industry and exceeding quota attainment. Ability to work in an ambiguous team environment. Excellent written and verbal communication skills, with the ability to provide comprehensive advertising solutions to prospective clients.", "responsibilities": "Acquire high-potential advertisers to grow with Google. Map market to identify advertisers. Design client first reach/contact (e.g., cold call, cold email, etc.) and understand client business and marketing needs. Design tailored proposals based on client needs, close agreements and transition them to account management teams. Be the trusted advisor, market expert for certain segments.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142170647408059078"}