{"title": "Principal Architect, Digital Native, Google Cloud", "level": "Advanced", "location": "Beijing, China; Shanghai, China", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.", "key_qualifications": "Bachelor's degree in Computer Science, a related technical field, or equivalent practical experience. 10 years of experience as an enterprise architect in a cloud computing environment or equivalent experience in a customer-facing role focusing on media and entertainment. Experience in cloud computing, including cloud market and competitive dynamics. Ability to communicate in Mandarin fluently to interact with local stakeholders.", "preferred_qualifications": "Experience with structured Enterprise Architecture practices, hybrid cloud deployments, and on-premise-to-cloud migration deployments/roadmaps. Experience in the enterprise technology buying and evaluation process. Experience in building, architecting, designing, and implementing highly distributed global cloud-based systems, and in network infrastructure, security, and application development. Knowledge of technology solutions and ability to learn, understand, and work quickly with new emerging technologies, methodologies, and solutions in the Cloud/IT technology space. Understanding of large-scale computing solutions. Ability to work cross-functionally, engage/influence audiences, and identify expansion engagements.", "responsibilities": "Build a trusted advisory relationship with strategic accounts, engage with Architects, VP Engineering, and executive-level stakeholders, and identify customer priorities, technical objections, and design strategies encompassing the entire Google ecosystem to deliver business value and resolve blockers. Provide domain expertise around public cloud and enterprise technology, and effectively promote Google Cloud with customers, at conferences, and online. Make recommendations on integration strategies, enterprise architectures, platforms, and application infrastructure to successfully implement a complete solution providing best practice advice to customers to optimize Google Cloud effectiveness. Manage the holistic enterprise architecture relationship with customers by collaborating with specialists, product management, engineering, and more. Travel to customer sites, conferences, and other related events.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142243787479884486"}