{"title": "Data Center Technician, Hardware Operations", "level": "", "location": "Lancaster, OH, USA", "description": "Google isn't just a software company. The Hardware Operations team is responsible for monitoring the state-of-the-art physical infrastructure behind Google's powerful search technology. As an Operations Technician, you'll install, configure, test, troubleshoot and maintain hardware (like servers and its components) and server software (like Google's Linux cluster). You'll also take on the configuration of more complex components such as networks, routers, hubs, bridges, switches and networking protocols. You'll participate in or lead small project teams on larger installations and develop project contingency plans. A typical day involves manual movement and installation of racks, and while it can sometimes be physically demanding, you are excited to work with infrastructure that is at the cutting-edge of computer technology. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible. The US base salary range for this full-time position is $81,000-$119,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google. ", "key_qualifications": "Bachelor's degree or equivalent practical experience.  Experience diagnosing and troubleshooting one of the following: operating systems and computer/server hardware or networking protocols. Experience with performing component-level repairs on IT equipment. Ability to lift/move 50lb (23kg) of equipment and ability to exert yourself physically over extended periods of time, including frequent bending, kneeling, climbing, pushing/pulling and lifting. Ability to work non-standard hours, including working weekends, holidays and on shift-based schedule as required. ", "preferred_qualifications": "Certification in Google IT Support Professional Certificate program. 2 years of experience diagnosing and troubleshooting one of the following: operating systems and computer/server hardware or networking protocols. Experience working within a data center or network operation center environment. Ability to collaborate and partner with teams to overcome issues. Ability to adapt to changes in a dynamic work environment. ", "responsibilities": "Deploy and operate new data center infrastructure across projects or functions. Report issues and follow data center procedures to troubleshoot and diagnose straightforward issues with equipment or infrastructure as they arise, and apply the resources needed to resolve identified issues. Maintain the security and integrity of data, track various forms of media to check for standard data security issues (e.g., data was not properly erased) handled in accordance with Google security standards. Disassemble specific equipment that has reached its end-of-life via part replacement or maintenance in a team setting. Repair, fix, and perform preventative maintenance on equipment, servers, machines, or infrastructure based on identified issues with defined solutions and limited guidance. ", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142261959150969542"}