{"title": "ASIC Design for Testability Engineer, Silicon", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.\n\nWith your technical expertise, you lead projects in multiple areas of expertise (i.e., engineering domains or systems) within a data center facility, including construction and equipment installation/troubleshooting/debugging with vendors.\n\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "salary": "", "key_qualifications": "Bachelor's degree in Mechanical Engineering, Electrical Engineering, Industrial Engineering, or equivalent practical experience.\n3 years of experience in Design for Testability.\nExperience with any one of ATPG, LV, BIST, JTAG tools and flow.", "preferred_qualifications": "Experience with a scripting language such as Perl.\nExperience with Synthesis, Logic Testing, and ATPG.\nKnowledge of design DFT techniques used for logic testing.\nAbility to scale DFT, with a focus on minimal area overhead.", "responsibilities": "Work on a team of Design for Testing (DFT) engineers, working closely with RTL and Physical Designer engineers.\nWrite basic to complex scripts to automate the DFT flow.\nCommunicate and work with multi-disciplined and multi-site teams.\nWork with members of the DFT team to deliver overall deliverables for an IP or SoC.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142378119286661830"}