{"title": "Customer Engineer, Data Management (English, French)", "level": "Advanced", "location": "Paris, France", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.", "key_qualifications": "Master's degree in Computer Science, or equivalent practical experience. Experience planning infrastructure and application modernization as a technical consultant, technical pre-sales engineer, or enterprise architect. Experience in application delivery cycles, technical architecture, methodologies for devops, and leading IT strategy discussion and design cloud adoption plans. Ability to communicate in English and French fluently to interact in this customer-facing sales role.", "preferred_qualifications": "Experience architecting and developing software or infrastructure for scalable and secure distributed systems. Knowledge of on-premise and hyperscaler technologies in infrastructure and data areas. Ability to learn, understand and work with new emerging technologies, methodologies, and solutions in the cloud technology space. Excellent presentation skills, with the ability to deliver technical presentations.", "responsibilities": "Work with the team to identify and qualify business opportunities, understand key customer business and technical challenges, and develop the strategy and solution to support their stakes. Inspire customers and peers to solve difficult problems with novel solutions. Manage the technical relationship with Google’s customers, including managing product and solution briefings, proof-of-concept work, and the coordination of additional technical resources. Work with customers to demonstrate and prototype Google Cloud product integrations in customer/partner environments, and travel to customer sites, conferences and other related events as needed. Recommend integration strategies, enterprise architectures, platforms, and application infrastructure to implement a complete solution using best practices on Google Cloud.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142485596487459526"}