{"title": "Systems Development Engineer, Google Cloud", "level": "Mid", "location": "Tel Aviv, Israel; Haifa, Israel", "description": "As a Systems Development Engineer at Google, you'll own and support the needs of Google's internal systems and related infrastructure. You're highly technical and will work directly with other systems and service owners to ensure reliability and sustainability of the Google service infrastructure as well as compliance with internal policies. Success in this role means you'll be able to support systems in a mixed operating system environment and will work efficiently with our internal technology providers as well as other operations groups. Googlers will rely on your guidance when it comes to design decisions so you'll have a direct impact in keeping the business productive. Google Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "key_qualifications": "Bachelor's degree in Computer Science or IT-related field, or equivalent practical experience. Candidates will typically have 3 years of experience with systems automation, and with systems design and implementation. Typically 3 years of experience with technical infrastructure (e.g., deployment, maintenance, troubleshooting). Experience in EDA tools and scripting languages (e.g., Unix Shell, Python).", "preferred_qualifications": "Experience with cloud systems design. Experience with Site Reliability Engineering and/or Developer Operations, with Jenkins and/or Gerrit. Experience in analyzing and troubleshooting complex distributed systems.", "responsibilities": "Develop and support a broad set of Electronic Design Automation (EDA) Cloud's technical stack and identify areas for improvement. Provide technical leadership and contribution to EDA Cloud systems and workflows. Develop and drive automated solutions. Work collaboratively and implement solutions with partner teams. Identify and explore new tools and technologies to improve the EDA Cloud environment.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142426857910739654"}