{"title": "Director, Product Management, Real World Journeys, Search", "level": "Director+", "location": "San Francisco, CA, USA; New York, NY, USA", "description": "Real World Journey’s mission as a team is to inspire action by connecting people with experiences that make life better. Doing that well means that we help people save time, money, and connect with each other and the world.  As the Director of Product Management, you will lead the Real World Journeys Foundations team. You will manage a distributed team of product managers in a complex environment, while owning the future vision and roadmap of a core product. You'll provide a strong product vision and acumen, creativity and innovation, and work across both strategic and operational initiatives to build effective bridges and alignment through trusted partnerships. In Google Search, we're reimagining what it means to search for information – any way and anywhere. To do that, we need to solve complex engineering challenges and expand our infrastructure, while maintaining a universally accessible and useful experience that people around the world rely on. In joining the Search team, you'll have an opportunity to make an impact on billions of people globally.", "salary": "$253,000-$363,000", "key_qualifications": "Bachelor's degree in Computer Science, related field, or equivalent practical experience. 15 years of experience in product management.", "preferred_qualifications": "Experience launching successful consumer products at scale. Ability to set and drive the big picture strategy for a product team, while also providing detailed guidance on individual projects. Excellent organizational leadership skills, with the ability to collaborate with and influence teams across boundaries, including technical proficiency and ability to work closely with Engineering partners. Exceptional communication skills, with the ability to represent complex business or technical concepts with senior leadership. A commitment to building inclusive teams and team culture. ", "responsibilities": "Drive the vision, strategy, and product roadmap for Search Real World Journeys Foundations, including building core horizontal capabilities and leveraging generative AI to build highly innovative experiences across complex journeys. Deliver high-quality and impactful launches through close partnership with Engineering, UX, and other key stakeholders (including other Product leaders). Unlock roadblocks at the corporate level and cultivate collaboration with senior product leaders across Google through leadership, creativity, intelligence, and presence. Inspire and grow a team of product managers and collaborate with a large team of dedicated engineers.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142456207167103686"}