{"title": "Open Source Intelligence Specialist, Global Security Operations Center", "level": "Mid", "location": "Singapore", "description": "Security is at the core of Google's design and development process: it is built into the DNA of our products. The same is true of our offices. You're an expert who shares our seriousness about security and our commitment to confidentiality. You'll collaborate with our Facilities Management team to create innovative security strategies, investigate breaches and create risk assessment plans for the future. You believe that providing effective security doesn't come at the expense of customer service - you will be our bodyguard (and our long lost pal). This position entails a rotating shift schedule consisting of four 12-hour workdays per week, including weekends and public holidays.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 5 years of experience in law enforcement, intelligence, a military role, or similar private sector.", "preferred_qualifications": "Understanding of threat types and trends. Understanding of global geopolitical trends and emerging threats and risks. Ability to handle highly confidential and sensitive information. Excellent problem solving, communication, and collaboration skills, with the ability to take initiative while building cross-functional relationships. Excellent judgment, discretion, and diplomacy skills. Excellent critical thinking and decision making skills.", "responsibilities": "Collect, evaluate, escalate, and disseminate intelligence to support action plans based on credibility and likelihood. Provide intelligence support to the Global Security Operations Center (GSOC) in incident response, crisis management, and global travel management. Use open source material to find, research, and assess information that could indicate a potential concern to Google, our employees, and our interests. Support the development of protocols and practices to assess and mitigate issues to Google, to drive efficiency, and to manage crises. Provide pan-regional coverage when adequate staffing is unavailable.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142557847836598982"}