{"title": "Environmental Health and Safety Program manager, Submarine Networks", "level": "Mid", "location": "Singapore", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines. Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.", "key_qualifications": "Bachelor's degree in Environmental Health and Safety, Engineering, a related field, or equivalent practical experience. 5 years of experience in EHS program management, project management, or a related field. Experience in the data center, mission critical design concepts, and international environmental regulations.", "preferred_qualifications": "5 years of experience managing cross-functional or cross-team projects. Experience in subsea cable and marine projects (i.e., O&G, etc.) and Data Centre/Colocation build facilities and OSP (Outside Plant Construction). Knowledge of EHS regulations and best practices. Knowledge of the EHS, contractor qualification and evaluation, preferably submarine cable operations/construction domains, and regulatory landscape.", "responsibilities": "Identify, organize, and lead program activities throughout the program life-cycle and stakeholders to deliver successful business, operational, and technical improvements within the EHS domain. Collaborate effectively with internal and external stakeholders, building strong relationships and fostering a culture of safety and compliance. Manage program budget and resources effectively. Stay abreast of industry best practices and emerging trends in EHS and submarine cable landing/operations.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142557118967227078"}