{"title": "Strategy and Operations Lead, Mastery Go-to-Market", "level": "Mid", "location": "Mountain View, CA, USA", "description": "The Mastery Team develops and delivers product and skills training to Google sales and services teams, as well as external client and agency partners...", "key_qualifications": "Bachelor's degree or equivalent practical experience.  6 years of experience in management consulting, sales operations, business strategy, investment banking, venture capital, private equity or corporate advisory, or 4 years of experience with an advanced degree.", "preferred_qualifications": "MBA or PhD. Experience in developing and executing strategies to deliver business results. Ability to pay attention to detail and manage multiple projects under deadlines. Ability to communicate with and influence senior executives and sales/enablement teams. Excellent problem solving, leadership, and analytical skills. Ability to work with people from a broad range of backgrounds and experiences.", "responsibilities": "Define, prioritize, structure, and execute strategic and operational initiatives which includes developing work plans, gathering and synthesizing data, leading analyses, and developing and implementing recommendations. Drive operations for the organization, including optimizing resource allocation, measuring/reporting progress against key objectives, and managing business updates/quarterly reviews. Deliver on initiatives that are foundational elements to the Mastery team achieving learning and business objectives (e.g., process standardization and optimization, measurement strategy, talent strategy, etc.). Analyze business processes to identify potential issues, uncover/prioritize levers for improvement, and influence senior stakeholders to implement suggested improvements. Structure and package work into compelling presentations and communications that influence various audiences including senior executives.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142502638917690054"}