{"title": "Silicon Engineer, System Level Testing Volume Ramp, Silicon", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.\nAs a member of the Google Tensor team, you will enable the system level testing methodology for volume ramp. You will contribute to test planning, integration, stabilization, and debugging on a variety of post-silicon platforms. You will collaborate with many IP teams to support the Product Development and Test Engineering (PDTE) team on volume ramp tasks. You will build a deep understanding of the post-silicon characterization and use it to improve the factory yield.\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science or Electrical Engineering, or equivalent practical experience. 3 years of experience in silicon bring-up or validation, debugging post-silicon issues and developing silicon tests. Experience programming in C.", "preferred_qualifications": "Master's degree or PhD in Computer Science, Electrical Engineering, or related domains. Experience with embedded software development and related toolchains, or software debug tools (e.g. GDB) and hardware debug tools (e.g. JTAG/TRACE32). Experience with Android, Embedded Linux, RTOS, or bare metal software. Experience with Python programming. Experience in factory testing.", "responsibilities": "Contribute to test planning, test development/stabilization, and error debugging to support the silicon volume ramp at the system level. Support the PDTE team on silicon volume ramp tasks. Collaborate with Design and Validation leads to support the system level testing platform. Collaborate with internal test engineers and partner engineers on screening parts and debugging RMAs. Collect the post-silicon characterization data to improve the production quality and yield.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142677167598117574"}