{"title": "Cloud Technical Resident, Cloud Academy, Early Career (English, Japanese)", "level": "Early", "location": "Tokyo, Japan", "description": "Google Cloud Academy – Technical Residency Program is for very motivated individuals. This fast-paced 9-month program is your chance to learn from excellent customer-facing staff (technical and non-technical) at Google and see how we transform businesses in the digital world. It's all about practical learning, mentorship from excellent customer facing staff members, and getting certified in Google Cloud products & services. See your work create great results!  We're not just promoting products—we help companies stay ahead of the curve through innovation. Build your skills, grow your network, and explore different paths within Google Cloud’s customer facing team to help start off your career well. You will participate in two rotations that will help you be confident and competent in front of customers, ranging from startups to large enterprise companies!  We value collaboration, real impact, and shaping the future of tech.", "salary": "", "key_qualifications": "Bachelor's degree in relevant STEM field (e.g., Computer Science, Information Systems, Management Information Systems) or equivalent practical experience. Experience in Databases, Web Technologies, Machine Learning/AI, or Cloud Foundations (e.g., cloud computing, GCP, or similar) through certifications, internships, coursework, or relevant practical experience. Experience working in customer service, presenting to clients, or in a leadership role within a school or volunteer organization. Ability to communicate in Japanese and English fluently to support client relationship management in this region.", "preferred_qualifications": "Experience developing programs/scripts in C++, Java, Python or experience in infrastructure/system administration. Experience building or troubleshooting websites or web applications using web technologies (e.g., HTTP(S), JavaScript, APIs, TCP/IP, DNS). Experience in systems software and algorithms, working with Linux/Unix. Experience in database design and SQL query construction. Experience leading entrepreneurial efforts, outreach within organizations, and/or in project/product/program management. Ability to adapt your message to stakeholders and present technical materials. Organizational, problem-solving, or troubleshooting skills.", "responsibilities": "Help Google Cloud customers meet their business goals by providing strategic solutions and recommend digital transformation. Improve product feature offerings by providing customer feedback to internal cross-functional teams including Product Management and Engineering. Help develop recommendations for solution architectures and consulting services. Guide customers through the entire innovation lifecycle, building strategic roadmaps and driving achievement of key milestones. Solve customers' operational issues through problem solving and technical troubleshooting, while working with internal teams to drive resolution. Help customers get answers to product questions.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142770680639693510"}