{"title": "Software Engineer III, Mobile (Android), Google Photos", "level": "Mid", "location": "Mountain View, CA, USA", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\n\nGoogle Photos is a photo sharing and storage service developed by Google. Photos is one of the most sought after products at Google and is looking for both client-side (web and mobile), with server-side (search, storage, serving) and machine intelligence (learning, computer vision) Software Engineers. We are dedicated to making Google experiences centered around the user.", "salary": "$136,000-$200,000 + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree or equivalent practical experience.\n2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree in an industry setting.\n2 years of experience with data structures or algorithms in either an academic or industry setting.\n2 years of experience Android application development.", "preferred_qualifications": "Master's degree or PhD in Computer Science or related technical field.\n2 years of experience with performance, large scale systems data analysis, visualization tools, and/or debugging.\nExperience developing accessible technologies.\nProficiency in code and system health, diagnosis and resolution, and software test engineering.", "responsibilities": "Write product or system development code.\nReview code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\nContribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\nTriage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.\nParticipate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142725500274385606"}