{"title": "Senior Director, AI Product Marketing, Google Cloud", "level": "Director+", "location": "Sunnyvale, CA, USA", "description": "As the Senior Director, AI Product Marketing for Google Cloud, you will be responsible for establishing Google Cloud as the leader in AI for business decision makers in businesses, organizations, and governments, and all types of developers and data scientists. You will do this in partnership with our product teams, customer-facing teams, and the larger Google AI community.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 15 years of experience in product/solutions marketing, or product management. Experience marketing AI, developing market-defining products, and category creation. Experience leading teams in a global environment.", "preferred_qualifications": "Experience inspiring developer audiences. Experience marketing or selling to IT and Business leaders. Experience building and scaling high-performing teams. Ability to be a product/technology advocate. Outstanding narrative and storytelling abilities that propel adoption and market momentum. Ability to influence a wide audience at all levels and work cross-functionally, partnering with Sales, Engineering, Product Management, and partner teams.", "responsibilities": "Lead and nurture a marketing team that inspires our customers and drives awareness, consideration, adoption, engagement and advocacy of Google Cloud AI. Build thought leadership, inspiring customers to see their best path to success with AI is with Google and Google Cloud. Help press and influencers see the momentum and opportunity of Google Cloud AI. Win new customers. Clear offers and ways to bring customers on the adoption journey, and be responsible for increasing the customer base. Help existing Google Cloud customers benefit from more usage of AI. Engage developers. Help developers become AI developers. Build a growing business. Help build an AI business for Google Cloud.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142759052827337414"}