{"title": "Data Center Facilities Technician", "level": "Early", "location": "Sterling, VA, USA; Leesburg, VA, USA", "description": "The Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facilities Technicians at Google data centers operate, monitor and support physical facilities conditions. Some of these duties will include heating and cooling of air and water, power supply, generators, UPS systems, electrical distribution and control and monitoring systems. You regularly help inspect, maintain and repair various data center systems such as piping and non-critical electrical or mechanical system components). You provide daily assistance to senior technicians as you read blueprints/schematics, conduct tours of systems and assess their working order. As an advocate for best practices, you develop creative approaches to reducing operational costs while improving overall data center efficiency. You ensure that environmental and safety standards are consistently met, identifying problems and making repairs quickly. In emergency situations or abnormal conditions, you manage data center performance issues and outages to minimize the recovery time from failures.", "salary": "$81,000-$119,000 + bonus + equity + benefits", "key_qualifications": "Associate's degree, trade school certification, or equivalent practical experience. 5 years of experience in mechanical/heating, HVAC, controls/automation or electrical systems used in a data center environment (e.g., Feeders, Transformers, Generators, Switchgear, UPS systems, ATS/STS units, PDU/PMM units). 2 years of experience in apprenticeship or technician level in Mechanical/Heating, HVAC, or Electrical Engineering. Ability to lift and move 50 lbs of equipment and work on platforms, ladders, and under raised floors. Ability to work non-standard hours and differing work rotations/shifts.", "preferred_qualifications": "Certification in Universal Refrigerant Handling. Experience in a data center, hospital, or power plant environment. Knowledge of electrical and mechanical systems used in a data center environment, including Feeders, Transformers, Generators, Switchgear, UPS systems, ATS/STS units, PDU/PMM units, Chillers, Air handling units, and CRAC units. Ability to communicate effectively with contractors who perform maintenance or upgrade work on systems. Ability to learn quickly and address issues as they arise.", "responsibilities": "Operate, monitor, maintain, and respond to abnormal conditions in facilities systems (i.e., electrical, mechanical, and building monitoring and control). Track operational characteristics. Train and mentor peers.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142728952354349766"}