{"title": "Growth Strategy and Analytics Manager, Subs Retention", "level": "Mid", "location": "Mexico City, CDMX, Mexico", "description": "YouTube Marketing’s mission is to know our users, and to connect them to the magic of our products and creators. We make YouTube successful by shaping people’s perceptions of YouTube and inspiring them to engage with us. We’re also responsible for all of YouTube’s marketing activities to consumers, creators, and key opinion influencers.\nKnow the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google's products solve the world's problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 6 years of experience in marketing, growth, or related functions, including performing modeling in SQL and using quantitative and qualitative insights to inform growth strategy, roadmap, prioritization, etc. Experience managing cross-functional or cross-team projects.", "preferred_qualifications": "Experience growing an eCommerce product, especially a subscription business. Experience with an international B2C business. Experience with marketing analytics, metric analysis, and measurement. Experience developing relationships and working collaboratively with multiple cross-functional partners, including product, engineering, and data science. Excellent process and project management skills with the ability to set goals and systematically prioritize growth initiatives.", "responsibilities": "Manage and influence the short- and long-term growth strategy, goals, and priorities, partnering closely with cross-functional and international marketing, product, operations, strategy, UX, data science, and engineering teams.\nSolve strategic business problems through identifying and sizing high impact growth strategies via analyses (e.g., SQL, modeling), dash-boarding, and monitoring business and industry trends.\nOwn the measurement and analysis for our paid and free channels and campaigns with a focus on maximizing our retained user subscriber volume and ROI.\nManage a team of vendor analysts and develop a scaled resourcing plan.\nDeliver effective communications and presentations to multiple levels of stakeholders.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/142892207483822790"}