{"title": "Software Engineer III, Machine Learning, Google Cloud Platforms", "level": "Mid", "location": "Sunnyvale, CA, USA", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. With your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions. Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems. The US base salary range for this full-time position is $136,000-$200,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "key_qualifications": "- Bachelor’s degree or equivalent practical experience.\n- 2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree in an industry setting.\n- 2 years of experience with data structures or algorithms in either an academic or industry setting.\n- 2 years of experience with machine learning algorithms and tools (e.g., TensorFlow), artificial intelligence, deep learning and/or natural language processing.", "preferred_qualifications": "- Master's degree or PhD in Computer Science or related technical field.\n- 2 years of experience with performance, large scale systems data analysis, visualization tools, and/or debugging.\n- Experience developing accessible technologies.\n- Proficiency in code and system health, diagnosis and resolution, and software test engineering.", "responsibilities": "- Write product or system development code.\n- Participate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.\n- Review code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\n- Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\n- Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/143127809324131014"}