{"title": "Treasury Accountant, Alternative Investments", "level": "Mid", "location": "Chicago, IL, USA", "description": "Google accountants are a savvy bunch who handle the core accounting responsibilities at Google. You know your accounting principles and the full accounting process end to end...", "key_qualifications": "Bachelor's degree in Accounting, Finance, Business, a related field, or equivalent practical experience. 4 years of experience in public accounting or industry. Experience in GAAP accounting principles related to investments or investment company accounting.", "preferred_qualifications": "Certified Public Accountant (CPA). Experience in Investments (ASC320), Investment Company Accounting (ASC946), Consolidations (ASC810), Fair Value (ASC820), Foreign Currency Transactions and Translation (ASC 830), and Alternative Investments. Experience in data analysis tools (e.g., SQL, Python, or Scripting). Ability to learn quickly to execute tasks in a fast-paced environment, with attention to detail. Ability to have a collaborative style and work with cross-functional and international teams.", "responsibilities": "Participate in monthly and quarterly close related activities including loan receivable, debt security investments (AFS), Fair Value, and alternative investment asset classes. Participate in strategic investment initiatives, including technical accounting research and analysis, drafting adoption memo and documenting accounting conclusions, while solutioning operational accounting and reporting considerations to ensure treasury controllership objectives are met. Support compliance of Internal Controls over Financial Reporting (ICFR) program and Sarbanes-Oxley (SOX) requirements, particularly for manual controls, systems controls, and Information Produced by Entity (IPE) for the Treasury Accounting team. Lead in special projects and initiatives, planning and execution from time to time focusing on treasury related activities and other adhoc projects as assigned.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/143257162129253062"}