{"title": "Systems Development Engineer, Silicon Infrastructure", "level": "Early", "location": "Bengaluru, Karnataka, India", "description": "Systems Development Engineering (SDE) at Google is a role where you manage services and systems at scale. SDEs creatively put their engineering discipline to use automating the mundane and reducing toil. We don’t just write code to fix bugs, but emphasize the development of tools and solutions that fix classes of problems. We know it’s hard to control what you can’t measure – so we focus on observability: instrumenting first, then turning data into knowledge, and finally knowledge into action. We know that the operational efficiency of Google systems, services, virtual compute environments and the operating systems that power them impact the environment, not just the bottom line. We know that working together we can do more, and that community matters.\n\nGoogle brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow.\n\nTogether we engineer and build the infrastructure, tools, access and telemetry for systems that enable orchestration of Google-scale services. Come build things that matter.\n\nThe Silicon Infrastructure team is responsible for building and operating the underlying foundation infrastructure used for designing custom silicon. This includes compute platforms, CI/CD, Cloud, groups and ACLs, source control, dashboards, resource economy, and bench labs used by silicon engineers in their daily work.\n\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science or IT-related field, or equivalent practical experience. 2 years of experience with systems automation. 2 years of experience with technical infrastructure (e.g., deployment, maintenance, troubleshooting).", "preferred_qualifications": "Experience in implementing, troubleshooting, and supporting High-Performance Computing systems. Experience with cloud provider ecosystems of cloud service providers. Experience in supporting large-scale complex cloud-based infrastructure. Experience in one of the HPC Schedulers such as LSF, Symphony, NC, or SLURM. Experience with DevOps tools such as Terraform, Puppet, Ansible, Jenkins. Excellent investigative and problem-solving skills, with effective communication abilities.", "responsibilities": "Ensure the timely delivery of silicon designs using Google Cloud Platform (GCP) within a fast-paced environment. Monitor and uphold high-standards for internal services on Google Cloud. Provide support, maintain, and deploy team-supported infrastructure and documentation. Collaborate closely with engineering teams to implement and develop on Google Cloud infrastructure. Automate tasks wherever possible.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/143279576825373382"}