{"title": "Program Manager II, Network Optimization, Google Cloud", "level": "Mid", "location": "Atlanta, GA, USA", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines.<br/><br/>Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.", "key_qualifications": "Bachelor's degree in Supply Chain Management, Logistics, Industrial Engineering, Operations Research, or equivalent practical experience.<br/>2 years of experience in supply chain program or project management.<br/>Experience with logistics and distribution processes, transportation modes, warehouse operations, and inventory management.<br/>Experience with network principles, cost modeling, algorithms, and tools.", "preferred_qualifications": "2 years of experience managing cross-functional or cross-team projects.<br/>Experience with data analysis tools and techniques (e.g., SQL, Python, R).<br/>Knowledge of logistics and distribution processes, transportation modes, warehouse operations, and inventory management.<br/>Knowledge of statistical methods (e.g., regression, hypothesis testing) for analyzing cost drivers and identifying trends.<br/>Ability to evaluate data and information, challenge assumptions, and make sound decisions based on evidence.", "responsibilities": "Collaborate with manufacturing, logistics, data center, and commodity teams to design and optimize logistics and distribution strategies for cloud infrastructure components.<br/>Develop comprehensive network cost models that incorporate factors such as transportation costs, inventory holding costs, warehouse operating costs, and customs duties.<br/>Identify and structure data sources to support network cost and service model development and validation.<br/>Collect, clean, and analyze data related to shipment volumes, transportation rates, inventory levels, warehouse utilization, and customer service metrics.<br/>Work with engineering and design teams to ensure that network cost considerations are integrated into the product development process.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/143463266872369862"}