{"title": "Technical Program Manager, Pixel Carrier Certification", "level": "Mid", "location": "Bengaluru, Karnataka, India", "description": "A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company.", "key_qualifications": "Bachelor's degree in a technical field or equivalent practical experience. 2 years of experience managing projects.", "preferred_qualifications": "7 years of experience in carrier certification, including expertise in RF, protocol, field testing, and program management for certification. Experience troubleshooting issues occurring in certification, perform log analysis for chipset for 5G, 4G LTE, and with test equipment log analysis. Experience in certification at the system level from RF performance to protocol and IP/IMS layers, with the ability to enable technical discussions with customer SMEs. Knowledge of carrier certification processes for major carriers. Knowledge of standards, testing, certification protocols, and RF requirements for wireless products.", "responsibilities": "Lead the NPI/in-market projects, drive third-party labs to ensure top quality and on-time delivery of the certification deliverables for Pixel projects. Support multiple projects, and collaborate with cross-functional teams to troubleshoot and resolve the reported issues. Work with Technical Account Management to discuss test scope and certification requirements with the carrier customer. Manage communication of technical issues within the team and cross-functionally, and escalate issues as needed. Plan and schedule project deliverables, prioritize testing tasks with cross-functional support, and escalate as needed.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/143550569665962694"}