{"title": "Product Support Engineer", "level": "", "location": "Dublin, Ireland", "description": "Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products. To learn more about gTech, check out our video.", "key_qualifications": "Bachelor’s degree or equivalent practical experience. 2 years of experience project managing and delivering technical solutions. 2 years of experience in technical troubleshooting, and managing internal/external partners or customers. Experience in system design or in one programming language (e.g., Java, C++, Python, etc.).", "preferred_qualifications": "Experience working in Technical Products, Cloud Support, Quality Engineering, or SRE. Knowledge and experience using Google Ads or other online advertising solutions and the media/tech landscape. Experience in technical troubleshooting or customer support in a tech organization. Customer-facing experience translating technical concepts and solutions to non-technical and executive audiences. Experience in business analysis to conduct analytics, develop dashboards, and make recommendations. Critical thinking and problem-solving experience to develop strategic perspectives on customer-focused solutions within a diverse environment and a customer-first mindset with the ability to own end-to-end experience and solutions.", "responsibilities": "Prioritize and deliver outstanding customer service throughout the customer journey, troubleshooting and resolving issues interacting directly with Google's advertisers and Sales teams, agencies, and partners. Become a technical expert on AI-powered advertising products, troubleshoot complex issues, develop diagnostic tools, and contribute to product improvements through cross-functional collaboration including Product Engineering teams. Analyze data and insights to create action plans to solve issues at the root cause for our customers focusing on knowledge management, operational improvements, account reviews, and product adoption. Partner with Sales and other cross-functional partner teams to own and continuously improve the journey of all clients across, resolving complex issues and understanding customer pain points. Share insights and provide expertise to our partner teams to support product and process improvements. Drive an inclusive culture and success among a global team, demonstrating mentorship and leadership.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/143618232513635014"}