{"title": "Software Engineering Manager II", "level": "Advanced", "location": "San Jose, CA, USA", "description": "Like Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers. You not only optimize your own code but make sure Engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way. With technical and leadership expertise, you manage engineers across multiple teams and locations, a large product budget and oversee the deployment of large-scale projects across multiple sites internationally. In this role, you will manage the team enabling and supporting hardware accelerated video encode and decode. You will collaborate with SoC partners to optimize power, performance, and stability for Chrome OS. Chrome OS delivers quality computing at scale to provide universal and unfettered access to information, entertainment, and tools. Our mission is to empower anyone to create and access information freely through fast, secure, simple, and intelligent computing.", "key_qualifications": "Bachelor’s degree, or equivalent practical experience. 8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). 3 years of experience in a technical leadership role; overseeing projects, with 2 years of experience in a people management, supervision/team leadership role. Experience with embedded systems, kernel, Unix/Linux environments, and the development of Linux device drivers or firmware.", "preferred_qualifications": "Master's degree or PhD in Computer Science, or a related technical field. Experience in low-level system software development, such as firmware, kernel, and driver. Experience in video and software optimization. Ability to participate in technical/developer communities, open source projects or other developer community groups.", "responsibilities": "Manage a team of Software Engineers working on graphics and video for Chrome OS. Set team priorities that support the broader organization's goals. Align strategy, processes, and decision-making across teams. Set clear expectations based on their level and role and aligned to the broader organization's goals. Meet regularly to discuss performance and development and provide feedback and coaching. Develop the mid-term technical goal and roadmap within the scope of the teams. Evolve the roadmap to meet anticipated future requirements and infrastructure needs. Design, guide and vet systems designs within the scope of the broader area, and write product or system development code to solve ambiguous problems. Review code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/143774769374732998"}