{"title": "Security Sales Specialist, Google Cloud", "level": "Advanced", "location": "Hong Kong", "description": "As a member of the Google Cloud team, you inspire leading companies, schools, and government agencies to work smarter with Google tools like Google Workspace, Search, and Chrome. You advocate for the innovative power of our products to make organizations more productive, collaborative, and mobile. Your guiding light is doing what’s right for the customer, you will meet customers exactly where they are at and provide them the best solutions for innovation. Using your passion for Google products, you help spread the magic of Google to organizations around the world. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 10 years of experience in enterprise software sales or account management at an enterprise business-to-business software company. Experience with security solutions or security software product.", "preferred_qualifications": "Experience in promoting cyber security solution and cloud-based security solutions. Experience with large, complex commercial and legal agreements working with Procurement, Legal, and Business teams. Familiarity with Google Cloud Platform (GCP) and its security offerings. Ability to work with sales engineers and customer technical leads to inventory existing software, define migration plans, and build business cases for migrations. Expertise on emerging security threats, industry trends, and Google Cloud's security solutions. Ability to communicate in English and Mandarin fluently in order to engage and support customers.", "responsibilities": "Build and execute territory plans to identify, engage, and close high-value enterprise security agreements. Lead the entire business cycle with support from technical teams. Cultivate strong executive-level relationships within existing and prospective enterprise accounts, aligning Google Cloud Security solutions with their strategic goals. Develop expertise in the entire Google Cloud's security portfolio (including Mandiant solutions and services) and be able to articulate product features, use cases, and differentiate them from the competition. Engage with customers and partners to generate interest, maintain a robust sales pipeline, and provide accurate, timely forecasts to business leadership. Work closely with Customer Engineers, Marketing, Product, and Channel teams to provide a seamless customer experience and increase business impact.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/143863945982026438"}