{"title": "Senior Interaction Designer, Google Photos", "level": "Mid", "location": "San Francisco, CA, USA; Mountain View, CA, USA", "description": "At Google, we follow a simple but vital premise: 'Focus on the user and all else will follow.' Google’s Interaction Designers take complex tasks and make them intuitive and easy-to-use for billions of people around the globe. Throughout the design process—from creating user flows and wireframes to building user interface mockups and prototypes—you’ll envision how people will experience our products, and bring that vision to life in a way that feels inspired, refined, and even magical.", "key_qualifications": "Bachelor's degree in Design, Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience. 6 years of interaction design experience in product design or UX design. Experience in visual design and prototyping. Include a portfolio, website, or any other relevant link to your work in your resume (providing a viewable link or access instructions).", "preferred_qualifications": "Master's degree in Design, Human-Computer Interaction, Computer Science, a related field. 8 years of experience in product design or UX. 3 years of experience working in a complex, cross-functional organization. 2 years of experience leading design projects. 1 year of experience working with executive leaders.", "responsibilities": "Collaborate with product managers, engineers, and cross-functional stakeholders to understand requirements and provide creative, thoughtful solutions. Communicate the user experience at various stages of the design process with wireframes, flow diagrams, storyboards, mockups, and/or high fidelity prototypes. Integrate user feedback and business requirements into ongoing product experience updates. Advocate for the prioritization of design centered changes, refinements, and improvements. Articulate user journeys with scenarios, storyboards and presentations, low and high-fidelity mocks, detailed interaction specs, and prototypes to effectively communicate interaction and design ideas.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/143940958503740102"}