{"title": "Staff Software Engineer, Machine learning Performance", "level": "Advanced", "location": "London, UK", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. In this role, you will collect and analyze profile data and provide expert-level visualizations and user actionable advice. You will serve high impact opportunities within Alphabet (e.g., improving Large Language Models (LLMs), guiding TPU chip co-design) and cross-industry supporting new frameworks and chips to run in different cloud environments. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor's degree or equivalent practical experience. 8 years of experience in software development and with data structures/algorithms. 5 years of experience with AI/ML algorithms and tools, LLMs or other multimodal foundation models, and natural language processing. 5 years of experience in distributed development and large-scale data processing. Experience coding in C++ or Python.", "preferred_qualifications": "Experience in performance analysis and optimization, including system architecture, performance modeling, or similar. Experience working in a complex, matrixed organization involving cross-functional, or cross-business projects. Experience in a technical leadership role leading project teams and setting technical direction. Experience debugging large model performance in training or serving (e.g., ML Framework like JAX, TF, PyTorch). Experience in Graphics Processing Units (GPUs), TPUs or other hardware accelerators. Experience in ML system development.", "responsibilities": "Drive continuous improvements to the machine learning software/hardware stacks through providing insightful performance debugging. Provide insights by summarizing different views of captured profile data such as trace timelines, memory usage, High-level Operations (HLO) profiles, Machine learning (ML) graph summaries. Learn and build an intuitive understanding of existing data collection, analysis, and visualization workflows. Support new, exciting ML paradigms such as horizontal scaling for upcoming Tensor Processing Unit (TPU) chips by making contributions across the JAX, compilers stack and analysis tools. Partner with product area leads, cloud customers to understand model optimization use cases, drive cross-functional efforts to deliver on chip profiling requirements, and propose new hardware features.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/143920016780075718"}