{"title": "People Consultant (Fixed-Term Contract)", "level": "Mid", "location": "Dublin, Ireland", "description": "People Operations strives to revolutionize human resources the same way that Google has revolutionized search. We are helping to find, grow and keep the remarkable assemblage of talent who are our Googlers. You'll be an advocate of Google's culture and values, partnering with our business leaders to help them build their organizations and make sure all people decisions are based on data. Whether coaching our clients on how to lead their teams, navigating and resolving employee relations issues or managing programs that help develop our Googlers, you are exceptionally focused on putting them first, and being as clear and transparent as possible to help Googlers understand how people decisions get made.", "key_qualifications": "Bachelor's degree or equivalent practical experience. 7 years of experience as an HR Business Partner or HR Generalist providing consultations to the business on topics such as performance management, workplace concerns, etc. Experience in capturing data and surfacing trends/themes across multiple consultations to suggest interventions, process and HR product improvements, or in service of a business, product area, or market strategy. Experience managing multiple stakeholders.", "preferred_qualifications": "Experience in HR, people programs, or other large-scale people related roles. Experience with cross-functional collaboration and influence. Experience coaching and mentoring others. Excellent communication and stakeholder management skills, with the ability to deliver exceptional customer service. Excellent collaboration, consultation, teamwork, and organizational skills.", "responsibilities": "Deliver dynamic consultations around a variety of HR topics aligned to the People Operations (POps) Menu of Services such as performance enablement, team/manager/leader effectiveness, career development, diversity, equity, and inclusion, and navigating transitions. Contribute to deployment of HR programs and processes for a business area, product area, or market via dynamic consultations. Identify, recommend, and advance long-term, scalable, and simplified solutions to drive continuous improvements in people processes, asking for input or buy-in from more executive leaders when needed. Lead market specific POps programs and initiatives in line with the respective POps market plans. Develop comprehensive knowledge of Google-wide HR policies, local/market legal and regulatory knowledge, and the POps Menu of Services, and understand how to navigate the POps ecosystem in order to effectively service employees, managers, and leaders.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/143974566421504710"}