{"title": "Customer Engineer, Cloud Native Database", "level": "Advanced", "location": "Berlin, Germany; Frankfurt, Germany; Munich, Germany; Hamburg, Germany", "description": "The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners. As a Customer Engineer for Google Cloud, you will help customers to adopt Google Cloud managed database offerings. You will work in partnership within the Sales teams by problem-solving key technical issues for our customers. Additionally, you will liaise with the Product teams and Engineering teams to stay on industry trends and devise enhancements to Google Cloud products. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science or equivalent practical experience. 10 years of experience with NoSQL database technologies, administration and management tools, performance tuning techniques, and modern/cloud-based application development environments. Experience engaging with, and presenting to, technical stakeholders and executive leaders. Ability to communicate in English and German fluently in order to communicate in this customer-facing sales role.", "preferred_qualifications": "Master's degree in Computer Science, or a related technical field. Experience in technical sales or professional consulting in the fields of systems integration, large-scale data transfer/management, and enterprise database performance. Experience optimizing database performance with transactional or analytic workloads, with the knowledge of disaster recovery and data backup strategies. Knowledge of DevOps principles and database automation tools. Understanding of cloud-based database architectures and deployments (e.g. Google Cloud Platform), including distributed or big data technologies. Ability to learn, understand, and work quickly with new emerging technologies, methodologies, and solutions in the cloud/IT technology space.", "responsibilities": "Work with the team to identify and qualify business opportunities for databases, understand key customer business and technical issues, and develop the strategy and solution to support their stakes. Inspire customers and peers to solve difficult problems with solutions, including product and solution briefings, proof-of-concept work, and coordinating technical resources. Design the architecture and the migration strategy minimizing the migration effort, risk, and downtime. Work with customers to demonstrate and prototype the Google Cloud database product portfolio in customer/partner environments, and travel to customer sites, conferences, and other related events as needed. Recommend integration strategies, enterprise architectures, platforms, and application infrastructure required to complete solutions using best practices on Google Cloud.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/144095826770043590"}