{"title": "Research Scientist, Multimodal Large Language Modeling, Google Research", "level": "Mid", "location": "Sydney NSW, Australia", "description": "As an organization, Google maintains a portfolio of research projects driven by fundamental research, new product innovation, product contribution and infrastructure goals, while providing individuals and teams the freedom to emphasize specific types of work. As a Research Scientist, you'll setup large-scale tests and deploy promising ideas quickly and broadly, managing deadlines and deliverables while applying the latest theories to develop new and improved products, processes, or technologies. From creating experiments and prototyping implementations to designing new architectures, our research scientists work on real-world problems that span the breadth of computer science, such as machine (and deep) learning, data mining, natural language processing, hardware and software performance analysis, improving compilers for mobile platforms, as well as core search and much more.\n\nAs a Research Scientist, you'll also actively contribute to the wider research community by sharing and publishing your findings, with ideas inspired by internal projects as well as from collaborations with research programs at partner universities and technical institutes all over the world.\n\nIn this role, you will research methods to improve understanding of sign languages, as used by the deaf and hard of hearing communities. Areas of specific interest include computer vision, image and video processing, multilingual and multimodal modeling, and generative image and video models. You will build resources, develop and evaluate research systems, and engage with the community.\n\nGoogle Research is building the next generation of intelligent systems for all Google products. To achieve this, we’re working on projects that utilize the latest computer science techniques developed by skilled software developers and research scientists. Google Research teams collaborate closely with other teams across Google, maintaining the flexibility and versatility required to adapt new projects and foci that meet the demands of the world's fast-paced business needs.", "key_qualifications": "PhD in Computer Science, a related technical field, or equivalent practical experience. 2 years of experience in Natural Language Processing, Computer Vision, Machine Learning, Large Language Model, multimodal models, or similar areas. Experience in programming languages (e.g., Python or C/C++). Experience contributing to research communities including publishing in forums.", "preferred_qualifications": "Experience in innovative research. Experience working with a Research team. Ability to navigate ambiguity.", "responsibilities": "Develop code for data collection, cleaning, and processing.\nCoordinate data collection and quality control with partners.\nWrite code in Python with PAX, Content Management System (CMS), and other Google frameworks.\nDesign algorithms for model training and prediction.\nManage experiments on Tensor Processing Unit (TPU) cloud, and write up results in design documents, technical reports, and papers for publication.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/144033036495659718"}