{"title": "System Technical Program Manager", "level": "Mid", "location": "New Taipei, Banqiao District, New Taipei City, Taiwan", "description": "Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.", "key_qualifications": "Bachelor's degree in a relevant field, or equivalent practical experience. 2 years of experience in program management. Experience with consumer electronics or manufacturing assembly process. Experience with working and managing international OEM partners.", "preferred_qualifications": "5 years of experience managing cross-functional or cross-team projects. Experience in leading technical projects in consumer electronics or related companies. Excellent communication skills and ability to influence decisions effectively across all project stakeholders and levels. Ability to travel up to 30% of the time as needed.", "responsibilities": "Manage project operations from proto builds through ramp and serve as technical lead in resolving complex issues during bring-up and life of product. Lead a cross-functional team of engineers in the development and support of New Product Introductions. Lead project readiness. Identify, prioritize, and manage key technical changes and risks of a given product. Ensure all technical risks associated with a product are identified and closed or mitigated to enable the quality ramp of a product. Review assessment of the robustness of Engineering and Manufacturing solutions to meet the requirements of the operation and the implementation of any additional solutions to mitigate any risks to the plan. Advise the product line for the life cycle of the product. Ensure operations technical readiness for all phases of the introduction cycle.", "company": "google", "url": "https://www.google.com/about/careers/applications/jobs/results/144103524962050758"}